{
  "city": "Bangkok",
  "country": "Thailand",
  "country_code": "TH",
  "hero_title": "Hotels in Bangkok",
  "description": "Discover the best hotels in Bangkok, Thailand. Find exclusive deals and luxury accommodations.",
  "hero_image": "https://images.luxuryescapes.com/k8poq69wndgino863vk",
  "hotels": [
    {
      "vendor_name": "Anantara Riverside Bangkok Resort",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Bangkok Riverfront Luxury with Daily Breakfast, Nightly Free-Flow Cocktails & Cruise Upgrades Available",
      "description": "Discover Bangkok from a new angle with a stay at this five-star stay, perfectly placed on the banks of the Chao Phraya River. With Thailand’s shining capital on the horizon, a complimentary shuttle ferry whisks you to high-end malls, ancient temples and buzzing markets, while 11 acres of tropical gardens offer rare space and quiet in the city. Return to signature Anantara hospitality, steeped in an old-world Siam spirit and 12 extraordinary restaurants and bars. Choose between the international teppanyaki house Benihana, tiki tipples at Trader Vic’s or the waterfront Longtail by the River, the perfect place to kick back and watch the world drift by. Take part in a cultural activity or simply relax poolside or at the world-class spa.",
      "location_subheading": "Thailand",
      "price": 449,
      "original_price": 1095,
      "discount_percentage": 59,
      "link": "https://luxuryescapes.com/offer/006RF00000JAmRpYAL",
      "hero_image": "https://images.luxuryescapes.com/k8poq69wndgino863vk",
      "image_two": "https://images.luxuryescapes.com/7yvemgv5mrpxbrkpzf8",
      "image_three": "https://images.luxuryescapes.com/0vlddmtxysscjcpxtn6r",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 3,
      "end_date_utc": "2025-08-19 13:59:00"
    },
    {
      "vendor_name": "Siam Kempinski Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Bangkok City Opulence near Siam Paragon Mall with Daily Breakfast, Resort Credit & Nightly Cocktails",
      "description": "Treat your senses to a decadent urban escape, where regal Thai hospitality meets European flair, perfectly situated in Bangkok's buzzing shopping and entertainment district. Tucked behind the world-famous Siam Paragon shopping centre and just moments from a BTS Skytrain station, this resort-style, five-star oasis redefines luxury with sweeping tropical gardens, free-form saltwater pools and artful interiors at every turn. Culinary moments shine here - savour modern Thai flavours at Sra Bua by Kiin Kiin, relish Mediterranean-inspired grill at ALATi or unwind with cocktails and live music at the glamorous 1897 Lounge. Keep an eye out for rotating gourmet pop-ups that bring global flavours to Bangkok's doorstep. After a day of temple-hopping, street food trails and retail therapy, retreat to your elegant guestroom or suite, or indulge in traditional Thai healing rituals at the luxurious Kempinski The Spa.",
      "location_subheading": "Thailand",
      "price": 839,
      "original_price": 1785,
      "discount_percentage": 53,
      "link": "https://luxuryescapes.com/offer/006RF00000IYXTpYAP",
      "hero_image": "https://images.luxuryescapes.com/blg3whwigo72a7gwtbt",
      "image_two": "https://images.luxuryescapes.com/v6rmu7r1xvp3ky1vbdv",
      "image_three": "https://images.luxuryescapes.com/hkdlrgbkjba5fqrkn69f",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 3,
      "end_date_utc": "2025-08-08 13:59:00"
    },
    {
      "vendor_name": "Sofitel Bangkok Sukhumvit",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Central Bangkok Art-Deco Escape with Belgian Rooftop Bar, Pool & Spa",
      "description": "Placing you in Bangkok’s beating heart, this five-star address blends French chic with Thai vibrance, rising above Sukhumvit Road. From the moment you step into the lobby, adorned with Thai art and grand chandeliers, you can expect the exceptional. Lounge by the sparkling pool with a cocktail in hand, get pampered at Le Spa or kick back in the opulence of your room or suite. Savour Italian fare at Bella Sera, fusion Japanese cuisine at Maison Mizuki and classic French baked delights at Le Macaron. For something more indulgent, head to Bangkok's first Belgian restaurant - Belga Rooftop Bar & Brasserie, perched on the 32nd floor and showcasing glittering skyline views. When it's time to explore, Sukhumvit's shopping, dining and nightlife await.",
      "location_subheading": "Thailand",
      "price": 206,
      "original_price": 206,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GUQ5XYAX",
      "hero_image": "https://images.luxuryescapes.com/6qi0qnmbn8ghvyvk475u",
      "image_two": "https://images.luxuryescapes.com/5l1brtq44hy5jguglic4",
      "image_three": "https://images.luxuryescapes.com/tezxspj7abvd79fqozgjg",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Bangkok Platinum Pratunam",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Sophisticated High-Rise Bangkok Elegance Above Renowned Mall with Rooftop Infinity Pool & Spa",
      "description": "Enjoy a stylish stay in the heart of Bangkok’s shopping paradise. A world of comfort, style, and convenience awaits at this haven perched in the Bangkok skyline, above the famed Platinum Shopping Mall. With CentralWorld, Siam Paragon, and Big C just a short stroll away, and the BTS Skytrain within easy reach, your Bangkok adventure is at our doorstep. Unwind with breathtaking city views, take a refreshing dip in the infinity pool and sip handcrafted cocktails at the rooftop bar. Indulge in a global culinary journey with flavours from Thailand, Japan, India, and beyond with an international buffet at The Square Restaurant. Venture beyond the hotel to explore the bustling Pratunam Market or savour the flavours of Thailand at the nearby street food stalls. On your return, embrace Let's Relax Spa to recharge your mind, body and soul.",
      "location_subheading": "Thailand",
      "price": 123,
      "original_price": 123,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000Elgv0YAB",
      "hero_image": "https://images.luxuryescapes.com/gtkb1wya6hcq11qj3x9e",
      "image_two": "https://images.luxuryescapes.com/xufug1sr77o7j0s2j4oc",
      "image_three": "https://images.luxuryescapes.com/m2rcngw0lqhpwnbclvag",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Bangkok on Siam Square",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Stylish Bangkok Urban Escape near Siam SkyTrain Station with Onsite Restaurant & Outdoor Pool",
      "description": "Immerse yourself in the contemporary chic spirit of this plush Novotel urban sanctuary, perfectly positioned in the heart of Bangkok's vibrant Siam Square. Take advantage of the hotel's prime location and explore the Thai capital to the fullest with easy access to the Siam SkyTrain station, the world-renowned MBK centre and the high-end Siam Paragon Mall. Indulge in a feast of flavours at The Square as you relish local Thai delights and sip on signature cocktails at the Gourmet Bar after a day of exploration. For some relaxing moments, go for a swim in the sparkling outdoor pool or pamper yourself with restorative facial and body treatments at the Tammachart Day Spa.",
      "location_subheading": "Thailand",
      "price": 106,
      "original_price": 106,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlwCIAS",
      "hero_image": "https://images.luxuryescapes.com/tyw2ibub1giyexk1h2c7",
      "image_two": "https://images.luxuryescapes.com/dh0kwgnyjiljmt4quvri",
      "image_three": "https://images.luxuryescapes.com/3p9hkrudojr5p2a6nwgt",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Bangkok Hotel G",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Pullman Bangkok Luxury with Onsite Spa, Michelin-Rated Restaurant, Rooftop Bar & Pool",
      "description": "Experience five-star Pullman luxury at this stylish retreat high above the Bangkok bustling streets. Savor Michelin-rated dining at Scarlett Wine Bar on the 37th floor, or enjoy cocktails at the rooftop bar 25 Degrees, home to one of Bangkok’s best burger joints. Unwind by the swimming pool or at the onsite spa after a day of exploring vibrant Silom Road, or take a short stroll to top attractions like Patpong Night Market, Lumphini Park and Mahanakhon Skywalk.",
      "location_subheading": "Thailand",
      "price": 69,
      "original_price": 69,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlwhIAC",
      "hero_image": "https://images.luxuryescapes.com/v1rtiwhg7crl6f050xv",
      "image_two": "https://images.luxuryescapes.com/a4ae6ihk78kpz70zsogl",
      "image_three": "https://images.luxuryescapes.com/ke01l4sjm2tqg7cs889g",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Bangkok King Power",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Contemporary Pullman Bangkok Escape with Six Restaurants, Infinity Pool & Luxe Spa",
      "description": "Find yourself in the heart of it all from this contemporary Pullman sanctuary, perfectly poised in the heart of Bangkok, within easy rich of the Thai capital city's most happening districts. Retreat to the hotel's plush, well-appointed rooms, swim laps in Bangkok's largest infinity pool or indulge in soothing treatments at Le Spa - this urban oasis has it all to create a memorable escape. If you're feeling peckish, take delight across the hotel's six restaurants and bars: sample world-class Japanese meals at Tenshino, relish traditional omakase dining at Tenko, feast on Thai delicacies at Cuisine Unplugged and sip on signature cocktails at Glen Bar and Pool Bar. Being mere steps from the Skytrain station, the city's best attractions are easily accessible, plus, you can shop until you drop at the nearby King Power Duty-Free Complex and Siam Square One.",
      "location_subheading": "Thailand",
      "price": 86,
      "original_price": 86,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2xsIAC",
      "hero_image": "https://images.luxuryescapes.com/dgq3193vxj8zhz79ezs",
      "image_two": "https://images.luxuryescapes.com/1awji29br3yugjxzbg",
      "image_three": "https://images.luxuryescapes.com/259e10f04jm4vesfmxy",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Kimpton Maa-Lai Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Tranquil Five-Star Oasis within the Heart of Bangkok",
      "description": "Discover a beautiful five-star oasis in the heart of Thailand with a luxurious stay at Kimpton Maa-Lai Bangkok, an IHG Hotel. Get lost in the tranquil atmosphere of this lush hotel, with an abundance of floor-to-ceiling windows bringing the surrounding greenery inside for the ultimate relaxing getaway. Explore the exotic culture of Bangkok by wandering the handsome streets or eat your way through the city as a local foodie, tasting the unique mix of sweet, sour, salty and spicy flavours.",
      "location_subheading": "Thailand",
      "price": 234,
      "original_price": 234,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CP3QLAA1",
      "hero_image": "https://images.luxuryescapes.com/7kybi2glzy7qk55r2bl",
      "image_two": "https://images.luxuryescapes.com/ofo18gohf9of5m2mcsxb",
      "image_three": "https://images.luxuryescapes.com/zbieeysxcviq9ywkhqsr",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mövenpick BDMS Wellness Resort Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Tranquil Mövenpick Bangkok Retreat with Four Restaurants, Luxe Spa & Wellness Clinic",
      "description": "Experience a grand slice of wellness luxury at this sprawling five-star Mövenpick sanctuary, nestled in the bustling heart of Bangkok. Ensconced amid lush tropical gardens, the resort offers an oasis of serenity with signature wellness facilities and thoughtfully designed rooms. Savour delectable culinary delights at the resort's four dining venues, including the Bittersweet bar where you can sip on craft cocktails and indulge in Mövenpick's famous Chocolate Hour.",
      "location_subheading": "Thailand",
      "price": 102,
      "original_price": 102,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000IbsG4AAJ",
      "hero_image": "https://images.luxuryescapes.com/dakz0ipfjohzcy8hfs",
      "image_two": "https://images.luxuryescapes.com/ew2obvy9lnbrn9ilqjhm",
      "image_three": "https://images.luxuryescapes.com/99xeqfxc1prg9h2y6fg",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hyatt Regency Bangkok Sukhumvit",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Central Bangkok Sky-High Oasis near BTS Skytrain with Onsite Dining & Outdoor Pool",
      "description": "Smack dab in the thriving heart of Sukhumvit Road, Hyatt Regency Bangkok Sukhumvit is your go-to for sky-high style and top-notch comfort. Whether you're kicking back at Spectrum rooftop bar or gliding through the swimming pool, this place brings serious city vibes with a side of luxury. Step out the front foor and you're minutes from some of the best eats, shops and nightlife in Bangkok - plus direct BTS access via the skybridge, so you can zip around with ease. With spacious rooms, standout dining at five venues and a 24-hour fitness centre, everything you need is at your fingertips.",
      "location_subheading": "Thailand",
      "price": 191,
      "original_price": 191,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000HicEWYAZ",
      "hero_image": "https://images.luxuryescapes.com/f9oxlb7b3gi1nl61eem",
      "image_two": "https://images.luxuryescapes.com/42op2pmt8k8iuhzowjhs",
      "image_three": "https://images.luxuryescapes.com/dwo8j2afwgjlb9hczg",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mandarin Oriental Hotel Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Five-Star Bangkok Riverside Haven with 11 Outstanding Restaurants & Bars",
      "description": "Standing tall alongside the famed Chao Phraya River is the exceptionally stylish, five-star Mandarin Oriental Bangkok. With 11 restaurants and bars onsite, you won't need to venture far to unearth culinary wonders. Take a seat at the two-Michelin-starred restaurant, Le Normandie by Alain Rouxor, drop into Lord Jim's for mouthwatering seafood and prime cuts of meat, or head to The Author's Lounge and the Bamboo Bar for creative cocktails. When you need a moment of bliss, The Oriental Spa is the place to go for luxurious treatments inspired by traditional Thai and western techniques. Beyond this luxe property lies some of Bangkok's best attractions, including the Grand Palace just a short boat ride away, or the renowned IconSiam shopping precinct.",
      "location_subheading": "Thailand",
      "price": 479,
      "original_price": 479,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DMK8AAO",
      "hero_image": "https://images.luxuryescapes.com/hqglou3a6d2ktsktjua",
      "image_two": "https://images.luxuryescapes.com/k835dk1hf4rnxa4wwib",
      "image_three": "https://images.luxuryescapes.com/8bp6l1fp7kp77j939kj",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Sindhorn Midtown Hotel Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Central Bangkok Urban Retreat with Rooftop Infinity Pool & Bar",
      "description": "Boasting sweeping skyline views, Sindhorn Midtown Hotel Bangkok, Vignette Collection, an IHG Hotel, offers an upscale city break in the heart of Thailand's capital. Dine on authentic Thai dishes at Bangkok'78 restaurant, or indulge in some smooth spirits at The Black Cat whiskey bar. Choose indulgence with shimmering waters at Horizon Pool Bar, offering canapes and skyline views at the rooftop infinity pool, before retiring to an artistic guestroom for a restful night's sleep.",
      "location_subheading": "Thailand",
      "price": 117,
      "original_price": 117,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CvG9iAAF",
      "hero_image": "https://images.luxuryescapes.com/7mk5nm1f5kxp7179o0ys",
      "image_two": "https://images.luxuryescapes.com/124yqa5vlvg0a6kn8l",
      "image_three": "https://images.luxuryescapes.com/4h37e6578y8lti4ekf5",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 01:59:00"
    },
    {
      "vendor_name": "Novotel Bangkok Sukhumvit 20",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Sophisticated Bangkok Novotel Escape in the Heart of Sukhumvit with Infinity Pool, Rooftop Bar & Onsite Dining",
      "description": "Discover a world of modern comfort and Thai hospitality at this centrally located Novotel hotel in Sukhumvit. Perfectly positioned in the heart of Bangkok's most vibrant district, this stylish hotel offers easy access to the city's bustling shopping precincts, including the high-end EmQuartier and Terminal 21. Savour delectable Thai cuisine at the hotel's onsite restaurant, Gourmet Bar, or sip on refreshing cocktails at the Sky on 20 rooftop bar, offering panoramic views of the city skyline. For relaxation, take a dip in the outdoor infinity pool or energise yourself at the InBalance fitness centre. The hotel is also conveniently located just a short stroll from the BTS Skytrain and MRT subway stations, making it easy to explore the city's treasures.",
      "location_subheading": "Thailand",
      "price": 81,
      "original_price": 81,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2xyIAC",
      "hero_image": "https://images.luxuryescapes.com/gj7q02zct9h5k4e3s9g",
      "image_two": "https://images.luxuryescapes.com/eii64fof9hn5l32r8p5v",
      "image_three": "https://images.luxuryescapes.com/dztccsez8g0ljty9mp0s",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Park Hyatt Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Modern Central Bangkok Escape with Rooftop Bar, Johnnie Walker Whisky Lounge & Central Embassy Access",
      "description": "Experience the height of metropolitan luxury with this rejuvenating Bangkok stay. Indulge in exquisite dining at the hotel's six premium restaurants and bars, finding panoramic city views at the pristine Penthouse Bar + Grill on the high-rise rooftop, next to the hotel's infinity pool. Spend days exploring the buzzing sights and sounds of Thailand’s vibrant capital, and then find a moment for tranquillity during a relaxing treatment at PAÑPURI ORGANIC SPA.",
      "location_subheading": "Thailand",
      "price": 246,
      "original_price": 246,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000Cj3hIYAR",
      "hero_image": "https://images.luxuryescapes.com/jk9da2zm79fg4iv5s43c",
      "image_two": "https://images.luxuryescapes.com/5mi4ukfexpooteuslmw",
      "image_three": "https://images.luxuryescapes.com/jt6lqc75kv3quw29bpc",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Bangkok Makkasan",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Centrally-Located Contemporary Bangkok Escape with Outdoor Pool & Wine Bar",
      "description": "Embrace the eclectic spirit of Thailand's vibrant capital with a sophisticated stay at this Mercure urban oasis, strategically positioned in the city's heart. Take advantage of the hotel's prominent location which puts you within mere steps of trendy malls, hip eateries and the MRT Petchaburi and Makkasan Airport Rail Link Station, making it easy to reach any corner of the city. Savour panoramic views of Bangkok from the hotel's floor-to-ceiling windows, laze around on a sunbed or take a refreshing dip in the sparkling outdoor pool on the 10th floor. When hunger strikes, head to The Station, the hotel's all-day dining restaurant, and tuck into myriad Asian and international delicacies and sip on exquisite cocktails at the M Wine Lounge.",
      "location_subheading": "Thailand",
      "price": 49,
      "original_price": 49,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnGg0YAF",
      "hero_image": "https://images.luxuryescapes.com/b54qkuou0ioet1q2j54",
      "image_two": "https://images.luxuryescapes.com/s32zd77ybfhqpsr2ds",
      "image_three": "https://images.luxuryescapes.com/2ph7pxjti99mzf650fcd",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Avani Sukhumvit Bangkok Hotel",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Central Avani Boutique Bangkok Escape with Rooftop Pool",
      "description": "Feel the pulse of Bangkok’s CBD with a stay at Avani Sukhumvit Bangkok, high above the trendy On Nut neighbourhood. Sitting within walking distance of On Nut BTS Station, the stylish haven is perfectly placed to explore Bangkok’s bright lights, world-class shopping and diverse culture like a true local. From the buzzing rooftop pool and bar, to expertly prepared dishes at the Greenhouse Restaurant and lavish spa, Avani Sukhumvit Bangkok Hotel will enchant you from the moment you arrive.",
      "location_subheading": "Thailand",
      "price": 79,
      "original_price": 79,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004v0fMAAQ",
      "hero_image": "https://images.luxuryescapes.com/bx95vyphdq9kfqxxi09",
      "image_two": "https://images.luxuryescapes.com/suwc4lhr6ls21z8fkhw8",
      "image_three": "https://images.luxuryescapes.com/051hxdvzn0v24jr4xf",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Landmark Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Bangkok Five-Star Sky-High Luxury with Multi-Award-Winning Rooftop Restaurant",
      "description": "Reach glittering heights at The Landmark Bangkok, an elegant skyscraper towering over the sparkling sights of Thailand's capital. Make this five-star hotel your home in the city and enjoy fabulous benefits including the 31st-floor rooftop restaurant Rib Room & Bar Steakhouse, an award-winning hotspot specialising in French cuisine prepared in a contemporary open-style kitchen. The hotel also offers eight further onsite bars and restaurants (including the traditionally British Huntsman Pub and Cantonese eatery Sui Sian), soothing treatments at Viva Jiva Spa, a fitness club with exercise classes and an outdoor pool. Set on fashionable Sukhumvit Road, a short walk from BTS Skytrain station and the city's most exciting sights, The Landmark Bangkok couldn't be better placed for your foray into Thailand's captivating capital.",
      "location_subheading": "Thailand",
      "price": 148,
      "original_price": 148,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000007oz7jAAA",
      "hero_image": "https://images.luxuryescapes.com/fzti5w122ni7ufs465l8",
      "image_two": "https://images.luxuryescapes.com/im7zbtelpv8bfs9ch7qj",
      "image_three": "https://images.luxuryescapes.com/vayy88r47mrrep3f5ftm",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Capella Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Five-Star Bangkok Riverside Escape with Michelin-Starred Restaurant & Day Spa",
      "description": "Unrivalled luxury and cosmopolitan joie de vivre await at the illustrious Capella Bangkok, an ultra-luxe sanctuary nestled along the majestic Chao Phraya River. Set in the energetic Charoenkrung district, it's perfectly placed for days meandering through art galleries, iconic marketplaces, and eclectic dining precincts. Stay within the hotel’s breathtaking bounds to enjoy a wealth of delightful culinary experiences. Indulge in Michelin-starred magic at Cote by Mauro Colagreco, settle in for moreish plates by the water’s edge at Phra Nakhon, or relax with a mood-complementing cocktail in the sparkling confines of Stella. Find a pure sense of tranquillity at the hotel’s world-class day spa, boasting a fully equipped fitness centre and wellness pavilion dedicated to your rejuvenation.",
      "location_subheading": "Thailand",
      "price": 758,
      "original_price": 758,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000ExuXyAAJ",
      "hero_image": "https://images.luxuryescapes.com/3yc7n19h3cnls5rxstn",
      "image_two": "https://images.luxuryescapes.com/2gnm3qir1ovsdygd40e",
      "image_three": "https://images.luxuryescapes.com/ncxje4ficfknkjd8ttag",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Lumpini Park",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Five-Star Bangkok Escape Opposite Leafy Lumpini Park",
      "description": "Within walking distance of Si Lom MRT and Sala Daeng BTS stations, Crowne Plaza Bangkok Lumpini Park, an IHG Hotel, sits opposite Bangkok’s 58-hectare leafy patch of paradise. From the inviting swimming pool and fully-equipped fitness centre to the indulgent spa and expertly prepared Cantonese and international dishes at the lavish onsite restaurants - including Xin Tian Di and Panorama - this hotel will enchant you from the moment you arrive.",
      "location_subheading": "Thailand",
      "price": 125,
      "original_price": 125,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt7AAAR",
      "hero_image": "https://images.luxuryescapes.com/0asosd3uuqnr9o8vonp",
      "image_two": "https://images.luxuryescapes.com/48gnl8gzhmcyobvq3fn8",
      "image_three": "https://images.luxuryescapes.com/i9ebbdtu48jb9x5di1",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "VIE Hotel Bangkok MGallery Collection",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Central Bangkok Elegance with Michelin-Starred Restaurant & Rooftop Infinity Pool",
      "description": "Experience unparalleled luxury at this urban retreat offering exquisite comforts and next-level service. Revel in the city skyline from the rooftop infinity pool and bar, the perfect setting for a post-dip snack and tipple. Delight in Michelin-starred dining at Signature Bangkok or savour the finest sushi at YTSB, where Japanese cuisine meets the highest-quality ingredients. Step outside to explore Bangkok’s rich cultural heritage or enjoy world-class shopping at nearby landmarks like Siam Paragon and CentralWorld. Return to the hotel and relax at the chic Piano Bar, where you can enjoy handcrafted cocktails and the smooth sounds of jazz, creating the perfect ambience for a memorable evening.",
      "location_subheading": "Thailand",
      "price": 160,
      "original_price": 160,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP0JYAV",
      "hero_image": "https://images.luxuryescapes.com/oacxbpce79hkxxtjwo",
      "image_two": "https://images.luxuryescapes.com/idpcblnilyrx09c9hgj",
      "image_three": "https://images.luxuryescapes.com/2sfvsuwsyey3hksg0uh8",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "COMO Metropolitan Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Contemporary Five-Star Bangkok Retreat with Michelin-Starred Restaurant",
      "description": "Mingle with the fashionistas and film stars of vibrant Bangkok with a stay at the sleek COMO Metropolitan Bangkok. Perched on dynamic Sathorn Road in the Lumpini District, this sophisticated sanctuary is both the place to be seen and a tranquil escape, in the middle of the action but offering peaceful and private spaces to relax. Start every morning feeling fresh in minimalist rooms and suites that make luxurious comfort the first priority. Continue the descent into relaxation at COMO Shambhala Spa with a morning yoga class or laps of the outdoor 25-metre pool, before indulging in an hour’s bliss with one of the best Thai massages in Bangkok. Complete your day with a prestigious dining experience at the onsite Michelin-starred Nahm restaurant.",
      "location_subheading": "Thailand",
      "price": 189,
      "original_price": 189,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004QJ4eAAG",
      "hero_image": "https://images.luxuryescapes.com/f8a13cqa080f9o164t46",
      "image_two": "https://images.luxuryescapes.com/uqwknd8uxeh4t4h2avul",
      "image_three": "https://images.luxuryescapes.com/euqp5sd3cn0wc0lofj5",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Sindhorn Kempinski Hotel Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Bangkok 5-Star Kempinski Village-Style Luxury with World-Class Wellness Centre",
      "description": "Discover a slice of leafy serenity in the middle of Bangkok's vibrant metropolis at the five-star Sindhorn Kempinski Bangkok. Kempinski is synonymous with luxury, and this is no exception: five exquisite restaurants and bars are guaranteed to set your tastebuds into a frenzy, whether it's with classic cocktails at the Firefly Bar or Japanese cuisine at Ki Izakaya. Wellness is at the forefront, with an entire floor dedicated to Sindhorn Wellness by Resense, home to an infinity pool, luxury day spa and fitness centre. When you're not making good use of your hotel's facilities, head out to explore the quiet, leafy grounds of Lumphini Park.",
      "location_subheading": "Thailand",
      "price": 289,
      "original_price": 289,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003IAJYAA4",
      "hero_image": "https://images.luxuryescapes.com/o42bgf3metot1risjqku",
      "image_two": "https://images.luxuryescapes.com/ab6vqoiciiu63qrz2yh",
      "image_three": "https://images.luxuryescapes.com/oiigawy5x89ov9kqdo6lj",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Banyan Tree Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Sky-High Bangkok Luxury with Panoramic Views from Award-Winning Rooftop Bar",
      "description": "Soar above the bright lights of Bangkok with a five-star stay at Banyan Tree Bangkok, an urban sanctuary ranked among the world’s top 25 rooftop hotels on Tripadvisor. Set within one of Asia’s tallest towers, this luxurious retreat places you in the heart of the city’s dynamic CBD, moments from Silom and Sathorn. Step outside and discover nearby cultural treasures such as Wat Pathum Wanaram, lush Lumphini Park and the Pratu Nam ferry wharf - your gateway to exploring Bangkok by water taxi like a local. Back at the hotel, the true magic begins at Vertigo & Moon Bar Rooftop, Bangkok’s most spectacular rooftop venues. Panoramic views from the 61st floor stretch endlessly across the skyline. Indulge in world-class cuisine at one of seven onsite restaurants, serving everything from refined Thai dishes to elegant Japanese fare. With luxurious accommodation and a showstopping location, Banyan Tree Bangkok is your elevated escape in the heart of the city.",
      "location_subheading": "Thailand",
      "price": 143,
      "original_price": 143,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004UNTDAA4",
      "hero_image": "https://images.luxuryescapes.com/dd9aiawuh45gqps4v4y",
      "image_two": "https://images.luxuryescapes.com/bxdhi5jjjkguvmzb4nv",
      "image_three": "https://images.luxuryescapes.com/chz40wx3bnx362n669h",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-30 12:59:00"
    },
    {
      "vendor_name": "Grand Mercure Bangkok Atrium",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Elegant Bangkok Urban Oasis with Rooftop Pool, Onsite Spa & Two Restaurants",
      "description": "Find yourself in the vibrant centre of Thailand's spirited capital, Bangkok, with a stay at this sophisticated oasis. Nestled in the bustling Rama 9 district in Phetchaburi, this five-star abode offers dignified rooms and exceptional amenities, as well as seamless access to Bangkok’s cultural landmarks, culinary gems and shopping havens. After a day of discovery, unwind at the tranquil rooftop pool on the fourth floor, sip refreshing cocktails at the Pool Bar or indulge in a pampering session at the spa. Savour Thai fusion cuisine at Public while admiring stunning city views or relish an epic gastronomic feast at the renowned Japanese steakhouse Benihana as you sample its teppanyaki, sushi and signature rolls.",
      "location_subheading": "Thailand",
      "price": 43,
      "original_price": 43,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP01YAF",
      "hero_image": "https://images.luxuryescapes.com/iek0y25e1yrnyvfiwst",
      "image_two": "https://images.luxuryescapes.com/jbap89sf6b6en90lazu",
      "image_three": "https://images.luxuryescapes.com/lp2ibcxm22le79tvtlku",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Bangkok Sukhumvit 4",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Modern Bangkok Novotel Escape in the Heart of Sukhumvit with Rooftop Pool, Onsite Dining & Vodka Bar",
      "description": "Experience the vibrant energy of Thailand's capital with a stay at this centrally located Novotel hotel in Sukhumvit. Perfectly positioned in the heart of Bangkok's most exciting district, this stylish hotel offers easy access to the city's bustling shopping precincts, iconic landmarks and world-famous culinary offerings. After a day exploring the city, return to the hotel to savour authentic Thai cuisine at Food Exchange Restaurant. Head to the top floor for a dip in the rooftop infinity pool before sipping signature cocktails at poolside RedSquare Bar - the first-ever international vodka bar - as you watch the sunset behind the dazzling city skyline.",
      "location_subheading": "Thailand",
      "price": 76,
      "original_price": 76,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP0EYAV",
      "hero_image": "https://images.luxuryescapes.com/ma4fag2ntpte1het01wh",
      "image_two": "https://images.luxuryescapes.com/wrtn9s78zj8ohsn4sc6r",
      "image_three": "https://images.luxuryescapes.com/pud3atlq4oddrnf49hgo",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Sukhothai Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Bangkok’s Blissfully Secluded #1 Hotel",
      "description": "Find a slice of serenity amid the electric atmosphere of Thailand's capital at the blissfully secluded Sukhothai Bangkok. Surrounded by lush gardens, yet perfectly positioned to embrace all the city offers, this award-winning hotel - ranked #1 in Bangkok at the Travel + Leisure 2020 World’s Best Awards - is a sanctuary of serenity amid the buzzing metropolis. With its glam rooftop bars, towering skyscrapers and world-class dining, juxtaposed with traditional floating markets and street-food hawkers, Bangkok dazzles even the most seasoned travellers. Whether it's a city break or stopover between Thai islands, Bangkok is simply unmissable. Ideally located in the heart of the business district, this urban oasis effortlessly blends traditional Thai décor and hospitality with modern facilities. Indulge yourself at Sukhothai Spa, with a salt-water lap pool, hammams, a sauna and steam room, plus an array of treatments to leave you feeling restored. You won’t even need to venture far to indulge in delicious food: the hotel is home to some of Bangkok’s best restaurants, including the award-winning Celadon, voted the best restaurant in the city by Travel + Leisure magazine.",
      "location_subheading": "Thailand",
      "price": 310,
      "original_price": 310,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GPsBAAW",
      "hero_image": "https://images.luxuryescapes.com/2a7i411pq7s2m22elqzs",
      "image_two": "https://images.luxuryescapes.com/694pbg806vta90dx6g",
      "image_three": "https://images.luxuryescapes.com/ajoxivlzu6hxkznu45f7",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mövenpick Hotel Sukhumvit 15 Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Bangkok Mövenpick Luxury with Rooftop Pool & Rainforest Bar",
      "description": "Retreat to one of Bangkok's trendiest neighbourhoods with a signature Mövenpick stay. Eat at the all-day dining hub, Lelawadee Restaurant, or elevate your experience with a refreshing cocktail at the Rainforest Rooftop Bar with panoramic city vistas and a unique two-story waterfall. Enjoy the hotel’s stylish surroundings with a dip in the picturesque rooftop pool, relax in the manicured courtyard or rest up in beautifully appointed rooms; all welcome havens of calm and tranquillity high above the thrilling energy of the city.",
      "location_subheading": "Thailand",
      "price": 72,
      "original_price": 72,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlwaIAC",
      "hero_image": "https://images.luxuryescapes.com/9od430f046yqx1wbqr75",
      "image_two": "https://images.luxuryescapes.com/udgmgu141rf89td8s956",
      "image_three": "https://images.luxuryescapes.com/7zajruxe4l4i3cio75gu",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Standard, Bangkok Mahanakhon",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Grand Opening: Ultra-Cool Bangkok Escape with Rooftop Bar & Pool",
      "description": "Bold, innovative and fabulously unconventional, The Standard, Bangkok Mahanakhon - first opened in July 2022 - stands high above the city, offering an ultra-cool escape in the centre of Thailand’s buzzing capital. With a 24-hour gym, palm-fringed rooftop lagoon and a dazzling all-star lineup of restaurants and bars - including Sky Beach, the highest rooftop bar in the city, international Cantonese darling Mott 32 and the brilliantly eccentric Tease - it's the perfect launchpad to explore everything hip and happening in the heart of Bangkok. With each room featuring floor-to-ceiling windows offering spectacular views of the sprawling cityscape below, it’s a Bangkok escape that’s guaranteed to take you to new heights.",
      "location_subheading": "Thailand",
      "price": 244,
      "original_price": 244,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009C40IAAS",
      "hero_image": "https://images.luxuryescapes.com/86l694jhkdctef1eox9b",
      "image_two": "https://images.luxuryescapes.com/z56hdt42bqzyolc2lmrs",
      "image_three": "https://images.luxuryescapes.com/1mik2n9jtpu4x73tlkfu",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Grand Mercure Bangkok Asoke Residences",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Self-Contained Suites in Central Bangkok with Rooftop Pool, Sauna & Steam Room",
      "description": "Eat, play and repeat in the City of Angels from the comfort of your self-contained suite in central Bangkok. This luxurious retreat is a short stroll from the Sukhumvit shopping district and the Asoke BTS Skytrain station, making it the perfect base for your Thai adventure. After a day of exploring, return to your urban oasis to lounge in style while overlooking the sparkling city below. Enjoy sumptuous rooftop dining for breakfast, indulge in therapeutic massages or some time in the sauna, and take a dip in the rooftop pool to rejuvenate head-to-toe. Everything you need is right at your fingertips at Grand Mercure Bangkok Asoke Residence.",
      "location_subheading": "Thailand",
      "price": 81,
      "original_price": 81,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnGfwYAF",
      "hero_image": "https://images.luxuryescapes.com/bju0azk5tq93ntcb7iv9",
      "image_two": "https://images.luxuryescapes.com/9za9xhoxfglcb0z5vve",
      "image_three": "https://images.luxuryescapes.com/uqnll9fvco3w7oj0qntf",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Bangkok Sukhumvit 11",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Modern Bangkok City Break with Rooftop Pool & Onsite Argentinian Steakhouse",
      "description": "Experience Bangkok's vibrant city life with a stay at this modern retreat located in the heart of the city's bustling Sukhumvit district. Perfect for those looking for an urban escape, enjoy the best of Bangkok right amongst the action at the Soi 11 shopping and dining strip. Cool off at the hotel's stylish rooftop pool and savour a poolside cocktail at The Pool Bar before heading to the onsite Lily Fu's for a dinner of Asian favourites or El Gaucho Argentinian Steakhouse for perfectly grilled steaks on the terrace. For fitness enthusiasts, the hotel's modern gym facilities provide the perfect space to maintain your routine.",
      "location_subheading": "Thailand",
      "price": 80,
      "original_price": 80,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2yYIAS",
      "hero_image": "https://images.luxuryescapes.com/7stqkmqo58obltxgqvho",
      "image_two": "https://images.luxuryescapes.com/5wth0ndlauqffl3ccci",
      "image_three": "https://images.luxuryescapes.com/ku1iaxsxmd2zvx7oe4ws",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "SO/ Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Ultra-Chic Five-Star SO/ Bangkok City Stay with Spa & Six Restaurants & Bars",
      "description": "Spoil your senses with a stay at an outrageously fashionable sanctuary located in Bangkok’s lively entertainment district. Designed by couturier Christian Lacroix, this hotel blends French elegance with playful, modern design. Enjoy stunning city views from the rooftop infinity pool overlooking Lumphini Park, or work out in the SO/ FIT gym. Dive into the stunning rooftop infinity pool or, for ultimate relaxation, visit the SO/ SPA for expert facial, body and beauty treatments. Surrounded by the vibrant energy of Bangkok’s temples, nightlife and street food, SO/ Bangkok offers a fashionable base for exploring this dynamic city.",
      "location_subheading": "Thailand",
      "price": 157,
      "original_price": 157,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlwOIAS",
      "hero_image": "https://images.luxuryescapes.com/fg1g829t3o8jbxhmvg8",
      "image_two": "https://images.luxuryescapes.com/8wa16y1geogk055yftwq",
      "image_three": "https://images.luxuryescapes.com/c9cpg5mlffbnxuzdet",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Living Sukhumvit Legacy",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Bangkok Resort-Style City Break with Pool, Kids' Club & Onsite Dining",
      "description": "Discover an urban sanctuary at this resort-style hotel, nestled in the vibrant heart of Bangkok. Perfect for families, this property boasts a stunning pool with a waterslide, alongside a playroom, games room and kids' club. Long-stay guests will love the spacious rooms and suites, each thoughtfully designed with stylish living and dining areas for the ultimate comfort. Savour tasty delicacies at the El Santo restaurant, or sip on exquisite cocktails at the Sips & Splash poolside bar. With its prime location near Phrom Phong BTS Skytrain Station, you’ll enjoy seamless access to Bangkok’s cultural gems, shopping havens and buzzing entertainment spots. There is even a rooftop tennis court where you can play a game of tennis surrounding by the towering skyscrapers of this colourful city.",
      "location_subheading": "Thailand",
      "price": 70,
      "original_price": 70,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOzyYAF",
      "hero_image": "https://images.luxuryescapes.com/3g8cnh0vnjo37u0304j",
      "image_two": "https://images.luxuryescapes.com/ptzdzvy9zpr2uovyd94b",
      "image_three": "https://images.luxuryescapes.com/6n8uytt07vx3prypmpsb",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "InterContinental Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Luxury Five-Star Escape in the Heart of Bangkok",
      "description": "Discover the best of Bangkok's vibrant CBD with a five-star stay at InterContinental Bangkok, an IHG Hotel. Within an easy walk of Chit Lom BTS Station and Pratunam Pier, explore Bangkok like a true local - head to nearby Central World for high-end shopping in Bangkok's largest mall or Wat Benchamabophit to witness Buddhist icons surrounded by elegant Italian marble or ascend to the hotel's luxurious rooftop pool for glorious views of the city beyond.",
      "location_subheading": "Thailand",
      "price": 200,
      "original_price": 200,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt7BAAR",
      "hero_image": "https://images.luxuryescapes.com/ixg9stzabwi9eks5gpl",
      "image_two": "https://images.luxuryescapes.com/nfibj1czfuqcn3n8rp6k",
      "image_three": "https://images.luxuryescapes.com/2ur0ritpxbqrml77w6ct",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Siam Kempinski Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Bangkok Kempinski Five-Star Glamour with Michelin-Starred Restaurant",
      "description": "A slice of serenity in the heart of buzzing Bangkok awaits at the five-star Siam Kempinski Hotel Bangkok, where signature luxury and an unrivalled location come together. Gourmands can't pass up a chance to stay in and dine: there are three restaurants and bars to choose from, including the award-winning Michelin-starred Sra Bua by Kiin Kiin. The luxury spa and health club is a haven offering treatments like traditional Thai massages and revitalising facials for a dose of rest and relaxation. A covered walkway links this resort-style hotel to the famous Siam Paragon shopping mall, so you're never too far from a spot of top-tier shopping. Meanwhile, the BTS SkyTrain station at Siam is within easy walking distance, bringing Bangkok's sights closer.",
      "location_subheading": "Thailand",
      "price": 249,
      "original_price": 249,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003IAJ9AAO",
      "hero_image": "https://images.luxuryescapes.com/i9xse6ujr8j5huofh8j",
      "image_two": "https://images.luxuryescapes.com/9sdwn6pyxg64j7oxxefs",
      "image_three": "https://images.luxuryescapes.com/wavljfxjri9dx9fl59h",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Grand Hyatt Erawan Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Central Bangkok Oasis with Nine Bars & Restaurants, Outdoor Pool & Spa",
      "description": "Nestled in Bangkok's commercial heart yet feeling worlds away, the Grand Hyatt Erawan places you beside the iconic Erawan Shrine, perfectly positioned to soak up the capital's energy while enjoying a refined retreat from the bustle. Imagine stepping from the diplomatic district's sophisticated streets into your own slice of heaven. Nine distinct restaurants and bars promise a culinary journey across continents, while the shimmering pool and world-class spa stand ready to wash away your travel fatigue. As Bangkok pulses around you, this privileged address offers the perfect balance of downtown excitement and plush comfort awaiting your return.",
      "location_subheading": "Thailand",
      "price": 180,
      "original_price": 180,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000HicEVYAZ",
      "hero_image": "https://images.luxuryescapes.com/wapaib3yplgb8c7n7z",
      "image_two": "https://images.luxuryescapes.com/v99pr0i9ixql0cfzu08dj",
      "image_three": "https://images.luxuryescapes.com/qrokod8tvmwtsfhdkeo",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "PARKROYAL Suites Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Contemporary Bangkok City Centre Escape with Restaurant & Alfresco Pool",
      "description": "Become immersed in all the exciting action within Bangkok’s city centre with a comfortable stay at the stylish PARKROYAL Suites Bangkok. Set in the city’s predominantly commercial zone, travellers visiting for both work and pleasure can take full advantage of this prime location, staying within minutes of shopping, dining and cultural attractions. Trawl around this thriving metropolis on foot by day and easily return to recuperate within welcoming and calming interiors. Explore the fully equipped gym and sparkling pool for an active recovery or chill out in the evenings with a fuss-free delectable meal at the hotel’s own Spice Brasserie.",
      "location_subheading": "Thailand",
      "price": 103,
      "original_price": 103,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CwYjAAAV",
      "hero_image": "https://images.luxuryescapes.com/ih2grmyubvpshrqt3g7t",
      "image_two": "https://images.luxuryescapes.com/v797h0ix8q0ha6fnf3ul",
      "image_three": "https://images.luxuryescapes.com/olb9om5mwm96gw8uerzc",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Bangkok Sukhumvit 24",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Ultra-Modern Bangkok Escape near Emporium Mall with Rooftop Infinity Pool",
      "description": "Experience sophistication at this ultra-chic hotel, perfectly situated in the vibrant heart of Bangkok. Just steps away from the BTS Skytrain Phrom Phong Station and the city’s prestigious EM District shopping centres, this hotel offers the ideal base for your Bangkok adventure. Elevate your stay with a visit to the rooftop, where glittering views of the city skyline await. Unwind by the infinity-edge pool, sip on refreshing cocktails and savour light bites at Vue Bar. Satisfy your culinary cravings at The Market Restaurant, serving breakfast, lunch and dinner, or maintain your wellness routine at the fitness centre.",
      "location_subheading": "Thailand",
      "price": 95,
      "original_price": 95,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP0DYAV",
      "hero_image": "https://images.luxuryescapes.com/uea8wuh11la3r66mgns",
      "image_two": "https://images.luxuryescapes.com/n942lvg0u8dcagjax6ph",
      "image_three": "https://images.luxuryescapes.com/7opmnv9sewdwewo5f4u8",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Bangkok Siam",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Downtown Bangkok Retreat near BTS SkyTrain with Onsite Dining & Rooftop Pool",
      "description": "Experience urban living at this contemporary escape in bustling downtown Bangkok. Unwind with a cocktail by the sun-soaked rooftop pool, complete with city views, drop by The Eight Restaurant for both local and international bites, or grab a drink and snack at the swanky Sky Terrace Bar. With the city's shopping district, the BTS SkyTrain and the Art & Culture Centre on your doorstep, you're free to shop 'til you drop or explore the city's heritage at ease. By night, explore Bangkok's vibrant markets, street food stalls and famed nightlife before returning to your homey abode.",
      "location_subheading": "Thailand",
      "price": 93,
      "original_price": 93,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP0CYAV",
      "hero_image": "https://images.luxuryescapes.com/u9g6zsamngltji42ssws",
      "image_two": "https://images.luxuryescapes.com/cat7cx7aicdu4705f1b",
      "image_three": "https://images.luxuryescapes.com/4yflelz4l2m7k7sk63qb",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Shangri-La Hotel, Bangkok",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Award-Winning Shangri-La Bangkok Riverside Luxury",
      "description": "Immerse yourself in the culture, history and vibrant nightlife of Thailand’s capital with a riverside stay at Shangri-La Bangkok - voted one of the Top Hotels in Bangkok in the Conde Nast Traveler Readers’ Choice Awards 2021. This glittering high-rise beside the water enjoys a prime location with direct access to the SkyTrain, public ferry terminal and bus links, making it easy to discover everything this vibrant cosmopolitan city has to offer. After busy days exploring, return to world-renowned five-star Shangri-La luxury, where six restaurants, three bars, a chocolate boutique, the dreamy Chi, The Spa and a health club await to relax and rejuvenate you.",
      "location_subheading": "Thailand",
      "price": 151,
      "original_price": 151,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000006zXGSAA2",
      "hero_image": "https://images.luxuryescapes.com/x5bqml7snglllw7lfer",
      "image_two": "https://images.luxuryescapes.com/7stddjgpfqno84aqmf",
      "image_three": "https://images.luxuryescapes.com/2vjqodivscyv265q9eq",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "InterContinental Bangkok Sukhumvit",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Opulent Bangkok Stylish Escape with Sumptuous Lounge & Infinity Pool",
      "description": "Indulge in Thai opulence at the stunning InterContinental Bangkok Sukhumvit, an IHG Hotel. Nestled in vibrant Ratchaprasong, this exquisite retreat offers palatial interiors flowing seamlessly from the plush bar to the elegant dining space. Experience ultimate relaxation with rejuvenating spa treatments, look over the gleeming cityscape while floating along the infinity pool and explore lively Bangkok in style.",
      "location_subheading": "Thailand",
      "price": 151,
      "original_price": 151,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DNPS1AAP",
      "hero_image": "https://images.luxuryescapes.com/9hqwqt8cdhjg7hq1da7c",
      "image_two": "https://images.luxuryescapes.com/zthy43g6glh5n6vm9rl",
      "image_three": "https://images.luxuryescapes.com/xzwt2msu8tf1zp7ze1h",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Holiday Inn Bangkok Sukhumvit",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Contemporary Bangkok City Break near Major Shopping District",
      "description": "Get a taste of Thailand’s feverish metropolis at Holiday Inn Bangkok Sukhumvit, an IHG Hotel. Boasting a central location, the hotel places guests within walking distance of luxury shopping centre, Terminal 21, and lifestyle district ‘Emporium and EmQuartier’. Cool off with a dip in the oasis-like eighth-floor swimming pool, or dine at the opulent Maya Restaurant and Rooftop Bar and take in the boundless skyline over an expertly mixed cocktail and northern Indian plates.",
      "location_subheading": "Thailand",
      "price": 91,
      "original_price": 91,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DGdUBAA1",
      "hero_image": "https://images.luxuryescapes.com/ecd0owk52cnu0p108rt",
      "image_two": "https://images.luxuryescapes.com/5goeaes6to93v01id9c",
      "image_three": "https://images.luxuryescapes.com/dm6j7t3qa6a46b2am6n",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Avani+ Riverside Bangkok Hotel",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Stylish Bangkok City Escape on the Chao Phraya with Rooftop Infinity Pool",
      "description": "Riverside resplendence awaits with a five-star stay at Avani+ Riverside Bangkok Hotel. Savour unrestrained views of the mighty Chao Phraya from the comfort of your room, over acclaimed Brazilian-Portuguese plates at SEEN Restaurant & Bar Bangkok or by the hotel’s legendary ultra-slick rooftop infinity pool. Head to onsite live music bar Lost & Found for lavish feasts and decadent nightly entertainment or to Sugar Babies, Bangkok’s only candy bar, for the ultimate sweet fix.",
      "location_subheading": "Thailand",
      "price": 131,
      "original_price": 131,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004v0dkAAA",
      "hero_image": "https://images.luxuryescapes.com/h6olw6qn96d178midl2",
      "image_two": "https://images.luxuryescapes.com/khzbwaj0tye1b31q2ha",
      "image_three": "https://images.luxuryescapes.com/j5lidjvqoi2n2xtxc4z8",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Anantara Riverside Bangkok Resort",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Blissful Bangkok Riverside Resort with 10 Onsite Restaurants & Bars",
      "description": "The buzzingly busy streets of Bangkok seem miles away when you stay at Anantara Riverside Bangkok Resort, thanks to its tranquil location on the banks of Chao Phraya River, surrounded by acres of lush jungle. Ten onsite dining venues are sure to delight any gourmand: feast on teppanyaki, dine on mouthwatering Italian cuisine and sip cocktails poolside. Each day is a new adventure, with river cruises, yoga classes, a tennis court and the deluxe Anantara Spa.",
      "location_subheading": "Thailand",
      "price": 139,
      "original_price": 139,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004v0dQAAQ",
      "hero_image": "https://images.luxuryescapes.com/fgxsn8je9r72pjowfvct",
      "image_two": "https://images.luxuryescapes.com/6ox1lkqidm78018yqht",
      "image_three": "https://images.luxuryescapes.com/7i7wp6jty9yk10krdco",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indigo Bangkok Wireless Road",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Stylish Bangkok City Escape on Wireless Road with Rooftop Infinity Pool",
      "description": "Surrounded by verdant rain trees, prestigious embassies and Thailand's indelible heritage, Hotel Indigo Bangkok Wireless Road is the perfect place to discover the very best of the capital - whether it’s sizzling street food or soulful walks through nearby Lumphini Park. Savour sky-high, smoke-fuelled plates at CHAR Restaurant, cozy craft beers at 22 Steps Craft House or simply laze by the hotel’s mirage-like rooftop pool, surrounded by Bangkok’s soaring skyline.",
      "location_subheading": "Thailand",
      "price": 119,
      "original_price": 119,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000BfgH3AAJ",
      "hero_image": "https://images.luxuryescapes.com/yn3llm0ftjbaum8rpinn",
      "image_two": "https://images.luxuryescapes.com/y3x0dsooziradhhytkp6e",
      "image_three": "https://images.luxuryescapes.com/35mkialrpnku4yt5wrq9",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Anantara Siam Bangkok Hotel",
      "offer_country_name": "Thailand",
      "location_heading": "Bangkok",
      "title": "Stylish Bangkok Downtown Luxury with Nine Restaurants",
      "description": "Discover a luxury hotel with an iconic design in an unrivalled location when you stay at Anantara Siam Bangkok Hotel. Expect lavish decor, from crystal chandeliered ceilings to hand-painted silk murals and impeccably kept gardens. High-end facilities include nine exquisite restaurants, a tranquil day spa featuring VIVID IV Drip Bar, an anti-ageing and aesthetics hub, plus a swimming pool, barber shop, beauty salon, fitness centre, yoga studio and the Spice Spoons cooking class.",
      "location_subheading": "Thailand",
      "price": 269,
      "original_price": 269,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004v0dlAAA",
      "hero_image": "https://images.luxuryescapes.com/wdmd5x8i1d8cdxrpjfu",
      "image_two": "https://images.luxuryescapes.com/2epx067h3buft0xfqpt",
      "image_three": "https://images.luxuryescapes.com/7bfqot94tro0bws5mazp",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hotels in Bangkok - Thailand Hotels & Travel Guide 2024",
    "description": "Find the best hotels in Bangkok, Thailand with exclusive deals. Book your perfect getaway with up to 60% off.",
    "keywords": [
      "bangkok hotels",
      "bangkok travel",
      "thailand hotels"
    ],
    "canonical": "https://mondoexplora.com/en/destination/bangkok",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/bangkok",
      "es": "https://mondoexplora.com/es/destination/bangkok",
      "fr": "https://mondoexplora.com/fr/destination/bangkok",
      "it": "https://mondoexplora.com/it/destination/bangkok"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 45,
    "average_price": 186,
    "average_discount": 2
  }
}