{
  "city": "California",
  "country": "United States",
  "country_code": "US",
  "hero_title": "Hotels in California",
  "description": "Discover the best hotels in California, United States. Find exclusive deals and luxury accommodations.",
  "hero_image": "https://images.luxuryescapes.com/spdn7gwrtcav7c41o0dj",
  "hotels": [
    {
      "vendor_name": "Andaz West Hollywood - A Concept by Hyatt",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "West Hollywood Glamour on the Sunset Strip with Daily Breakfast & Nightly Free-Flow Wine Hour",
      "description": "Defined by its history as a 1960s rockstar refuge and proudly the first hotel on the Sunset Strip, this iconic stay is your key to exploring the star-studded neighbourhoods of Los Angeles. Your base on Sunset Boulevard places you just a short drive from Universal Studios and the Hollywood Sign, offering the ultimate gateway to Beverley Hills and Santa Monica. Soak up sprawling Hollywood Hills views at The Sundeck, West Hollywood's highest rooftop pool bar, and experience market-fresh Californian cuisine crafted right before your eyes in the open kitchen at Riot House Restaurant. Then, relive the golden era of rock 'n' roll at the Riot House Bar, once frequented by legendary musicians.",
      "location_subheading": "United States",
      "price": 509,
      "original_price": 1018,
      "discount_percentage": 50,
      "link": "https://luxuryescapes.com/offer/006RF00000FqSXRYA3",
      "hero_image": "https://images.luxuryescapes.com/spdn7gwrtcav7c41o0dj",
      "image_two": "https://images.luxuryescapes.com/t9twldyivls9tvk4bo4j",
      "image_three": "https://images.luxuryescapes.com/txnirogvzdkyswqtvq5e",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 2,
      "end_date_utc": "2025-08-31 13:59:00"
    },
    {
      "vendor_name": "Fairmont San Francisco",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Sophisticated San Francisco Escape in Nob Hill w. Onsite Dining & Unique Tiki Bar",
      "description": "Experience the grandeur of San Francisco with an elegant stay at the prestigious Fairmont San Francisco. Perched atop Nob Hill, this historic hotel offers panoramic views of the city and the spectacular bay. Just a short stroll from Union Square, you'll be within easy reach of high-end shopping and world-class dining. Explore the nearby Chinatown, the oldest in North America, and savour authentic dim sum and other culinary delights. Within the hotel, indulge in locally sourced, sustainable Californian cuisine at Laurel Court Restaurant and Bar, or sip on handcrafted cocktails at the Tonga Room & Hurricane Bar, offering a tropical and festive atmosphere with its indoor rainstorms and floating stage.",
      "location_subheading": "United States",
      "price": 282,
      "original_price": 282,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GRitOYAT",
      "hero_image": "https://images.luxuryescapes.com/2eh86y2mv3bsnzv6iit",
      "image_two": "https://images.luxuryescapes.com/22khlbltlf8w3siqywi",
      "image_three": "https://images.luxuryescapes.com/voaxplfy4uze7wkphj1",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pendry Newport Beach",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Stylish California Escape near Newport Beach with 7 Restaurants, Day Spa & Pool Bar",
      "description": "The epitome of coastal elegance is here at Pendry Newport Beach, a luxurious haven nestled in the heart of California's Orange County. This beachfront gem is perfectly positioned for you to explore the upscale shopping district of Fashion Island, savor exquisite dining at the renowned Newport Beach Restaurant Week, or soak up the sun at the picturesque Crystal Cove State Park. After days of excitement, retreat to the hotel's alfresco pool bar to sip cocktails while wading in crystal waters.",
      "location_subheading": "United States",
      "price": 363,
      "original_price": 363,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Fl6x3AAB",
      "hero_image": "https://images.luxuryescapes.com/cifmkg23vtxz3dsge8",
      "image_two": "https://images.luxuryescapes.com/ir5qqg7hgvosg13vf8",
      "image_three": "https://images.luxuryescapes.com/ldvvsnieipcqhiw149r5",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Kimpton La Peer Hotel",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Glamourous West Hollywood Stay with Outdoor Pool",
      "description": "Experience the height of bohemian glamour at Kimpton La Peer Hotel, an IHG Hotel. This artfully-curated West Hollywood stay is located in Los Angeles' walkable Design District. Meet at the Courtyard Bar for a healthy, hearty Mediterranean meal, lounge poolside under the shade of leafy olive trees and journey to the Patio Bar for an icy afternoon tipple. When you are ready to explore, The Grove, Melrose Avenue and the iconic Sunset Strip are just a short drive away.",
      "location_subheading": "United States",
      "price": 366,
      "original_price": 366,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000EdKEjAAN",
      "hero_image": "https://images.luxuryescapes.com/onhjgeczhpvsdzpz6k",
      "image_two": "https://images.luxuryescapes.com/3to2hiybeuhia03dnumb",
      "image_three": "https://images.luxuryescapes.com/hszeydp19u3tqgcd1ss",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Pendry San Diego",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Five-Star San Diego Boutique Luxury with Rooftop Swimming Pool",
      "description": "Stay in sun-kissed bliss at the Pendry San Diego, a luxury boutique hotel boasting a dreamy downtown location in the heart of the historic Gaslamp Quarter. Between exploring the city and strolling along the marina, break out your summer read in the poolside cabanas, or treat yourself to a relaxing massage at Spa Pendry. The six onsite restaurants and bars are well worth a visit: indulge in craft beers at Nason's Beer Hall, fresh seafood at Lionfish, or classic cocktails at Fifth & Rose.",
      "location_subheading": "United States",
      "price": 302,
      "original_price": 302,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DQ3UKAA1",
      "hero_image": "https://images.luxuryescapes.com/xm4cr05zdrd92ehkmfi",
      "image_two": "https://images.luxuryescapes.com/imcsxqyp1gven6z0jy2",
      "image_three": "https://images.luxuryescapes.com/bqdpwg3dnf2v3kkdjbf",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Kimpton Sawyer Hotel",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Sophisticated Downtown Sacramento Stay with Rooftop Pool Deck",
      "description": "Discover unparalleled sophistication in the vibrant heart of downtown Sacramento at the Kimpton Sawyer Hotel. Soak up views over the Golden One Center from the pool deck, and savour cocktails and cuisine at two onsite eateries and the downstairs Punch Club Social. When you're ready for adventure, simply cross the road to catch a thrilling basketball game, or embark on a foodie tour of the neighbourhood.",
      "location_subheading": "United States",
      "price": 207,
      "original_price": 207,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000EdKF9AAN",
      "hero_image": "https://images.luxuryescapes.com/fs0ne3ta3bv450opzam",
      "image_two": "https://images.luxuryescapes.com/x4vbo6tzqbe5xc0bkq8d",
      "image_three": "https://images.luxuryescapes.com/yscwwi7zjjb4p4d5oh0f",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "L'Ermitage Beverly Hills",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Glamorous Five-Star Beverly Hills Escape with Rooftop Pool, Day Spa & French Bistro",
      "description": "Experience the epitome of California-style luxury at the five-star L'Ermitage Beverly Hills, a hotel that effortlessly embodies the glitz and glamour of its prestigious location. Indulge in an elevated residential-style experience in this all-suite hotel, sample world-class dining at L’ Restaurant or pamper yourself at the Ricari Studios spa. Just moments from the designer boutiques of Rodeo Drive and the iconic Hollywood Walk of Fame, here you'll find an ideal celebrity-style escape.",
      "location_subheading": "United States",
      "price": 597,
      "original_price": 597,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004U8imAAC",
      "hero_image": "https://images.luxuryescapes.com/18w0a4gpwib2vkte4mf3",
      "image_two": "https://images.luxuryescapes.com/yi65l4kuwxyt4q14n4t",
      "image_three": "https://images.luxuryescapes.com/323tq7y2nugggmdkp2fs",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Terranea Resort",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "California 5-Star Oceanfront Paradise with 8 Restaurants, Onsite Spa & Golf Course",
      "description": "Indulge in the epitome of Californian luxury at the five-star Terranea Resort, perched on the stunning Palos Verdes Peninsula. This oceanfront haven is a paradise of refined relaxation, with four sparkling pools, a pristine nine-hole golf course and a world-class spa. Savour gastronomic delights at eight distinctive restaurants, each offering a unique culinary journey from the oceanfront dining at Mar'sel’s with elegant dinners and sophisticated brunches, to the spirited flavours of Catalina Kitchen. Head the nearby Point Vicente Lighthouse, or explore the vibrant art scene at the Palos Verdes Art Center. Return to your spacious guestroom, suite or villa to unwind in unmatched luxury and watch the sunset over the Pacific, ending another day in this coastal utopia.",
      "location_subheading": "United States",
      "price": 1034,
      "original_price": 1034,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GMMsMAAX",
      "hero_image": "https://images.luxuryescapes.com/4i38cln7ogdwgvwrh5yb",
      "image_two": "https://images.luxuryescapes.com/xnou99b9qwwlpnssn0rs",
      "image_three": "https://images.luxuryescapes.com/zi6iaih7fl4d37005gaf",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Disneyland Hotel",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Disneyland Hotel with Early Entry to Disneyland Resort, Themed Pools & Waterslides",
      "description": "Your fairytale journey begins at this iconic resort just steps from _Disneyland Resort_ in California. Whimsically blending Disney spirited past with modern amenities, this hotel offers themed suites, six atmospheric eateries and bars, and two sprawling, retro-themed pools. There's no better way to experience The Happiest Place on Earth than by sleeping on its doorstep. Staying at _Disneyland_ Hotel comes with exclusive perks, such as early theme park entry and movie nights for the whole family. When you're not immersed in the fun-filled theme parks, relax in a private poolside cabana and make a splash on two exhilarating waterslides. For moments of quiet amid the endless excitement, retreat to Tenaya Stone Spa for a magical massage.",
      "location_subheading": "United States",
      "price": 478,
      "original_price": 478,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000DbW34YAF",
      "hero_image": "https://images.luxuryescapes.com/y1xmg8jbi3r8xp975qhc",
      "image_two": "https://images.luxuryescapes.com/de42kkekic597k706ei",
      "image_three": "https://images.luxuryescapes.com/k2y3vtwynq7gi1zkopuwc",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Kimpton Hotel Wilshire",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Luxe Los Angeles City Break near Beverly Hills with Glamorous Rooftop Pool & Bar",
      "description": "Step into Southern California style with a stay at Kimpton Hotel Wilshire, an IHG Hotel, located in the heart of the city’s prestigious Miracle Mile - just moments from Beverly Hills’ iconic, palm-swept boulevards. Head to the hotel’s spectacular rooftop pool and bar for laidback plates, mezcal-forward cocktails and sweeping views of Hollywood Hills or strike out to explore Miracle Mile’s ‘Museum Row,’ featuring the Academy Museum of Motion Pictures, the Peterson Automotive Museum and more.",
      "location_subheading": "United States",
      "price": 247,
      "original_price": 247,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000EdKEkAAN",
      "hero_image": "https://images.luxuryescapes.com/ukla41wl3exoth17o4bf",
      "image_two": "https://images.luxuryescapes.com/jrjidikwlhy4sje5kxt",
      "image_three": "https://images.luxuryescapes.com/pn1nycr4zojm37v4pax",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Kimpton Rowan Palm Springs Hotel",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Elegant Palm Springs Escape with Lavish Rooftop Pool Views & Premium Dining",
      "description": "Modern boutique-style elegance blends with the inspiring desert landscape of southern California at Kimpton Rowan Palm Springs, an IHG Hotel - an oasis with views overlooking the rugged mountain ranges from a luxurious rooftop pool and terrace. Pinioned between the San Jacinto Mountain Range and the Coachella Valley, here you're in the ideal spot to lounge poolside, sip a refreshing cocktail from High Bar, and dine on a pristine seasonal menu at 4 Saints' rooftop restaurant.",
      "location_subheading": "United States",
      "price": 245,
      "original_price": 245,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000EdKElAAN",
      "hero_image": "https://images.luxuryescapes.com/hf8m4the86j65fg4mfkd",
      "image_two": "https://images.luxuryescapes.com/c2mimvvizbjczx6frs8",
      "image_three": "https://images.luxuryescapes.com/n9xyd28b4ixy9s5lsjhp",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Silverado Resort",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Napa Valley Hideaway with World Championship Golf Course",
      "description": "Napa Valley Wine Country is yours to discover from the comfort of the luxurious Silverado Resort and Spa. When you're not wandering across the region, bouncing between vineyards and celebrated restaurants, spend time exploring the resort's 120 hectares. Enjoy a friendly game of tennis, practice your swing on the world-class championship golf course, or succumb to total relaxation with a rejuvenating treatment at the spa. When hunger strikes, be wined and dined at The Grill.",
      "location_subheading": "United States",
      "price": 227,
      "original_price": 227,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DkAMAA0",
      "hero_image": "https://images.luxuryescapes.com/msmqx4f46r3vkeoqppzi",
      "image_two": "https://images.luxuryescapes.com/ojrlejd67by3jzlocq4",
      "image_three": "https://images.luxuryescapes.com/6neujw9ijrshdvwphosw",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 01:59:00"
    },
    {
      "vendor_name": "Petit Ermitage Hotel",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Glamorous West Hollywood Boutique Suite Escape with Rooftop Pool",
      "description": "Immerse yourself in the magic of West Hollywood with an escape at the beautifully bohemian Petit Ermitage. Perched between two of California's most famous boulevards - Sunset and Santa Monica - this chic boutique bolthole is perfectly located for all your Golden State adventures. Remarkable restaurants and brilliant bars are within walking distance, and it's an easy 15-minute drive to the boutiques of Beverly Hills and thrills of Universal Studios. Petit Ermitage is a haven of European eccentricity, with suites that celebrate vintage styling and splashes of Parisian, Spanish and Moroccan-inspired design. That boutique feel continues in the common areas, with walls lined with original art from the owner’s eclectic collection - think Miro, de Kooning and Dali. However, it’s at the rooftop pool where the fun truly begins: sun yourself on one of the striped daybeds while admiring views of the Hills or settle in for a swim - it’s heated and saltwater, so it’s comfortable no matter the time of year. A nearby fire deck comes to life at sundown, best admired with a cocktail in hand from Butterfly Bar. When hunger strikes, turn to the expansive alfresco restaurant, which also doubles as a hummingbird and butterfly sanctuary. **Luxury Escapes inclusions** - Toast your Hollywood adventure with a **complimentary bottle of wine** from the minibar - Live the high life with an **upgrade to the next suite category**, subject to availability **One-Bedroom Suite Upgrade:** Spread out in the charming One-Bedroom Suite, complete with kitchenette (most rooms), king-sized bed and a separate living area.",
      "location_subheading": "United States",
      "price": 225,
      "original_price": 225,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GLKQAA4",
      "hero_image": "https://images.luxuryescapes.com/ihwmopjswb9fzzectd",
      "image_two": "https://images.luxuryescapes.com/vpdcb588dt4bie97wn8f",
      "image_three": "https://images.luxuryescapes.com/4thwcergup11qfeh38k",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Intercontinental Los Angeles Downtown",
      "offer_country_name": "United States",
      "location_heading": "California",
      "title": "Elevated Downtown Los Angeles Luxury in the Iconic Wilshire Grand with Sky Lobby & Rooftop Bar",
      "description": "Experience the glamour of the City of Angels from the soaring heights of the InterContinental Los Angeles Downtown, an IHG Hotel. Located in the Wilshire Grand skyscraper, savour steak and seafood at La Boucherieor sip handcrafted cocktails at Spire 73, the tallest open-air rooftop bar in the Western Hemisphere. Unwind with a splash in the sky-high outdoor pool, offering panoramic city views, or set yourself up for a lazy afternoon in a poolside cabana.",
      "location_subheading": "United States",
      "price": 225,
      "original_price": 225,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt7PAAR",
      "hero_image": "https://images.luxuryescapes.com/l4zomewo248prbmufacd",
      "image_two": "https://images.luxuryescapes.com/tl0t8qcl8kwqitpmy5a9",
      "image_three": "https://images.luxuryescapes.com/pvb5stflz83c826d1yh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hotels in California - United States Hotels & Travel Guide 2024",
    "description": "Find the best hotels in California, United States with exclusive deals. Book your perfect getaway with up to 60% off.",
    "keywords": [
      "california hotels",
      "california travel",
      "united states hotels"
    ],
    "canonical": "https://mondoexplora.com/en/destination/california",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/california",
      "es": "https://mondoexplora.com/es/destination/california",
      "fr": "https://mondoexplora.com/fr/destination/california",
      "it": "https://mondoexplora.com/it/destination/california"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 14,
    "average_price": 379,
    "average_discount": 4
  }
}