{
  "city": "Dubai",
  "country": "United Arab Emirates",
  "country_code": "AE",
  "hero_title": "Hotels in Dubai",
  "description": "Discover the best hotels in Dubai, United Arab Emirates. Find exclusive deals and luxury accommodations.",
  "hero_image": "https://images.luxuryescapes.com/tiedmdvapvo1mf2u3sr",
  "hotels": [
    {
      "vendor_name": "The Ritz-Carlton, Dubai Beach Resort",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Oceanfront Glamour with Private Beach, Daily Breakfast, Nightly Dinner & Two Kids Stay Free",
      "description": "A beachfront icon on the golden shores of Dubai Marina, The Ritz-Carlton, Dubai captures the prestige and polish of this globally renowned brand in a setting that’s hard to match. From the cabana-lined lagoon pools and decadent spa to the sprawling private beach, every moment here echoes Dubai’s dazzling spirit. Dining is a true highlight, with six high-end restaurants included in your package. Enjoy Middle Eastern flavours under the stars at Amaseena, refined Asian dishes prepared in Blue Jade’s open kitchen or classic Italian in the marble-accented elegance of Splendido. Set along The Walk at Jumeirah Beach Residence, this beachfront haven is your key to Dubai at its most glamorous. With effortless access to icons like Burj Khalifa, world-class golf courses, and a host of activities from designer shopping to watersports, the city’s finest moments are always within reach.",
      "location_subheading": "United Arab Emirates",
      "price": 789,
      "original_price": 1679,
      "discount_percentage": 53,
      "link": "https://luxuryescapes.com/offer/006RF00000I7W2TYAV",
      "hero_image": "https://images.luxuryescapes.com/tiedmdvapvo1mf2u3sr",
      "image_two": "https://images.luxuryescapes.com/f89hhp6sc7kcfwyt6cm",
      "image_three": "https://images.luxuryescapes.com/yurfqorilwcio6qa7l9c",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 3,
      "end_date_utc": "2025-08-08 13:59:00"
    },
    {
      "vendor_name": "The Dubai Edition",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Downtown Dubai Glamour with Daily Breakfast, Nightly Cocktails & AED200 Spa Credit",
      "description": "Dubai's signature style, innovation and prestige are put on spectacular display at this designer hotel in the city's downtown area. Located steps from the iconic Dubai Mall and the soaring Burj Khalifa, this cosmopolitan oasis is another striking architectural landmark by the coveted EDITION brand. While here, relax in the serene rooftop infinity pool, where plush loungers create the perfect retreat. As the sun sets, find a seat at Thia Skylounge - a glamorous rooftop bar and shisha lounge offering crafted cocktails and panoramic vistas of the Burj Khalifa. For a dining experience on par with the city's best, onsite DUOMO brings Italian grandeur to life beneath soaring cathedral ceilings and dazzling crystal chandeliers. Wellness seekers will find respite at the spa, which features luxurious treatments and a state-of-the-art fitness centre.",
      "location_subheading": "United Arab Emirates",
      "price": 469,
      "original_price": 1340,
      "discount_percentage": 65,
      "link": "https://luxuryescapes.com/offer/006RF00000JgicoYAB",
      "hero_image": "https://images.luxuryescapes.com/w8v95nja4j32orn9odao",
      "image_two": "https://images.luxuryescapes.com/jai2rzvhakcxgjcykxi",
      "image_three": "https://images.luxuryescapes.com/hlng1eyi8kj1ie1j0zq",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 2,
      "end_date_utc": "2025-08-25 13:59:00"
    },
    {
      "vendor_name": "Andaz Dubai The Palm",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Beachfront Dubai Palm Jumeirah Glamour with Daily Breakfast & Daily Lunch or Dinner",
      "description": "Set on the trunk of the Palm Jumeirah is a high-end, design-focused oasis offering a taste of eclectic opulence close to the very best of Dubai. This beachfront hideaway boasts a pristine private beach, adults-only cabana pool, boutique spa and five dining options with an abundance of delectable cuisines and flavours. Walk into the atrium-style lobby and take in the vibrant glass birds in flight (inspired by Dubai's falconry traditions) before admiring the local artwork embellishing every wall and colourful woven carpet inspired by the Bedouin art of Sadu embroidery. With such a central location, Dubai’s top attractions - including the Nakheel Mall, Dubai Marina, Jumeirah Beach and Mall of the Emirates - are at your fingertips.",
      "location_subheading": "United Arab Emirates",
      "price": 679,
      "original_price": 2829,
      "discount_percentage": 76,
      "link": "https://luxuryescapes.com/offer/006RF00000JBxppYAD",
      "hero_image": "https://images.luxuryescapes.com/o3owhsy0ub88iz02ga",
      "image_two": "https://images.luxuryescapes.com/0pv1bt62z76idx6vjhir",
      "image_three": "https://images.luxuryescapes.com/eob7ng0lli7a4e33fm5f",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 5,
      "end_date_utc": "2025-07-30 13:59:00"
    },
    {
      "vendor_name": "W Dubai - The Palm",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Beachside Opulence on Palm Jumeirah with Daily Breakfast, Nightly Dinner & Two Kids Stay Free",
      "description": "At one of Dubai's most prized addresses on the Palm Jumeirah, W's signature playful, design-led luxury brings the wow factor, marrying city living with beachside serenity. Here, next-level skyline views, tiered pools with submerged cabanas, a chic onsite beach club and jaw-dropping five-storey atrium bring the best of the Dubai lifestyle together. Indulgence awaits at the resort's celebrity chef destination restaurants, including easygoing Mediterranean plates at Olivino and Japanese cuisine prepared with Korean flair at Akira Back, perched magnificently on the hotel's rooftop. Take the whole family on a glitzy getaway, where little ones can enjoy the kids' swimming pool and outdoor Games Room, while adults can dive into the topaz pools at the adults-only WET deck - a sun-drenched wonderland with wicker cabanas and a world-class sound system.",
      "location_subheading": "United Arab Emirates",
      "price": 619,
      "original_price": 2579,
      "discount_percentage": 76,
      "link": "https://luxuryescapes.com/offer/006RF00000JpqT3YAJ",
      "hero_image": "https://images.luxuryescapes.com/o2g6h0wjalg76dotjd9s",
      "image_two": "https://images.luxuryescapes.com/78qal4ty81id9ik35fo",
      "image_three": "https://images.luxuryescapes.com/njf5gx8f8gs7somqvcij",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 3,
      "end_date_utc": "2025-09-02 13:59:00"
    },
    {
      "vendor_name": "Sofitel Dubai The Obelisk",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Extended by Popular Demand: Dubai Opulence with Club Access, Breakfast & Nightly Free-Flow Cocktails",
      "description": "Standing tall against the dazzling city skyline, this five-star haven is ready to welcome you to a world of unrivalled luxury. French sophistication meets ancient Egyptian pharaonic flair in the largest Sofitel in the Middle East, a refined retreat ideally positioned for easy access to Dubai's best experiences - including countless souqs, Dubai Creek and the city's best shopping districts. Wine or dine at one of six enticing venues, unwind by a luxurious Egyptian ankh-shaped pool, or pamper yourself with a Provence-inspired retreat at the Sofitel Spa with L'Occitane. Ready to explore? Should you be tempted to leave your luxurious resort, the nearby station will whisk you to Dubai's major attractions in minutes. Further afield, you'll find the heritage Al Fahidi District in Bur Dubai and the evocative desert landscapes that ensconce the city. Whether it’s a family stay or a romantic escape to one of the most exciting hubs in the Middle East, Sofitel Dubai The Obelisk is where you need to be.",
      "location_subheading": "United Arab Emirates",
      "price": 469,
      "original_price": 1466,
      "discount_percentage": 68,
      "link": "https://luxuryescapes.com/offer/006RF00000EHUJOYA5",
      "hero_image": "https://images.luxuryescapes.com/wx7x9spnya1dknjcb42o",
      "image_two": "https://images.luxuryescapes.com/wdt3p1xb2pzk26rvrb8",
      "image_three": "https://images.luxuryescapes.com/hxx0tyozo7z5a3rfju0w",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 3,
      "end_date_utc": "2025-08-06 12:59:00"
    },
    {
      "vendor_name": "Anantara The Palm Dubai Resort",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai's Palm Jumeirah Five-Star Glamour with Private Beach & the Only Overwater Villas in the UAE",
      "description": "Take your luxurious Dubai escape up a notch at the five-star Anantara The Palm Dubai Resort, home to the only overwater villas in the UAE. Here, experience that signature Dubai extravagance with 400 metres of pristine private beach, three swimming lagoons and Turkish hammam rituals at Anantara Spa. Gourmands are spoilt for choice with seven onsite eateries, including upscale Australian dining at Bushman's Restaurant & Bar and Mediterranean cuisine at The Beach House.",
      "location_subheading": "United Arab Emirates",
      "price": 147,
      "original_price": 147,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BTU3AAO",
      "hero_image": "https://images.luxuryescapes.com/yadjmovg02k4p5pdmq1n",
      "image_two": "https://images.luxuryescapes.com/7neihjw57shbztk7swhu",
      "image_three": "https://images.luxuryescapes.com/tgonqpvc0j927ngjw58t",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mandarin Oriental Downtown Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Sky-High Downtown Dubai Opulence with Nine Restaurants & Tranquil Spa",
      "description": "Soaring above Dubai’s iconic skyline, Mandarin Oriental Downtown, Dubai is a bold statement of architectural ingenuity, encased in the iconic Wasl Tower, one of the world's tallest ceramic facades. Standing proudly in the heart of Dubai’s buzz, this hotel puts you steps away from the record-breaking Burj Khalifa and the endless luxury of The Dubai Mall. Within Mandarin Oriental Downtown, Dubai, a world of refinement awaits, with exceptional restaurants and a stunning 25-metre outdoor lap pool nestled within a landscaped garden terrace. After days spent in unrivalled opulence, wander through the trendy streets of City Walk or head to Jumeirah Beach for some sun and sea.",
      "location_subheading": "United Arab Emirates",
      "price": 488,
      "original_price": 488,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000EU9VeYAL",
      "hero_image": "https://images.luxuryescapes.com/u3e03jbi4g3mgzrrb0yo",
      "image_two": "https://images.luxuryescapes.com/4sciytmmxq4z417cv",
      "image_three": "https://images.luxuryescapes.com/l9h8sfvzob3imz68skbl",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "One&Only Royal Mirage, Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Regal Elegance Near Dubai Marina with Private Beach & Four Swimming Pools",
      "description": "Uncover Arabic romance at One&Only Royal Mirage in Dubai, a hotel dripping in opulence from its dramatic architecture to its mosaic-tiled corridors and gleaming domes. You're spoilt for choice when it comes to dining during your stay, with nine inspiring restaurants to choose from, including Eauzone for modern Asian dining by the pool, The Courtyards for mezze culture under the stars and Nina for aromatic Indian classics. For a dose of relaxation, visit Oriental Hammam for a traditional steam bath ritual or One&Only Spa for a rejuvenating facial. For a splash of fun, visit the pristine stretch of private beach near the hotel or one of the four swimming pools scattered across the property, including the adults-only Al Janoub pool area with private gazebos, shaded sun loungers and an infinity pool with views over Dubai Harbour Marina and Palm Island Bay.",
      "location_subheading": "United Arab Emirates",
      "price": 193,
      "original_price": 193,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GktYAAS",
      "hero_image": "https://images.luxuryescapes.com/mu52um8s5msp1ad7u2ti",
      "image_two": "https://images.luxuryescapes.com/l3u2vqpwwl5x4ake1xlm",
      "image_three": "https://images.luxuryescapes.com/v2lpy8dj54rv33gusc4t",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "One&Only The Palm",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Secluded One&Only Opulence on Palm Jumeirah with Private Beach",
      "description": "Embrace unrivalled luxury at the elegant One&Only The Palm, ideally located on a private peninsula of the prestigious Palm Jumeirah. Surrounded by white sand shores and featuring remarkable views of the city skyline, this exquisite oasis offers a palatial Dubai escape within a truly secluded paradise. Part of the globally recognised One&Only brand, enjoy moments spent walking the resort's pristine stretch of private beach, swimming in temperature-controlled swimming pools or dining across four unforgettable restaurants. For further relaxation, head to the lavish Guerlain Spa or take advantage of tailored treatments by celebrated hairdressers and stylists.",
      "location_subheading": "United Arab Emirates",
      "price": 485,
      "original_price": 485,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GktiAAC",
      "hero_image": "https://images.luxuryescapes.com/jhmi5snymqm7qr2fkx",
      "image_two": "https://images.luxuryescapes.com/tvo5qpemuyivv1pbjz6n",
      "image_three": "https://images.luxuryescapes.com/tjxwloobq9a2l8fnhwke",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Rixos Premium Dubai JBR",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Beachfront Opulence in the Heart of Jumeirah Beach Residence with Eight Restaurants & Bars",
      "description": "Set along the golden shores of Dubai’s iconic Jumeirah Beach Residence, this five-star beachfront haven effortlessly fuses Rixos’ signature indulgence with the city’s bold, glamorous spirit. With sweeping views of turquoise waters, Rixos Premium Dubai JBR caters to both style-savvy travellers and thrill-seekers, featuring a collection of world-class dining venues, a palm-fringed pool and the serene, Turkish-inspired Naturelife Spa. You'll be perfectly positioned for discovery - wander to Dubai Marina Mall for high-end fashion or explore The Walk at JBR, a vibrant promenade of seaside dining and retail. As night falls, the hotel transforms - dine in style at the chic STK steakhouse or experience the electric weekend vibe at Azure Beach, where the energy never fades.",
      "location_subheading": "United Arab Emirates",
      "price": 147,
      "original_price": 147,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000Ib17mYAB",
      "hero_image": "https://images.luxuryescapes.com/pdn3r4ttrgnu1qyl64y",
      "image_two": "https://images.luxuryescapes.com/ea67626bhd8bu165wulk",
      "image_three": "https://images.luxuryescapes.com/oh9o1bv1xg4w2fj0v7",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Jumeirah Al Qasr Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Dubai Palatial Splendour with Private Beach & Award-Winning Spa",
      "description": "Live the high life at Jumeirah Al Qasr Dubai, a five-star oasis that boasts extraordinary architecture, magical old-world splendour and Arabian charm. Whether it’s a spectacular day bathing in the hotel's private beach, midnight desert sojourns, culinary gems or world-class shopping, you will be perfectly placed to explore Dubai's countless treasures. An award-winning wellness centre, serene infinity pool, gourmet dining and more await at this idyllic retreat in the heart of the prestigious Al Sufouh 1 neighbourhood.",
      "location_subheading": "United Arab Emirates",
      "price": 202,
      "original_price": 202,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000C2GvfAAF",
      "hero_image": "https://images.luxuryescapes.com/8518ys6l862tooc3rmh",
      "image_two": "https://images.luxuryescapes.com/ca48yy1iowfx0qxulyqdb",
      "image_three": "https://images.luxuryescapes.com/mph92b6pnl2ax1mh57zp",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Avani Ibn Battuta Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Stylish Dubai City Escape with Rooftop Pool Bar",
      "description": "Discover Dubai from Avani Ibn Battuta Dubai Hotel - a stylish city retreat sitting in close proximity to all the vibrant area's attractions. Spend days basking by the shimmering swimming pool, feasting on international cuisine at Pele Social Hub or meeting your fitness goals at AvaniFit, featuring a state-of-the-art gym and sauna. Beyond your hotel, find yourself in the Ibn Battuta Dubai Mall or venture to the nearby Palm Jumeirah island, palm-tree-lined Dubai Marina Walk and pristine JBR Beach.",
      "location_subheading": "United Arab Emirates",
      "price": 71,
      "original_price": 71,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BTV6AAO",
      "hero_image": "https://images.luxuryescapes.com/3rljf5qsc8jlo93kx2nq",
      "image_two": "https://images.luxuryescapes.com/5yv7x6o38jdv0zv2jvo",
      "image_three": "https://images.luxuryescapes.com/eos2yeh4vp6d2f77nla",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Jumeirah Mina Al Salam Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Dubai Beachfront Luxury with Seven Restaurants & Bars",
      "description": "Stay moments from the beach in regal Arabian-style luxury at Jumeirah Mina Al Salam, a five-star Dubai gem. Onsite, you'll find seven restaurants and bars to choose from, whether you're craving poolside snacks, dreaming of authentic Mexican cuisine, or wishing for handcrafted cocktails in an elegant lounge overlooking the ocean. Take a refreshing dip in one of two shimmering pools, find rejuvenation at the onsite spa or simply enjoy views across the resort's massive lagoon - the choice is yours.",
      "location_subheading": "United Arab Emirates",
      "price": 193,
      "original_price": 193,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000C2GuDAAV",
      "hero_image": "https://images.luxuryescapes.com/5jcu8jh8y431mego2vs",
      "image_two": "https://images.luxuryescapes.com/uegw6wvdqr1tk0zcswmc",
      "image_three": "https://images.luxuryescapes.com/gsa7a5teer7ukmgquzlh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Aparthotel Adagio Dubai Deira",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Stylish Dubai Apartments 20-Minutes from Burj Khalifa with Rooftop Pool & Onsite Dining",
      "description": "Embrace comfort and convenience at Aparthotel Adagio Dubai Deira, a harmony between modern living and traditional Arabian hospitality. This hotel boasts thoughtful accommodations with elegant furnishings and expansive windows that bathe the spaces in natural light. Unwind by the rooftop pool with sea-to-sky views, or enjoy slow-cooked curries and grilled meats at the onsite restaurant. Wander through the dazzling alleyways of the Gold Souk, where master jewellers showcase their creations, or lose yourself in the aromatic wonderland of the Spice Souk. Take a traditional abra boat ride across Dubai Creek, explore the historic exhibits at Dubai Museum, or enjoy waterfront dining along Al Seef's charming restaurants.",
      "location_subheading": "United Arab Emirates",
      "price": 48,
      "original_price": 48,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP8AYAV",
      "hero_image": "https://images.luxuryescapes.com/roawmsgdui4lljgc6onr",
      "image_two": "https://images.luxuryescapes.com/ugos9d9h3x1hn478ml",
      "image_three": "https://images.luxuryescapes.com/hfox2t1nwl8j7899p3l",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Movenpick Al Mamzar",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Opulence Near Airport & Historic Souks with Rooftop Pool",
      "description": "Nestled in the Al Mamzar district of Deira, a bustling heart of Old Dubai and its commercial hub, this five-star hotel embraces the vibrant spirit of the city. Explore renowned Gold Souk and Spice Souk and Al Mamzar Beach Park. After a day of discovery, retreat to the hotel’s contemporary rooms. With Dubai International Airport moments away, it’s an ideal choice for the adventurous traveller. Savor an exquisite culinary experience at the hotel’s restaurant, where Middle Eastern flavors meet European elegance. Unwind at the state-of-the-art gym and enjoy views from the rooftop pool. Explore Dubai’s iconic landmarks, including the awe-inspiring Burj Khalifa and the world-famous Dubai Mall.",
      "location_subheading": "United Arab Emirates",
      "price": 37,
      "original_price": 37,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP8GYAV",
      "hero_image": "https://images.luxuryescapes.com/t19ohy6ovlgnuien53h",
      "image_two": "https://images.luxuryescapes.com/okohkqvd7t6svtxmiicj",
      "image_three": "https://images.luxuryescapes.com/vycpnswv8fny67z7d4e",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "InterContinental Dubai Festival City",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Waterfront Stay with Iconic Glass Infinity Pool & Direct Access to Festival City Mall",
      "description": "Dubai's sparkling cityscape is yours to discover when you stay at the waterfront InterContinental Dubai Festival City, an IHG Hotel, a luxurious retreat offering direct access to the world-class Dubai Festival City Mall. Unbeatable facilities include an iconic glass-bottom infinity pool that lets you look down at city streets below, an award-winning spa, Planet Trekkers Kids' Club, and five onsite restaurants including a trendy Lebanese eatery and a terrace bar offering city panoramas.",
      "location_subheading": "United Arab Emirates",
      "price": 112,
      "original_price": 112,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt5SAAR",
      "hero_image": "https://images.luxuryescapes.com/rn3yqo19ufz7a25746iq",
      "image_two": "https://images.luxuryescapes.com/gb5sfiblp7vs23v57pln",
      "image_three": "https://images.luxuryescapes.com/z6vjo3kkx0t1mjfely",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Adagio Premium The Palm",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Contemporary Dubai Self-Contained Beachfront Apartments on Palm Jumeirah with Private Beach & Rooftop Pool",
      "description": "Discover a haven of refined comfort at this striking aparthotel on Dubai's Palm Jumeirah, featuring a rooftop infinity pool overlooking the Arabian Gulf, a modern fitness centre and a private beach where golden sands meet crystal-clear waters. Every moment is crafted for an unforgettable stay, from breakfast at Fixie cafe to unwinding in thoughtfully appointed apartments. Set within Dubai's most iconic community, this hotel's premier location puts the city's top experiences within easy reach. Embark on a thrilling adventure at Aquaventure Waterpark or indulge in retail therapy at Nakheel Mall. As the sun sets, enjoy the gentle sea breeze and witness the Dubai skyline transform into a glittering masterpiece.",
      "location_subheading": "United Arab Emirates",
      "price": 76,
      "original_price": 76,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP88YAF",
      "hero_image": "https://images.luxuryescapes.com/7pxhua8l1kjyhef8rva",
      "image_two": "https://images.luxuryescapes.com/qxrm11o3mm53yh2ywe7",
      "image_three": "https://images.luxuryescapes.com/d4pm4yu1miem2pvfz78i",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Retreat Palm Hotel Dubai - MGallery Collection",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Beachfront Dubai Palm Jumeirah Wellness Sanctuary with Four Restaurants, Onsite Spa & Infinity Pool",
      "description": "Transport yourself to an oasis of tranquillity with a sophisticated stay at this five-star beachfront sanctuary, ideally situated on the East Crescent of Dubai's world-renowned Palm Jumeirah. Designed for ultimate relaxation and rejuvenation, this wellness retreat offers a holistic escape just moments from Dubai’s vibrant energy. Restore balance with therapies at Rayya Wellness Centre, or unwind in beachside cabanas by the infinity pool or on the private beach area. Indulge in nutrient-rich delights at Vibe and savour authentic Turkish cuisine at Bait Al Nakhla. Beyond the resort, experience exhilarating adventures at Aquaventure Waterpark or explore Dubai’s landmarks, including the Burj Khalifa.",
      "location_subheading": "United Arab Emirates",
      "price": 75,
      "original_price": 75,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GUPuDYAX",
      "hero_image": "https://images.luxuryescapes.com/wlvff1geop9stla9obim",
      "image_two": "https://images.luxuryescapes.com/b4q1do1ixmak4o93w2rih",
      "image_three": "https://images.luxuryescapes.com/9a0qsdailrqe525hcvw",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Oaks Ibn Battuta Gate Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Five-Star Arabian Retreat with Private Beach Access & Rooftop Bar",
      "description": "The sheer five-star splendour of Oaks Ibn Battuta Gate Dubai must be seen to be believed - step into the many-lanterned lobby and you're transported to a world of effortless Arabian luxury, with intricate historic flourishes honouring ancient explorer Ibn Battuta. This is the perfect gateway to discover Dubai’s many treasures - admire the glorious Dubai sunset at the Skyline Pool Bar, laze on the dazzling sands of the hotel's private beach or enjoy authentic Moroccan plates and shisha at Moroc Lounge.",
      "location_subheading": "United Arab Emirates",
      "price": 99,
      "original_price": 99,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BTY0AAO",
      "hero_image": "https://images.luxuryescapes.com/zpdtb3vmf9vewprjskli",
      "image_two": "https://images.luxuryescapes.com/ovisf8ckgd5h3k5iivr",
      "image_three": "https://images.luxuryescapes.com/hsf43nd4jvzw3cuxyre",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Bab Al Shams",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Ultra-Opulent Dubai Desert Oasis with Cultural Experiences & Six Restaurants",
      "description": "Indulge in unrivalled luxury and immerse yourself in a desert oasis like no other at Bab Al Shams, just 45 minutes from downtown Dubai. Surrender to the allure of traditional architecture and personalised service that caters to your every desire at this opulent sanctuary - feast on delicious cuisine at award-winning restaurants - including a sophisticated cigar lounge, Ya Hala - or make new memories with a range of desert adventures, including hot-air ballooning, horse riding and camelback treks.",
      "location_subheading": "United Arab Emirates",
      "price": 277,
      "original_price": 277,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000ExAGGAA3",
      "hero_image": "https://images.luxuryescapes.com/h8nrmfs1efpcymbggfqm",
      "image_two": "https://images.luxuryescapes.com/ls0siwadtk38wpkv51gy",
      "image_three": "https://images.luxuryescapes.com/f8d6gzjabp0cqv1h1lps",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Zabeel House by Jumeirah, The Greens",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Stylish Dubai Boutique Escape with Organic Spa & Co-Working Space",
      "description": "Stay, work and play the Dubai way at Zabeel House by Jumeirah, The Greens - the ultimate lifestyle boutique hotel hangout. Gather at the Social Company for breakfast, lunch or dinner, or after a day exploring, settle in at Lah Lah for Pan-Asian flavours that pack a punch. Just don't forget to decompress at The Native Club, Dubai's all-organic spa.",
      "location_subheading": "United Arab Emirates",
      "price": 62,
      "original_price": 62,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Ey5u1AAB",
      "hero_image": "https://images.luxuryescapes.com/dg0zrj7c0exk8y6hwsck",
      "image_two": "https://images.luxuryescapes.com/q1jf5pfjdfpyqk2zli8i",
      "image_three": "https://images.luxuryescapes.com/ja5n8yqcer76vy5c54is",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Raffles Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Five-Star Raffles Excellence with Six Dining Venues, Outdoor Pool & Onsite Spa",
      "description": "This luxury Dubai property is an oasis of soothing charm, with a remarkable sense of style. The 17-storey pyramid-inspired design holds some of the largest rooms in the Emirates, each a glamorous sanctuary in the Dubai cityscape. Experience outstanding service, soak up panoramic vistas from the lavish outdoor pool, unwind with a treatment at the luxurious Raffles Spa, or dine under the stars among the tranquil gardens of this destination hotel. Raffles is perfectly located in the city's premium business and shopping district and conveniently connects to WAFI City mall where you can shop to your heart's content. There's little reason to leave, however a 15-minute taxi ride lands you at the awe-inspiring Burj Khalifa, or the local metro station is a five-minute walk and will get you to all other major attractions.",
      "location_subheading": "United Arab Emirates",
      "price": 200,
      "original_price": 200,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2zBIAS",
      "hero_image": "https://images.luxuryescapes.com/3xyvyd5o8hcpi79qie2i",
      "image_two": "https://images.luxuryescapes.com/j0li647gbtslfas3xjhp",
      "image_three": "https://images.luxuryescapes.com/p0tzuvyy7ivo5tc80gn",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Jumeirah Emirates Towers Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Sky-High Five-Star Dubai Escape near Burj Khalifa with Opulent Suites, 12 Restaurants & Bars and Outdoor Pool",
      "description": "Spoil yourself with five-star service and modern delights at Jumeirah Emirates Towers Dubai, located on the popular Sheikh Zayed Road, near the iconic Burj Khalifa. Explore the 12 onsite restaurants and bars at this luxury skyscraper - dig into international flavours at Mundo, sample Japanese street food at Gohan or savour a Middle Eastern afternoon tea at Daefi Lounge. Later, explore the hotel's private beach or retreat to Talise Spa - an oasis of calm amid Dubai's bustling streets.",
      "location_subheading": "United Arab Emirates",
      "price": 93,
      "original_price": 93,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Ey5rkAAB",
      "hero_image": "https://images.luxuryescapes.com/p6w0ie3jaf2xmhjl2oiv",
      "image_two": "https://images.luxuryescapes.com/u3z56yfmxiggppe7trhp",
      "image_three": "https://images.luxuryescapes.com/aty9ahn08juwpf4sws3k",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 14:59:00"
    },
    {
      "vendor_name": "voco Dubai The Palm",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Glamorous Dubai Escape on The Palm Jumeirah with Rooftop Pool & Bar",
      "description": "Glamorous luxury awaits at voco Dubai The Palm, an IHG Hotel, set on the trendy Palm West Beach on iconic Palm Jumeirah. Gaze upon Dubai's glitzy cityscape and the shimmering waters of the Persian Gulf from this stylish hotel, boasting a rooftop infinity pool, European favourites at Maison Mathis and refreshing rooftop cocktails at poolside Frenia. From the futuristic Palm Jumeirah, you're easily placed to explore the nearby Dubai Marina Walk and the pristine sands of Palm West Beach.",
      "location_subheading": "United Arab Emirates",
      "price": 92,
      "original_price": 92,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CP3uLAAT",
      "hero_image": "https://images.luxuryescapes.com/9enf9qly8m5d82zak3p",
      "image_two": "https://images.luxuryescapes.com/tip4obhlgd6z73b7j1x8",
      "image_three": "https://images.luxuryescapes.com/ijzpbyc5hwud2lstbxdt",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "25hours Hotel One Central",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Contemporary Dubai Luxury with Rooftop Pool & Cocktail Bar",
      "description": "Discover luxury with a touch of playfulness at the brand-new 25hours Hotel One Central in Dubai's thriving One Central precinct. The quirky interiors are decked out with intriguing antiques, local artwork and vinyl records. Discover three exceptional restaurants onsite to keep your tastebuds buzzing. Stop in at Nomad Day Bar for a cup of freshly brewed coffee, feast on mouthwatering North Indian food at Tandoor Tina and order German beers on tap alongside house-baked pretzels and other Bavarian treats at Ernst Biergarten. For a tipple at one of Dubai's most exciting cocktail spots, head to the sixth floor for a nightcap at Monkey Bar. When you're finished feasting, visit the spa and fitness centre for a pampering treatment, a steam in the sauna and a workout in the gym. The hotel is conveniently close to Dubai's famed sights, including the Museum of the Future, as well as the city's best restaurants and shopping.",
      "location_subheading": "United Arab Emirates",
      "price": 95,
      "original_price": 95,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000007oWDLAA2",
      "hero_image": "https://images.luxuryescapes.com/ktvqdaw6xrmnhbuysunh",
      "image_two": "https://images.luxuryescapes.com/szd4zlytudgpgdohsza",
      "image_three": "https://images.luxuryescapes.com/tbv3f6mc8daj65kfjbr4",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Avani+ Palm View Dubai Hotel & Suites",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Glamorous Dubai Waterfront Escape near Palm Jumeirah & Marina Walk",
      "description": "Gaze upon Dubai's cityscape at the glitzy Avani+ Palm View Dubai Hotel & Suites, boasting an outdoor infinity pool, bespoke restaurants and convenient city location. Positioned among Dubai's media city, the hotel is the ideal launchpad to explore the nearby attractions of the futuristic Palm Jumeirah island, palm-tree lined Dubai Marina Walk and pristine JBR beach. Savour a light breakfast before discovering this fascinating metropolis, all easily connected by public transport on your doorstep.",
      "location_subheading": "United Arab Emirates",
      "price": 65,
      "original_price": 65,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BTVLAA4",
      "hero_image": "https://images.luxuryescapes.com/936rjf4hs2488ea42hq",
      "image_two": "https://images.luxuryescapes.com/pqobyu3ayxifl0g531n",
      "image_three": "https://images.luxuryescapes.com/ryn2vlwefbtw6e8kq99b",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Sofitel Dubai The Palm Resort & Spa",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Sofitel Glamour on Palm Jumeirah with 10 Restaurants, Six Outdoor Pools, Private Beach & Spa",
      "description": "Experience the allure of Dubai with a touch of French elegance on the sun-soaked, world-famous Arabian Gulf. Boasting exquisite dining venues, bars and lounges, six glistening outdoor pools and the rejuvenating Sofitel SPA with L’Occitane, the Sofitel Dubai The Palm has it all. Nestled amongst lush greenery and an endless stretch of private beach, this resort provides a playground for watersports, romantic walks or basking in the Arabian sun. Nearby, you’ll find the glitzy boutiques of the Mall of Emirates, the awe-inspiring Burj Khalifa and evocative desert landscapes.",
      "location_subheading": "United Arab Emirates",
      "price": 144,
      "original_price": 144,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GTorTYAT",
      "hero_image": "https://images.luxuryescapes.com/d2thv96sbwm23h03nyq",
      "image_two": "https://images.luxuryescapes.com/8ut5sub6giq3c8lh0mnm",
      "image_three": "https://images.luxuryescapes.com/kdpnt3m5unc3mqw718c",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Grand Mercure Dubai City",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Stylish Dubai City Oasis near Airport with Onsite Restaurant & Spa",
      "description": "Experience Emirati culture up close and embrace the dynamic spirit of Dubai with a stay at this Mercure retreat, ideally positioned near the Dubai International Airport. This 5-star hotel boasts a sparkling rooftop pool with a glass bottom, as well as the opulent Arabian Spa with a hammam and steamed sauna for ultimate relaxation. Dive into a world of culinary flavours at one of hotel's three restaurants, from all-day dining at Walima to the casual Huzza by the mazzanine pool, enjoy Middle Eastern inspired culinary delights as you please. When it's time to explore, head to the nearby Dubai Creek for a Dhow cruise, visit the charming souks and wander along the historic Al Fahidi district while the attractions of downtown Dubai, including the Dubai Mall and the Burj Khalifa are a short drive away.",
      "location_subheading": "United Arab Emirates",
      "price": 44,
      "original_price": 44,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP87YAF",
      "hero_image": "https://images.luxuryescapes.com/4yzv3c36kgoy7mweud8",
      "image_two": "https://images.luxuryescapes.com/fnj7z33xa2c2picn9i2",
      "image_three": "https://images.luxuryescapes.com/ggic14avwokuwf8qg7k5",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Movenpick Jvt",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Sky-High Elegance in Jumeirah Triangle Village with Outdoor Pool & Wellness Spa",
      "description": "Nestled in the Jumeirah Village Triangle, this hotel offers all the luxury and comfort you've been looking for. Kick back in stylish rooms with sweeping views of Downtown Dubai, take a dip in the rooftop pool, or treat yourself at the world-class spa. Just a stone's throw from major attractions but tucked away from the hustle and bustle, this is your ideal home base in Dubai. From the mouthwatering restaurants serving up local and international cuisine to a state-of-the-art fitness centre that'll keep your routine on track, you're entering a world in which every detail is taken care of. With shopping malls and beaches within easy reach, you're positioned to make the most of your Dubai experience, whether you're here for business or pleasure.",
      "location_subheading": "United Arab Emirates",
      "price": 66,
      "original_price": 66,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP86YAF",
      "hero_image": "https://images.luxuryescapes.com/770rczpduzzsidhcfzwo",
      "image_two": "https://images.luxuryescapes.com/wn9531r9skmn7da5t6ek",
      "image_three": "https://images.luxuryescapes.com/5vi40jr515z7hvaxfhd",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Deira Creekside Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Sophisticated Dubai Stay Opposite Deira Mall with Outdoor Pool & Mamzar Beach Shuttle",
      "description": "Enjoy the cultural charm of the Deira district, home to the famous Gold Souk and Spice Souk, with a stay at this stylish hotel, just five minutes from the Dubai International Airport (DXB). Take advantage of your spot right opposite the hip and happening City Centre Deira Mall, or wander to the most beloved mall of the city, Dubai Mall, for a spot of retail therapy, before returning to your contemporary and calming room. For days out and about, explore the mesmerising Dubai Creek or the historic Al Fahidi neighbourhood, both just a short drive away, or take advantage of the complimentary hotel shuttle to Mamzar Beach. Back at the hotel, dip your toes into the temperature-controlled outdoor pool; work up a sweat at the state-of-the-art fitness centre or indulge in an array of Arab and Italian flavours at Tala Restaurant.",
      "location_subheading": "United Arab Emirates",
      "price": 38,
      "original_price": 38,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2zHIAS",
      "hero_image": "https://images.luxuryescapes.com/ob11rger7lxijwpfo1xu",
      "image_two": "https://images.luxuryescapes.com/8sgkfj816o6bkajr6y93",
      "image_three": "https://images.luxuryescapes.com/6apkq1jor6kotnja1rr",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "voco Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Stylish Dubai World Trade Centre Escape",
      "description": "Discover dazzling Dubai from voco Dubai, an IHG Hotel - a stylish city retreat adjacent to the World Trade Centre. Between explorations, recharge your batteries with a dip in the swimming pool, sip cocktails while admiring the glittering cityscape from a great height, or feast on international cuisine at one of the mouthwatering onsite restaurants. Beyond your hotel, find yourself in the heart of the financial district or venture to the nearby Palm Jumeirah Island or glistening Dubai Mall.",
      "location_subheading": "United Arab Emirates",
      "price": 75,
      "original_price": 75,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CP3z7AAD",
      "hero_image": "https://images.luxuryescapes.com/lc1hjb54v915b3beaxzw",
      "image_two": "https://images.luxuryescapes.com/syla6ea0jxz6rz04hhgv",
      "image_three": "https://images.luxuryescapes.com/wonu9sshw3mcm849aldd",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "NH Collection Dubai The Palm",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Palm Jumeirah Glamour with Rooftop Infinity Pool",
      "description": "Retreat to a world of luxury at NH Collection Dubai The Palm, set on the iconic Palm Jumeirah. Experience signature Dubai opulence at this elegant hotel boasting glittering cityscape and shimmering ocean views, a sun-soaked rooftop infinity pool, a tranquil day spa and easy beach access. Gourmands are spoilt for choice with five onsite eateries, including Arabian flair at Maiora and award-winning mixology at SEEN bar.",
      "location_subheading": "United Arab Emirates",
      "price": 83,
      "original_price": 83,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DNcLEAA1",
      "hero_image": "https://images.luxuryescapes.com/ionko6ddqmv1kk97q6xw",
      "image_two": "https://images.luxuryescapes.com/9dj8iyn7jqu7llfz56qn",
      "image_three": "https://images.luxuryescapes.com/2o1v2ha8g3t61p8pwe7",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Kempinski Hotel Mall of the Emirates",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Kempinski Escape near Ski Dubai with Five Restaurants & Bars",
      "description": "Whether it’s spectacular day releaxing by the infinity pool, midnight desert sojourns, culinary gems or world-class shopping, a stay at the five-star Kempinski Hotel Mall of the Emirates offers the perfect opportunity to explore Dubai's countless treasures. An onsite spa and four diverse restaurants present guests with an idyllic blend of indulgence and convenience, though the hotel's major draw is it's direct connection to the award-winning Mall of the Emirates; the complex’s vast assembly of luxury shopping, dining and entertainment options are only a short stroll away. Escape the heat with a visit to Ski Dubai, a truly one-of-a-kind 22,500-square-metre winter oasis in the scorching heart of the Middle East, offering five individual slopes and a plethora of snow activities that are fun for the whole family.",
      "location_subheading": "United Arab Emirates",
      "price": 277,
      "original_price": 277,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003IAHmAAO",
      "hero_image": "https://images.luxuryescapes.com/2dr6hji72vjr6kyllkp",
      "image_two": "https://images.luxuryescapes.com/hcpfak3jx90pzg6bag",
      "image_three": "https://images.luxuryescapes.com/liome6c0cc4zcq9sw6sj",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Fairmont Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Central Dubai City Opulence with 12 Restaurants & Bars, Rooftop Pool & Decadent Spa",
      "description": "Stay within a striking architectural Dubai marvel inspired by traditional wind towers. Situated in the pulsating heart of the city, the hotel is a stone's throw from the world's largest shopping centre, The Dubai Mall, and the towering Burj Khalifa. Dine and sip tantalising drinks across 12 stylish restaurants and bars, enjoy sumptuous treatments in the marble-clad spa inspired by ancient Rome and look out onto the sprawling Dubai cityscape from the rooftop pool.",
      "location_subheading": "United Arab Emirates",
      "price": 90,
      "original_price": 90,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2z7IAC",
      "hero_image": "https://images.luxuryescapes.com/54q8nzmqdblumiin3rs",
      "image_two": "https://images.luxuryescapes.com/z8g9i1vf1snh9vb46o",
      "image_three": "https://images.luxuryescapes.com/kg81ph1jwk8t00mx1tbs",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Jumeirah Beach Hotel Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Fun-Filled Beachfront Escape with Rooftop Garden Bar & Nine Restaurants & Bars",
      "description": "Instantly recognisable by its distinctive ocean wave design, Jumeirah Beach Hotel Dubai sits along Dubai's glittering shores. The perfect family escape or romantic hideaway, the hotel has something for everyone, from the tranquil Talise Spa and its heavenly treatments to four shimmering pools and a private stretch of golden sand. When hunger hits, there are nine onsite restaurants and bars, including a candlelit rooftop garden bar with views over the city.",
      "location_subheading": "United Arab Emirates",
      "price": 184,
      "original_price": 184,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000C2GvzAAF",
      "hero_image": "https://images.luxuryescapes.com/wymqe9ur6gdt9wkr42p",
      "image_two": "https://images.luxuryescapes.com/w4z6wgpg66dgxw63xpz8u",
      "image_three": "https://images.luxuryescapes.com/uoxs0ftxof4a41w6vfb",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Movenpick Hotel Bur Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Mövenpick Bur Dubai Escape near Dubai Frame with Seven Restaurants & Rooftop Pool",
      "description": "Feel the pulse of Dubai's cosmopolitan culture with a sophisticated stay at this Mövenpick sanctuary, ideally located in Bur Dubai, moments from the historic Dubai Creek. Kick back and relax in the well-appointed rooms and self-contained apartments, lounge by the sparkling rooftop pool and indulge in the signature Mövenpick chocolate hour. If you're feeling peckish, there is plenty on offer, with everything from North Indian delicacies to flavour-packed Lebanese cuisine available across seven restaurants and bars. Venture out to visit the iconic Burj Khalifa, the glitzy Dubai Mall and cross the Dubai Creek to explore the vibrant gold and spice souks. Back at your abode after a long day, catch a game or enjoy a friendly round of darts at the onsite sports pub.",
      "location_subheading": "United Arab Emirates",
      "price": 43,
      "original_price": 43,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP8FYAV",
      "hero_image": "https://images.luxuryescapes.com/mgn7sea0p0avb6fypg4",
      "image_two": "https://images.luxuryescapes.com/tz1y2gyrx6m148cryvfh",
      "image_three": "https://images.luxuryescapes.com/4mrc28b9xm874irwbr",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Dubai Jumeirah",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Stylish Dubai Jumeirah Escape with Glittering Pool & Cocktail Bar",
      "description": "Middle Eastern-inspired luxury awaits at Crowne Plaza Dubai Jumeirah, an IHG Hotel, set in the buzzing district of Jumeriah 1. Indulge in delicious cuisine at the hotel’s Ginger restaurant, savour British pub fare at The Docks, lounge by the glittering pool with a cocktail in hand or recharge at the onsite spa boasting a Moroccan bath and sauna. Leave it all behind and venture out to explore the pristine sands of Jumeriah Beach or indulge your inner shopaholic at one of the many malls nearby.",
      "location_subheading": "United Arab Emirates",
      "price": 50,
      "original_price": 50,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CPuh1AAD",
      "hero_image": "https://images.luxuryescapes.com/klkit9s89bxufhsci11",
      "image_two": "https://images.luxuryescapes.com/2586sqbu5jnjzhnlid",
      "image_three": "https://images.luxuryescapes.com/zg3w0yseheebr0m3v1fol",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Queen Elizabeth 2 Hotel",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Legendary Queen Elizabeth Ocean Liner Hotel near Dubai Frame with Three Dining Venues & Indoor Pool",
      "description": "The Queen Elizabeth 2 is a beacon of maritime history, once renowned for lavish transatlantic crossings, it has now become synonymous with luxury ocean travel. All rooms and suites retain much of their original mid-century decor, including wood panelling and plush furnishings, as well as brass portholes, art deco accents and vintage nautical artwork. Delight in an enticing afternoon tea at the Queens Grill, or catch all the action at the Golden Lion, Dubai's oldest pub. As you explore the ship, you'll uncover the original theatre that continues to offer world-class performances, a fully-equipped fitness centre, a nine-metre indoor pool and a museum revealing the vessel's captivating legacy.",
      "location_subheading": "United Arab Emirates",
      "price": 48,
      "original_price": 48,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2zJIAS",
      "hero_image": "https://images.luxuryescapes.com/3tkkmas21kw4fyvvcnbn",
      "image_two": "https://images.luxuryescapes.com/2aj91dybg43ikeh0uwb",
      "image_three": "https://images.luxuryescapes.com/47pvvexo7s7yb8c81qqg",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Holiday Inn Dubai Festival City",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Festival City Stay with Sky-High Views",
      "description": "Directly connected to Dubai Festival City mall, Holiday Inn & Suites Dubai Festival City, an IHG Hotel is the ideal location for rest and relaxation after a day of retail therapy. Shop till you drop as you browse hundreds of boutiques, shops and restaurants before returning for a soothing treatment at the spa and a refreshing dip in the pool. Once you've built up an appetite, feast on flame-grilled meat as you gaze out over the Dubai skyline from the terrace of Joe's Backyard on the 19th floor.",
      "location_subheading": "United Arab Emirates",
      "price": 43,
      "original_price": 43,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DI5r6AAD",
      "hero_image": "https://images.luxuryescapes.com/tznju3lx9q2i9jwk0hlq",
      "image_two": "https://images.luxuryescapes.com/hrh9rpn3ybohsai5mb5k",
      "image_three": "https://images.luxuryescapes.com/us9rscqft43zzsf9m9pn",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indigo Dubai Downtown",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Dynamic City Centre Hotel Minutes from Burj Khalifa",
      "description": "Boasting dazzling views and a dynamic location, the Hotel Indigo Dubai Downtown, an IHG Hotel, delivers you to the heart of this cosmopolitan city. Savour a medley of Mediterranean cuisine at Open Sesame social eatery or indulge in a cocktail by the pool at the Orange Feels Bar and Shisha Lounge. Splurge with a shopping spree at the nearby Dubai Mall, or invigorate body and mind at the onsite fitness centre. Retire to a stylish suite to enjoy city views in a bespoke and art-filled space.",
      "location_subheading": "United Arab Emirates",
      "price": 62,
      "original_price": 62,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CugD7AAJ",
      "hero_image": "https://images.luxuryescapes.com/ug6cnrazkqfwf4jjs2s",
      "image_two": "https://images.luxuryescapes.com/3mg1e79llq3b1hbh16tl",
      "image_three": "https://images.luxuryescapes.com/kmaknrqlymqkvi7pht5y",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Dubai Jlt",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Jumeirah Lakes Towers Opulence with Rooftop Pool & Spa",
      "description": "Be perfectly poised for urban exploration at this modern escape in the heart of the city's bustling Jumeirah Lakes Towers district. Take relaxation up a notch in the hotel's serene spa, plunge into the refreshing rooftop pool or savour global flavours and refreshing sips at one of five onsite restaurants and bars. Paired with sprawling city vistas, everything you need is within grasp. Venture out to explore the nearby Dubai Marina, teeming with world-class dining and shopping options, or take a short drive to the iconic Jumeirah Beach. The hotel's prime location also places you within easy reach of the city's major business hubs and the Dubai Expo 2020 site.",
      "location_subheading": "United Arab Emirates",
      "price": 51,
      "original_price": 51,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP6iYAF",
      "hero_image": "https://images.luxuryescapes.com/2wzkbqv2xnc4t1vpcwc",
      "image_two": "https://images.luxuryescapes.com/7jub4e842fgc1cosu4e4",
      "image_three": "https://images.luxuryescapes.com/wjjwtt882hbfjpv1k1f",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Atlantis, The Palm Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Atlantis Dubai Luxury on Palm Island with World's Largest Waterpark & The Lost Chambers Aquarium",
      "description": "Discover the glitz and glamour of Dubai on a grand scale when you indulge in a stay at the five-star Atlantis, The Palm, a jewel in the crown of Palm Island. Jaw-dropping in size and beauty, this hotel has it all. There are 32 exquisite dining venues, bars and lounges - including Nobu Dubai and Gordon Ramsay's Bread Street Kitchen & Bar. Plus, you can make your way through the Raging Rapids and relax on 1km of private beach at the world's largest waterpark, Aquaventure Waterpark, with 105 slides and attractions, including the 'Leap of Faith'. Be mesmerised with 65,000 marine animals at The Lost Chambers Aquarium and discover luxurious treatments at Awaken Spa (and that’s just the beginning). Nestled between the calm turquoise waters of the Arabian Gulf and the majestic Dubai skyline, this Dubai icon allows you to experience a world away from the everyday, yet within easy reach of Palm Island's splendours. Think high-end hotels, fine-dining restaurants, trendy nightclubs, world-class shopping and watersports in Dubai Marina.",
      "location_subheading": "United Arab Emirates",
      "price": 327,
      "original_price": 327,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GfekAAC",
      "hero_image": "https://images.luxuryescapes.com/q9ts6b0nyp6d1wrkq9",
      "image_two": "https://images.luxuryescapes.com/9iq0gjzp45l3vh4d55ne",
      "image_three": "https://images.luxuryescapes.com/7yxrgpnvxhtahlmfdlcf",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 01:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Dubai Marina",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Stylish Dubai City Break on Marina Promenade",
      "description": "Overlooking scintillating views of yachts and calm waters, Crowne Plaza Dubai Marina, an IHG Hotel, is a tranquil refuge in the midst of the delightful Dubai Marina district. Invigorate your body and mind at the fitness centre, take a plunge into the refreshing pool or indulge in boutique shopping. Stroll along the marina promenade or take a ride on a scenic water taxi before returning to the sophisticated comfort of a stylish room or suite for enhanced rest and relaxation.",
      "location_subheading": "United Arab Emirates",
      "price": 83,
      "original_price": 83,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CPuiOAAT",
      "hero_image": "https://images.luxuryescapes.com/sj6p3pbr2nnkk9pa0r",
      "image_two": "https://images.luxuryescapes.com/96wlg94dskhv9fbccx2",
      "image_three": "https://images.luxuryescapes.com/o17xk8m78kz2lmb9xcyh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Jumeirah Residences Marsa Al Arab",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Glamourous Dubai Escape with Outdoor Pool & Private Beach Access",
      "description": "Nestled along the dazzling shores of the Arabian Gulf, experience the pinnacle of luxury at this sophisticated escape. With expansive wraparound terraces, each residence provides enviable views of the Burj Al Arab, sparkling marina or city skyline, complete with luxurious furnishings and amenities. When it's time to indulge, head to the lavish Commodore Club for European and international delicacies. Beyond the resort, the beachfront and vibrant Dubai Marina are just moments away, placing world-class dining, shopping and entertainment at your doorstep. With unmatched privacy and luxury, Dubai’s most coveted locations are at your fingertips.",
      "location_subheading": "United Arab Emirates",
      "price": 312,
      "original_price": 312,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CDKziYAH",
      "hero_image": "https://images.luxuryescapes.com/6568daa085bmip1g1mjo3",
      "image_two": "https://images.luxuryescapes.com/9euo6n2ma8tq1nv50tz",
      "image_three": "https://images.luxuryescapes.com/2hx96z2g9paaqbtmd4o",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "SO/ Uptown Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Sky-High SO/ Uptown Dubai Opulence with Gourmet Dining & Cocktail Bars",
      "description": "Experience signature SO/ opulence at this sky-high stay, surrounded by breathtaking views of Dubai’s city skyline and the iconic Palm Jumeirah. Blending five-star whimsical luxury with a one-of-a-kind spirit, spend your days lazing at the beach club-inspired pool bar, Lazuli, or savour high tea and specialist negronis at the hotel’s den of mixology, Savant. For the ultimate indulgence, seek out the artiste-inspired Celeste, the hotel’s decadent caviar and champagne bar, or head to Uptown Spa by SO/. When it comes time to explore, you'll find Bluewaters Island and the Dubai Marina just minutes away, offering vibrant dining and entertainment options. Plus, for those looking for some retail therapy, the Mall of Emirates is a 20-minute drive away.",
      "location_subheading": "United Arab Emirates",
      "price": 89,
      "original_price": 89,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlwXIAS",
      "hero_image": "https://images.luxuryescapes.com/fl7fx57ybla1gjug5co9",
      "image_two": "https://images.luxuryescapes.com/c4dcl1qt63knrapu14a",
      "image_three": "https://images.luxuryescapes.com/5tdb5nab5e6zo7b304qf",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "voco Bonnington Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Opulent Five-Star Oasis within the Heart of Dubai",
      "description": "Discover the wonders of the United Arab Emirates with a stay at the sophisticated voco Bonnington Dubai, an IHG Hotel, peacefully nestled by the iconic Dubai Marina. In the heart of the cosmopolitan Jumeirah Lakes Towers, this hotel is an oasis from the bustling city and Dubai heat. Have incredible shopping experiences with trips to glistening modern malls or authentic souks. Then return to this chic hotel for a dip in the pool, and enjoy a meal and a drink at the onsite restaurants and bars.",
      "location_subheading": "United Arab Emirates",
      "price": 55,
      "original_price": 55,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CP3r7AAD",
      "hero_image": "https://images.luxuryescapes.com/heaiexbq62hd8kpc2seo",
      "image_two": "https://images.luxuryescapes.com/sniqfgcdfea0sknr7vi",
      "image_three": "https://images.luxuryescapes.com/cyloz69l8i20lult8bxl",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Bur Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Stylish Dubai Retreat near Airport & Iconic Dubai Frame with Rooftop Pool & Bar",
      "description": "Step into sleek sophistication at Novotel Bur Dubai, nestled in Healthcare City. Wake up to a bountiful buffet breakfast at the all-day Hang Out Cafe, enjoy poolside snacks with a view of Dubai’s skyline, and round off the day with a cocktail from the swanky Burgundy Lounge. Don't miss out on a massage at the onsite spa or a sweat sesh at the fitness centre. Ideal for both comfort and exploration, the hotel places you moments from the peaceful Creek Park and within easy access to Downtown Dubai and popular spots like Dubai Mall, the Burj Khalifa and the charming Al Seef district.",
      "location_subheading": "United Arab Emirates",
      "price": 35,
      "original_price": 35,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP9tYAF",
      "hero_image": "https://images.luxuryescapes.com/ubfl0c2pbe1se5zumu",
      "image_two": "https://images.luxuryescapes.com/yydemzt0tjalik3jxt0d",
      "image_three": "https://images.luxuryescapes.com/2bjjohbe08pso82plu2m",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Jumeirah Marsa Al Arab",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Beachfront Opulence with 11 Restaurants & Four Pools",
      "description": "Set along the sparkling shores of the Arabian Gulf, this retreat boasts ultra-luxe rooms and suites with unparalleled views of Dubai's marina and city skyline. Luxuriate at Talise Spa, a transformative, all-encompassing journey to wellness. Savour world-class dining at any of the 11 restaurants and four vibrant bars, serving everything from exotic Asian flavors to Mediterranean classics. The connected world-class Marsa Al Arab Marina promenade invites you to celebrate global flavours in a lively waterfront dining scene. Embrace this buzzing, oppulent atmosphere with six restaurants to choose from. Whilst you explore Dubai's most coveted location, enjoy exclusive private beach access and endless, top-tier shopping and dining.",
      "location_subheading": "United Arab Emirates",
      "price": 420,
      "original_price": 420,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CDFSBYA5",
      "hero_image": "https://images.luxuryescapes.com/cr4n2fkw4jojlt3iudki",
      "image_two": "https://images.luxuryescapes.com/cvv297x1nwi1v1ahsdq",
      "image_three": "https://images.luxuryescapes.com/vtzd8r3ioinwv7dgl7",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Burj Al Arab Jumeirah",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Award-Winning Dubai Five-Star Burj Al Arab Jumeirah Escape",
      "description": "Burj Al Arab Jumeirah needs little introduction: concealed in the wrapper of the world-famous sail-shaped building is the beacon of modern Dubai, an iconic hotel where sheer luxury and outstanding service blend effortlessly. Regularly acclaimed as the world’s most luxurious hotel, this incredible property features the world's largest fleet of Rolls Royces, one of the highest staff-to-suite ratios in the world, a rooftop helipad, a breathtaking terrace with pools and air-conditioned cabanas and a Michelin-starred restaurant.",
      "location_subheading": "United Arab Emirates",
      "price": 1086,
      "original_price": 1086,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000C2GfDAAV",
      "hero_image": "https://images.luxuryescapes.com/wonwf53cc9fv12rmhyeq",
      "image_two": "https://images.luxuryescapes.com/4wtbp0ypuqemr6ccltpd",
      "image_three": "https://images.luxuryescapes.com/sjjmqmmijkrtqx442o",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Palazzo Versace Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Dubai Palazzo Versace Glamour in Jaddaf Waterfront",
      "description": "Extraordinary architecture, magical old-world charm, world-renowned dining experiences, extravagant shopping malls, and golden deserts are just a few of the endless reasons to visit Dubai - and you are invited to unearth everything this breathtaking city has to offer with a luxurious stay at the Palazzo Versace Dubai. Impeccably located along the shores of the historic Dubai Creek - just a short distance from Burj Khalifa and Downtown Dubai - this palatial hotel is equally as glamorous as its dazzling surroundings. Steeped in classic Italian design inspired by a 16th-century palace with subtle traces of modern Arabian architecture, every inch of this Neo-classical masterpiece embodies the Versace lifestyle. The chandelier-studded, five-star hotel has three tranquil outdoor pools, nine restaurants and bars, and an award-winning spa with seven treatment rooms and two Moroccan Hammams. With views of the Dubai Creek and skyline, this truly is luxury at its finest.",
      "location_subheading": "United Arab Emirates",
      "price": 215,
      "original_price": 215,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GNJVAA4",
      "hero_image": "https://images.luxuryescapes.com/xpei2lnk9ll1kxh6pa3c",
      "image_two": "https://images.luxuryescapes.com/r6lp06qs05xdj7d2m6b",
      "image_three": "https://images.luxuryescapes.com/atmp2as6pmdgch7vtww",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Dubai - Festival City",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Waterfront Escape Adjacent to Dubai Festival City Mall",
      "description": "Fun is at an all-time high in Dubai Festival City, a vibrant entertainment precinct home to the massive, world-famous shopping mall and the stylish Crowne Plaza Dubai - Festival City, an IHG Hotel. The hotel rests along Dubai's pristine waterfront and poses as the perfect respite after a day's excursion: take a refreshing dip in the swimming pool, order cocktails at Skyline Bar to sip at sunset, enjoy a steam in the sauna, or delight your tastebuds with an Arabian-style dinner under the stars at Zaytoun.",
      "location_subheading": "United Arab Emirates",
      "price": 62,
      "original_price": 62,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CQ3hzAAD",
      "hero_image": "https://images.luxuryescapes.com/2mrv9xbjkgu8cdiqyqn",
      "image_two": "https://images.luxuryescapes.com/iengr2hhxl8nulraiofo",
      "image_three": "https://images.luxuryescapes.com/3raaaq1s4i5s0tecvb4t",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Sofitel Dubai Jumeirah Beach",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Arabian Glamour in the Heart of Jumeirah Beach Residence with Award-Winning Dining & Infinity Pool",
      "description": "Nestled in the heart of Jumeirah Beach Residence, this hotel blends French luxury with Dubai’s opulence and vibrant energy. Offering direct beach access, this urban sanctuary places you just a short stroll from The Walk, a bustling waterfront promenade lined with contemporary boutiques and al fresco dining venues. The hotel boasts a selection of gourmet dining options, including a chic French brasserie and a rooftop lounge offering panoramic views of the Arabian Gulf. Enjoy a refreshing dip in the infinity pool or maintain your fitness regime at the state-of-the-art gym. With the Dubai Marina and Ain Dubai Ferris Wheel just moments away, this hotel is your gateway to the best of the city.",
      "location_subheading": "United Arab Emirates",
      "price": 113,
      "original_price": 113,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GULVeYAP",
      "hero_image": "https://images.luxuryescapes.com/e9ol8e06p4p1vojjr1hd",
      "image_two": "https://images.luxuryescapes.com/pghn6jlux4uti2wa8e",
      "image_three": "https://images.luxuryescapes.com/eyh5biqdobdr6qt32no",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Raffles The Palm Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Palatial Raffles Dubai Palm Jumeirah Luxury with Six Restaurants, Two Pools & Day Spa",
      "description": "Timeless elegance and world-renowned luxury converge at this grandiose Raffles oasis, perched on the sparkling shores of Palm Jumeirah. Boasting unrivalled Arabian Gulf views, a private beach with 500 metres of alabaster sand, imported from the Maldives, an exterior of Portuguese marble and a grand atrium adorned with a 24-carat gold leaf ceiling, Raffles The Palm Dubai oozes extravagance. This resplendent hotel was made for those who enjoy the finer things in life, with six exquisite dining venues, including the Amalfi Coast-inspired Piatti by the Beach. Lounge adjacent to glistening waters in a cabana set on sugar-fine sand, visit heavenly Cinq Mondes Spa or bask in the sun by the mirage-like pool fringed by palm trees.",
      "location_subheading": "United Arab Emirates",
      "price": 193,
      "original_price": 193,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP8NYAV",
      "hero_image": "https://images.luxuryescapes.com/i7ysrsamjcib1c7ghdoo",
      "image_two": "https://images.luxuryescapes.com/romt7rmrki0gmv0eapgw",
      "image_three": "https://images.luxuryescapes.com/a91mmjgpvjgnxaowpmz",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Jumeirah Al Naseem Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Beachfront Jumeirah Dubai Escape with Nine Restaurants & Five Pools",
      "description": "Experience signature Jumeirah luxury and access to the pristine sands of Dubai’s longest private beach with a lavish escape at Jumeirah Al Naseem Dubai. This contemporary beachfront Arabian-inspired oasis will make you feel like royalty as you are treated to unparalleled views over the iconic Burj Al Arab. Let your expectations be met and then surpassed as you luxuriate in the five sparkling pools, dine at one of the nine restaurants and make the most of all Madinat Jumeirah complex facilities.",
      "location_subheading": "United Arab Emirates",
      "price": 323,
      "original_price": 323,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000C2GvGAAV",
      "hero_image": "https://images.luxuryescapes.com/sy8mfgcq53llaqq6vu5",
      "image_two": "https://images.luxuryescapes.com/e1u4yh7bk9anyu44t4j",
      "image_three": "https://images.luxuryescapes.com/yq5peuozdje6pco7cc62",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:00:00"
    },
    {
      "vendor_name": "Sofitel Dubai Downtown",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Downtown Dubai Urban Glamour near Burj Khalifa with Rooftop Infinity Pool & Luxe Spa",
      "description": "Experience the romance, gourmet cuisine, and Parisian flair of Sofitel while staying in the heart of downtown Dubai. Blending Middle Eastern luxury with a French twist, the hotel is steps from the city's world-class shopping, dining and vibrant nightlife. After a day of exploration, indulge in a cocktail by the rooftop infinity pool and soak up the glittering city vistas. Find your zen at the award-winning Sofitel Spa, and savour global flavours at various onsite restaurants and bars, serving up Mediterranean, Modern Asian and more. The hotel offers unrivalled access to the Burj Khalifa and The Dubai Mall - the world’s largest shopping destination. Plus, the nearby Dubai Metro puts the city’s legendary attractions at your fingertips.",
      "location_subheading": "United Arab Emirates",
      "price": 144,
      "original_price": 144,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GUParYAH",
      "hero_image": "https://images.luxuryescapes.com/44kz4lx68atcixjgds5g",
      "image_two": "https://images.luxuryescapes.com/kvwnsxnrva0fh24ddgrd",
      "image_three": "https://images.luxuryescapes.com/njdgvvdkukh7chdmeed",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Movenpick Downtown Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Downtown Dubai Elegance near Burj Khalifa with Rooftop Pool & Lounge",
      "description": "Experience Downtown Dubai your way with a stay at this elegant Mövenpick oasis, just a stone's throw from the world's tallest building. Head straight to the sparkling rooftop pool for laps in the sun, savour all-day delicacies at Bien or indulge in cocktails and small bites at the swanky Oasis Pool Lounge. When you wish to explore, you'll find everything right at your doorstep. See the city from above with a visit to the Burj Khalifa, shop for souvenirs at the bustling souks of Old Dubai and soak up the sun on Jumeirah Beach.",
      "location_subheading": "United Arab Emirates",
      "price": 99,
      "original_price": 99,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP8HYAV",
      "hero_image": "https://images.luxuryescapes.com/7194ddl1zqlhmz9nbgr",
      "image_two": "https://images.luxuryescapes.com/vgl4s3to3k4x62f0mqgh",
      "image_three": "https://images.luxuryescapes.com/pp0uoy6wtr0ra997i5",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hyde Hotel Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Stylish Dubai Haven near Lively Business Bay with Burj Khalifa Views, Rooftop Pool & Two Dining Experiences",
      "description": "Soak up downtown Dubai's irresistible glitz and glam from this ultra-chic oasis cradled in the heart of the bustling Business Bay district. Perched along the picturesque Dubai Canal, this glamorous hotel is greeted by iconic Burj Khalifa views and is the perfect base for all your urban explorations. You can marvel at the towering Burj while you take a refreshing dip in the outdoor pool and rejuvenate with restorative treatments at the spa. For culinary enthusiasts, there is plenty to snack on: savour traditional Japanese delicacies prepared with a twist at the famous Katsuya or tuck into sucluent Mediterranean food at Cleo.",
      "location_subheading": "United Arab Emirates",
      "price": 91,
      "original_price": 91,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP8OYAV",
      "hero_image": "https://images.luxuryescapes.com/aswbshneu9rpti9bq8h",
      "image_two": "https://images.luxuryescapes.com/50gyw4yjdstplqv6qlcy",
      "image_three": "https://images.luxuryescapes.com/tzwm9lu7gs3gicxof2jg",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Sofitel Dubai The Obelisk",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Ultimate Sky-High Opulence with Onsite Dining, Pool & Spa",
      "description": "Standing tall against Dubai's dazzling city skyline, this five-star haven is ready to welcome you to a world of unrivalled luxury. French sophistication meets ancient Egyptian pharaonic flair in the largest Sofitel in the Middle East, a refined retreat ideally positioned for easy access to Dubai's best experiences - including countless souqs, Dubai Creek and the city's best shopping districts. Dine at one of the onsite venues, unwind by a luxurious Egyptian ankh-shaped pool, or pamper yourself with a Provence-inspired treatment at the Sofitel Spa with L'Occitane. Ready to explore? Should you be tempted to leave your luxurious slice of paradise, the nearby station will whisk you to Dubai's major attractions in mere minutes.",
      "location_subheading": "United Arab Emirates",
      "price": 90,
      "original_price": 90,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000Jjw0iYAB",
      "hero_image": "https://images.luxuryescapes.com/iygghvul7na3adk5l8c",
      "image_two": "https://images.luxuryescapes.com/y9nn363ydkhr3i6vcv9",
      "image_three": "https://images.luxuryescapes.com/t5a9v76yiw6z5fg427",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Dubai Deira",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Stylish Dubai City Oasis near Gold Souk with Three Restaurants, Rooftop Infinity Pool & Lounge",
      "description": "Experience Emirati culture up close and embrace the dynamic spirit of Dubai with a stay at this Mercure retreat, ideally positioned near the bustling Gold and Spice souks of Deira. Discover the perfect blend of tasteful luxury and local charms as you spend your days soaking up the stunning Dubai skyline views in between swimming laps at the rooftop infinity pool or sipping on expertly crafted drinks from the Atmos Rooftop Lounge. Dive into a world of culinary flavours across the hotel's three restaurants serving Pan-Asian, Middle-Eastern and farm-to-table delicacies. When it's time to explore, head to the nearby Dubai Creek for a Dhow cruise, visit the charming souks and wander along the historic Al Fahidi district while the attractions of downtown Dubai, including the Dubai Mall and the Burj Khalifa are a short drive away.",
      "location_subheading": "United Arab Emirates",
      "price": 40,
      "original_price": 40,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP89YAF",
      "hero_image": "https://images.luxuryescapes.com/5baozzt39vwtkazx5eyq",
      "image_two": "https://images.luxuryescapes.com/mq68kpg51yi5292eugos",
      "image_three": "https://images.luxuryescapes.com/fh59pi6ekqok5tzfqop",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Movenpick Hotel Jumeirah Beach",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Chic Dubai Escape on Jumeirah Beach with Outdoor Pool & Wellness Centre",
      "description": "Find yourself in the heart of Dubai's most chic and vibrant seaside district with a stay at this Movenpick sanctuary, ideally located within the Jumeirah Beach Residences. Blending comfort with style, the hotel boasts six drinks and dining venues, a sprawling resort pool and a wellness centre - all while placing you mere steps from the cobalt waters of the Arabian Gulf. Relax with holistic treatments at the spa, savour New York-inspired cuisine at Soul, tuck into a fantastic buffet feast at The Talk or try shisha at the poolside lounge while enjoying the Dubai dusk. Be sure not to miss the signature Chocolate Hour - perfect for your sweet tooth. When you wish to explore, visit the stunning Walk at JBR and admire Palm Jumeirah's beauty.",
      "location_subheading": "United Arab Emirates",
      "price": 79,
      "original_price": 79,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP8EYAV",
      "hero_image": "https://images.luxuryescapes.com/fkb6lmzm3oz9s48bzrhd",
      "image_two": "https://images.luxuryescapes.com/kh3z0badnlh909myqd0l",
      "image_three": "https://images.luxuryescapes.com/bx9e4rh6y7fo6ew0spn",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Intercontinental Dubai Marina",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Spectacular Dubai Waterfront Escape near Jumeirah Beach",
      "description": "A destination in itself, the five-star InterContinental Dubai Marina, an IHG Hotel, boasts exceptional waterfront views along with an award-winning restaurant and bespoke art pieces around the lobby, turning it into an open-space gallery. Sample delicious European cuisine at the hotel’s Marina Social restaurant, lounge in the triangular rooftop pool overlooking the city, visit Dubai Marina Mall or venture out to explore everything the luxurious city has to offer with easy access to the Dubai Tram.",
      "location_subheading": "United Arab Emirates",
      "price": 109,
      "original_price": 109,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt5RAAR",
      "hero_image": "https://images.luxuryescapes.com/bk11fbt9fad6gcgfp96e",
      "image_two": "https://images.luxuryescapes.com/hm2vzfpbkkzicf143nja",
      "image_three": "https://images.luxuryescapes.com/f613osznt8bj8k9mtpoc",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Delano Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Dubai Beachfront Opulence on Bluewaters Island with Sparkling Pool & Four Restaurants & Bars",
      "description": "Step into a world of flamboyance and grandeur at this world-class Delano address, perfectly positioned on the alluring Bluewaters Island, overlooking the shimmering waters of the Arabian Gulf. This five-star sanctuary redefines the resort experience, boasting a vast array of amenities, including a sparkling pool fringed by cabanas, a poolside bar and a tranquil spa for all your pampering needs. Spend your days soaking up the sun or splashing in the waves along the resort's private coastline. When hunger strikes, surprise your palate with myriad flavours across Delano Dubai's seven restaurants and bars, including the Amalfi Coast-inspired Tutto Passa, the sporty La Cantine Beach and the chic Rose Bar. If you wish to explore, you'll be within a short drive of the Marina Mall, Jumeirah Beach and the Walk at JBR.",
      "location_subheading": "United Arab Emirates",
      "price": 295,
      "original_price": 295,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnJdkYAF",
      "hero_image": "https://images.luxuryescapes.com/hvdonirwq3qnsp33fyp",
      "image_two": "https://images.luxuryescapes.com/pxhc5qq5mmilq6013uc",
      "image_three": "https://images.luxuryescapes.com/hc8l0b1fpk4rxqyxsnl",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Fairmont The Palm",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Fairmont Palm Jumeirah Dubai Opulence with Private Beach, Indulgent Day Spa & 11 Restaurants & Bars",
      "description": "Discover unparalleled elegance at this Dubai escape, perfectly positioned on prestigious Palm Jumeirah overlooking the Arabian Sea. Boasting eleven world-class restaurants and bars, eight sparkling swimming pools and a private beach, experience five-star Fairmont service paired with signature Dubai glamour. From Little Miss India to Frevo Brazillian, be transported to another world when you dine.. Find tranquillity at Serenity Spa, featuring both a thermal oasis and ice fountain. Beyond the hotel, explore vibrant Dubai Marina, visit the nearby Mall of the Emirates or marvel at the stunning views from the Dubai Frame.",
      "location_subheading": "United Arab Emirates",
      "price": 158,
      "original_price": 158,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvdIAC",
      "hero_image": "https://images.luxuryescapes.com/8x0iuq7wgsl1xqvsxzrh",
      "image_two": "https://images.luxuryescapes.com/mkvjlsuktp9u8q5uino",
      "image_three": "https://images.luxuryescapes.com/zofx781q0olvxqjrggl",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "One&Only Za'beel",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Ultimate Dubai Vertical Resort with 10 Restaurants & Bars & UAE's Longest Rooftop Infinity Pool",
      "description": "Nestled in the heart of everything - cuisine, culture, entertainment - discover a new-age world of glamour at Dubai’s iconic vertical resort, One&Only One Za'abeel. This desert jewel redefines luxury, with the UAE’s longest rooftop infinity pool, complete with sunken seating, cabanas and unparalleled views of the city. But that's not all - a revolutionary three-storey wellness centre and a breathtaking constellation of immaculate dining experiences across ten onsite restaurants and bars make for an unforgettable escape.",
      "location_subheading": "United Arab Emirates",
      "price": 296,
      "original_price": 296,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000FcWQ0AAN",
      "hero_image": "https://images.luxuryescapes.com/frmgwhf1vlgj1786jd7",
      "image_two": "https://images.luxuryescapes.com/xjkmza4h3h5dw5reas8k",
      "image_three": "https://images.luxuryescapes.com/wztvctecou3h5vfbdbr",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 14:59:00"
    },
    {
      "vendor_name": "Kempinski The Boulevard Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Kempinski Downtown Dubai Luxury with Direct Access to Dubai Mall",
      "description": "Experience Dubai's enigmatic opulence at Kempinski The Boulevard Dubai, a five-star sanctuary in the heart of the city's vibrant Downtown district. The hotel offers breathtaking skyline views and direct access to the huge Dubai Mall. Dine alfresco at the La Brasserie Sur Le Boulevard, and pamper yourself at the luxury spa's traditional hammam or relax by one of the tranquil pools. If you wish to explore, the best of Dubai, including the iconic Burj Khalifa, are just moments away.",
      "location_subheading": "United Arab Emirates",
      "price": 222,
      "original_price": 222,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Gx5t3AAB",
      "hero_image": "https://images.luxuryescapes.com/vhdbc5vo3wdg6y76jqo",
      "image_two": "https://images.luxuryescapes.com/egb4ads9jcxfcjw4hpql",
      "image_three": "https://images.luxuryescapes.com/mxy65c82bd3071hvx3b9",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Jumeirah Living World Trade Centre Residences",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Luxury Residences in the Dubai World Trade Centre",
      "description": "Experience elevated home-away-from-home comforts at Jumeirah Living World Trade Centre Residences - a beacon of sophistication nestled in the heart of Dubai's business district. This prestigious property offers access to the city's iconic landmarks, including the Dubai Mall and the awe-inspiring Burj Khalifa. Savour the flavours of the world at a plethora of nearby dining venues, or indulge in retail therapy at the high-end boutiques lining the nearby Sheikh Zayed Road.",
      "location_subheading": "United Arab Emirates",
      "price": 133,
      "original_price": 133,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000FO3XSAA1",
      "hero_image": "https://images.luxuryescapes.com/rkb56uvver9g7oeksuxk",
      "image_two": "https://images.luxuryescapes.com/ru5c2iq2ynfgntxz06aq",
      "image_three": "https://images.luxuryescapes.com/3sa28st7sg045r9vj5k",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel World Trade Centre Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Elegant Dubai Novotel Escape Close to Jumeirah Beach with Four Dining Options & Heated Pool",
      "description": "Step into a world where every moment is designed for comfort, convenience, and magical experiences, nestled in the heart of Dubai. Novotel World Trade Centre Dubai offers a refreshing oasis in the midst of the city's skyscrapers, with a tranquil outdoor pool and a rejuvenating spa, plus serene, light-filled rooms that offer stunning skyline views. Savour international cuisine at Entre-Nous Restaurant or indulge in a refreshing drink at Chills Pool Lounge. Enjoy live jazz at Blue Bar, or explore vibrant shopping districts with a complimentary shuttle. With direct access to Dubai World Trade Centre, a metro station at your doorstep, and the airport just 20 minutes away, your journey through Dubai begins in effortless elegance.",
      "location_subheading": "United Arab Emirates",
      "price": 34,
      "original_price": 34,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP6hYAF",
      "hero_image": "https://images.luxuryescapes.com/eofxlrn7szse6yexuwhr",
      "image_two": "https://images.luxuryescapes.com/n86by68ueo8q3rpwdazu",
      "image_three": "https://images.luxuryescapes.com/pcxyhvb3ri7jdk8f5oe",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Suites Mall Avenue Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Chic Dubai Novotel Suites near Mall of the Emirates with Pool & Onsite Restaurant",
      "description": "Feel the buzzing heart of dynamic Dubai from this all-suite Novotel sanctuary, perfectly positioned within the city's Al Barsha business and leisure district. Set mere steps from The Mall of the Emirates and the Dubai Metro, the hotel acts as the perfect base for all your Dubai explorations. Rest and rejuvenate in the hotel's sleek and stylish suites, indulge in a culinary journey at the Deli Boutique restaurant or spend your time lounging by the sparkling pool. When you wish to explore, the luxurious yacht-lined Dubai Marina and the vibrant downtown - with all its attractions, including the iconic Burj Khalifa - are a short drive away.",
      "location_subheading": "United Arab Emirates",
      "price": 33,
      "original_price": 33,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2zKIAS",
      "hero_image": "https://images.luxuryescapes.com/my8b474f2npbc3gp60i9",
      "image_two": "https://images.luxuryescapes.com/o040pj0d3r80mdujiw",
      "image_three": "https://images.luxuryescapes.com/5ej1fpxehe7hi3u51a2l",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Adagio Premium Dubai Al Barsha",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Sky-High Dubai Self-Contained Apartment Opulence near Palm Jumeirah with Rooftop Pool & Onsite Dining",
      "description": "Settle into stylish apartment living in the heart of Dubai's vibrant Al Barsha district, where comfort meets convenience just moments from the Mall of the Emirates and the Dubai Metro. Towering over 41 storeys, the property boasts modern apartments featuring fully equipped kitchens, spacious living and dining areas, laundry facilities and panoramic views of the Dubai skyline. Soak up the stunning Burj Al Arab views when you unwind at the sparkling rooftop pool, stay active in the fitness centre, or recharge in the sauna and steam room. When hunger strikes, head over to 365 Restaurant for delicious dishes while Café Java is apt for light bites or a hot cuppa. A short drive from the iconic Palm Jumeirah and the Dubai Mall, this chic home-away-from-home is the perfect base for exploring the city.",
      "location_subheading": "United Arab Emirates",
      "price": 66,
      "original_price": 66,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP81YAF",
      "hero_image": "https://images.luxuryescapes.com/032kyip123ckmmfhgl6j",
      "image_two": "https://images.luxuryescapes.com/k2fhxwv36lks9iw27kw2",
      "image_three": "https://images.luxuryescapes.com/jfix3a2dldo9lwgfug",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "SLS Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Sky-High Opulence with 360-Degree City Views, Rooftop Club & World's Highest Infinity Pool",
      "description": "Step into a new era of luxury in the heart of Dubai with a stay that blends striking architecture, elevated dining and indulgent comfort. Soaring high above the city, this five-star haven features breathtaking 360-degree views of the skyline, bay and creek, best enjoyed from one of the two sky-high infinity pools - including the world’s highest overflow pool, perched on Level 75. Unwind at the rooftop bar with a handcrafted cocktail and gourmet bites, or dive into an unforgettable culinary journey at the chic onsite restaurants, serving myriad cuisines. Beyond the hotel, Dubai’s vibrant spirit awaits. Wander through colourful souks, designer boutiques and acclaimed restaurants. Iconic landmarks including the Burj Khalifa and Dubai Mall are close by, while the charming gold souk is just a short drive away.",
      "location_subheading": "United Arab Emirates",
      "price": 153,
      "original_price": 153,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP8KYAV",
      "hero_image": "https://images.luxuryescapes.com/r3pwl5mdt741wbn170d",
      "image_two": "https://images.luxuryescapes.com/j55tkwfxdggwhwrc24m",
      "image_three": "https://images.luxuryescapes.com/s7nx2bsg7p3wi9puvc",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Dubai Deira",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Glamorous Five-Star Dubai Retreat within the Historic Deira District",
      "description": "Immerse yourself in the beauty of Dubai's historic neighbourhood when you stay at the five-star Crowne Plaza Dubai Deira, an IHG Hotel. Effortlessly combining Middle Eastern-inspired design elements with modern comforts makes for a stunning space you won't want to leave. Spend your days by the glittering pool, feasting at Spice Island or meeting your fitness goals onsite gym. Beyond the hotel, a short stroll will see you at Reef Shopping Mall or Dubai Creek",
      "location_subheading": "United Arab Emirates",
      "price": 39,
      "original_price": 39,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CQJZvAAP",
      "hero_image": "https://images.luxuryescapes.com/ly5bhoqasgegxeodj4i",
      "image_two": "https://images.luxuryescapes.com/3pox19pmr4z1f0d7bta",
      "image_three": "https://images.luxuryescapes.com/mkzjve18nhxtxbqvmu2l",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 01:59:00"
    },
    {
      "vendor_name": "Pullman Dubai Creek City Centre",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Pullman Stay with Rooftop Pool, Onsite Restaurants & Direct Access to Deira City Centre Shopping Mall",
      "description": "Embrace modern comforts at this urban retreat directly connected to Deira City Centre Shopping Mall, home to over 370 shops and a host of dining options. A short stroll will take you to the historic Dubai Creek, where traditional dhows cruise past modern yachts. After a day of exploration, retreat to the chic rooftop pool lounge, offering stunning city views, catch the game with a pub meal at La Fabrique or savour a culinary journey at Medley, where expert chefs whip up a tantalising array of dishes. For relaxation, Fit & Spa Lounge offers signature treatments in plush surrounds.",
      "location_subheading": "United Arab Emirates",
      "price": 60,
      "original_price": 60,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2zIIAS",
      "hero_image": "https://images.luxuryescapes.com/v4awubjewbr7xybhd2iu",
      "image_two": "https://images.luxuryescapes.com/ln1kuol1tuso1b6izmsb",
      "image_three": "https://images.luxuryescapes.com/uck15pjsx5tgwpqy3ri",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Shangri-La Hotel Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Shangri-La Dubai Escape near Burj Khalifa with Rooftop Pool & Swim-Up Bar",
      "description": "Experience the glamour of Dubai with a splash of signature luxury at Shangri-La Hotel Dubai, a slick hotel with views of the stunning Burj Khalifa. While the city buzzes below, this 42-story hotel offers a tranquil escape from the bustle with a palm-fringed rooftop pool and swim-up bar, a large spa, salon, three exquisite restaurants and three uber-cool bars. When you're ready to venture further, enjoy a convenient location on Sheikh Zayed Road, the main artery of Dubai, minutes from Dubai Mall, City Walk, Dubai World Trade Centre and the golden shores of La Mer beach.",
      "location_subheading": "United Arab Emirates",
      "price": 112,
      "original_price": 112,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000006zXGQAA2",
      "hero_image": "https://images.luxuryescapes.com/aupk9m8jzvtj9ontywn9",
      "image_two": "https://images.luxuryescapes.com/1kvdu4wdod3q8jksof2i",
      "image_three": "https://images.luxuryescapes.com/h5wt91fheoauijp9oyt",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "InterContinental Residence Suites Dubai F.C",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Apartment Escape with City Views & Indoor Lap Pool",
      "description": "InterContinental Residence Suites Dubai F.C, an IHG Hotel merges the comfort of home with dazzling views of the Dubai skyline and the services and amenities of a five-star hotel. Kick back and appreciate the urban sprawl at great heights, savour Italian and Mediterranean cuisine at MezzaLuna restaurant, take a refreshing plunge into the indoor pool or lounge on the sun deck. Mere minutes from Dubai Festival City Mall, this hotel is ideally situated to experience Dubai's best.",
      "location_subheading": "United Arab Emirates",
      "price": 102,
      "original_price": 102,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CNA7jAAH",
      "hero_image": "https://images.luxuryescapes.com/9ccuhmivbrbl7sjiiinc",
      "image_two": "https://images.luxuryescapes.com/6w7z21kxwhhlvka1vn2",
      "image_three": "https://images.luxuryescapes.com/tbmw9ai1ig30v438e0em",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Atlantis The Royal",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Next-Level Atlantis The Royal Dubai Palm Island Luxury with Eight Celebrity-Chef Restaurants & Sky Pool",
      "description": "Enjoy total opulence at the glitzy Atlantis The Royal, located on Dubai's world-famous Palm Island - home to an abundance of five-star resorts, world-class dining venues, celebrity-grade nightclubs and Royal Club, one of the best club lounges in the world. Expect only unforgettable indulgence: swim laps in the 90-metre sky pool, spend each evening dining in a different restaurant with 17 dining outlets onsite (including eight celebrity chef-helmed restaurants), treat yourself at the 5,000sqm wellness centre and gaze in wonder at the beautiful lobby - home to three aquariums, including the world's largest jellyfish tank.",
      "location_subheading": "United Arab Emirates",
      "price": 1096,
      "original_price": 1096,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000008gYD7AAM",
      "hero_image": "https://images.luxuryescapes.com/i26ucrdngo7fv80daesn",
      "image_two": "https://images.luxuryescapes.com/atf1244q390dtt5vujvm",
      "image_three": "https://images.luxuryescapes.com/zu31w9hkqhk0xz6pant",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Dubai Al Barsha",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Sky-High Novotel Dubai Elegance near Al Barsha District with Sparkling Outdoor Pool, Spa & Three Restaurants",
      "description": "Find yourself in the heart of it all from this towering Dubai urban oasis, strategically situated in the dynamic city's vibrant Al Barsha district. Indulge in elevated luxury at this 41-storey property offering gorgeous views of the Dubai skyline, relax and unwind in the plush rooms, take a dip in the glittering outdoor pool or treat yourself to a pamper session at the onsite spa. Be within easy reach of the stunning Mall of the Emirates, which houses Ski Dubai, and also the powder-white shores of Jumeirah Beach. If you wish to venture further, downtown Dubai, the Burj Khalifa, Dubai Mall and the bustling souks of Bur Dubai beckon. Return to your Novotel sanctuary to tuck into global cuisine at 365, dine on Carribean delights and sip on refreshing tipples while soaking up the views from Deck Se7en.",
      "location_subheading": "United Arab Emirates",
      "price": 41,
      "original_price": 41,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2zFIAS",
      "hero_image": "https://images.luxuryescapes.com/9qiyhsw4hsq9kthp2z49",
      "image_two": "https://images.luxuryescapes.com/ttyf4us8fwpl7blnid7a",
      "image_three": "https://images.luxuryescapes.com/wgmsya07jsi7c2flqd",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Jumeirah Dar Al Masyaf",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Jumeirah Summerhouse Oasis Retreat with Exclusive Private Beach",
      "description": "Embrace oasis opulence just steps from Dubai’s longest private beach with a five-star stay at the prestigious, ultra-boutique Jumeirah Dar Al Masyaf. Boasting just 29 lavishly furnished Arabian summerhouse villas, this exclusive retreat is Dubai at its most luxurious - savour sumptuous Italian bites on the resort’s private pier at Pierchic, jazz and classic cocktails at Bar Baci or sail past wind towers and the resort’s spectacular waterways by traditional abra barge.",
      "location_subheading": "United Arab Emirates",
      "price": 232,
      "original_price": 232,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000C2GuXAAV",
      "hero_image": "https://images.luxuryescapes.com/amwxmh68bhwjt5j9xica",
      "image_two": "https://images.luxuryescapes.com/0clg0rpb79n3v9culxr",
      "image_three": "https://images.luxuryescapes.com/968ev8jhpm9ju4r73rid",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Rixos The Palm Hotel & Suites",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Palatial Palm Jumeirah Opulence with Private Beach, Five Restaurants & Turkish-Inspired Spa",
      "description": "Bask in the irresistible allure of Dubai's glittering skyline and soak up the panoramic Persian Gulf views from this oasis that's perched on the Palm Jumeirah. Spend your days strolling along the hotel's private beach, lounge by the four expansive outdoor pools, or pamper yourself at the Turkish-inspired Anjana Spa. Gourmands are in for a treat: delight your tastebuds across the hotel's restaurants, bars and onsite patisserie. When you wish to explore, the glitzy Dubai Mall and the Burj Khalifa are only a 30-minute drive away. After a day of urban adventures, return to your chic abode and sip on refreshing, well-crafted cocktails and toast to your escape.",
      "location_subheading": "United Arab Emirates",
      "price": 362,
      "original_price": 362,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP8LYAV",
      "hero_image": "https://images.luxuryescapes.com/9tzs9091yg3fbfjan2",
      "image_two": "https://images.luxuryescapes.com/yeosjsgd5jykl3vozgf",
      "image_three": "https://images.luxuryescapes.com/hl7k0v7dr74fzlglcv8",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Swissotel Living Al Ghurair",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai One-, Two- & Three-Bedroom Apartment Escape in Al Ghurair Centre with Three Dining Venues",
      "description": "Nestled in the pulsating heart of Deira, this five-star oasis invites you to experience the ultimate fusion of relaxation and adventure. Guests enjoy direct access to the iconic Al Ghurair Centre, a bustling shopping paradise brimming with retail shops, dining options and vibrant entertainment venues - all just steps from your luxurious retreat. Escape to the serene onsite spa, where revitalising treatments and therapies await to awaken your senses. Or, lounge by the sparkling pool, a stunning oasis perfect for basking in the radiant Dubai sun. When it comes to dining, the Liwan restaurant serves up an array of international cuisine, while the Yasmine lobby lounge and Pool Cafe offer inviting spots for light bites and refreshing drinks.",
      "location_subheading": "United Arab Emirates",
      "price": 83,
      "original_price": 83,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2zEIAS",
      "hero_image": "https://images.luxuryescapes.com/rm0uw5zspvlprvzugfkr",
      "image_two": "https://images.luxuryescapes.com/xo4ulxl7fvj9d0iemll5",
      "image_three": "https://images.luxuryescapes.com/lv0xf1r5iupta2zny2bn",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Dubai Downtown",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Glamorous Dubai Downtown Stay near Burj Khalifa with Five Restaurants & Rooftop Pool",
      "description": "Overlooking the shimmering Dubai Canal, this contemporary hotel offers a prime location near Dubai Mall, home to a plethora of high-end boutiques, the bustling Downtown Dubai area and the city's renowned landmarks. Indulge in izakaya-style dining and weekly DJ sets at Honeycomb Hi-Fi, savour dinner and a dance in the 80's retro-chic Citadelle and sip vino in the artist-designed Couqley French Brasserie. After a day of exploration, enjoy a treatment at the spa or sip cocktails in the Lolita Pool Bar & Lounge with views of the iconic Burj Khalifa.",
      "location_subheading": "United Arab Emirates",
      "price": 73,
      "original_price": 73,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlwGIAS",
      "hero_image": "https://images.luxuryescapes.com/xz11zpjlyb9c0vpplak",
      "image_two": "https://images.luxuryescapes.com/q69kvwpp0se2ms4nn8ne",
      "image_three": "https://images.luxuryescapes.com/yjl8qrl3uo4ya2blv57a",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Kempinski Central Avenue Dubai",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Central Dubai Glamour within Dubai Mall with Onsite Restaurant & Day Spa",
      "description": "Experience the grandeur of Dubai with a stay at the opulent Kempinski Central Avenue Dubai. This luxurious hotel is located within Dubai Mall and offers unparalleled access to the city's vibrant nightlife, retail and award-winning restaurants. Savour Middle-Eastern cuisine at Nai restaurant, make use of the glittering rooftop infinity pool, or stop at the Senses spa for an aromatherapy massage. For those seeking cultural enrichment, the Dubai Opera and the Dubai Museum are just a short drive away.",
      "location_subheading": "United Arab Emirates",
      "price": 268,
      "original_price": 268,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Gx5soAAB",
      "hero_image": "https://images.luxuryescapes.com/yoazu1cqwrcpmp7q8mer",
      "image_two": "https://images.luxuryescapes.com/ac8ryzqid2ar82iy5t",
      "image_three": "https://images.luxuryescapes.com/vxuksdbzl9s2pktez46i",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Dubai City Ctr Resid.",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Modern Dubai Suites & Apartments near Dubai International Airport with Rooftop Pool & Spa",
      "description": "Experience a sophisticated city break in Dubai at these refined residences. Nestled alongside Dubai Creek, these striking suites and apartments boast waterfront views while connecting you directly to City Centre Deira mall. Unwind in designer apartments, rejuvenate in the rooftop pool, or indulge in Fit & Spa Lounge that epitomises well-being and relaxation. Just minutes from Dubai International Airport and the heritage heart of the city, these residences position you perfectly to experience Dubai's captivating contrasts. By day, explore the nearby Dubai Gold Souk and spice souks, or take a traditional abra boat along the Dubai Creek. By night, sample the best innovative cuisine that Dubai has to offer.",
      "location_subheading": "United Arab Emirates",
      "price": 90,
      "original_price": 90,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP6gYAF",
      "hero_image": "https://images.luxuryescapes.com/9of85p0f4rgm8mrmzivs",
      "image_two": "https://images.luxuryescapes.com/n1l2uz9axpmwcbmv4ztl",
      "image_three": "https://images.luxuryescapes.com/b12cjhxbg14csal55td",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Grand Plaza Movenpick Media City",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Five-Star Dubai Opulence near Palm Jumeirah with Restaurants, Rooftop Bar, Pool & Spa",
      "description": "Indulge in opulence at this enchanting sanctuary, where an Arabian adventure awaits. Moments from the city's vibrant shopping districts and dining treasures, Grand Plaza Mövenpick Media City promises an unforgettable experience. This five-star haven embraces indulgence and tranquility in one unforgettable escape. Enjoy signature flavours at Bytes Restaurant or embrace elegance with a high tea at Grand Lounge. For a sweet moment, treat yourself at the irresistible chocolate hour. As the sun dips, unwind at TWENTY THREE Rooftop Bar, with breathtaking views of The Palm Jumeirah and Dubai’s glittering skyline. Relax by the outdoor pool and get pampered at the soothing M Spa & Beauty Salon.",
      "location_subheading": "United Arab Emirates",
      "price": 71,
      "original_price": 71,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP8IYAV",
      "hero_image": "https://images.luxuryescapes.com/db5cxp2f1h7ldlbyzpn",
      "image_two": "https://images.luxuryescapes.com/a37kh579j899a0e2byqk",
      "image_three": "https://images.luxuryescapes.com/bjsbwyxffsb7ynuhbdju",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Kempinski Hotel & Residences Palm Jumeirah",
      "offer_country_name": "United Arab Emirates",
      "location_heading": "Dubai",
      "title": "Dubai Five-Star Kempinski Glamour on Palm Jumeirah with Private Beach",
      "description": "Retreat to a world of opulence at the five-star Kempinski Hotel and Residences Palm Jumeirah and experience a stay to remember. The magnificent temperature-controlled outdoor pool features a swim-up bar and the private beach is a tempting oasis for a cooling dip, while five acres of lush gardens are the perfect spot for a twilight stroll. When hunger strikes, there are three exceptional restaurants and bars to choose from, including Mediterranean flair at Villamore, Italian-inspired classics at Brunello Restaurant, or K-West Bar for traditional pub fare and a sports fix. Plus, keep the little ones busy at the daily kids' club. Palm Jumeirah is a haven for luxurious resorts, high-end restaurants and popular beach clubs, and you'll be perfectly placed within easy reach of it all.",
      "location_subheading": "United Arab Emirates",
      "price": 617,
      "original_price": 617,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009C1ShAAK",
      "hero_image": "https://images.luxuryescapes.com/ui0q6zo9royvt8uok4w",
      "image_two": "https://images.luxuryescapes.com/00fxekt88snthg17kjpfdo",
      "image_three": "https://images.luxuryescapes.com/pjdhm8ki5dv2vqqaltgj",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hotels in Dubai - United Arab Emirates Hotels & Travel Guide 2024",
    "description": "Find the best hotels in Dubai, United Arab Emirates with exclusive deals. Book your perfect getaway with up to 60% off.",
    "keywords": [
      "dubai hotels",
      "dubai travel",
      "united arab emirates hotels"
    ],
    "canonical": "https://mondoexplora.com/en/destination/dubai",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/dubai",
      "es": "https://mondoexplora.com/es/destination/dubai",
      "fr": "https://mondoexplora.com/fr/destination/dubai",
      "it": "https://mondoexplora.com/it/destination/dubai"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 84,
    "average_price": 193,
    "average_discount": 4
  }
}