{
  "city": "Jakarta",
  "country": "Indonesia",
  "country_code": "ID",
  "hero_title": "Hotels in Jakarta",
  "description": "Discover the best hotels in Jakarta, Indonesia. Find exclusive deals and luxury accommodations.",
  "hero_image": "https://images.luxuryescapes.com/g326vag85lcu5dgpscfk",
  "hotels": [
    {
      "vendor_name": "Mercure Jakarta Batavia",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Stylish Old Town Jakarta City Break with Restaurant, Outdoor Pool & Spa",
      "description": "Escape the bustle of Indonesia's capital at this stylish hotel, perfectly positioned in the historic Batavia district. When you're not relaxing in one of the comfortable rooms, recharge with a dip in the sparkling outdoor pool or tempt your taste buds at Malaka, the acclaimed onsite restaurant serving a mix of international and Asian culinary delights. Wander outside to cobblestone streets and marvel at the well-preserved Dutch colonial architecture that has earned this district UNESCO World Heritage status. Immerse yourself in the vibrancy of Glodok, Jakarta's thriving Chinatown, or escape to the scenic Thousand Islands archipelago, for a dose of natural serenity.",
      "location_subheading": "Indonesia",
      "price": 38,
      "original_price": 38,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnL4lYAF",
      "hero_image": "https://images.luxuryescapes.com/g326vag85lcu5dgpscfk",
      "image_two": "https://images.luxuryescapes.com/95m9dchcthsl2wvz3qm",
      "image_three": "https://images.luxuryescapes.com/714dknw648kidj9u2oxc",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indonesia Kempinski",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Five-Star Kempinski Luxury in the Heart of Jakarta with Rooftop Swimming Pool",
      "description": "Experience unrivalled luxury at the Hotel Indonesia Kempinski Jakarta, a five-star cosmopolitan retreat. This landmark hotel is perfectly positioned to explore the Indonesian capital's famed sites, including the National Monument, Grand Indonesia Mall, Ancol Dreamland and the Thousand Islands. Spend your days eating, drinking, shopping and exploring, before returning to your elegant accommodation. Head to the hotel's rooftop swimming pool to soak away your stress, or work up a sweat in the onsite fitness centre. Dine at the array of gastronomic restaurants or escape the city buzz in your serene and stylish room.",
      "location_subheading": "Indonesia",
      "price": 136,
      "original_price": 136,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009C1ZnAAK",
      "hero_image": "https://images.luxuryescapes.com/ffwng69p7hlahxtdvf2",
      "image_two": "https://images.luxuryescapes.com/cyblbj9aabxm0h8z39bs",
      "image_three": "https://images.luxuryescapes.com/y436z5lhge7hw4j4df9e",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Movenpick Jakarta City Centre",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Elegant Central Jakarta Mövenpick Escape with Onsite Spa & Four Restaurants",
      "description": "Experience the vibrant energy of Indonesia's bustling capital with a stay at this peaceful haven. Located in the heart of the city, Mövenpick Hotel Jakarta City Centre offers easy access to Jakarta's rich cultural and historical attractions, including the grand Istiqlal Mosque and the fascinating National Museum. After a day of exploration, relax with a handcrafted cocktail at the stylish bar, before retreating to the comfort of your modern, well-appointed room. With four restaurants, the tranquil Le Jardin spa and a fitness centre, this hotel is an ideal choice for both business and leisure travellers.",
      "location_subheading": "Indonesia",
      "price": 71,
      "original_price": 71,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOwzYAF",
      "hero_image": "https://images.luxuryescapes.com/e7g2djunzm1yqhxaohd7",
      "image_two": "https://images.luxuryescapes.com/p6bk2k68vnlhai41mqq",
      "image_three": "https://images.luxuryescapes.com/6a22a9axqf5g5q58et9",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Swissotel Jakarta PIK Avenue",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Swissôtel Jakarta Urban Sanctuary Just 15-Minutes from Airport with Outdoor Pool",
      "description": "Step into a unique melting pot of Indonesian culture and vintage design, placed at the epicentre of Jakarta's dynamic central business district - just a 15-minute drive from Soekarno-Hatta International Airport (CGK). Among a skyline of skyscrapers, high-end shopping malls like the Pik Avenue Mall, and vibrant restaurants and cafes, explore the best of Indonesia's capital from this fresh urban sanctuary. Cool off in the outdoor swimming pool after a day of exploring the city and unwind with a delicious cocktail from Summers at the Pool, or dine on traditional fare at onsite restaurant The Chinese National.",
      "location_subheading": "Indonesia",
      "price": 124,
      "original_price": 124,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOwsYAF",
      "hero_image": "https://images.luxuryescapes.com/abr2qpkodjr0kmq51d",
      "image_two": "https://images.luxuryescapes.com/pzv2x4isehvzk9jun25k",
      "image_three": "https://images.luxuryescapes.com/9pxohwp9lkaqc5x9vjnm",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Jakarta Pantai Indah Kapuk",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "North Jakarta PIK Avenue Elegance with Onsite Dining & Outdoor Pool",
      "description": "Appreciate in the vibrant culture and energetic city life of North Jakarta with a stay at this refined retreat. Start your day the right way with your brew of choice at M Coffee, then venture out to explore the modern shopping haven PIK Avenue and sample the city’s best street food. After a day of exploration, treat yourself to a delicious meal at the onsite NSNTR Bistro, where you can savour a variety of Indonesian delicacies and local dishes. Relax by the tranquil outdoor pool or work up a sweat at the fitness centre. With Soekarno-Hatta International Airport nearby, this hotel is the perfect choice for both business and leisure travellers.",
      "location_subheading": "Indonesia",
      "price": 94,
      "original_price": 94,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnL4XYAV",
      "hero_image": "https://images.luxuryescapes.com/f3guw678rkelyapzbysx",
      "image_two": "https://images.luxuryescapes.com/f8udceqwwei19395qoz",
      "image_three": "https://images.luxuryescapes.com/1rkrb0yw4ucyhdydshxm",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Jakarta Sabang",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Central Jakarta Hotel with Swimming Pool & Restaurant",
      "description": "Enjoy the energy of Jakarta, Indonesia's capital city, at this central stay. This modern retreat is a stone's throw from the historic National Monument and the bustling shopping district of Thamrin City, placing you close to the city's most popular sights. After a day of urban exploration, retreat to the hotel's rooftop pool for a refreshing dip, savour authentic Indonesian cuisine at Clovia Restaurant, or rejuvenate with a treatment at the onsite spa. The hotel also offers easy access to the city's public transportation, making it an ideal base for your Jakarta adventure.",
      "location_subheading": "Indonesia",
      "price": 56,
      "original_price": 56,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnL4cYAF",
      "hero_image": "https://images.luxuryescapes.com/btff68r63zpknlhrzy7",
      "image_two": "https://images.luxuryescapes.com/mrvjb8hgkav8vck3ya",
      "image_three": "https://images.luxuryescapes.com/ryff93e5m9ueeo1po2gc",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Fairmont Jakarta",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Contemporary Jakarta Indulgence with Rooftop Pool, Signature Spa & Six Restaurants",
      "description": "Experience the eclectic energy of Indonesia's capital with a stay at this sophisticated urban sanctuary, perfectly situated in the heart of Jakarta. Directly linked to Plaza Senayan, one of the city's trendiest shopping venues, this five-star hotel offers easy access to top attractions, including the National Museum of Indonesia, Istiqlal Mosque and the vibrant Glodok Chinatown Market. Back at your sky-high hotel, enjoy a refreshing dip in the outdoor pool or pamper yourself at the luxe Fairmont Spa with restorative treatments. For the culinary curious, dine and sip across the hotel's eight restaurants and bars, sampling Indonesian, and Japanese delicacies and relishing juicy steaks with epic cocktails from the 22nd-floor steak bar, all while soaking up the glittering city vistas.",
      "location_subheading": "Indonesia",
      "price": 142,
      "original_price": 142,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2xvIAC",
      "hero_image": "https://images.luxuryescapes.com/jlircino9j8qo8ayt026",
      "image_two": "https://images.luxuryescapes.com/z22j0hkafbknp86xra",
      "image_three": "https://images.luxuryescapes.com/crmos9bnzrhbohuj0wh",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Jakarta Gajah Mada",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Stylish Central Jakarta Escape with Onsite Dining, Pool, Sauna & Spa",
      "description": "Experience the vibrant energy of Indonesia's capital with a stay at this Novotel gem offering easy access to popular attractions of the city. Perfectly positioned in the heart of the city, this modern retreat puts you in proximity to Jakarta's historic Chinatown and the majestic National Monument. Eat like the locals at the onsite The Square restaurant and savour authentic Indonesian cuisine. Enjoy a refreshing dip in the outdoor pool or head to the spa for some rejuvenation. The hotel's prime location also places you within reach of the city's premier shopping district, Plaza Indonesia, and the bustling food scene of Pasar Baru. Call it a day in spacious and elegant rooms that offer views, hues and exceptional service await.",
      "location_subheading": "Indonesia",
      "price": 34,
      "original_price": 34,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOvVYAV",
      "hero_image": "https://images.luxuryescapes.com/1lw48vu1an3lay0mbatw",
      "image_two": "https://images.luxuryescapes.com/fb9acnwnnk4cday36bx",
      "image_three": "https://images.luxuryescapes.com/p7cj4evn1wv5y2nblnvo",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Jakarta Simatupang",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Mercure Jakarta Central Sanctuary with Rooftop Bar & Pool",
      "description": "Experience Jakarta's dynamic cityscape with a stay at this centrally located hotel. Combining modern amenities with timeless design, the property offers easy access to the city's vibrant shopping hubs and breathtaking views of the striking skyline. Relax in your stylish room while soaking in the scenery, or elevate your visit with a cocktail at the stunning Karumba rooftop rum bar. Indulge in thoughtfully crafted international cuisine at Graffiti Restaurant before heading out to explore Jakarta's vibrant nightlife. Whether you're travelling for business or leisure, your unforgettable Jakarta adventure starts here.",
      "location_subheading": "Indonesia",
      "price": 38,
      "original_price": 38,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOvQYAV",
      "hero_image": "https://images.luxuryescapes.com/5otxst3dumxs0cvl80rb",
      "image_two": "https://images.luxuryescapes.com/8ob23oxa4l2x4m77g8to",
      "image_three": "https://images.luxuryescapes.com/1np21fz42qrg3juj51um",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Jakarta Kota",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Sophisticated Jakarta Retreat near Old Town with Onsite Spa & Outdoor Pool",
      "description": "Step into this vibrant urban sanctuary, blending colonial architecture with contemporary Indonesian influences. Guests are invited to relax in the hotel's sleek outdoor swimming pool, savour innovative and traditional Chinese cuisine at Chiao Tung restaurant, or sip signature cocktails at Kirana Bar, where live music sets the mood from early till late. From the cobblestone streets of historic Kota Tua to the pulsing energy of Indonesia's capital, Mercure Jakarta Kota puts guests at the epicentre of the city. Beyond the well-trodden tourist paths, adventurous travellers can uncover hidden gems like captivating street art in Taman Fatahillah or the exciting street food scene at Pecenongan Night Market.",
      "location_subheading": "Indonesia",
      "price": 32,
      "original_price": 32,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOvJYAV",
      "hero_image": "https://images.luxuryescapes.com/synczpbs26ftlj3a45s",
      "image_two": "https://images.luxuryescapes.com/aezx9xlw2jcz3t88ocz8",
      "image_three": "https://images.luxuryescapes.com/hj11ti70wsk9ht54p7u",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Jakarta Cikini",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Sleek Jakarta Escape with Onsite Pool, Restaurant & Guaranteed City Views",
      "description": "Nestled in the vibrant heart of Jakarta, this elegant hotel provides a peaceful haven amid the city's lively energy. Spend your day immersing yourself in Jakarta's unique mix of historic charm and modern vitality, from the colonial-era architecture and charming cobblestone streets of Old Jakarta to the bustling nightlife of its dynamic districts. After a day of exploration, relax with a handcrafted cocktail at the stylish bar before retreating to the comfort of your modern, well-appointed room. With a sparkling outdoor pool, an onsite restaurant, a 24-hour fitness centre and complimentary bike rentals, this hotel is an ideal choice for both business and leisure travellers.",
      "location_subheading": "Indonesia",
      "price": 51,
      "original_price": 51,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnL4gYAF",
      "hero_image": "https://images.luxuryescapes.com/ycrwu4cuk91o8cl8g5jh",
      "image_two": "https://images.luxuryescapes.com/4xju9yk19fqzgzxxh1ku",
      "image_three": "https://images.luxuryescapes.com/cuanez9nvpl163jtzhtl",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Jakarta Indonesia",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Central Jakarta Escape with Outdoor Pool & Seven Onsite Dining Venues",
      "description": "Take refuge from the busy streets of Jakarta at this blissful urban escape in the sky. With warm interiors inspired by traditional Indonesian Wayang puppetry, feather-soft beds and bright windows with cosmopolitan vistas, this lavish retreat is the perfect place to luxuriate after a long day of exploring and eating your way across the city.The chances for relaxation don't stop once you leave your room - take a dip in the glistening pool or visit the spa to savour a massage. You'll be spoilt for choice with the elegant bars and exquisite eateries at Pullman Jakarta Thamrim CBD. Revel in a world-class fine dining experience at Ginza Sushi Ichi that specialises in omakase-style sushi and flies its produce in from Tokyo to be enjoyed fresh by you. Lovers of sweet treats will rejoice at the chocolate lounge that boasts a mouth-watering afternoon tea and the exemplary bakery producing sumptuous designer cakes.",
      "location_subheading": "Indonesia",
      "price": 85,
      "original_price": 85,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2y8IAC",
      "hero_image": "https://images.luxuryescapes.com/31ncwf38utd9944h12et",
      "image_two": "https://images.luxuryescapes.com/dnhypmfvh0l1sntwnc9",
      "image_three": "https://images.luxuryescapes.com/v6ldhhzb0oea5x4h9tx",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "InterContinental Jakarta Pondok Indah",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Jakarta Five-Star Stylish City Break with Pondok Indah Mall",
      "description": "Experience the height of Indonesian opulence with an escape to the five-star InterContinental Jakarta Pondok Indah, an IHG Hotel. The iconic ‘Beverly Hills of Indonesia', Pondok Indah offers access to the city's best high-end shopping, dining and leisure destinations. Savour Indonesian heritage-inspired wellness treatments at Inaria Spa, experience intimate sommelier-led wine pairings at The Vineyard or head to the connected Pondok Indah Mall for the city’s most dazzling retail boutiques.",
      "location_subheading": "Indonesia",
      "price": 96,
      "original_price": 96,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000BfgKmAAJ",
      "hero_image": "https://images.luxuryescapes.com/9qt28u9d1liu7axo4s0o",
      "image_two": "https://images.luxuryescapes.com/zov8y5f9ql0i3we45sk",
      "image_three": "https://images.luxuryescapes.com/kti7tk2z6aulzawh68h7",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Jakarta Central Park",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "West Jakarta Central Park Pullman Hotel with Three Dining Venues & Onsite Spa",
      "description": "Dive right into the centre of Indonesia's capital at this urban retreat just a stone's throw from the Central Park Mall in West Jakarta, where high-end boutiques and gourmet eateries await. Inside the hotel, stop by the stylish pool bar and terrace, relax and unwind at the lavish spa and wellness centre, and choose between three innovative dining options for a bite to eat and a refreshing drink. Venture out to explore the city's rich culture at the nearby National Museum, take a leisurely stroll around the lush Taman Anggrek Park or chase thrills at the Ancol Dreamland amusement park.",
      "location_subheading": "Indonesia",
      "price": 90,
      "original_price": 90,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2y3IAC",
      "hero_image": "https://images.luxuryescapes.com/d2a1hicfcl242my09yg",
      "image_two": "https://images.luxuryescapes.com/smejdv4usy4wt3ue0j1",
      "image_three": "https://images.luxuryescapes.com/v3skazakzpj730rwkdkq",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Jakarta Cikini",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Stylish Jakarta CBD City Break with Onsite Restaurant & Rooftop Infinity Pool & Bar",
      "description": "Stay in the centre of Indonesia's captivating capital at this city oasis, steps from the CBD and historic Taman Ismail Marzuki Arts Centre. Relax and unwind among your hotel's fusion of traditional and modern style, marvel at the glittering skyline while you take a dip in the rooftop infinity pool and sip on refreshing cocktails at its bar. Stay in and tuck into authentic Indonesian and international cuisine at De'kafe Restaurant or indulge in rejuvenating in-room spa services. Should you wish to explore, the city's top attractions, including the Monas monument and vibrant Glodok Chinatown Market, are within easy reach.",
      "location_subheading": "Indonesia",
      "price": 40,
      "original_price": 40,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnL4kYAF",
      "hero_image": "https://images.luxuryescapes.com/hy9ghgwihanwimpd2nhw",
      "image_two": "https://images.luxuryescapes.com/7psqb8d0sgaflspzgq7b",
      "image_three": "https://images.luxuryescapes.com/wcqe817xb6ry4oe2if1",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "25hours Hotel Jakarta The Oddbird (previously Ashta Residence)",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Central Jakarta Urban Sanctuary with Outdoor Pool & Onsite Restaurant",
      "description": "Step into a unique melting pot of Indonesian culture and vintage design, placed at the epicentre of Jakarta's dynamic central business district. Among a skyline of skyscrapers, high-end shopping malls like the Pacific Place Mall, and vibrant restaurants and cafes, explore the best of Indonesia's capital from this fresh urban sanctuary. Cool off in the 9th-floor outdoor swimming pool after a day of exploring the city and unwind with a delicious cocktail from the poolside Cabana bar. Take some time to relax at the spa with an ice-cold plunge or a warming sauna session, and dine on South American fare at the laid-back Copa restaurant, complete with hearty charcoal-grilled favourites and signature tacos.",
      "location_subheading": "Indonesia",
      "price": 141,
      "original_price": 141,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOx1YAF",
      "hero_image": "https://images.luxuryescapes.com/52oe9wn665xt7hhnai32",
      "image_two": "https://images.luxuryescapes.com/301c5vb4x87fhynfgz5b",
      "image_three": "https://images.luxuryescapes.com/7heytuctaijj3y0o30dg",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Langham Jakarta",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Elegant Jakarta Escape with Artesian Rooftop Bar & Onsite Dining",
      "description": "Step into a world of pure luxury with an opulent stay at The Langham Jakarta, the glittering jewel of Indonesia's cosmopolitan capital. This architectural marvel is surrounded by the city's iconic luxury shopping, cultural attractions such and endless world-class restaurants. Between citybound adventures, savour the flavours of Jakarta at the hotel's award-winning restaurants, or taking in the sunset with a sophisticated cocktail at the rooftop Artesian Bar Jakarta.",
      "location_subheading": "Indonesia",
      "price": 186,
      "original_price": 186,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GumFWAAZ",
      "hero_image": "https://images.luxuryescapes.com/2hj2oisgnnuiex6xd9bn",
      "image_two": "https://images.luxuryescapes.com/li2lmybxtfwu3hze286",
      "image_three": "https://images.luxuryescapes.com/s4f3lcjplrw4kk2qmja",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Jakarta Gatot Subroto",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Sophisticated South Jakarta Mercure Stay with Onsite Restaurant, Pool & Spa",
      "description": "Experience the vibrant energy of Indonesia's capital with a stay at a centrally located modern retreat. Perfectly positioned in the heart of Jakarta, it offers convenient access to the renowned Lotte Shopping Avenue and the historic National Monument. Savour authentic Indonesian and international cuisine at the onsite Flora restaurant or maintain your routine in the well-equipped fitness centre. When you're ready to explore, enjoy proximity to the bustling Sudirman Central Business District and the grand Istiqlal Mosque.",
      "location_subheading": "Indonesia",
      "price": 58,
      "original_price": 58,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOwjYAF",
      "hero_image": "https://images.luxuryescapes.com/7hzz1ahfuba6t186hhce",
      "image_two": "https://images.luxuryescapes.com/awzpfvo8fgd3rnrw4u9",
      "image_three": "https://images.luxuryescapes.com/tcazqyu7hjtpp8icinim",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Keraton at The Plaza - The Unbound Collection by Hyatt",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Jakarta All-Club Luxury near Plaza Indonesia with Rooftop Pool",
      "description": "Experience the vibrant charm of Indonesia’s capital from this luxury, all-club hotel nestled in central Jakarta. This five-star urban retreat features two exclusive lounges and a tropical rooftop pool with sweeping views of the city's mesmerising skyline. Savour a diverse culinary journey just steps away at Grand Hyatt Jakarta, conveniently connected via a bridge. Indulge in authentic Japanese flavours and sizzling teppanyaki at Sumire, or unwind at C's Steak and Seafood with delicious cuts and Italian fare. When you're ready to explore, Jakarta’s cultural landmarks await, including the iconic National Monument nearby.",
      "location_subheading": "Indonesia",
      "price": 214,
      "original_price": 214,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000HicEMYAZ",
      "hero_image": "https://images.luxuryescapes.com/juzy8rvuyd36i30yw2hq",
      "image_two": "https://images.luxuryescapes.com/aj4gw863qs560r8ds7bp",
      "image_three": "https://images.luxuryescapes.com/9rgyx05s6r8bp9butiop",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Raffles Jakarta",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Opulent Raffles Escape in Jakarta with Onsite Wellness Centre & Diverse Dining Venues",
      "description": "Experience the epitome of luxury at this Raffles property located in the heart of Indonesia's vibrant capital. This sophisticated urban retreat offers a gateway to the city's thriving arts and culture scene, with the Ciputra Artpreneur Centre, a hub for art exhibitions and theatre performances, integrated within the hotel. Post exploration it offers solace in rooms that are designed for ultimate luxury and relaxation. Dig into gastronomic delights at Arts Café by Raffles, serving a fusion of Indonesian and international dishes, or sip on signature cocktails at The Writers Bar. Venture out to explore the nearby upscale shopping centres or the historic Monas Tower, before retreating to the hotel's tranquil spa or the stunning outdoor pool. The combination of ultimate luxury and impeccable hospitality awaits your arrival in Jakarta.",
      "location_subheading": "Indonesia",
      "price": 141,
      "original_price": 141,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2yFIAS",
      "hero_image": "https://images.luxuryescapes.com/22rn85bn6pi9nibtozc",
      "image_two": "https://images.luxuryescapes.com/s5cb62kn0im9we1cwrt",
      "image_three": "https://images.luxuryescapes.com/ymx13xc0l5ib3fbgswt9",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Convention Center Ancol",
      "offer_country_name": "Indonesia",
      "location_heading": "Jakarta",
      "title": "Waterfront North Jakarta Escape next to Ancol Theme Park with Outdoor Pool",
      "description": "Uncover the allure of northern Jakarta with an elegant retreat at this Mercure abode, ideally situated next to the vibrant Dreamland Ancol theme park. Greeted by shimmering views of the Java Sea and within easy reach of Seaworld Oceanarium, Fantasy World and Ancol Beach, the hotel boasts warm interiors and well-appointed rooms designed to curate an ultra-comfortable stay. Take a refreshing dip in the hotel's expansive adults-only pool while kids can splash around and enjoy the water slides in the kids' pool area. When hunger strikes, tuck into authentic Indonesian fare at Sunda Kelapa Restaurant and sip on epic cocktails from the all-day Nelayan Bar.",
      "location_subheading": "Indonesia",
      "price": 35,
      "original_price": 35,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOvMYAV",
      "hero_image": "https://images.luxuryescapes.com/gip5kdmeze2wjyr0ot3",
      "image_two": "https://images.luxuryescapes.com/f8ob0azau857uy26nxgi",
      "image_three": "https://images.luxuryescapes.com/n5icffse9c81paeevfdc",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hotels in Jakarta - Indonesia Hotels & Travel Guide 2024",
    "description": "Find the best hotels in Jakarta, Indonesia with exclusive deals. Book your perfect getaway with up to 60% off.",
    "keywords": [
      "jakarta hotels",
      "jakarta travel",
      "indonesia hotels"
    ],
    "canonical": "https://mondoexplora.com/en/destination/jakarta",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/jakarta",
      "es": "https://mondoexplora.com/es/destination/jakarta",
      "fr": "https://mondoexplora.com/fr/destination/jakarta",
      "it": "https://mondoexplora.com/it/destination/jakarta"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 21,
    "average_price": 91,
    "average_discount": 0
  }
}