{
  "city": "Nusa Dua",
  "country": "Indonesia",
  "country_code": "ID",
  "hero_title": "Hotels in Nusa Dua",
  "description": "Discover the best hotels in Nusa Dua, Indonesia. Find exclusive deals and luxury accommodations.",
  "hero_image": "https://images.luxuryescapes.com/ojy1foyvo3kpqqeug",
  "hotels": [
    {
      "vendor_name": "Novotel Bali Nusa Dua - Hotel & Residences",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Nusa Dua Tropical Bliss with Daily Breakfast, Nightly Dinner & Nightly Free-Flow Drinks",
      "description": "Set amid five hectares of lush tropical gardens surrounding a sprawling two-tier lagoon pool, this resort promises a world of relaxation and indulgence. Experience unrestricted access to Bali’s golden southern shores and dreamy sunsets at the hotel's very own beach club - easily reached by a complimentary shuttle. Taste your way through the hotel's selection of mouthwatering bars and eateries, serving up traditional French pastries at Pause Cafe, classic Balinese fare and international favourites at The Square, and fresh delights at Gourmet Bar, where drinks come with a side of sparkling pool views. Little ones will adore the hotel’s family-friendly facilities, including a fun-filled kids’ club boasting a wealth of daily activities like Balinese dancing and swimming lessons. Meanwhile, parents can find their zen at the soothing In Balance Spa, blending ancient traditions and modern innovation to make you feel worlds away from the every day. For fun with the whole family, opt for a bicycle tour or a blissful beach day.",
      "location_subheading": "Indonesia",
      "price": 549,
      "original_price": 1144,
      "discount_percentage": 52,
      "link": "https://luxuryescapes.com/offer/006RF00000C8zAhYAJ",
      "hero_image": "https://images.luxuryescapes.com/ojy1foyvo3kpqqeug",
      "image_two": "https://images.luxuryescapes.com/9c7qa6sa4n8lkxmixn9g",
      "image_three": "https://images.luxuryescapes.com/wkd3gwoy0n4qobr4i17p",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 3,
      "end_date_utc": "2025-09-21 13:59:00"
    },
    {
      "vendor_name": "Ayodya Resort Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Nusa Dua Bestseller: All-Inclusive Beachfront Paradise with All-Day Dining & Unlimited Free-Flow Drinks",
      "description": "Taste and tipple anytime, anywhere at this all-inclusive oasis, a paradise on one of Nusa Dua’s best beaches. Want for nothing with all-day dining - including free-flow drinks wherever you land - whether it's at a shady table, poolside at Surfer's Corner, indulging in authentic Japanese at Genji or enjoying beachside bliss at Ayodya Beach Club & Grill. Unwind with authentic treatments at the spa, treat yourself to a yoga session or explore tropical Nusa Dua by bike. With its location on the pristine Mengiat Beach and proximity to a plethora of restaurants, shopping and watersports, you'll have plenty to keep your days as busy or as restful as you desire. Shop up a storm at the Bali Collection mall, home to international and local fashion brands and eateries and savour authentic Indian cuisine at Ganesha ek Sanskriti. Ayodya Resort Bali has something for everyone.",
      "location_subheading": "Indonesia",
      "price": 989,
      "original_price": 2060,
      "discount_percentage": 52,
      "link": "https://luxuryescapes.com/offer/006RF00000JiGisYAF",
      "hero_image": "https://images.luxuryescapes.com/0xb7ipw9r4y12rghpycc",
      "image_two": "https://images.luxuryescapes.com/nnyvoovrcgindti6vku",
      "image_three": "https://images.luxuryescapes.com/trrno2m0mluc38rk2x6q",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 5,
      "end_date_utc": "2025-08-05 13:59:00"
    },
    {
      "vendor_name": "The Apurva Kempinski Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Bali Bestseller is Back! Nusa Dua Beachfront Opulence with Massages, Daily Breakfast & Nightly Dinner",
      "description": "Experience Nusa Dua like never before at one of the island's most luxurious hotels. Designed with dramatic flair by award-winning architect Budiman Hendropurnomo, the resort dazzles from the second you step into the opulent lobby, with grand staircases and tiered private pool suites cascading down the cliff face, in a reflection of the country’s iconic terraced rice fields. In this five-star establishment, both service and amenities are world-class. Dive into the remarkable 60m outdoor swimming pool, glide down the thrilling waterslides or descend into pure bliss at The Apurva Spa. Other highlights of this incredible resort include Koral Restaurant, Bali’s first aquarium dining experience, and the renowned Reef Beach Club, complete with a sparkling 42-metre infinity pool. When it's time to be wined and dined, choose between Izakaya by OKU, the relaxed and beachfront Reef Beach Club, or indulge in hot pot specialities at Bai Yun. Feast at the sophisticated Pala Restaurant & Rooftop Bar or enjoy cocktails at the exclusive L’Atelier by Cyril Kongo on the resort’s highest floor.",
      "location_subheading": "Indonesia",
      "price": 1569,
      "original_price": 4615,
      "discount_percentage": 66,
      "link": "https://luxuryescapes.com/offer/006RF00000IrUonYAF",
      "hero_image": "https://images.luxuryescapes.com/lp7nmjp6zk5ws6fj4oda",
      "image_two": "https://images.luxuryescapes.com/2xc14zbb174sppjrzbk",
      "image_three": "https://images.luxuryescapes.com/nipqfsem5or5syofkeu",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 5,
      "end_date_utc": "2025-08-25 13:59:00"
    },
    {
      "vendor_name": "Mercure Bali Nusa Dua",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Contemporary Nusa Dua Resort with Outdoor Pool, Spa & Onsite Restaurant",
      "description": "Set in the heart of the island's prestigious Nusa Dua district, this four-star hotel offers a serene retreat within lush tropical gardens. Enjoy a refreshing dip in the stunning outdoor pool, or relish the local flavours at the Soka restaurant. Let the kids loose in the kids' pool while you enjoy a magical massage at the onsite spa that eliminates all your worries. When you're ready to explore, find yourself within easy reach of the stunning Geger Beach and the Bali Collection shopping centre, offering a plethora of dining and shopping options. For golf enthusiasts, the award-winning Bali National Golf Club is just a short drive away. A shuttle to the beach makes it easy for you to make your way to the white sands for some Vitamin Sea. Good food, luxurious rooms, unrivalled service at your fingertips, makes this the Bali escape for you!",
      "location_subheading": "Indonesia",
      "price": 43,
      "original_price": 43,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2ypIAC",
      "hero_image": "https://images.luxuryescapes.com/zx5dipb6tdjqbnfrdd5",
      "image_two": "https://images.luxuryescapes.com/qb3poiq7lorq4serqcvw",
      "image_three": "https://images.luxuryescapes.com/jkwvi62rgyq8bsrwz77",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Samabe Bali Suites & Villas",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Five-Star Clifftop Nusa Dua Escape with Private Beachfront",
      "description": "Take luxury to new heights with an indulgent clifftop stay at Samabe Bali Suites & Villas. Floating on top of a cliff in sensational Nusa Dua, with panoramic views of the Indian Ocean, the five-star beach resort is a destination in itself, ensconced in eight hectares of tropical greenery and opening onto a private white-sand, azure-water beach. Other Balinese towns are just a short drive away, but with everything you need at your fingertips, you’ll find little reason to leave. Every lodging at Samabe Bali Suites & Villas comes with ocean views as standard, inspiring relaxation from the very second you walk into the Balinese-inspired interior. You won’t be lost for activities: sip on a cocktail by the waterfront infinity pool, embrace your inner chef with cooking classes or explore the azure waters with stand-up paddleboarding or snorkelling. Spa savants will feel their troubles melt away with treatments at Galangal Spa, while yogis can find balance in mind and body with daily yoga classes. Whatever your form of relaxation, your butler can organise everything for you - the 24-hour service means someone is always on hand to make dinner reservations, arrange activities and refresh your room whenever you want.",
      "location_subheading": "Indonesia",
      "price": 303,
      "original_price": 303,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003Go1VAAS",
      "hero_image": "https://images.luxuryescapes.com/f2r9nt6cat226roqig7i",
      "image_two": "https://images.luxuryescapes.com/71jywol93ahtys4x9rje8",
      "image_three": "https://images.luxuryescapes.com/fj212dsrnqvrr464runj",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Kayumanis Nusa Dua Private Villa & Spa",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Bali Private Pool Villas with Onsite Dining, Spa & Private Beach Acces",
      "description": "Wake to lush, tropical surroundings at the five-star Kayumanis Nusa Dua Private Villa & Spa. Each villa offers a private swimming pool within walled gardens, so you feel utterly at home in the comfort of your exclusive sanctuary. With dedicated butler service, your every need will be taken care of. Bali’s balmy evenings are best spent at one of the two exquisite restaurants, which serve mouthwatering Italian and authentic Indonesian cuisine in semi-alfresco settings. Treat yourself to a herb-infused body scrub or a glowing facial at Kayumanis Spa Nusa Dua, or go all out and opt for a signature ocean ritual. Spend your days exploring must-see sights like the Water Blow, Pura Gegar Temple, or white sand beaches. If you’re feeling active, go jet-skiing, parasailing, banana boat riding or diving. Keen golfers will delight in a round or two at Nusa Dua Golf and Country Club, renowned for its exceptional course.",
      "location_subheading": "Indonesia",
      "price": 269,
      "original_price": 269,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y0000070HStAAM",
      "hero_image": "https://images.luxuryescapes.com/y2pktn20ele8kmwifm",
      "image_two": "https://images.luxuryescapes.com/u2s8e5d5hcg7uglkhnoc",
      "image_three": "https://images.luxuryescapes.com/7yt61czo47577tl2wd",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Sofitel Bali Nusa Dua Beach Resort",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Sofitel Bali Beachfront Resort with Three Restaurants, Lagoon Pool & Spa",
      "description": "In the heart of Nusa Dua, overlooking the shining blues of the Bali Sea, this five-star resort indulges in French-inspired elegance. A beachside retreat tucked away in a quiet enclave of Bali’s southern peninsula, embrace exquisite dining onsite and a myriad of beachside bars and restaurants moments away. Gourmands will delight in the resort's restaurants - Pan-Asian street food at Kwee Zeen, Italian al fresco dining at Cucina and barbecue buffet at Toya Beach Bar & Grill. Float throughout the almost resort-wide lagoon pool or soothe in an exotic treatment at Sofitel SPA Wellness Centre. Whether you’re looking to explore Balinese temples or soak up the sunshine at the beach, Nusa Dua’s extraordinary treasures await.",
      "location_subheading": "Indonesia",
      "price": 160,
      "original_price": 160,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000G2vcBYAR",
      "hero_image": "https://images.luxuryescapes.com/w9ekhe96we0repe6k3o8",
      "image_two": "https://images.luxuryescapes.com/yyfayzz4mleaiioju5",
      "image_three": "https://images.luxuryescapes.com/91qm9mjtgryus3oyjr0l",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Mulia, Nusa Dua, Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Iconic Mulia Bali One-Bedroom Private Pool Villas with Six Onsite Swimming Pools & Butler Service",
      "description": "Discover the height of opulence at this five-star award-winning complex. On the edge of a secluded beach in Bali's southeast, this hedonistic haven delivers decadent dining, state-of-the-art fitness facilities and iconic beachfront pools. Stay in a celebrity-style villa ensconced in tranquil gardens, offering guests a verdant sanctuary with luxurious amenities, plush bedding and bespoke touches - complete with private hydrotherapy swimming pool and 24-hour butler service. Savour exceptional global cuisine at the nine bars and restaurants onsite, sink your toes into powder-white sand on the beach or plunge into one of six resort pools, including the Balinese-inspired Ocean Pool with swim-up bar.",
      "location_subheading": "Indonesia",
      "price": 567,
      "original_price": 567,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004F3SQAA0",
      "hero_image": "https://images.luxuryescapes.com/03ctor4jum59ig9sd2t8",
      "image_two": "https://images.luxuryescapes.com/otgojk2lhjkio1987t1",
      "image_three": "https://images.luxuryescapes.com/w6cj99619jxb7ovz8vib",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Royal Santrian Luxury Beach Villa",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Idyllic Five-Star Nusa Dua Beachfront Villa Hideaway with Onsite Spa",
      "description": "Find serenity in the quiet, exclusive ambiance of The Royal Santrian Luxury Beach Villas, one of Nusa Dua’s villa only beachfront resorts, with the buzzing palm-lined Nusa Dua just a few sandy steps away. Indulge in a dining experience inspired by the elements of earth, wind, water and fire at Allspice, or share a romantic moment at the Teppanyaki & Sushi Bar. When you're ready to truly unwind, head to the spa for full-body rejuvenation with signature Balinese wellness rituals.",
      "location_subheading": "Indonesia",
      "price": 346,
      "original_price": 346,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000EC3h2AAD",
      "hero_image": "https://images.luxuryescapes.com/8uk02pf1x23rlv3098b",
      "image_two": "https://images.luxuryescapes.com/ki0sxlwqrd30a39s7qu",
      "image_three": "https://images.luxuryescapes.com/oagyifmz9aw0akf885",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Mulia, Nusa Dua, Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Nusa Dua Mulia All-Suite Opulence with Iconic Infinity Pool & Nine Restaurants & Bars",
      "description": "Embrace world-class indulgence with everything you could want at your fingertips at this ultra-luxurious Bali favourite just steps from Nusa Dua Beach. Dotted among the palm-fringed grounds are six dreamy swimming pools, nine restaurants and bars serving everything from Chinese to Mediterranean fare, cocktails and high tea. Find your zen at Mulia Spa among the Finnish saunas and meditative steam room, or sink your toes into the secluded stretch of white-sand beach.",
      "location_subheading": "Indonesia",
      "price": 508,
      "original_price": 508,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JTI81AAH",
      "hero_image": "https://images.luxuryescapes.com/tcafadk14e8xigidzohn",
      "image_two": "https://images.luxuryescapes.com/wh9p6jgjpv1lfhxj9w7",
      "image_three": "https://images.luxuryescapes.com/gytrr6fzc9wh9jsw1vt",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "REVĪVŌ Wellness Resort Nusa Dua Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Award-Winning Nusa Dua Wellness Resort with Tailored Retreat Packages",
      "description": "Find your breath again during a transformative eco-wellness experience at REVĪVŌ, one of the only resorts of its kind in the inlands of Nusa Dua. With an award-winning reputation and just 22 suites and villas, this boutique retreat is designed for one thing: restoration of mind and body. Choose to rejuvenate at your own pace with a leisurely accommodation package, offering open access to the resort’s spa and fitness facilities. Or seek deeper renewal with a REVĪVŌ Signature Retreat, offering a fully tailored wellness experience led by expert practitioners. Each retreat begins with a one-on-one wellness consultation and includes personalised movement classes, daily spa therapies, nourishing meals at the plant-forward NŪTRIŌ restaurant, and advanced vitality treatments to support your body’s natural rhythms.",
      "location_subheading": "Indonesia",
      "price": 262,
      "original_price": 262,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000007pCsgAAE",
      "hero_image": "https://images.luxuryescapes.com/746awn6ig7ynil91y4sm",
      "image_two": "https://images.luxuryescapes.com/gk83kyu9j98gw6p4cda",
      "image_three": "https://images.luxuryescapes.com/bh30awe7ac74ogmemhe",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Bale Nusa Dua",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Ultra-Luxe Nusa Dua Private Pool Villas",
      "description": "Experience one of Nusa Dua’s most luxurious properties with a stylish escape to The Balé Nusa Dua by LifestyleRetreats - an intimate hideaway taking you a short walk from the pristine beaches, fantastic shopping precincts, stylish restaurants and local eateries of Nusa Dua. Bali bliss doesn’t get any better than this. Home to just 29 luxe villas, each with its own private pool, The Balé Nusa Dua by LifestyleRetreats offers guests a level of privacy that can’t be found in larger resorts. Boasting exceptional service, absolute tranquillity and upscale amenities including a luxurious day spa, fitness centre, two onsite restaurants, large double infinity pool with sunken loungers and shaded poolside cabanas - you’ll never want to leave.",
      "location_subheading": "Indonesia",
      "price": 260,
      "original_price": 260,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000005Ha6GAAS",
      "hero_image": "https://images.luxuryescapes.com/uzd9wbnh8awquhdnrd1",
      "image_two": "https://images.luxuryescapes.com/4lpkqpbzn8mvjps5itnso",
      "image_three": "https://images.luxuryescapes.com/f7uvma88bqsvkfl2spo",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Mulia, Nusa Dua, Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Award-Winning Five-Star Mulia Bali Beachfront Icon",
      "description": "A multi-award-winning celebrity favourite and legend of Bali’s Nusa Dua beachfront, Mulia Resort is the ultimate choice for your next indulgent escape. Considered one of the top resorts in the world, this five-star oasis was named one of Asia's best resorts at the Condé Nast Traveler Readers' Choice Awards 2020. It's not hard to see why this luxury resort receives A-list acclaim. Dotted among the palm-fringed grounds are four dreamy swimming pools, including an oceanfront infinity pool and cabanas; nine restaurants and bars serving everything from Chinese and Mediterranean fare to cocktails and high tea; the Mulia Spa with Finnish saunas and hydrotherapy pools; a kids’ club, tennis courts and more. With everything you could possibly want in one place, it might be easy to forget that some of Bali’s finest beaches await on the doorstep.",
      "location_subheading": "Indonesia",
      "price": 314,
      "original_price": 314,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GJD9AAO",
      "hero_image": "https://images.luxuryescapes.com/d3fhuim8suexpvdaiauu",
      "image_two": "https://images.luxuryescapes.com/2o5fld539oxgyyhkgx",
      "image_three": "https://images.luxuryescapes.com/p2fd4s5osljpwe5l1byo",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Apurva Kempinski Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Luxurious Five-Star Nusa Dua Kempinski Beachfront Resort",
      "description": "Step into unparalleled Kempinkski luxury at one of Bali's most highly-regarded beachfront hotels. Sitting on the golden shores of Nusa Dua and designed by award-winning architect Budiman Hendropurnomo, The Apurva Kempinski Bali’s palatial majesty is first observed from the outside. Private pool suites zigzag down its façade, a tiered masterpiece reflecting Bali's iconic terraced rice fields. Home to Bali's first aquarium dining experience, Koral Restaurant, the gourmet Japanese restaurant Izakaya by OKU, the extraordinary L'Atelier by Cyril Kongo lounge and more - five-star service is of the utmost importance, and its high-end facilities are of the same calibre. Dive into a remarkable 60-metre outdoor swimming pool dotted with palms and luxurious, partially submerged sunbeds, and a 40-metre kids' pool and waterslide nearby. Revel at one of Nusa Dua's best hotspots, the Reef Beach Club, complete with a sparkling 42-metre pool, beach cabanas, live music and some of the island's finest cocktails, or slow your mind with a healing treatment based on the Javanese philosophy of inner and outer harmony at the lavish The Apurva Spa.",
      "location_subheading": "Indonesia",
      "price": 283,
      "original_price": 283,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003IAIaAAO",
      "hero_image": "https://images.luxuryescapes.com/y4cnoc0zfdme1t6faamu",
      "image_two": "https://images.luxuryescapes.com/2n1t77p09dy5jg269dzq",
      "image_three": "https://images.luxuryescapes.com/uqcedhs38nntdvjigoiy",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Grand Mirage Resort & Thalasso Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Nusa Dua Beachfront Indulgence with Infinity Pool & 10 Onsite Dining Venues",
      "description": "Indulge in five-star opulence at this spectacular beachfront retreat located on Nusa Dua’s iconic golden shores. Whether it's a midnight snack, poolside cocktails or a multi-course feast, Grand Mirage’s round-the-clock offerings take luxury to a new level. Experience exceptional themed buffet dinners, alfresco delights and Italian, Chinese and Indonesian delicacies. Step out onto the secluded beachfront to sink your toes into powder-white sand. This resort features a seemingly endless array of prestigious facilities - set amid eight acres of lush tropical palms, the complex boasts three glittering outdoor pools, a watersport centre and a bespoke wellness sanctuary. Fun-filled adventures await - Head to Bali Collection for some of the island’s best shopping, Museum Pasifika for a glimpse of the region’s spectacular artistic heritage or practice your swing at the sweeping greens of Bali National Golf Club. Return to the comfort of Grand Mirage Resort & Thalasso Bali where extraordinary beaches await.",
      "location_subheading": "Indonesia",
      "price": 146,
      "original_price": 146,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlgHIAS",
      "hero_image": "https://images.luxuryescapes.com/mu9rr2ou95vkcshbkdrk",
      "image_two": "https://images.luxuryescapes.com/dzt4hjjtbpdh4p417wl",
      "image_three": "https://images.luxuryescapes.com/t4zorxhwgli3656ko6m",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Grand Hyatt Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Nusa Dua Beachfront Opulence with Five Pools & 10 Restaurants & Bars",
      "description": "Embrace world-class indulgence with everything you could want at your fingertips at this ultra-luxurious Bali favourite just steps from Nusa Dua Beach. Dotted among the palm-fringed grounds are five dreamy swimming pools and 10 restaurants and bars, serving everything from Indonesian to Mediterranean fare. Drawing inspiration from Balinese water palaces, Kriya Spa offers bespoke spa and wellness treatments delivered by professionally trained therapists. Find your zen, then sink your toes into the secluded stretch of white-sand beach or venture out to explore the vibrant art markets, historic temples and the lush landscapes of the surrounding area.",
      "location_subheading": "Indonesia",
      "price": 108,
      "original_price": 108,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000Cj3hEYAR",
      "hero_image": "https://images.luxuryescapes.com/k8vzunpd2ygzrvnqijqjc",
      "image_two": "https://images.luxuryescapes.com/3cjf4c80yed552n2rmmc",
      "image_three": "https://images.luxuryescapes.com/jh6q0gftfhhw6w0rl7j",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Nusa Dua Beach Hotel and Spa",
      "offer_country_name": "Indonesia",
      "location_heading": "Nusa Dua",
      "title": "Palatial Nusa Dua Elegance with Eight Restaurants & Bars, Three Pools & Spa",
      "description": "Embrace the essence of Balinese luxury at this five-star retreat on Bali’s southern peninsula. Designed to resemble a traditional Balinese palace, this beachfront sanctuary is surrounded by lush tropical gardens and offers direct access to the golden sands of Nusa Dua. With three sparkling outdoor pools, a serene spa and a Gecko Kids’ Club, it’s an ideal escape for both couples and families. Choose between five restaurants and three bars, from Mediterranean fare under the bamboo roof at Tamarind to cocktails and light bites at Chess Beachfront Bar. Whether you're lounging at the Pool Bar, indulging in a traditional massage or catching a performance at the open-air theatre, every moment here captures the island’s unique blend of culture, comfort and coastal charm.",
      "location_subheading": "Indonesia",
      "price": 101,
      "original_price": 101,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000JOgkmYAD",
      "hero_image": "https://images.luxuryescapes.com/gh8n05jgsanjdnlj9799",
      "image_two": "https://images.luxuryescapes.com/skbux6u1vcz215gvf3",
      "image_three": "https://images.luxuryescapes.com/acats9ppbkihh2vhfbse",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hotels in Nusa Dua - Indonesia Hotels & Travel Guide 2024",
    "description": "Find the best hotels in Nusa Dua, Indonesia with exclusive deals. Book your perfect getaway with up to 60% off.",
    "keywords": [
      "nusa dua hotels",
      "nusa dua travel",
      "indonesia hotels"
    ],
    "canonical": "https://mondoexplora.com/en/destination/nusa-dua",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/nusa-dua",
      "es": "https://mondoexplora.com/es/destination/nusa-dua",
      "fr": "https://mondoexplora.com/fr/destination/nusa-dua",
      "it": "https://mondoexplora.com/it/destination/nusa-dua"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 17,
    "average_price": 399,
    "average_discount": 10
  }
}