{
  "city": "Ubud",
  "country": "Indonesia",
  "country_code": "ID",
  "hero_title": "Hotels in Ubud",
  "description": "Discover the best hotels in Ubud, Indonesia. Find exclusive deals and luxury accommodations.",
  "hero_image": "https://images.luxuryescapes.com/fiql6kbr0be9e41p66vd",
  "hotels": [
    {
      "vendor_name": "Kaamala Resort Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Romantic Ubud Suites & Villas with Daily Breakfast, Daily Lunch or Dinner & Massages",
      "description": "Retreat to jungle-fringed paradise at this five-star romantic hideaway, perfect for those seeking a serene Ubud escape. Here, traditional stone and wood carvings are complemented by modern design, and sweeping views of terraced rice paddies and breathtaking valleys will leave you spellbound. At Habitat Bistro, signature Indonesian plates and panoramic views over treetops await. Absorb the beauty of the landscape from the resort’s infinity pool, complete with a large hammock overlooking the edge. Tap into the spiritual with daily yoga sessions or restore, renew and rejuvenate at the decadent Svaha Spa Bisma. While this tranquil oasis may leave you feeling miles away from the every day, the endless wonders of Ubud are all within close reach, including the Sacred Monkey Forest Sanctuary, Ubud Art Market and Ubud Palace.",
      "location_subheading": "Indonesia",
      "price": 449,
      "original_price": 998,
      "discount_percentage": 55,
      "link": "https://luxuryescapes.com/offer/006RF00000J2CrlYAF",
      "hero_image": "https://images.luxuryescapes.com/fiql6kbr0be9e41p66vd",
      "image_two": "https://images.luxuryescapes.com/8qgrw4n8xk24z9ojhbt",
      "image_three": "https://images.luxuryescapes.com/8vireg61g4i98xp7ypa",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 3,
      "end_date_utc": "2025-08-18 13:59:00"
    },
    {
      "vendor_name": "AnandaDara Ubud Resort & Spa",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Tranquil Ubud Rainforest Retreat with Daily Breakfast, Nightly Two-Course Dinner & Nightly Cocktails",
      "description": "Located just north of Ubud, the home of Bali’s famous rice terraces, this luxury resort and spa is truly at one with its lush natural surroundings. Lose yourself in tranquil landscaped gardens, soak in the poolside whirlpool or float away in a romantic flower bath followed by an indulgent river stone massage at l’santē AnandaDara SPA. Nestled moments from Ubud's culinary scene, the resort's de Daara eateries offer a tantalising blend of international flavours, from crowd-pleasers like authentic nasi goreng to gourmet pizzas, with its name taken from the Balinese word 'Daar' meaning 'eat'. While staying in Bali's most serene province, make the most of your location. Take a short drive to the nearby Ulu Petanu Waterfall, discover local art at the Ubud Market and relish in your proximity to the Tegallalang Rice Terraces - one of Bali's most photographed destinations.",
      "location_subheading": "Indonesia",
      "price": 349,
      "original_price": 1203,
      "discount_percentage": 71,
      "link": "https://luxuryescapes.com/offer/006RF00000IM67gYAD",
      "hero_image": "https://images.luxuryescapes.com/g098jb8unozr1n5kzqs",
      "image_two": "https://images.luxuryescapes.com/ni88bu98wkrxxz5lpt6",
      "image_three": "https://images.luxuryescapes.com/m19s0pfixowmgejrirr",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 3,
      "end_date_utc": "2025-08-06 13:59:00"
    },
    {
      "vendor_name": "Kappa Senses Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Ubud Rainforest Hideaway with Massages by Clarins, Daily Breakfast, Daily Lunch or Dinner & Cocktails",
      "description": "Reclaim your inner peace and reawaken the senses at this blissfully secluded hideaway amid the verdant jungle of Ubud. Showcasing luxurious, French-inspired style and the palatial OmTara Spa by Clarins - complete with vitality pools, steam, sauna and Vichy showers - this is the lush capital of well-being in Bali. Picture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort plucked from a dream. With five heavenly restaurants and bars, there’s a sanctuary to satisfy every craving, including Kokokan Restaurant’s innovative fine dining, featuring fresh produce from the resort’s onsite organic garden. From peaceful pavilions to the two remarkable jungle-clad pools and myriad walkways leading through lush foliage, this resort naturally integrates first-class facilities with pristine nature. Each day brings new adventures and a plethora of complimentary daily wellness, culture, and foodie activities.",
      "location_subheading": "Indonesia",
      "price": 559,
      "original_price": 1471,
      "discount_percentage": 62,
      "link": "https://luxuryescapes.com/offer/006RF00000J0I5GYAV",
      "hero_image": "https://images.luxuryescapes.com/yg2am5lm9iwiv2sfuks",
      "image_two": "https://images.luxuryescapes.com/w1ste415iciii093x35q",
      "image_three": "https://images.luxuryescapes.com/6i57am0snm5i7bcmizi7",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 3,
      "end_date_utc": "2025-08-04 13:59:00"
    },
    {
      "vendor_name": "E Sanctuary Resort Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Ubud Private Pool Villa Stay with Daily Breakfast, Nightly Dinner & Cocktails",
      "description": "Discover serenity in the heart of Ubud at this hillside retreat, nestled amid palms, rice terraces and tropical gardens. Wake to birdsong and forest vistas in your private pool villa, each featuring a private pool and warm interiors with indoor hot tubs for unwinding. Soothe body and mind with a traditional Balinese massage or a private yoga session at the on-site wellness centre. Savour mindful Balinese dishes at the picturesque Beiji Rainforest restaurant and sip on sundowners by the pool, while soaking up the greenery all around. Set just minutes from the Sacred Monkey Forest and Ubud Palace, cultural adventures are always close by.",
      "location_subheading": "Indonesia",
      "price": 419,
      "original_price": 776,
      "discount_percentage": 46,
      "link": "https://luxuryescapes.com/offer/006RF00000J0KF7YAN",
      "hero_image": "https://images.luxuryescapes.com/3ml9hd06hmzr1ab0rfj",
      "image_two": "https://images.luxuryescapes.com/5pi99d9lle9h06f0b7cs",
      "image_three": "https://images.luxuryescapes.com/5u8lfwvz8n9vzq29hq6q",
      "deal_tier": "Lifestyle Brands on Luxury Escapes",
      "min_duration": 3,
      "end_date_utc": "2025-08-30 13:59:00"
    },
    {
      "vendor_name": "Kayumanis Ubud Private Villa & Spa",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Ubud Riverfront Private Pool Villas with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
      "description": "Escape to Ubud's lush green rice paddies and discover your private slice of island paradise at this five-star boutique retreat, home to just 23 elegantly appointed villas, each offering high-end butler service, a glistening private pool and quintessential Balinese design. Hidden within a tropical forest overlooking the Ayung River, heavenly Kayumanis Ubud Private Villa & Spa radiates tranquillity - yet is just a 15-minute drive from Bali's vibrant cultural capital, Ubud. Indulge in a wealth of wellness treatments at Kayumanis Spa Ubud, or treat yourself to a romantic feast high over the river valley at Dining Corner. Embrace the beauty of the Balinese jungle and the vibrancy of Ubud, home to world-class restaurants and shopping. Take a short drive and discover innumerable nearby temples or the popular Aloha Ubud Swing, a perfect spot to take in sweeping vistas of rice paddies, rainforests, lakes and waterfalls. Visit thousands of Balinese long-tailed macaque monkeys within their home at the Sacred Monkey Forest Sanctuary, or journey an extra five minutes to Goa Gajah Elephant Cave temple.",
      "location_subheading": "Indonesia",
      "price": 679,
      "original_price": 2122,
      "discount_percentage": 68,
      "link": "https://luxuryescapes.com/offer/006RF00000InSbtYAF",
      "hero_image": "https://images.luxuryescapes.com/axspyug6wtmrt4wk0iwp",
      "image_two": "https://images.luxuryescapes.com/ix38947tiuqjdsexmuql",
      "image_three": "https://images.luxuryescapes.com/aoi4kw0edp661vvg8dj9",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 3,
      "end_date_utc": "2025-08-15 13:59:00"
    },
    {
      "vendor_name": "Kappa Senses Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "French-Inspired Five-Star Ubud Jungle Luxury with Private Pool Villas & Rice Paddy Views",
      "description": "Reclaim your inner peace and reawaken your senses at Kappa Senses Ubud, a blissfully secluded hideaway amid the verdant jungle of Ubud. Showcasing luxurious, French-inspired style, five relaxing restaurants and bars and a dreamy 1,000sqm OmTara Spa by Clarins, this is the lush capital of wellbeing in Bali. Picture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort where dreams and reality blend seamlessly.",
      "location_subheading": "Indonesia",
      "price": 227,
      "original_price": 227,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000FNKQUAA5",
      "hero_image": "https://images.luxuryescapes.com/n7pa4dvvm27kozos1w4",
      "image_two": "https://images.luxuryescapes.com/qxbr5uxo3j9pn0rtnbc",
      "image_three": "https://images.luxuryescapes.com/db65rtgneeijt7cce0s9",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Aksari Resort Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Romantic Ubud Jungle Paradise with Infinity Pool",
      "description": "Discover a new level of romantic luxury at Aksari Resort Ubud, a contemporary collection of suites and villas nestled in the lush valleys of Bali's Ubud. Take a dip in the cascading infinity pool perched over the jungle, recharge your body and mind with a decadent massage or spa treatment at Svaha Spa and dive into authentic Indonesian cuisine at Ankhusa or Japanese delicacies at Kojin Teppanyaki Restaurant.",
      "location_subheading": "Indonesia",
      "price": 156,
      "original_price": 156,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CQR66AAH",
      "hero_image": "https://images.luxuryescapes.com/ngqe6loqpymp8m31yxl",
      "image_two": "https://images.luxuryescapes.com/lsrsm4qq7pqv25losb8",
      "image_three": "https://images.luxuryescapes.com/jluc2gzucomxu75815",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Samaya Ubud Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Idyllic Five-Star Villa Sanctuary in the Heart of Ubud with Private Pools & Onsite Spa",
      "description": "A collection of impeccably designed villas set deep in the heart of Ubud’s lush rainforest and verdant rice paddies, five-star Bali relaxation awaits at The Samanya Ubud Bali. Feel at peace as you arrive on the tranquil grounds and make your way to your private, incredibly spacious villa. Relieve any lingering tension with a rejuvenating trip to the resort’s spa, and leave the gastronomy and mixology to the professionals with a feast at either Swept Away or Scene restaurant.",
      "location_subheading": "Indonesia",
      "price": 251,
      "original_price": 251,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DpUP3AAN",
      "hero_image": "https://images.luxuryescapes.com/xgo0odmthfv8t20qnra",
      "image_two": "https://images.luxuryescapes.com/cy6o07vdfflkyiuaa4r",
      "image_three": "https://images.luxuryescapes.com/43mimh3csj6j0te0xz54",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Alila Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Ubud Hillside Hideaway Overlooking Ayung River Valley with Wellness Program, Spa & Pool",
      "description": "High above the Ayung River, stay at a secluded hillside sanctuary that blends Balinese charm with natural beauty. Hidden within Bali’s central foothills, a lush path of coconut and banana trees welcomes you to this tranquil retreat. From its elevated vantage, the resort offers views of the emerald jungle canopy and alang-alang plantations that stretch endlessly into the horizon. Within this architectural masterpiece, designed to resemble a Balinese village, savour authentic Balinese cuisine at onsite Plantation Restaurant, or rejuvenate your senses at Spa Alila. Just five kilometres from Ubud’s artistic heart, you're invited relax, rejuvenate, and connect with the enchanting spirit of Bali’s verdant landscapes.",
      "location_subheading": "Indonesia",
      "price": 135,
      "original_price": 135,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000Cj3hGYAR",
      "hero_image": "https://images.luxuryescapes.com/65wipqqc5j2n6q4rtoe",
      "image_two": "https://images.luxuryescapes.com/ls5t8k9m3xqihqvxvf",
      "image_three": "https://images.luxuryescapes.com/ewx30ysegohsjr3gfb5l",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Kayumanis Ubud Private Villa & Spa",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Ubud Five-Star Pool Villa Luxury with Butler Service",
      "description": "Escape to the lush, undulating hills of Ubud in search of your own private slice of Bali paradise at the five-star Kayumanis Ubud Private Villa & Spa, an urban sanctuary ranked among Tripadvisor’s top 10% of properties worldwide. This luxury retreat is home to just 23 elegantly appointed villas, each offering butler service and private pools. Hidden within a tropical forest overlooking the Ayung River, and home to an intimate collection of one, two and three-bedroom villas, this heavenly retreat radiates tranquility, while only five minutes from the artists' village of Ubud. Unwind with a day of pampering at Kayumanis Spa Ubud or indulge in a romantic feast high over the river valley at Dining Corner. Take in Ubud's beauty with a guided tour, enrich your home recipes with onsite cooking classes or learn how to relax, meditate and harmonise your body through yoga (surcharges apply to activities).",
      "location_subheading": "Indonesia",
      "price": 225,
      "original_price": 225,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y0000070HUzAAM",
      "hero_image": "https://images.luxuryescapes.com/5u3fcae93a8alxirjx4c",
      "image_two": "https://images.luxuryescapes.com/f82xbntc1ccaejq2a2ly",
      "image_three": "https://images.luxuryescapes.com/v84pamwa1fjqhjky7e8n",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Arkamara Dijiwa Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Elegant Five-Star Ubud Jungle Oasis near Sacred Monkey Forest",
      "description": "Escape to a five-star, evergreen wonderland close to Bali’s iconic Sacred Monkey Forest Sanctuary at the gorgeous Arkamara Dijiwa Ubud. Enjoy genuine hospitality, the harmony of a traditional Balinese village and pure tranquillity within the scenic surroundings and glistening outdoor pools of this retreat. Your days will be spent luxuriating at the onsite Kamalini Spa, treating your tastebuds to elegant Indonesian cuisine at Kaukau Restaurant or sipping a sundowner at Akasa Rooftop Bar.",
      "location_subheading": "Indonesia",
      "price": 120,
      "original_price": 120,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DQpgrAAD",
      "hero_image": "https://images.luxuryescapes.com/2a8mgg0ut6fhr9jmcp5n",
      "image_two": "https://images.luxuryescapes.com/wip9fjbal88r571lcqos",
      "image_three": "https://images.luxuryescapes.com/5mmv6rphrs7nbqogt8",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Bambu Indah Resort",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Boutique Ubud Eco-Luxury Jungle Retreat with Natural Pools & Rejuvenating Spa",
      "description": "Immerse yourself in the tranquillity of a Balinese jungle and be in harmony with nature at this luxurious sustainable stay, cradled in the heart of Ubud and perched by a babbling river. Rejuvenate amid the rich forest foliage, breathe in the crisp air, take a refreshing dip in the spring-fed natural pools and pamper yourself with authentic Balinese treatments in the stunning massage pods. Boasting uniquely curated organic bamboo houses, choose to stay high up in the treetops or by the river and indulge in unparalleled luxury. Tuck into farm-to-table delights and Balinese delicacies at the picturesque The Riverside Warung, and sip on fruity cocktails at The Elevator Sunset Bar. If you wish to explore, there are plenty of hiking trails and walking tours to embark on nearby, while Ubud's cultural icons are only moments away.",
      "location_subheading": "Indonesia",
      "price": 208,
      "original_price": 208,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000IeZmiAAF",
      "hero_image": "https://images.luxuryescapes.com/yh1biff7dihsfvwo67b",
      "image_two": "https://images.luxuryescapes.com/9y4ncoab4rrumihcq9ix",
      "image_three": "https://images.luxuryescapes.com/q2s8m7yolf5jlzp4ynvr",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Asvara Villa Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Romantic Ubud Private Pool Villas with Daily Breakfast & Beach Club Entry",
      "description": "Discover the lush jungles, temples and art markets of Ubud when you stay at Asvara Villa Ubud, a romantic all-villa hideaway surrounded by evergreen rice fields. It's all too easy to forget about the rest of the world in your own private villa, complete with a private swimming pool, bubbling jacuzzi, kitchenette and breezy lounge. When you're not enjoying candle-lit dinners and floating breakfasts, venture out to Ubud centre - just 15 minutes away by car - and immerse yourself in the local culture.",
      "location_subheading": "Indonesia",
      "price": 190,
      "original_price": 190,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CQRAIAA5",
      "hero_image": "https://images.luxuryescapes.com/i3sj66suocxbp1f7w6d",
      "image_two": "https://images.luxuryescapes.com/68ah6ku7itrhdka04v",
      "image_three": "https://images.luxuryescapes.com/tnci1srayic12kd2t1xn",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Blue Karma Dijiwa Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Ubud Jungle Sanctuary with Yoga & Wellness Spa",
      "description": "Shut the world out from your private sanctuary at Blue Karma Dijiwa Ubud. Tucked away in the tranquil Ubud jungle, this magnetic hideaway beckons guests to indulge in the theraputic sounds of sprawling Balinese wildlife while blurring the lines between the outdoors and in. Rejuvinate your mind and body with a superfood meal at the Botanist Restaurant, where local produce are championed in nutrient-rich dishes, or immerse yourself in a full-body wellness treatment at Flying Bamboo Spa.",
      "location_subheading": "Indonesia",
      "price": 122,
      "original_price": 122,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DQpeqAAD",
      "hero_image": "https://images.luxuryescapes.com/4wrjdc6dum47wq43erlb",
      "image_two": "https://images.luxuryescapes.com/6anly7dxnhe063aa97xk",
      "image_three": "https://images.luxuryescapes.com/w3fq2ndlc5ofqc4rpuo4",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "COMO Uma Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Ubud Five-Star Jungle Haven with Italian-Inspired Dining",
      "description": "Allow the artful spirit of Ubud to take hold when you stay at the five-star COMO Uma Ubud, a jungle sanctuary enveloped by coconut palms and banyan trees on the cusp of the Tjampuhan Valley. The outdoor terrace is the perfect place to catch balmy breezes and at the celebrated Uma Cucina, an Italian-inspired restaurant and lounge bar serving antipasto platters or ribbons of silky pasta alongside innovative cocktails from a menu curated by Lewis Wilkinson, a leading London mixologist. Slip into total bliss at the top-rated wellness centre, a tranquil haven with decadent spa treatments including a soothing Indonesian massage, plus a yoga pavilion and a 25-metre swimming pool.",
      "location_subheading": "Indonesia",
      "price": 243,
      "original_price": 243,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CNx4tAAD",
      "hero_image": "https://images.luxuryescapes.com/xjltgtcerhad561yb50b",
      "image_two": "https://images.luxuryescapes.com/xqxgr087rrbi5twpchsq",
      "image_three": "https://images.luxuryescapes.com/o0ydo2ua2khkzgb0i5dj",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Maya Ubud Resort & Spa",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Serene Five-Star Ubud Retreat",
      "description": "Indulge in the ultimate feeling of five-star bliss at the breathtaking Maya Ubud Resort & Spa - a stunning Balinese sanctuary that offers guests complete serenity. Cradled by the dramatic Petanu River valley and the rolling rice paddies of Peliatan, Maya Ubud is a jewel within a tranquil 10-hectare tropical haven. From here, it's a leisurely 25-minute stroll to vibrant Ubud town, bursting with artisan markets, colourful boutiques and world-class restaurants. Designed to capture the spirit of a traditional Balinese village, this ultra-luxe retreat combines local elegance and hospitality with a true five-star experience. Reconnect with nature and plunge into the glistening infinity pool overlooking the enchanting forest, experience euphoria at Maya Spa with a rejuvenating treatment beside the swirling waters of Petanu River, or spend each morning aligning your chakras at the tranquil Bale Raga Yoga Studio. Live the good life in a carefully designed suite or villa, beautiful spaces bathed in natural light and boasting verdant vistas across the lush surrounds.",
      "location_subheading": "Indonesia",
      "price": 121,
      "original_price": 121,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GPqtAAG",
      "hero_image": "https://images.luxuryescapes.com/kceezyxnqqsgat6kuc5h",
      "image_two": "https://images.luxuryescapes.com/6ujv333oqoodbknkj0d",
      "image_three": "https://images.luxuryescapes.com/4wpl1vcpqr7nc52as0qz",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Khastana Hadi Resort Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Ubud Pool Villa Oasis near Heritage-Listed Rice Terraces with Jungle Views",
      "description": "Run away to the misty hills of Ubud and relax like never before in your private villa among the verdant jungle. Spend your days exploring the UNESCO World Heritage-listed Tegallalang Rice Terraces, savour bold Balinese flavours at the bustling Ubud Market or find inner peace at the sacred Tirta Empul Temple. With two- and three-bedroom villa variations to choose from, the whole family can enjoy quality time at Khastana Hadi Resort Ubud. Luxuriate in your private pool amid stunning jungle surroudnings, or rejuvenate your senses with indulgent in-villa massages. For the food enthusiasts, cooking classes and seafood dinners can be arranged in your villa.",
      "location_subheading": "Indonesia",
      "price": 652,
      "original_price": 652,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000IxCIvYAN",
      "hero_image": "https://images.luxuryescapes.com/hyf6v5ymmt6sspiisfts",
      "image_two": "https://images.luxuryescapes.com/z4oxfpyqmqk90t4tfdci",
      "image_three": "https://images.luxuryescapes.com/9nfb9yshqq4nvs233as",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Kaamala Resort Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Romantic Ubud Suite Escape with Infinity Pool",
      "description": "Retreat to the ultimate jungle-fringed paradise at Kaamala Resort Ubud, a romantic haven perfect for those seeking a serene escape. Absorb the beauty of the terraced rice paddies and breathtaking valleys from the resort's stunning infinity pool, complete with an oversized hammock swaying at its edge. Tap into your spiritual side with daily yoga sessions or be pampered at Svaha Spa. Later, be sure to refuel at Habitat Bistro, where signature local and international dishes await.",
      "location_subheading": "Indonesia",
      "price": 197,
      "original_price": 197,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CQR87AAH",
      "hero_image": "https://images.luxuryescapes.com/uc4cmq6oazsfqnnqvdr",
      "image_two": "https://images.luxuryescapes.com/73kti6pxb330o4gqjb",
      "image_three": "https://images.luxuryescapes.com/jzy605nmvcbtogc79dph",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Purist Villas and Spa",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Boutique Ubud Jungle Retreat",
      "description": "Find your jungle-fringed paradise at The Purist Villas and Spa, a boutique resort set among the rolling green hills of Ubud, Bali’s spiritual heart. Nestled amid lush gardens, the resort offers 18 unique, contemporary suites and villas to choose from, each one more stunning than the last. Enjoy peaceful seclusion tucked away behind rural roads, terraced rice fields and layers of jungle, while Ubud’s central hub is only a five-minute drive away, so you’re never too far from small-town convenience. Spend blissful days by the pool (there are two to choose from), book in an indulgent spa treatment at the onsite Purist Spa, join a yoga class or dine alfresco on classic Indonesian cuisine at Café Balisimo. This is the perfect place to relax and recharge. Meanwhile, the serenity of Ubud, along with its cultural curiosities - galleries, local street markets and temples - is a breath of fresh air from the everyday.",
      "location_subheading": "Indonesia",
      "price": 147,
      "original_price": 147,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004iCXlAAM",
      "hero_image": "https://images.luxuryescapes.com/dx9g8q9yzq41245ib55",
      "image_two": "https://images.luxuryescapes.com/kowve5gqfe6es31aomoq",
      "image_three": "https://images.luxuryescapes.com/oyppkmtsqbsm5g0gczzb",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Hanging Gardens of Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Secluded Jungle Pool Villas near Ubud",
      "description": "Suspended over the lush jungle, bursting with orchids, bamboo, and coffee trees, Hanging Gardens of Bali is an exotic Eden near Ubud. Watch the world melt away from the famed two-tier pool, which appears to float above the mist-covered forest below. Marvel at awe-inspiring views that stretch down to the Ayung River, across the valley to the sacred Dalem Segara Temple, discover the vibrance of Ubud Town - less than a 30-minute shuttle away - and find serenity in the riverside spa by The Spa Collection. Romantic pathways lead to Hanging Gardens of Bali’s 44 secluded pool villas, and getting around this vertiginous property is simple: you’ll be whisked up and down the hill via the onsite monorail. Dining at the Feng Shui-inspired Three Elements Restaurant is an award-winning feast for the senses. Here, enjoy not only a tantalising culinary journey, but also views of the pool, valley, and, after dusk, the glow of hundreds of romantic candles.",
      "location_subheading": "Indonesia",
      "price": 818,
      "original_price": 818,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GlA8AAK",
      "hero_image": "https://images.luxuryescapes.com/3c44dr28id36mj5ojpqe",
      "image_two": "https://images.luxuryescapes.com/461v0mz97ep2aa1fn8wo",
      "image_three": "https://images.luxuryescapes.com/4xr6vh575c29cx940ql37",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Nandini Jungle By Hanging Gardens",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Five-Star Ubud Boutique Retreat within Payangan Rainforest",
      "description": "Escape to a five-star oasis perched above the Ayung River at Nandini Jungle by Hanging Gardens, a serene destination located in the heart of the Payangan Rainforest. After busy days exploring the bustling vibrance of Ubud or traversing through the concealed jungle paths, retreat to this intimate haven to enjoy a luxurious massage, practice yoga or simply relax around the outdoor swimming pool. As the sun sets, head to Wild Ginger Restaurant to enjoy the traditional culinary delights on offer.",
      "location_subheading": "Indonesia",
      "price": 187,
      "original_price": 187,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009FbPiAAK",
      "hero_image": "https://images.luxuryescapes.com/imcued181gbh3fd3g5o",
      "image_two": "https://images.luxuryescapes.com/o4i8mfnp97q8aa338g3",
      "image_three": "https://images.luxuryescapes.com/934noxnegfjpfxsg42q7",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Viceroy Bali",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Multi-Award-Winning Five-Star Ubud Sanctuary Perched Above Petanu River Gorge",
      "description": "Discover a New Type of Tropical Paradise at Viceroy Bali. Viceroy Bali is a five-star sanctuary nestled in a steep ravine overlooking the tranquil Petanu Valley, part of the exclusive Small Luxury Hotels of the World (SLH) Finest Collections. Sitting on a steep ravine, overlooking the Petanu Valley, this luxury hotel is surrounded by rich Balinese jungle but is just five minutes from the centre of bustling Ubud. Here, you’ll find some of the island’s best restaurants, magnificent markets and independent boutiques, full of unique artisan gifts. Intimate and family-run (a true rarity for a five-star hotel in Bali), Viceroy Bali is home to 40 suites and villas, each with thatched roofs, sweeping views of perfectly placed palm trees, private pools and luxurious amenities. The list of awards is lengthy and includes accolades from the Small Luxury Hotels of the World Awards and Galatian Signature Hotels Awards for 2020 alone. While leaving your sumptuous sanctuary is optional, there’s more to explore. Discover true tranquility at Akoya Spa, where treatments combine traditional Balinese techniques with modern wellness knowledge. Delight in the finest dining at Apéritif Restaurant, an elegant 1920s-inspired venue serving a distinguished degustation menu that celebrates high-quality ingredients and offering a borderless food experience that transcends traditional culinary boundaries. For a more laid-back experience, CasCades Restaurant presents a delicious selection of traditional Indonesian dishes alongside Western classics, all set in a stunning environment. For those seeking a sophisticated yet relaxed atmosphere, Pinstripe Bar offers expertly crafted cocktails, fine spirits, and an ambiance that perfectly complements the vibrant energy of Ubud.",
      "location_subheading": "Indonesia",
      "price": 542,
      "original_price": 542,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y0000037J5xAAE",
      "hero_image": "https://images.luxuryescapes.com/tobti09yp57al4lk0i",
      "image_two": "https://images.luxuryescapes.com/mvmxwqwdf92x1383b7am",
      "image_three": "https://images.luxuryescapes.com/re7gs9cid38ezr39job8",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "COMO Shambhala Estate",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Five-Star Award-Winning Ubud Jungle Wellness Sanctuary on the Ayung River",
      "description": "Let the rest of the world melt away when you succumb to bliss at COMO Shambhala Estate, an award-winning wellness sanctuary resting on the banks of the Ayung River, just outside of Ubud. At its heart, the resort is dedicated to achieving balance through holistic means. World-class facilities include nine treatment rooms and three treatment pavilions, each with verdant jungle panoramas, plus an outdoor vitality pool for hydrotherapy and a top-of-the-range yoga pavilion. To complement your well-being journey, indulge in nutritious and seasonal dishes at Glow, where you can watch your food being prepared in the open kitchen. Meanwhile, Indonesia's complex flavours and spices await at Kudus House, housed within a 150-year-old former Javanese residence.",
      "location_subheading": "Indonesia",
      "price": 700,
      "original_price": 700,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CNxJjAAL",
      "hero_image": "https://images.luxuryescapes.com/iic9dv32jyv6azgowm5",
      "image_two": "https://images.luxuryescapes.com/yy6kjczvdigunoswrgfv",
      "image_three": "https://images.luxuryescapes.com/9hsuss399jb5i2oxjqgd",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Five-Star Award-Winning Ubud Suites near Bali's Rice Paddies",
      "description": "Escape to the undulating hills of Ubud in search of serenity and rejuvenation at the five-star Tanah Gajah, a Resort by Hadiprana. This luxury retreat is home to just twenty suites and villas, each featuring unique artwork, traditional elegance and modern-day comforts in natural Balinese surrounds. Hidden within 12 acres of verdant emerald rice paddies, this heavenly resort radiates peace, quiet and tranquility, but is just ten minutes from the artists' village of Ubud. Unwind with a day of pampering at the spa, indulge in a romantic feast amidst the rice paddies, or witness the beauty of the region from above with Bali’s first hot-ballooning adventure.",
      "location_subheading": "Indonesia",
      "price": 543,
      "original_price": 543,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GuwiFAAR",
      "hero_image": "https://images.luxuryescapes.com/0xhj871s5dophn5p76wc",
      "image_two": "https://images.luxuryescapes.com/cyrcjojc34ccuk2peqv",
      "image_three": "https://images.luxuryescapes.com/ww1mxo3m7fhm0o071rb8",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Sanctoo Suites & Villas",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Tranquil Five-Star Ubud Retreat near Bali Zoo",
      "description": "Indulge in five-star jungle bliss at Sanctoo Suites & Villas, a serene sanctuary tucked away in the region of Gianyar, adjacent to Bali Zoo and around 20 minutes from Ubud's centre. This peaceful patch is inspired by its locale, with a lagoon pool that mimics the natural water holes of the African savannah and tranquil vistas over Wos River. Revive your senses at Sanctoo Spa with a hot stone massage or organic facial, or visit Sanctoo Restaurant for wholesome Balinese dishes.",
      "location_subheading": "Indonesia",
      "price": 145,
      "original_price": 145,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CO9ZiAAL",
      "hero_image": "https://images.luxuryescapes.com/pssmdy9o4l2woap41omk",
      "image_two": "https://images.luxuryescapes.com/xlp2ld70xgfvu2hnmg",
      "image_three": "https://images.luxuryescapes.com/mym1wgu0ma4rv6q0n5",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Capella Ubud",
      "offer_country_name": "Indonesia",
      "location_heading": "Ubud",
      "title": "Unique Capella Ubud Luxury Tents in the Lush Rainforest with Private Pools",
      "description": "Where natural wonder meets boutique luxury completely surrounded by the beauty of Ubud's rainforest, Capella Ubud, Bali is the serene sanctuary crowned 'Best Upcountry Hotel' in Travel + Leisure's Luxury Awards Asia Pacific 2023. This exclusive retreat spans a collection of heritage-inspired tents and one lodge, all with private pools, that weave together to form an opulent camp rich with decor inspired by Bali's past. Savor culinary delights at Mads Lange, as you join in paying homage to the famed Danish spice trader, and Api Jiwa, where bold flavours inspired by Asian omakase dance on your palate. Toast with craft cocktails at The Mortar and Pestle Bar while munching on light snacks and listening to the sweet sounds of the forest. Relax in the Officer's Tent, exclusively for camp residents, or gather around the campfire for storytelling evenings under the twinkling sky. Stay active throughout your stay at The Armory, the camp's tented gymnasium, offering state-of-the-art equipment and guided wellness activities from yoga to village biking. The site’s 120sqm outdoor rainforest pool invites you to swim amidst nature's beauty and Capella’s day spa, Auriga Wellness, takes you on a journey of pampering and spiritual healing.",
      "location_subheading": "Indonesia",
      "price": 950,
      "original_price": 950,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GQ6o0AAD",
      "hero_image": "https://images.luxuryescapes.com/4xxzwa9fmor0zqkxzkbe",
      "image_two": "https://images.luxuryescapes.com/slsoalr027qlkam6x3",
      "image_three": "https://images.luxuryescapes.com/6xajpdid0eyfyb2lp5lk",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hotels in Ubud - Indonesia Hotels & Travel Guide 2024",
    "description": "Find the best hotels in Ubud, Indonesia with exclusive deals. Book your perfect getaway with up to 60% off.",
    "keywords": [
      "ubud hotels",
      "ubud travel",
      "indonesia hotels"
    ],
    "canonical": "https://mondoexplora.com/en/destination/ubud",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/ubud",
      "es": "https://mondoexplora.com/es/destination/ubud",
      "fr": "https://mondoexplora.com/fr/destination/ubud",
      "it": "https://mondoexplora.com/it/destination/ubud"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 26,
    "average_price": 359,
    "average_discount": 12
  }
}