{
  "city": "Auckland",
  "country": "New Zealand",
  "country_code": "NZ",
  "hero_title": "Hoteles en Auckland",
  "description": "Descubre los mejores hoteles en Auckland, New Zealand. Encuentra ofertas exclusivas y alojamientos de lujo.",
  "hero_image": "https://images.luxuryescapes.com/d0h70tqtuc3xbzr3rrf",
  "hotels": [
    {
      "vendor_name": "Swiss-Belsuites Victoria Park, Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Chic Central Auckland Self-Contained Apartments with City Views & Daily Breakfast",
      "description": "Experience a slice of Auckland's urban sophistication with an elegant stay at this luxurious all-suite abode, perfectly situated near the iconic Victoria Park and the vibrant Viaduct Harbour. Boasting a stylish collection of self-contained apartments, this centrally placed address offers all the luxuries you'd expect from a world-class apartment hotel, including state-of-the-art kitchens, living and dining spaces and breathtaking city vistas. When it's time to explore, you'll find yourself close by popular attractions like the Sky Tower and Queen Street's bustling shops, while Federal Street's culinary treats are within easy reach. After a day of urban explorations, return to your well-appointed suite and unwind in style.",
      "location_subheading": "New Zealand",
      "price": 249,
      "original_price": 755,
      "discount_percentage": 67,
      "link": "https://luxuryescapes.com/offer/006RF00000IMpZNYA1",
      "hero_image": "https://images.luxuryescapes.com/d0h70tqtuc3xbzr3rrf",
      "image_two": "https://images.luxuryescapes.com/9em0lfcoxw8hshzu41q",
      "image_three": "https://images.luxuryescapes.com/jiyn8hjvn9aixgzlbe6r",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 2,
      "end_date_utc": "2025-08-06 13:59:00"
    },
    {
      "vendor_name": "QT Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Contemporary Auckland Harbourside City Break with Nightly Drinks, Daily Dining Credit & Rooftop Bar",
      "description": "Nestled in the heart of Auckland, this hotel puts you steps away from the city’s vibrant dining, fashion and arts scene. Here, you'll experience eclectic decor, world-class hospitality and decadent living, along with an unbeatable harbourside location. After a day of exploring, unwind in your sophisticated accommodation or head to the Rooftop at QT where peak drink-and-dine moments unfold against the city’s stunning skyline. For a taste of the Mediterranean, indulge at the onsite restaurant, Esther, bringing flavours inspired by sun-soaked shores to Auckland’s Viaduct Harbour, curated by renowned head chef Sean Connolly.",
      "location_subheading": "New Zealand",
      "price": 289,
      "original_price": 657,
      "discount_percentage": 56,
      "link": "https://luxuryescapes.com/offer/006RF00000GZiJiYAL",
      "hero_image": "https://images.luxuryescapes.com/1zo2daposa87iv53bijm",
      "image_two": "https://images.luxuryescapes.com/6tybs85v3eke00fcbchk",
      "image_three": "https://images.luxuryescapes.com/71s5x8x9y6109jtiycp",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 2,
      "end_date_utc": "2025-08-06 13:59:00"
    },
    {
      "vendor_name": "Hotel Indigo Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Grand Opening: Midtown Auckland Elegance with Four-Course Dinner, Daily Breakfast & Valet Parking",
      "description": "Discover Auckland from a fresh perspective at this brand-new, design-led hotel in the heart of Midtown. Once home to Dexter and Crozier's 'The Motor House', this heritage-meets-modern retreat offers sweeping views of the harbour and Sky Tower, which is just steps away. Each floor doubles as a mini gallery that celebrates local artistry while the vibrant neighbourhood outside beckons with diverse cuisines and entertainment. Begin your day at Bistro Saine, where French-inspired breakfast favourites - like caramelised crepes and creamy potato gratin - set the tone for adventure. With the Auckland Art Gallery and Auckland Domain nearby, this hotel's central location places the best of the city within easy reach. With valet parking and a front desk team ready to point you toward the city's hidden gems, this is your gateway to the soul of the city.",
      "location_subheading": "New Zealand",
      "price": 249,
      "original_price": 655,
      "discount_percentage": 62,
      "link": "https://luxuryescapes.com/offer/006RF00000HzY1NYAV",
      "hero_image": "https://images.luxuryescapes.com/p7614a06fbcks2ouq9q",
      "image_two": "https://images.luxuryescapes.com/vaiqkbkiy4j5mbcjcv8",
      "image_three": "https://images.luxuryescapes.com/3tpdowys72qs4c6lu1l",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 2,
      "end_date_utc": "2025-08-30 13:59:00"
    },
    {
      "vendor_name": "InterContinental Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Luxurious InterContinental Auckland Stay Steps from the Waitemata Harbour",
      "description": "Experience the best of Auckland's waterfront from the luxurious InterContinental Auckland, an IHG Hotel. Situated in the heart of the city, this five-star hotel offers a unique vantage point to explore the iconic Waitemata Harbour. Take a stroll and explore Commercial Bay, the city's shopping and dining hub, or enjoy a delicious meal at the hotel's signature restaurant. For more of an adventure, take a short ferry ride to Waiheke Island for a day of wine tasting and breathtaking views.",
      "location_subheading": "New Zealand",
      "price": 165,
      "original_price": 165,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Ez1F7AAJ",
      "hero_image": "https://images.luxuryescapes.com/hh7oxq8vtguxwukqpvn5",
      "image_two": "https://images.luxuryescapes.com/wk7jz809zly60ijfkp6",
      "image_three": "https://images.luxuryescapes.com/1b2l0uzox9zj6hfcq6vl",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "QT Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Designer QT Escape near Auckland Harbour with Rooftop Bar",
      "description": "On the shimmering shoreline of Viaduct Harbour, the vibrant QT Auckland will plunge you into nautical-inspired luxury as the city unfurls before you like a string of pearls. The fine dining of the waterfront Wynyard Quarter beckons, while the Rooftop at QT bar, soaring above the City of Sails, is set for good times - the perfect place to clink glasses together as dusk falls over the city’s glittering lights. Come for the eclectic rooms, the enviable location, and the world-class dining onsite. Celebrated international chef Sean Connolly’s newest restaurant, Esther, invites you to coast along the French Riviera, enjoy a pitstop in Sicily, then get lost in the magnificence of Morocco.",
      "location_subheading": "New Zealand",
      "price": 138,
      "original_price": 138,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004v0x1AAA",
      "hero_image": "https://images.luxuryescapes.com/66y6wc2mlpk1h48y0oenl",
      "image_two": "https://images.luxuryescapes.com/fw380b7ewq2y73uzuksg",
      "image_three": "https://images.luxuryescapes.com/k2qce3u85j6mdtrlf1rh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Avani Auckland Metropolis Residences",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Auckland Self-Contained Apartment-Style Suites Opposite Albert Park",
      "description": "Auckland's sailboat-studded harbour is the perfect place to enjoy fresh sea breezes, cosmopolitan vibes and spellbinding natural scenery - best enjoyed from Avani Auckland Metropolis Residences. Walk through the wow-factor lobby, a century-old former courthouse, and discover an indoor lap pool, fitness centre and sauna. The self-contained apartment-style suites have everything you need for a comfortable stay, including fully-equipped kitchens and laundry facilities.",
      "location_subheading": "New Zealand",
      "price": 87,
      "original_price": 87,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BU9LAAW",
      "hero_image": "https://images.luxuryescapes.com/sr7it8xo5uig2shzo7o",
      "image_two": "https://images.luxuryescapes.com/enuw2aljldor7ukt79xh",
      "image_three": "https://images.luxuryescapes.com/opjyx9xq3qe5kbtfnc26",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Auckland Ellerslie",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Sleek Auckland Retreat 15 Minutes from CBD with Onsite Dining & Garden Bar",
      "description": "Choose to stay in or explore Auckland with a stay at this ideally positioned hotel just 15 minutes from the city's thriving business district. Unwind in rooms with pleasing views and pleasant hues, with all modern comforts perfect for a relaxing escape. Savour mouthwatering dishes at the onsite Acacia Restaurant or enjoy an alfresco drink at the contemporary Acacia Garden Bar. Just a short stroll from the hotel, you'll find the Ellerslie Racecourse and the Auckland Botanic Gardens. Venture further afield to the bustling Viaduct Harbour for countless dining and entertainment options, or take a ferry ride to Waiheke Island for a day of wine tasting and scenic walks. Among other attractions nearby, the Auckland Zoo, Eden Park and Newmarket are worth a visit.",
      "location_subheading": "New Zealand",
      "price": 82,
      "original_price": 82,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2xpIAC",
      "hero_image": "https://images.luxuryescapes.com/af6k4s0morcpi3w2f9",
      "image_two": "https://images.luxuryescapes.com/h6gl283eq9rodwlqhv7",
      "image_three": "https://images.luxuryescapes.com/08nyt80g22j6sarvik68",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Holiday Inn Auckland Airport",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Contemporary Auckland Airport Escape with Outdoor Swimming Pool",
      "description": "It's all too easy to embark on your Auckland adventure when staying at the Holiday Inn Auckland Airport, an IHG Hotel, just a breezy seven-minute drive from the city's airport. When you're not skipping over to the city centre, stay in at your inn to enjoy the outdoor swimming pool, or stretch and work your muscles at the well-equipped fitness centre. For meals, Vapor Restaurant serves up a mouthwatering array of contemporary New Zealand cuisine using fresh and local produce.",
      "location_subheading": "New Zealand",
      "price": 74,
      "original_price": 74,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DfljQAAR",
      "hero_image": "https://images.luxuryescapes.com/euq3mdsxjjwu30sqos6p",
      "image_two": "https://images.luxuryescapes.com/phiqr1kfb7g469oq99y",
      "image_three": "https://images.luxuryescapes.com/tqno8ppvtah4wzntc28",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Maison Blanc Lodge",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Luxury Auckland Bush Retreat with Outdoor Spa, Sauna & Private Chef",
      "description": "Step foot inside the sprawling luxury of Maison Blanc Lodge - a bush retreat nestled in Auckland's Waitakere Ranges and not to be missed. You and your friends or family will be spoilt with daily meals prepared by a private chef, as well as an outdoor heated pool and spa overlooking the woodlands, an indoor sauna and a showstopping fireplace. Only a short drive from the city, the lodge provides seamless access to beautiful wild beaches and some of the best hiking trails in New Zealand.",
      "location_subheading": "New Zealand",
      "price": 503,
      "original_price": 503,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DN6woAAD",
      "hero_image": "https://images.luxuryescapes.com/m7uk96w24iniqdn9v54s",
      "image_two": "https://images.luxuryescapes.com/74cl0wfods5rgijc7xm6n",
      "image_three": "https://images.luxuryescapes.com/5xsn6pwhxo5ull7c2fa",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "So Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Auckland Design Hotel near Viaduct Harbour with Rooftop Bar & Spa",
      "description": "Stay in the beating heart of New Zealand's largest city at this boundary-pushing urban retreat - boasting breathtaking views of the city skyline and Waitematā Harbour. Settle into the plush, well-appointed rooms and take advantage of the hotel's prime location in the lively downtown Britomart district. Dine at the acclaimed Harbour Society restaurant or indulge in a French pastry from Javalab, savour a cocktail at the swanky HI-SO rooftop bar, dance into the night at Mixo or rejuvenate in the tranquil SO/ Spa. When you are ready to explore, the vibrant waterfront dining, coffee and nightlife scene is mere moments away.",
      "location_subheading": "New Zealand",
      "price": 143,
      "original_price": 143,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000IbsTSAAZ",
      "hero_image": "https://images.luxuryescapes.com/jca9ug4e4820bhw2xyd",
      "image_two": "https://images.luxuryescapes.com/6avzhfjxbse400h01nl",
      "image_three": "https://images.luxuryescapes.com/afs9m7i20ufd8pm8djnp",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Movenpick Hotel Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Chic Swiss-Inspired Auckland Escape near Viaduct Harbour with Daily Chocolate Hour",
      "description": "Unwind in this Swiss-inspired chic hotel and expect elegance infused with modern luxury, all while savouring first-rate service in the heart of Auckland. Enjoy mouthwatering wagyu beef or seared duck breast at BODA Restaurant, or sample signature cocktails at BODA Bar, the ideal spot to end the night while city lights twinkle outside. Right in the thick of the CBD, Mövenpick Hotel Auckland has no shortage of fun. You're within arm's reach of bustling local haunts like Elliott Street serving up global eats, and hidden laneways full of character, such as Vulcan Lane, brimming with quirky cafes and historic pubs. These spots capture the heart and soul of the city, giving you a true taste of Auckland.",
      "location_subheading": "New Zealand",
      "price": 94,
      "original_price": 94,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvzIAC",
      "hero_image": "https://images.luxuryescapes.com/xjienzylb8k29x9z1y2k",
      "image_two": "https://images.luxuryescapes.com/88mgpo0pp78i4mfllpf",
      "image_three": "https://images.luxuryescapes.com/dkm5g22wtr8bul5si7l",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Hotel Britomart",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Auckland Five-Star Eco-Luxury Overlooking Waitemata Harbour",
      "description": "Take in the magic of Auckland from The Hotel Britomart, New Zealand's first five Green Star hotel. Sustainable eco-luxury informs every detail of this stunning property, from the organic linens and toiletries in the rooms to the responsibly sourced materials used for the build. Near designer boutiques, award-winning eateries, bars, health and beauty venues, and some of Auckland's oldest buildings and newest architecture, The Hotel Britomart is the place to be.",
      "location_subheading": "New Zealand",
      "price": 138,
      "original_price": 138,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DMTyAAO",
      "hero_image": "https://images.luxuryescapes.com/36kmbythmtm3voqc7au8",
      "image_two": "https://images.luxuryescapes.com/htdd8fak3ei74nz1x8tj",
      "image_three": "https://images.luxuryescapes.com/97ys4kh1lditsa6nyl",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Sebel Auckland Viaduct Harbour",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Elegant Auckland Waterfront Luxury with Viaduct Harbour Views",
      "description": "Experience the vibrant heart of New Zealand's largest city with a stay in this refined waterfront haven. When you're not exploring the city, retreat to your modern room or suite, savour the fresh flavours of the onsite restaurant or take in the stunning harbour views from the hotel's terrace. Perfectly positioned on the edge of the Viaduct Harbour, this stylish hotel offers easy access to the city's finest restaurants, lively bars and chic boutiques. Visit the New Zealand Maritime Museum, get your culture fix at the Auckland Art Gallery or enjoy a delicious meal in style from one of the many nearby restaurants.",
      "location_subheading": "New Zealand",
      "price": 95,
      "original_price": 95,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP4qYAF",
      "hero_image": "https://images.luxuryescapes.com/01qrh93ev9aidius60fl",
      "image_two": "https://images.luxuryescapes.com/t0zgu86un5upgytpiu7e",
      "image_three": "https://images.luxuryescapes.com/hyy54pvzewfg7s5zrgq",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Contemporary City Break in the Heart of Auckland",
      "description": "Experience the best of Auckland with a glamorous stay at the Crowne Plaza Auckland, perfectly positioned in the city's premier entertainment district. Providing easy access to renowned bars and delicious dining, and just a short day trip away from some of the North Island's most iconic landscapes and wine regions, Crowne Plaza Auckland makes the perfect base for a New Zealand discovery. When you're not exploring, drop into the hotel's fitness centre, indulge in a wide range of New Zealand wines at the Aria Bar or treat yourself to locally sourced produce at Aria Restaurant.",
      "location_subheading": "New Zealand",
      "price": 87,
      "original_price": 87,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt6mAAB",
      "hero_image": "https://images.luxuryescapes.com/4w9vzjebtei5teejp1d",
      "image_two": "https://images.luxuryescapes.com/zb11km09epj19bmtmrkfl",
      "image_three": "https://images.luxuryescapes.com/loip6vy95fot9qinjp",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Sebel Auckland Manukau",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Modern Auckland Escape near New Zealand's Largest Theme Park with Onsite Dining",
      "description": "Do everything or do nothing on your Auckland escape with a stay at this conveniently located escape. This modern hotel is a stone's throw from Rainbow's End, New Zealand's largest theme park, and the Southern Motorway, offering easy access to the city's bustling centre. Dine at Ora Bistro, savouring contemporary New Zealand cuisine, or enjoy a refreshing drink at the stylish lobby bar. Venture out to explore the nearby Auckland Botanic Gardens or the bustling Otara Market, a local favourite for fresh produce and Polynesian crafts.",
      "location_subheading": "New Zealand",
      "price": 81,
      "original_price": 81,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlwVIAS",
      "hero_image": "https://images.luxuryescapes.com/586lb43a4prj7ktl8ht",
      "image_two": "https://images.luxuryescapes.com/3dbqx1bw2qsiczr3iz0e",
      "image_three": "https://images.luxuryescapes.com/1nkvpv1jhi38bojoak7e",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Sophisticated Pullman Auckland CBD Urban Oasis with Indoor Pool & Spa",
      "description": "Discover the charms of Auckland from this elegant urban sanctuary, perfectly nestled between the bustling CBD and the tranquil sailboat-studded Waitematā Harbour. Exuding an upscale aura with its gilded interiors and plush furnishings, this five-star hotel boasts well-appointed rooms and residences that create the perfect home-away-from-home feeling. Spend your days taking laps in the heated indoor pool, indulge in restorative treatments at the onsite Luxe Spa & Power Fitness and relish contemporary classics made with a worldly spin, paired with signature cocktails at the Tapestry Grill & Bar. If you wish to explore the City of Sails, some of the top attractions, including the iconic Viaduct Harbour and the Sky Tower are right at your doorstep.",
      "location_subheading": "New Zealand",
      "price": 97,
      "original_price": 97,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlwLIAS",
      "hero_image": "https://images.luxuryescapes.com/r5svxz6ixbd9qklxczin",
      "image_two": "https://images.luxuryescapes.com/5pdpnd5kje2kvhl6lmh",
      "image_three": "https://images.luxuryescapes.com/437r577h3hk6x0t3cv",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Auckland Airport",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Contemporary Pullman Auckland Airport Stay with Onsite Dining",
      "description": "Experience the convenience of a stay at Pullman Auckland Airport, a modern retreat ideally positioned just minutes from the terminals. Perfect for a seamless layover, the hotel is just 30 minutes from the scenic sights and delightful nights of New Zealand's largest city. Stop by the fitness centre for a quick workout before heading to the top floor Te Kaahu Restaurant & Bar for exquisite dining and panoramic vistas across the runway and Manukau Heads. Take advantage of the location and explore nearby attractions including Butterfly Creek, Vector Wero Whitewater Park, Rainbow's End and Villa Maria winery, or head right into Auckland, just a short drive away.",
      "location_subheading": "New Zealand",
      "price": 165,
      "original_price": 165,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2xxIAC",
      "hero_image": "https://images.luxuryescapes.com/1o7n3v8xhbmhogayaa36",
      "image_two": "https://images.luxuryescapes.com/8vrb3s0168lni3fuwhdh",
      "image_three": "https://images.luxuryescapes.com/oke2c7qt8ehhewzrdl2",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Cordis Auckland, by Langham",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Sophisticated Auckland Escape near The Civic District with Onsite Bar, Restaurant & High Tea Lounge",
      "description": "Experience the best of Auckland with a stay at Cordis, Auckland, a beacon of sophistication and elegance. This architectural masterpiece is ideally located near the bustling boutiques of Queen Street and the culture scene of The Civic district. Indulge in sumptuous local cuisine at Eight Restaurant, savour bespoke cocktails at Our Land Is Alive bar, or treat yourself to high tea in the stunning Chandelier Lounge. When the need to relax hits, unwind at the onsite Chuan Spa.",
      "location_subheading": "New Zealand",
      "price": 97,
      "original_price": 97,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GOurIAAT",
      "hero_image": "https://images.luxuryescapes.com/0wte2h70umfg30jjmun",
      "image_two": "https://images.luxuryescapes.com/m3nknlodo6wydobsn76r",
      "image_three": "https://images.luxuryescapes.com/p7xk7fkvp7n4nl8u5wl4",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Auckland Airport",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Contemporary Novotel Stay at Auckland Airport with Onsite Dining",
      "description": "Explore the scenic sights and delightful nights of New Zealand's largest city with a stay at this stylish hotel just 30 minutes from Auckland CBD. Perfectly positioned for city exploration or connecting flights, this Novotel property seamlessly blends comfort with convenience. Relax with great views and wine and dine at the THIRTEEN50 Bistro & Bar where an epicurean adventure awaits. Stop by the fitness centre for a quick workout before heading to glimpse panoramic views of the city and beyond at the Sky Tower. Take advantage of the location and explore nearby attractions including Butterfly Creek, Vector Wero Whitewater Park, Rainbows End and Villa Maria winery, or head right into the city, just a short drive away.",
      "location_subheading": "New Zealand",
      "price": 152,
      "original_price": 152,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlwTIAS",
      "hero_image": "https://images.luxuryescapes.com/q1mzk22emd3r2e15411",
      "image_two": "https://images.luxuryescapes.com/5ey6214ats5npgbsjq4l",
      "image_three": "https://images.luxuryescapes.com/ey4d519609bl08z9sweo",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Rydges Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Stylish City Break in the Heart of Auckland",
      "description": "Experience top-notch Kiwi hospitality and sweeping city views at Rydges Auckland, offering cutting-edge sophistication that's masterfully crafted to stand proudly on the international stage. Savour the best New Zealand produce at The CUT Restaurant & Bar or take a short stroll to the nearby Sky Tower, SkyCity Auckland or Viaduct Harbour's world-class bars and restaurants.",
      "location_subheading": "New Zealand",
      "price": 80,
      "original_price": 80,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004v1VmAAI",
      "hero_image": "https://images.luxuryescapes.com/8wf3h5tq4phyujpkdjxt",
      "image_two": "https://images.luxuryescapes.com/0awuh2xc0ghm7gftuhg",
      "image_three": "https://images.luxuryescapes.com/kkv70v3y1w91fyq50cg",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Sebel Quay West Auckland",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Apartment-Style Waterfront Luxury in Auckland CBD with Panoramic Views",
      "description": "Discover Auckland's CBD with easy access to local attractions from an elegant and contemporary waterfront hotel. This stylish retreat is perfectly positioned in the heart of \\\"The City of Sails\\\", offering easy access to world-class dining, shopping and entertainment. Stay in spacious apartments with panoramic views of the city and grab a bite at Up Café with a well-stocked bar to raise your spirits. Take advantage of the location and enjoy a leisurely stroll to the nearby Viaduct Harbour. For art enthusiasts, the Auckland Art Gallery Toi o Tāmaki is a short walk away, housing an impressive collection of national and international artwork. Auckland awaits!",
      "location_subheading": "New Zealand",
      "price": 103,
      "original_price": 103,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002Ilw8IAC",
      "hero_image": "https://images.luxuryescapes.com/zfh0bz62n96soh4ffdy",
      "image_two": "https://images.luxuryescapes.com/diob4e12ufrqyvauz0x",
      "image_three": "https://images.luxuryescapes.com/trsl29rpgpoxo67n10ht",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Voco Auckland Centre",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Contemporary Auckland Harbourside Escape with New Zealand's Highest Rooftop Bar",
      "description": "Auckland's bustling city centre beckons visitors to explore, and where better to discover this buzzing harbour city than at voco Auckland City Centre, an IHG Hotel. During your stay, indulge in authentic Italian cuisine (woodfired pizza or bolognese, anyone?) at Mozarella & Co., and grab your coffee to go at the ground-floor cafe before heading out to explore the sights. When evening comes, ascend to the rooftop lounge, Bar Albert, for a sophisticated cocktail menu.",
      "location_subheading": "New Zealand",
      "price": 85,
      "original_price": 85,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CP3UcAAL",
      "hero_image": "https://images.luxuryescapes.com/2d6x43kiifgi1eu4aje",
      "image_two": "https://images.luxuryescapes.com/ymya12jmgx5rjv17mcc",
      "image_three": "https://images.luxuryescapes.com/dfiftbenmdyr6uki38c",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Adina Apartment Hotel Auckland Britomart",
      "offer_country_name": "New Zealand",
      "location_heading": "Auckland",
      "title": "Stylish Self-Contained Auckland Stay near Viaduct Harbour",
      "description": "Located on Tapora Street, the Adina Apartment Hotel Auckland Britomart is a boutique self-catering property awash with understated luxury. After a day of exploration, a comfortable evening is assured with modern technology and spacious design, with some apartments featuring fully equipped kitchens and laundry facilities. Exploration is easy with the waterfront and the Quay Park precinct a stone's throw away, while onsite you'll find a gymnasium, parking and the relaxed Yard Bar & Eatery.",
      "location_subheading": "New Zealand",
      "price": 73,
      "original_price": 73,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DMffAAG",
      "hero_image": "https://images.luxuryescapes.com/pmyz74jnnr9qagosiv4a",
      "image_two": "https://images.luxuryescapes.com/4r072yymwhe8clnvv9go",
      "image_three": "https://images.luxuryescapes.com/ogn2hoo2la4cczhfrug",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hoteles en Auckland - New Zealand Hotels & Travel Guide 2024",
    "description": "Encuentra los mejores hoteles en Auckland, New Zealand con ofertas exclusivas. Reserva tu escapada perfecta con hasta 60% de descuento.",
    "keywords": [
      "auckland hotels",
      "auckland travel",
      "new zealand hotels"
    ],
    "canonical": "https://mondoexplora.com/es/destination/auckland",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/auckland",
      "es": "https://mondoexplora.com/es/destination/auckland",
      "fr": "https://mondoexplora.com/fr/destination/auckland",
      "it": "https://mondoexplora.com/it/destination/auckland"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 23,
    "average_price": 145,
    "average_discount": 8
  }
}