{
  "city": "Madrid",
  "country": "Spain",
  "country_code": "ES",
  "hero_title": "Hoteles en Madrid",
  "description": "Descubre los mejores hoteles en Madrid, Spain. Encuentra ofertas exclusivas y alojamientos de lujo.",
  "hero_image": "https://images.luxuryescapes.com/yyoqgv9cyopl2zwzd8la",
  "hotels": [
    {
      "vendor_name": "Mandarin Oriental Ritz, Madrid",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Five-Star Madrid Palace Glamour in the Heart of the Golden Triangle of Art",
      "description": "Art aficionados and fans of Spanish culture can't pass up a five-star stay at Mandarin Oriental Ritz, Madrid, a luxury Belle Époque palace located in the famous Golden Triangle of Art of Madrid. Unbeatable facilities include five restaurants and bars overseen by Spain's celebrated Chef Quique Dacosta - including the luxurious Palm Court and sparkling Champagne Bar - an opulent indoor swimming pool fit for royalty, plus an onsite spa featuring a vitality pool, experience showers and a steam room.",
      "location_subheading": "Spain",
      "price": 888,
      "original_price": 888,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DWDaAAO",
      "hero_image": "https://images.luxuryescapes.com/yyoqgv9cyopl2zwzd8la",
      "image_two": "https://images.luxuryescapes.com/au17t2p2xwcdegdo4ki",
      "image_three": "https://images.luxuryescapes.com/0jh1vaafm8dvupxeu2j",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "URSO Hotel & Spa Madrid",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Madrid Five-Star Boutique Elegance with Two Onsite Restaurants",
      "description": "Where palatial elegance meets modern luxury, experience the grandeur of Madrid from the heart of the city at URSO Hotel & Spa. Retaining many of its original 20th-century features including an ornate facade and stained glass observatory - now light-filled restaurant - be embraced by classic Spanish refinement. Treat yourself at the tranquil URSO Spa complete with a hydrotherapy pool, or savour innovative cuisine at Casa Felisa restaurant.",
      "location_subheading": "Spain",
      "price": 278,
      "original_price": 278,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GullvAAB",
      "hero_image": "https://images.luxuryescapes.com/q9o1e5z1ohkca9919xt",
      "image_two": "https://images.luxuryescapes.com/tk7p7xn5dwh1qc83ju6ym",
      "image_three": "https://images.luxuryescapes.com/c674uc277hfn7qe195a",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Urban",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Five-Star Avant-Garde Luxury in the Heart of Madrid with Michelin-Star Restaurant",
      "description": "Experience Madrid in the height of style and luxury with a stay at the five-star Hotel Urban. The hotel exudes big-city glamour, from its onsite Michelin-starred Cebo Restaurant to the unique avant-garde artwork and sultry glass-roof bar. Stamped with a Tripadvisor Travellers’ Choice 2021 award, Hotel Urban offers the highest quality facilities and warm hospitality in the heart of Spain's capital. Order tapas at the panoramic Urban Terrace, take a dip in the rooftop swimming pool and get your cocktail fix at the fashionable Glass Bar. The hotel is located near Madrid’s Museum Triangle, meaning art and history aficionados are within easy reach of the city’s best cultural attractions, including Museo Nacional del Prado, Thyssen-Bornemisza Museum and Museo Nacional Centro de Arte Reina Sofía. Plus, the Royal Palace of Madrid and other iconic sites are within a 20-minute walk.",
      "location_subheading": "Spain",
      "price": 188,
      "original_price": 188,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000005GfcjAAC",
      "hero_image": "https://images.luxuryescapes.com/tgb3itsvhz9r42uun6a",
      "image_two": "https://images.luxuryescapes.com/06b861kg17al91sjvqp",
      "image_three": "https://images.luxuryescapes.com/zga8rwswmblozuyaxigv",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Hospes Puerta de Alcala",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "19th-Century Five-Star Boutique Madrid Escape",
      "description": "Experience true Spanish cosmopolitan elegance with a stay at Hotel Hospes Puerta De Alcala - a 19th-century architectural masterpiece, designed by José María de Aguilar. This delightful retreat is located in the heart of the city, with awe-inspiring cultural and historic monuments only minutes from the hotel. Stroll through the streets to discover an abundance of flavours, enrich your mind with a trip to the Reina Sofia Museum, and indulge in high-end retail therapy along the world-class Salamanca.",
      "location_subheading": "Spain",
      "price": 193,
      "original_price": 193,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000BeqowAAB",
      "hero_image": "https://images.luxuryescapes.com/hd1rt622poivsxtugeqt",
      "image_two": "https://images.luxuryescapes.com/vpn0v0o1e8ba0z6eoa",
      "image_three": "https://images.luxuryescapes.com/991p2vbq36wvte1qootc",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indigo Madrid - Princesa",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Stylish Spain Escape in the Heart of Madrid",
      "description": "Immerse yourself in the electric buzz of Spain's elegant capital from the stylish Hotel Indigo Madrid - Princesa, an IHG Hotel, a modern oasis set within the tranquil neighbourhood of Moncloa-Argüelles. Savour avant-garde dishes at Best Restaurant and keep up with your routine at the onsite fitness centre. When it's time to explore, you'll find yourself just a stone's throw from inspiring sights, including the imposing Torre de Madrid, Plaza de Espana and the sophisticated Royal Palace.",
      "location_subheading": "Spain",
      "price": 83,
      "original_price": 83,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CugCZAAZ",
      "hero_image": "https://images.luxuryescapes.com/4cssdsk9o91w9vkr1pu",
      "image_two": "https://images.luxuryescapes.com/zslm4e42dspwp65qstqvr",
      "image_three": "https://images.luxuryescapes.com/5zc8lvnhrkkq7it678cl",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Madrid Airport",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Modern Madrid Stay Close to Transport & Airport",
      "description": "Minutes from the airport, Crowne Plaza Madrid Airport, an IHG Hotel is a gateway to Spain's cosmopolitan capital. Work up an appetite at the fitness centre before savouring international dishes at the Siesta Bar restaurant. Sophisticated and spacious guestrooms await to refresh and revitalise you before you undertake an expedition to experience the marvellous metropolis of Madrid. Closely connected to public transport, this hotel makes it simple to explore the city in all its splendour.",
      "location_subheading": "Spain",
      "price": 71,
      "original_price": 71,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CQJaDAAX",
      "hero_image": "https://images.luxuryescapes.com/2qb9jhwgsevkgndvn0fh",
      "image_two": "https://images.luxuryescapes.com/3pm9oca5cg17s1d8v24g",
      "image_three": "https://images.luxuryescapes.com/e78jf11svq5i1inh4lna",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Voco Madrid Retiro",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Madrid Modernist City Break near Retiro Park with Garden Restaurant",
      "description": "Discover Spain's vibrant capital from this modernist hotel, located just a stone's throw from iconic Retiro Park and the city's trendy neighbourhoods. Take a moment to savour traditional cuisine at the hotel's Garden Restaurant, or sit back with tapas and a cocktail at the Lounge Bar before exploring the city's rich history and contemporary art scene. With the finest shopping, dining, and entertainment venues at your fingertips, a memorable Spanish escape awaits.",
      "location_subheading": "Spain",
      "price": 107,
      "original_price": 107,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000IbOe0AAF",
      "hero_image": "https://images.luxuryescapes.com/ll1nxp35znu0yvtzex",
      "image_two": "https://images.luxuryescapes.com/8me8s5oh1s2m4pxi4yx",
      "image_three": "https://images.luxuryescapes.com/6xcvc889ufk60m9exm",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Relais & Chateaux Heritage Madrid Hotel",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Madrid Award-Winning Five-Star Heritage Glamour with Daily Breakfast",
      "description": "Join the jet-set elite in Madrid’s glamorous Salamanca quarter at the Relais & Chateaux Heritage Madrid Hotel - currently ranked within the top 10 hotels in all of Spain on Tripadvisor and previously featured in Condé Nast Traveler’s prestigious Gold List. Serious luxury is par for the course at this five-star heritage retreat, where you can relax in one of 46 exquisite rooms and suites, sip champagne and eat oysters on the secret roof terrace, then slip out into Salamanca's sprinkling of fine restaurants, tapas bars, designer boutiques, the iconic Prado Museum and vibrant Plaza Mayor. The opulence goes beyond the early 20th-century façade and further than the grandiose interiors by designer Lorenzo Castillo - there's also the world-class Restaurante Haroma, overseen by two Michelin-starred chef Mario Sandoval, hidden within. **Your handpicked inclusions (select nights/packages only)** - Refuel for a day of discovery with **daily breakfast** at the top-rated Restaurante Haroma - Be welcomed in true style with a **complimentary drink** on arrival - Enjoy an **upgrade to a Superior Room**, subject to availability (Classic Double Rooms only, 4+ nights) **Tripadvisor Travellers’ Choice, Best of the Best 2020** Top Hotels - Spain **Travelling with family?** Upgrade to the Family Room for two adults and up to two children (11 and under) or the Deluxe Family Room for three adults and up to two children (11 and under).",
      "location_subheading": "Spain",
      "price": 352,
      "original_price": 352,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GMPnAAO",
      "hero_image": "https://images.luxuryescapes.com/r2oss938fufn1qe90ft",
      "image_two": "https://images.luxuryescapes.com/83ptp753xb3aoop379eg",
      "image_three": "https://images.luxuryescapes.com/y0f27x4g6rj744oap6w",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "InterContinental Madrid",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Five-Star Madrid Escape on Paseo de la Castellana near Iconic Sorolla Museum",
      "description": "Step into the marble-lined lobby of the InterContinental Madrid, an IHG Hotel, to discover a luxurious retreat amid the bustling streets of Spain's vibrant capital. Take a moment to indulge in sumptuous fine dining served on a verdant garden terrace before discovering the city’s longest avenue right on your doorstep. Stroll down the vibrant Paseo de la Castellana, lined with mouth-watering dining options, marvel at iconic artwork in countless museums or wander around the nearby shopping districts.",
      "location_subheading": "Spain",
      "price": 175,
      "original_price": 175,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt62AAB",
      "hero_image": "https://images.luxuryescapes.com/x0gssf7i1kd5pu5jc3r7",
      "image_two": "https://images.luxuryescapes.com/xgs1fqij5dxnswpqsqaa",
      "image_three": "https://images.luxuryescapes.com/91yz6c5lvx56gqkac2qo",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 01:59:00"
    },
    {
      "vendor_name": "Ocean Drive Madrid",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Madrid Designer Escape in the Heart of Plaza de Isabel II with Rooftop Pool & Bar",
      "description": "Enjoy an unbeatable location in the heart of the city when you stay at Ocean Drive Madrid. Part of OD Hotels' contemporary Mediterranean brand - which includes designer properties in Ibiza, Mallorca and Barcelona - the hotel boasts an innovative and elegant vibe, perfectly paired with charming modern furnishings and designer décor. Ascend to Sky Bar to drink in breathtaking 360-degree panoramic views from the rooftop pool, indulge in global fare at the restaurant, or sunbathe on the spacious garden terrace. Located in a prime position in front of the Opera Palace, this is the perfect launchpad for exploring Plaza de Isabel II and beyond, with the Royal Palace, Plaza Mayor, Puerta del Sol and Gran Vía all within walking distance. Emblematic neighbourhoods La Latina, Huertas, Los Austrias, Malasaña and Chueca are all also nearby. With the best of Madrid on your doorstep, you’ll truly be spoilt for choice",
      "location_subheading": "Spain",
      "price": 170,
      "original_price": 170,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000006zn3iAAA",
      "hero_image": "https://images.luxuryescapes.com/xyu0ifjpnmml1u7ix44",
      "image_two": "https://images.luxuryescapes.com/bjqi9c97kh3uwa7zpwrh",
      "image_three": "https://images.luxuryescapes.com/7ar5rz8obkrhf9i6f90b",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Wellington & Spa",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Madrid Five-Star Heritage Elegance in the Heart of Salamanca",
      "description": "Energetic and enticing, Madrid captivates its visitors with its incredible art, culture and gastronomy. Experience this vibrant city for yourself with a stay at the five-star Wellington Hotel & Spa. The luxurious heritage hotel has proudly stood as part of Madrid’s cityscape since 1952 and hasn’t lost the glamour of its former years. Be wined and dined at three exquisite onsite restaurants, enjoy a tipple at the sun-soaked terrace bar and share a pint at the English-style pub. There’s even an onsite bakery, where you can pick up freshly baked bread and treats. Be pampered at SPA at Le Max Wellness Club Wellington, which features tranquil treatment rooms, a 30ºC hydrotherapy pool, Finnish sauna and hammam. Madrid’s Salamanca district is the city’s most exclusive area, home to 19th-century boulevards lined with fine-dining restaurants and designer boutiques, most notably along the Golden Mile. Madrid’s celebrated parks, including El Retiro Park, are just outside your door. Meanwhile, culture enthusiasts will relish the location in the heart of the city’s Golden Triangle of Art: spend a day perusing Museo Nacional del Prado, Museo Nacional Thyssen-Bornemisza and Museo Nacional Centro de Arte Reina Sofía.",
      "location_subheading": "Spain",
      "price": 300,
      "original_price": 300,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000007lm9XAAQ",
      "hero_image": "https://images.luxuryescapes.com/3fjqedyhnuxtgagsxhr",
      "image_two": "https://images.luxuryescapes.com/5cj7n7uvblcq7998io6",
      "image_three": "https://images.luxuryescapes.com/rsdvn163eweh02w9202h",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Relais & Châteaux Orfila",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Five-Star Relais & Châteaux Opulence in the Heart of Madrid",
      "description": "Experience an effortless collision of Spanish elegance and contemporary luxe at the five-star Hotel Orfila, a Relais & Châteaux hotel in the heart of Madrid, moments from top cultural attractions. Housed in a 19th-century palace, this boutique abode features just 32 rooms and suites. It sets the stage for an exceptional restaurant, El Jardín de Orfila, where the philosophy of showcasing fresh, local ingredients through avant-garde techniques has been executed by Mario Sandoval, who has worked in acclaimed, Michelin-starred restaurants. This opulent realm invites you to unwind in style after days exploring the city: take a stroll through Madrid's cobbled streets, hop between tapas restaurants, or wander the art-lined walkways of the Prado Museum.",
      "location_subheading": "Spain",
      "price": 385,
      "original_price": 385,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000006Q4x4AAC",
      "hero_image": "https://images.luxuryescapes.com/4frp2jx0p3ogaqbred4l",
      "image_two": "https://images.luxuryescapes.com/xd12f2iezkfvwkyxpn3i",
      "image_three": "https://images.luxuryescapes.com/ejzi0mnbbfvfe262vodi",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indigo Madrid - Gran Via",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Sophisticated Madrid Escape with Rooftop Infinity Pool & City Views",
      "description": "Discover Mediterranean bliss with a relaxing stay at Hotel Indigo Madrid - Gran Via, an IHG Hotel, located in the heart of the city, mere moments away from exquisite Spanish monuments. Live as the locals do by exploring the street art and museums, wandering through abundantly green parks and dancing the nights away. Retreat to this beautiful hotel to soak in views of the sun setting from the rooftop infinity pool before enjoying an authentic bite to eat at El Gato Canalla.",
      "location_subheading": "Spain",
      "price": 122,
      "original_price": 122,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CuiRtAAJ",
      "hero_image": "https://images.luxuryescapes.com/tbp78y6u1e9dujll4dd",
      "image_two": "https://images.luxuryescapes.com/5hrgssdpyk6drrx7ztl9h",
      "image_three": "https://images.luxuryescapes.com/w0bt8kcead879yuiutgf",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Villa Real Hotel",
      "offer_country_name": "Spain",
      "location_heading": "Madrid",
      "title": "Five-Star Madrid Luxurious City Break with Daily Breakfast & Rooftop Bar",
      "description": "Oozing with old-world charm and with an appreciation for art at its core, Villa Real Hotel boasts five-star luxury in the iconic Plaza de las Cortes. Boasting a prime position in the art triangle of Madrid, the boutique hotel invites guests to relax on plush furnishings surrounded by curated artworks. Relish scrumptious Mediterranean-inspired dishes in New York-inspired interiors, or sip a refreshing drink poolside, all while taking in the stunning cityscape from the hotel's airy rooftop.",
      "location_subheading": "Spain",
      "price": 131,
      "original_price": 131,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000EwunUAAR",
      "hero_image": "https://images.luxuryescapes.com/q0x1c1j45yant9be0d39",
      "image_two": "https://images.luxuryescapes.com/siy6arm95qlxsvn955x",
      "image_three": "https://images.luxuryescapes.com/t7ycdzvqzlxjqf1eewrt",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hoteles en Madrid - Spain Hotels & Travel Guide 2024",
    "description": "Encuentra los mejores hoteles en Madrid, Spain con ofertas exclusivas. Reserva tu escapada perfecta con hasta 60% de descuento.",
    "keywords": [
      "madrid hotels",
      "madrid travel",
      "spain hotels"
    ],
    "canonical": "https://mondoexplora.com/es/destination/madrid",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/madrid",
      "es": "https://mondoexplora.com/es/destination/madrid",
      "fr": "https://mondoexplora.com/fr/destination/madrid",
      "it": "https://mondoexplora.com/it/destination/madrid"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 14,
    "average_price": 246,
    "average_discount": 0
  }
}