{
  "city": "Singapore",
  "country": "Singapore",
  "country_code": "SG",
  "hero_title": "Hoteles en Singapore",
  "description": "Descubre los mejores hoteles en Singapore, Singapore. Encuentra ofertas exclusivas y alojamientos de lujo.",
  "hero_image": "https://images.luxuryescapes.com/irsjo9b9plntssjc21c",
  "hotels": [
    {
      "vendor_name": "Mondrian Singapore Duxton",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Ultimate Singapore City Glamour with Rooftop Pool, Daily Breakfast & Two-Hour Free-Flow Cocktails",
      "description": "Discover a new world of luxury at this Singapore stay, set magnificently among the traditional shophouses, cocktail bars and pedestrian-only laneways of ultra-cool Duxton Hill. Inspired by the city’s glamorous past and fearlessly embracing its future, each handcrafted detail of this stay has been fine-tuned to perfection. The hotel is home to 10 onsite restaurants and bars, including the spectacular 1970s-themed rooftop pool zone, Canyon Club, with some of the city’s best skyline views. Culinary legend Dario Cecchini - dubbed ‘The Greatest Butcher in the World’ by The New York Times - leads the garden-fringed trattoria, Bottega Di Carna. For guaranteed good times, begin each morning with artisanal coffee at Christina’s and kick off every evening at Singapore-inspired tiki joint Jungle Ballroom. Mondrian Singapore Duxton offers the perfect base for exploring Singapore’s best. Whether it’s temples and tipples in Chinatown or Michelin-starred chicken rice at the Maxwell Hawker Centre, both are within easy walking distance, and the iconic Gardens by the Bay reserve is an easy taxi ride away.",
      "location_subheading": "Singapore",
      "price": 449,
      "original_price": 1044,
      "discount_percentage": 57,
      "link": "https://luxuryescapes.com/offer/006RF00000FxzQGYAZ",
      "hero_image": "https://images.luxuryescapes.com/irsjo9b9plntssjc21c",
      "image_two": "https://images.luxuryescapes.com/li3v36myf8zb51rpphon",
      "image_three": "https://images.luxuryescapes.com/47cvef0sobgoc1nhca1p",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 2,
      "end_date_utc": "2025-08-06 13:59:00"
    },
    {
      "vendor_name": "COMO Metropolitan Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Singapore Glamour: Orchard Road Elegance with Daily Breakfast & Two-Hour Nightly Free-Flow Drinks",
      "description": "Discover signature elegance reimagined at this prestigious retreat, positioned just moments from the world-famous luxury shopping and dining precinct, Orchard Road. This exclusive city hideaway is the culmination of the very best in accommodation, dining, wellness and fashion, housed across 19 spectacular floors. Visit onsite COMO Shambhala to relax in the luxurious infrared sauna, rejuvenate in the Oxygen Therapy Space with hydroxy mild hyperbaric devices (a first in Singapore) or revive in the cooling ice bath. Indulge in mouthwatering Korean barbecue at Michelin-starred COTE Singapore Steakhouse and be sure to try an exquisite pastry creation at Cedric Grolet Singapore. Here, up-scale designer excellence is par for the course: Italian furniture by Giorgetti mingles freely with curated artwork and Atelier Ikebuchi’s breathtaking interior design. After days spent exploring Orchard Road, Emerald Hill or the Botanic Gardens, head to the hotel’s glass-bottomed rooftop pool for an exhilarating dip or shop your way through the glittering retail space Club 21.",
      "location_subheading": "Singapore",
      "price": 529,
      "original_price": 962,
      "discount_percentage": 45,
      "link": "https://luxuryescapes.com/offer/006Ii000002INW6IAO",
      "hero_image": "https://images.luxuryescapes.com/qj3t7q0j1a7c5jorhho9",
      "image_two": "https://images.luxuryescapes.com/zi91rtsi82sc0p2xe9cr",
      "image_three": "https://images.luxuryescapes.com/fcaaem3xfzg90z57lxi8",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 2,
      "end_date_utc": "2025-08-15 13:59:00"
    },
    {
      "vendor_name": "Sofitel Singapore City Centre",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Singapore Sofitel Stay with Onsite Restaurant & Outdoor Infinity Pool",
      "description": "Experience the vibrancy of Singapore's bustling Tanjong Pagar district with a stay at a five-star oasis, where French art de vivre meets Asian sophistication. This urban retreat is a stone's throw from the city's most iconic attractions, including the historic Chinatown and the lush Gardens by the Bay. Savour gastronomic delights at Racines, where French and local cuisines converge, or sip on artisanal cocktails at 1864, the hotel's sophisticated lounge. Venture to the 30-metre infinity pool for a refreshing dip, or maintain your fitness regime at the state-of-the-art gym.",
      "location_subheading": "Singapore",
      "price": 271,
      "original_price": 271,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GUOBmYAP",
      "hero_image": "https://images.luxuryescapes.com/4upg0svqd2w513ni5u5",
      "image_two": "https://images.luxuryescapes.com/z2do9l4q9mgdcdq0qrg",
      "image_three": "https://images.luxuryescapes.com/yr98w52k2h6kglrfxdok",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mandarin Oriental Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Mandarin Oriental Luxury in Singapore's Marina Bay with Forbes Award-Winning Spa",
      "description": "Immerse yourself in the beauty of Singapore at the ultra-luxurious, five-star Mandarin Oriental Singapore, located on the glamorous Marina Bay. The hotel's world-class facilities have seen it awarded the Forbes Travel Guide five-star award in the hotel and spa category for the last 10 consecutive years. Experience them for yourself: let go of your cares at the holistic day spa, indulge at any of seven top-tier dining venues, and maintain your routine at the fully equipped fitness centre. When it's time to cool off, the sparkling rooftop swimming pool awaits, or simply lounge poolside in a luxe cabana with a cocktail in hand. If you can tear yourself away from paradise, you'll find yourself surrounded by Singapore's famed sites, including Marina Bay Sands, Merlion Park and the National Museum of Singapore.",
      "location_subheading": "Singapore",
      "price": 447,
      "original_price": 447,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000BdkRvAAJ",
      "hero_image": "https://images.luxuryescapes.com/svzpwkvuceq1dzxjtpdm",
      "image_two": "https://images.luxuryescapes.com/86tikzsklfn2o5gnfe8l",
      "image_three": "https://images.luxuryescapes.com/hn4mn76f09y7mo6d1w9c",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "InterContinental Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Flagship Escape to One of Singapore's Best Hotels",
      "description": "Discover flagship luxury at the five-star InterContinental Singapore, set in the heart of the Bugis and Bras Basah cultural districts. A magnificent blend of rich Chinese heritage, Peranakan architecture and modern amenities, the resort excludes opulence and charm. An offering of gourmet delights draws on the city's diverse influences, from toothsome contemporary Cantonese to an Italian bistronomic restaurant and a thematic traditional afternoon tea. Linked to the Bugis MRT station, the wonders of Singapore, including the famed Orchard Road shopping district, are within easy reach. Explore nearby attractions such as the Marina Bay area, Singapore CBD and Chinatown, before returning for an indulgent spa treatment or champagne at the pool bar.",
      "location_subheading": "Singapore",
      "price": 262,
      "original_price": 262,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BVQcAAO",
      "hero_image": "https://images.luxuryescapes.com/pi70g1f0b9nkskfs4mbl",
      "image_two": "https://images.luxuryescapes.com/9uqzax50nfrz0p2uk9nj",
      "image_three": "https://images.luxuryescapes.com/vf6i2c0etnm2liywnh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Fairmont Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Sophisticated Central Singapore Stay Near Marina Bay with Michelin-Star Restaurant & Onsite Spa",
      "description": "Relish opulent city living at this sophisticated downtown stay, located only a short stroll from the historic Clarke Quay and Marina Bay. Dine in style at the hotel's Michelin-starred JAAN by Kirk Westaway, savour Italian plates at Prego, or indulge in the flavours of Japan at Mikuni - with three more exceptional bars and eateries to choose from. For moments of rest, rejuvenate with Eastern spa traditions and holistic treatments at the tranquil Willow Stream Spa.",
      "location_subheading": "Singapore",
      "price": 277,
      "original_price": 277,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000IbmioAAB",
      "hero_image": "https://images.luxuryescapes.com/yum7upbj8lknxwbe563",
      "image_two": "https://images.luxuryescapes.com/h5n91flxcc2ech9945",
      "image_three": "https://images.luxuryescapes.com/zvw2btkdchj38ll00i",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mondrian Singapore Duxton",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Mondrian Singapore Escape in Duxton Hill with Infinity Pool, Three Restaurants & Hollywood-Themed Rooftop Club",
      "description": "Fall in love with the allure of the Lion City with a sophisticated stay at this eye-catching Mondrian abode, perfectly positioned among the traditional shophouses, cocktail bars and pedestrian-only laneways of ultra-trendy Duxton Hill. Thrill yourself with gastronomic experiences at Bottega Di Carna, relish wood-fired flavours at Christina's, sip on sultry cocktails at the Jungle Ballroom and soak up epic skyline vistas from the 1970s Hollywood-themed rooftop pool zone, Canyon Club. The hotel's prime location near Chinatown puts you in the perfect place to explore the cultural, historical and culinary gems of the city. Venture out to the nearby Maxwell Food Centre for a taste of local street food, explore Duxton Hill's trendy boutiques and visit the iconic reserve of Gardens by the Bay.",
      "location_subheading": "Singapore",
      "price": 205,
      "original_price": 205,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnGfsYAF",
      "hero_image": "https://images.luxuryescapes.com/k14jstiojbk4lkpqrb6k",
      "image_two": "https://images.luxuryescapes.com/yo82fzw6sby9m9gcksn",
      "image_three": "https://images.luxuryescapes.com/aemydufrtvxaaa1pya3",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Intercontinental  Singapore Robertson Quay",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Singapore Riverside Escape with World-Class Onsite Steakhouse",
      "description": "Singapore's riverfront is a sophisticated medley of high-end restaurants, cafes and shopping, and the five-star InterContinental Singapore Robertson Quay, an IHG Hotel, is the cherry on top. Listed as Singapore's Leading Lifestyle Hotel at the World Travel Awards in 2022, this hotel boasts a superior location along the Singapore River, with the CBD just a five-minute drive away. When you're not exploring the local sights, stay in and be spoilt for choice with excellent onsite dining venues.",
      "location_subheading": "Singapore",
      "price": 208,
      "original_price": 208,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt6sAAB",
      "hero_image": "https://images.luxuryescapes.com/tl1a3brgydkg19oizpn",
      "image_two": "https://images.luxuryescapes.com/ces3tgiy8qmctlznoe6h",
      "image_three": "https://images.luxuryescapes.com/nuzr73lgfwl3lltctl5",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Pan Pacific Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Central Singapore Stay in Marina Bay with Eight Restaurants & Bars",
      "description": "Have the best of Singapore at your doorstep at Pan Pacific Singapore, a five-star sanctuary located inside Marina Square just a stone's throw away from iconic landmarks like Gardens by the Bay. Savour a world of flavours at the hotel's gourmet Edge restaurant, one of six eateries, or sip on bespoke cocktails at the Atrium. And with so much to explore, retreat to the award-winning St. Gregory Spa for soothing treatments to get you back on your feet.",
      "location_subheading": "Singapore",
      "price": 327,
      "original_price": 327,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cvl8MAAR",
      "hero_image": "https://images.luxuryescapes.com/0ccqkvozrfvf77h3584n",
      "image_two": "https://images.luxuryescapes.com/wgk2l99sa961u9cq866n",
      "image_three": "https://images.luxuryescapes.com/q5voh93ldcgeqtbjdlj",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:58:00"
    },
    {
      "vendor_name": "Grand Mercure Singapore Roxy",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Contemporary Grand Mercure Singapore Retreat within Heritage Katong with Tranquil Pool & Three Restaurants",
      "description": "Step into the heart of Singapore’s vibrant Katong district at this contemporary retreat, the perfect home base with the best of the city right at your doorstep. With the colourful Peranakan houses mere steps away and easy access to the MRT railway, you’re perfectly positioned to explore iconic sights and local treasures while staying in absolute comfort. Kick-start your day with coffee and fresh pastries at Roxy Divine, before enjoying a dip in the sparkling outdoor pool. After a day of urban adventure, return to the hotel where a contemporary buffet awaits at Feast Asia restaurant or tuck into authentic Chinese cuisine at Jia Wei Chinese Restaurant, before enjoying a nightcap at poolside Breez Bar.",
      "location_subheading": "Singapore",
      "price": 132,
      "original_price": 132,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP0AYAV",
      "hero_image": "https://images.luxuryescapes.com/2qvvz1au8cr8sq8ar9q",
      "image_two": "https://images.luxuryescapes.com/am2dx85l3bfdtqedry9",
      "image_three": "https://images.luxuryescapes.com/40kki5edhachj8eln2v",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 03:59:00"
    },
    {
      "vendor_name": "Pan Pacific Serviced Suites Beach Road",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Singapore Pan Pacific Opulence in Heart of the CBD with Rooftop Swimming Pool",
      "description": "Discover the glitz and glamour of Singapore's buzzing streets from the opulent Pan Pacific Serviced Suites Beach Road, a five-star oasis offering unparalleled hospitality. Spring into the dazzling CBD and spend balmy nights discovering the city's hottest attractions, all a short stroll away. Retire to your urban sanctuary at the end of each day to recharge in total comfort, or make a splash in the glimmering rooftop pool and toast to your stay with a signature Nasi Lema'rgarita at Club 5 bar.",
      "location_subheading": "Singapore",
      "price": 248,
      "original_price": 248,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cw2XJAAZ",
      "hero_image": "https://images.luxuryescapes.com/5g9hb2iy6glm1vojseu",
      "image_two": "https://images.luxuryescapes.com/pnqrwv3jeyjfbeyved3at",
      "image_three": "https://images.luxuryescapes.com/tju4mx7loeambj6rf5pk",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Holiday Inn Singapore Atrium",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Relaxed Central Singapore City Break with Outdoor Swimming Pool & Award-Winning Chinese Restaurant",
      "description": "From enchanting gardens to boutique shopping and delicious street food, Singapore is a treasure trove of discoveries, best explored from Holiday Inn Singapore Atrium, an IHG Hotel. When you're not exploring this vibrant metropolis from your central launchpad, be sure to savour the finest Cantonese delicacies at the award-winning Xin Cuisine restaurant, take a dip in the glorious outdoor swimming pool and keep up your daily workout routine at the modern fitness centre.",
      "location_subheading": "Singapore",
      "price": 146,
      "original_price": 146,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DGfb9AAD",
      "hero_image": "https://images.luxuryescapes.com/d5kvqrybgkelxi1em8v",
      "image_two": "https://images.luxuryescapes.com/zdfh8a068z34orruror",
      "image_three": "https://images.luxuryescapes.com/o8g3xblvkj7fn7d73yz",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indigo Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Singapore Historic Escape with Rooftop Infinity Pool Only 15 Minutes from Changi",
      "description": "Discover the soul of old Singapore with a stay at Hotel Indigo Singapore Katong, an IHG Hotel, just a 15-minute drive from Changi International Airport. Housed within a preserved police station in the heart of Singapore’s original and trendiest heritage district, live life like a local - wander Katong’s art-filled, antique streets, enjoy modern Singaporean plates and artisanal coffee at Baba Chews, or head to the rooftop infinity pool for magnificent sunset views of the neighbourhood below.",
      "location_subheading": "Singapore",
      "price": 155,
      "original_price": 155,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt6tAAB",
      "hero_image": "https://images.luxuryescapes.com/buk8f7dqdnfy8o95gy5",
      "image_two": "https://images.luxuryescapes.com/fwa651fdzoom2jkz1y38",
      "image_three": "https://images.luxuryescapes.com/9x41o601363du5t3dbbcj",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "PARKROYAL COLLECTION Marina Bay, Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Singapore Luxury Garden-Inspired Hotel with Wellness Centre & Six Restaurants",
      "description": "The glamour of Singapore's Marina Bay is yours to discover from PARKROYAL COLLECTION Marina Bay, Singapore, an eco-conscious, high-end escape in the heart of the city. If you're seeking pampering, there's an entire floor dedicated to wellness: enjoy signature treatments and revitalising therapies at St. Gregory spa, or join a spin class in the studio. Meanwhile, the outdoor 25-metre pool is illuminated by 1,380 fiber-optic lights at night, so you can swim through a galaxy under the stars.",
      "location_subheading": "Singapore",
      "price": 281,
      "original_price": 281,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cw2UFAAZ",
      "hero_image": "https://images.luxuryescapes.com/xkzubba7akjrxep9nihdk",
      "image_two": "https://images.luxuryescapes.com/tnhz3zecqakumrddicl",
      "image_three": "https://images.luxuryescapes.com/olgssjofgo6w5sfq4mzh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Changi Airport",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Stylish Singapore Changi Airport Stay with Glittering Outdoor Pool",
      "description": "Where convenience and luxury meet, a stay at Crowne Plaza Changi Airport, an IHG Hotel, guarantees you're perfectly placed for city exploration or connecting flights. Discover the Jewel, a tropical wonderland where nature meets retail, just next to the hotel or explore downtown Singapore, just a 25-minute MRT ride away. Relax by the outdoor pool, work up a sweat in the fitness centre or follow the call of fine dining to Azur, where light bites and sumptuous meals await.",
      "location_subheading": "Singapore",
      "price": 187,
      "original_price": 187,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CPucpAAD",
      "hero_image": "https://images.luxuryescapes.com/5y0xyrx9ubdf7clqym",
      "image_two": "https://images.luxuryescapes.com/on038to6wrsj1a7uv8l",
      "image_three": "https://images.luxuryescapes.com/kwtgilnosb9mbzazllg",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Paradox Singapore Merchant Court at Clarke Quay",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Tranquil Singapore Riverside Escape Near Clarke Quay with Three Restaurants, Free-Form Pool & Serene Spa",
      "description": "Experience the perfect blend of heritage and modern luxury at this resort-style retreat in Clarke Quay. Ideally located for discovering all that Singapore has to offer, this sophisticated escape pairs old-world charm with contemporary comfort. Enjoy authentic Peranakan fare and international dishes at the riverside café, savour Western favourites beside the free-form outdoor pool, or sip on handcrafted cocktails at the Crossroads Bar, paired with scenic views. Rejuvenate at Aramsa Spa, where natural, botanical treatments restore balance and calm. Later, venture out to explore the Garden City's top attractions - all within easy reach of the hotel.",
      "location_subheading": "Singapore",
      "price": 210,
      "original_price": 210,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000DkFPaYAN",
      "hero_image": "https://images.luxuryescapes.com/w81mibahx81qgpvigo5mw",
      "image_two": "https://images.luxuryescapes.com/3zhqg8fke675m61mdzp1",
      "image_three": "https://images.luxuryescapes.com/vhz5k6qsa048ywomof8",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Faber Park - Handwritten Collection",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Contemporary Mount Faber Retreat near Sentosa Island with Rooftop Pool & Restaurant",
      "description": "Revel in the tranquillity of Mount Faber at this contemporary parkside retreat. Awaken to breathtaking views of Singapore's oldest park through floor-to-ceiling windows, before savouring the day at the rooftop pool, gazing over the tropical landscape and across to Sentosa Island. Delight your palate with a fusion of flavours at The White Tiffin Fusion restaurant, serving seasonal fare with a twist. Venture beyond the hotel to explore VivoCity, Singapore's largest shopping mall, or embark on a day trip to action-packed Sentosa Island, home to Universal Studios Singapore, world-class golf courses and the renowned S.E.A. Aquarium.",
      "location_subheading": "Singapore",
      "price": 140,
      "original_price": 140,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP08YAF",
      "hero_image": "https://images.luxuryescapes.com/x97pl19955xuexw5uhf",
      "image_two": "https://images.luxuryescapes.com/j5jyf4lfyckczn9r4fy",
      "image_three": "https://images.luxuryescapes.com/a5xeobqydvl0jil4rprw",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Robertson House - Crest Collection",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Singapore Riverside Sophistication in Robertson Quay with Outdoor Pool & Speakeasy Bar",
      "description": "Centred around one of Singapore's most trending hubs, an elegant retreat awaits at this colonial-inspired Robertson Quay gem. Savour Anglo-Asian cuisine at the elegant Entrepôt restaurant, or try a bespoke boozy concoction in the warmth of Chandu; a charming speakeasy bar with a unique market-to-glass approach. Between city-slicking adventures, float your cares away in the hotel's spacious pool before diving into a tasty snack and the perfect gin and tonic served at the alfresco poolside bar. Take a stroll through the waterfront neighbourhood of Robertson Quay, dotted with acclaimed dining and rich culture, or venture further upstream to the nearby Clarke Quay to satisfy your high-end cravings.",
      "location_subheading": "Singapore",
      "price": 134,
      "original_price": 134,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JRePcAAL",
      "hero_image": "https://images.luxuryescapes.com/8ck0eoxy782azgx9yq8q",
      "image_two": "https://images.luxuryescapes.com/x056h9onlmhn9qngxrr9",
      "image_three": "https://images.luxuryescapes.com/73jk5qrpzcqd0u3ici5",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "QT Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Opulent QT Singapore Metropolitan Escape near Clarke Quay with Rooftop Pool & Onsite Dining",
      "description": "Welcome to QT Singapore, a place where opulence is dialled to the max and eccentric artwork meets modern facilities, wrapped up with a touch of skyline charm. Head to Cygnet by Sean Connolly for signature plates and classic cocktails, or settle into the rooftop pool that will melt your stress faster than the Singapore heat. Tucked away in a restored heritage building in the heart of the Lion City, QT Singapore puts you moments away from Orchard Road's shopper's paradise. If you want to balance your city adventures with some moments of zen, the Botanic Gardens make for an ideal escape, or if you're craving a late-night food crawl through Chinatown, it's all within easy reach.",
      "location_subheading": "Singapore",
      "price": 199,
      "original_price": 199,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IVbSIAW",
      "hero_image": "https://images.luxuryescapes.com/skey7bah776xt1xconfa",
      "image_two": "https://images.luxuryescapes.com/vwejqyrzr91bw2z5zwm",
      "image_three": "https://images.luxuryescapes.com/2tzdbh3jezw44d224vyd",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Marina Bay Sands",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Marina Bay Sands Singapore Glamour with Rooftop Infinity Pool",
      "description": "Encompassing three separate towers, 55 storeys and a prime stretch of real estate on Marina Bay, this iconic Singapore sojourn epitomises luxury on a grand scale. Extravagance is evident everywhere, from its 23-storey-high light-filled atrium to the iconic 150-metre-long infinity pool, 57 floors above the city. Earning the prestigious Forbes Travel Guide five-star rating, this hotel is the epitome of luxury. Upscale retail boutiques are located opposite the hotel, with high-flying brands from Chanel to Giorgio Armani at your fingertips. When it comes to dining, you're spoilt for choice - rooftop views and signature dishes await at Lavo, along with the finest selection of steaks from three continents at Cut. Wake at sunrise for sound meditation on the tranquil Sands SkyPark or dance the night away at the the largest club in Singapore - Marquee Nightclub, complete with a full-sized ferris wheel and three-storey spiral slide. Discover moments to live at this hotel, whether you're looking for action, adventure or romance.",
      "location_subheading": "Singapore",
      "price": 558,
      "original_price": 558,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000C2CODAA3",
      "hero_image": "https://images.luxuryescapes.com/hsv9gjrxco39vpps0rj",
      "image_two": "https://images.luxuryescapes.com/xa6nqbq1c1ottxe52b9",
      "image_three": "https://images.luxuryescapes.com/w3ssuzb5je8nvt1z57j9",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Living Singapore Orchard",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Singapore Tranquil Self-Contained Apartments in Iconic Fashion District",
      "description": "Experience the vibrant energy of Singapore with a stay at these self-contained apartments, perfectly positioned in the heart of the city's bustling shopping district. Just a short stroll from the hotel, you'll find the famous Orchard Road, lined with high-end boutiques, local eateries and vibrant nightlife. After days spent exploring, return to the comfort of your stylish studio or apartment, each thoughtfully designed with expansive living areas and fully equipped kitchens. Take a dip in the hotel's shimmering pool, or keep up with your fitness routine at the gym. When it's time to explore further, the hotel's prime location offers easy access to the nearby Singapore Botanic Gardens, a UNESCO World Heritage Site, and the National Museum of Singapore, showcasing the city's rich history and culture",
      "location_subheading": "Singapore",
      "price": 1053,
      "original_price": 1053,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnGftYAF",
      "hero_image": "https://images.luxuryescapes.com/uxssu7bhgql9na5kn7",
      "image_two": "https://images.luxuryescapes.com/5k0dkv5b683ie1g4hqse",
      "image_three": "https://images.luxuryescapes.com/x96ueimp0bjxij3z0jhi",
      "deal_tier": "",
      "min_duration": 6,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Parkroyal on Beach Road",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Elegant Singapore City Oasis with Glittering Rooftop Pool & Blissful Day Spa",
      "description": "Experience refined luxury at Singapore's PARKROYAL on Beach Road - an award-winning escape located in the city's elegant Bugis district. Explore the city at your doorstep before indulging in pampering at St. Gregory for a heavenly treatment, or plunging into the huge pool with views of the city skyline. When wining and dining, take your pick from five onsite venues, including Si Chuan Dou Hua Restaurant for exquisite Suchuan cuisine, and Tian Fu Tea Room for Chinese tea and dim sum.",
      "location_subheading": "Singapore",
      "price": 179,
      "original_price": 179,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cw2V8AAJ",
      "hero_image": "https://images.luxuryescapes.com/9pf80t64ku0g0ce2oys",
      "image_two": "https://images.luxuryescapes.com/vtr3j4qkvrmvf8ay94m",
      "image_three": "https://images.luxuryescapes.com/a7vi5erar2exi2b2l4tk",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "voco Orchard Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Singapore Stay on Orchard Road Boutique Shopping District",
      "description": "Enjoy a restful slumber at voco Orchard Singapore, an IHG Hotel after a shopping spree at the boutiques of Singapore's famous Orchard Road. Savour indulgent treats at the onsite restaurants and cafes, take a refreshing dip in the rooftop pool or rest and relax in the comfort of a sophisticated suite or guest room. For those looking to work up a sweat, hit the 24-hour fitness centre or shop 'til you drop at the many upscale boutiques and department stores along Singapore's famed shopping strip.",
      "location_subheading": "Singapore",
      "price": 181,
      "original_price": 181,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CP3wgAAD",
      "hero_image": "https://images.luxuryescapes.com/3inkf4suwkhmy2haekwq",
      "image_two": "https://images.luxuryescapes.com/vqjcweh7kjfacisxdja",
      "image_three": "https://images.luxuryescapes.com/kdpp0j5ao42xj5obi05i",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Singapore Bugis",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Heritage-Inspired Chic Singapore Stay with Panoramic City Views, Onsite Dining & Infinity Pool",
      "description": "Resting in the heart of Singapore’s arts and cultural district, Bugis-Bras Basah, this contemporary and colourful oasis is designed for a trendy stay. Stunning heritage-inspired rooms and steps from historical landmarks, eclectic shopping malls and trendy eateries, this is your gateway to the best of Singapore. Unwind in style with a stunning infinity pool overlooking the city and a breathtaking sky deck with panoramic Singapore views. Food lovers will rejoice with international and local cuisine at Royale Restaurant, award-winning Chinese at Song Garden and refreshing cocktails at Bartistry@One22.",
      "location_subheading": "Singapore",
      "price": 126,
      "original_price": 126,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP0BYAV",
      "hero_image": "https://images.luxuryescapes.com/wwj7tg4fghksyga1ymzo",
      "image_two": "https://images.luxuryescapes.com/klzlnb2bofuvgfo45ld3",
      "image_three": "https://images.luxuryescapes.com/6rb8na8fzmwnfi3w1o9p",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Capitol Kempinski Hotel Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Kempinski Luxury in the Heart of Singapore with Saltwater Relaxation Pool",
      "description": "Experience unrivalled luxury at The Capitol Kempinski Hotel Singapore, a five-star property that exudes the timeless heritage charm of a luxurious colonial building while offering guests every modern convenience. This cosmopolitan retreat is perfectly positioned to explore Singapore's famed sites, including Gardens by the Bay, Merlion Park and the National Gallery of Singapore. Spend your days eating, drinking, shopping and exploring before returning to your elegant accommodation. Head to the hotel's saltwater relaxation pool to soak away your stress or work up a sweat in the onsite fitness centre. Pop over to the mouthwatering 15 Stamford Restaurant to bring your palate to new heights as you savour the freshest land and sea produce, meticulously prepared by their talented culinary team for delicious international cuisine.",
      "location_subheading": "Singapore",
      "price": 274,
      "original_price": 274,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003IAIuAAO",
      "hero_image": "https://images.luxuryescapes.com/b7l3pz2sxrb2n5917czf",
      "image_two": "https://images.luxuryescapes.com/2reewso5un4h7e958g5",
      "image_three": "https://images.luxuryescapes.com/18cbqwwzafi5v1dw7fuk",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mandai Rainforest Resort",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Grand Opening: Tranquil Singapore Rainforest Hideaway with Two Restaurants & Rooftop Infinity Pool",
      "description": "Experience the wild beauty of Singapore’s lush Mandai Wildlife Reserve at this eco-luxury sanctuary, where nature and comfort exist in perfect harmony. Wake to the sounds of the rainforest and explore world-famous neighbours, including the Singapore Zoo, Night Safari and River Wonders, all mere steps away from this sustainability-first haven. Spend your days wandering forest trails, encountering rare wildlife and reconnecting with nature before retreating to your signature room inspired by its surroundings. When hunger strikes, relish farm-to-table delicacies at Forage and enjoy all-day dining at Planter's Shed, all complemented by serene rainforest views. Later, embrace restorative spa treatments infused with botanicals at the Banyan Tree Spa.",
      "location_subheading": "Singapore",
      "price": 257,
      "original_price": 257,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GlrXXYAZ",
      "hero_image": "https://images.luxuryescapes.com/60w6lewah5ngnx04bumrf",
      "image_two": "https://images.luxuryescapes.com/pxtozxx6sxcmu15nlk",
      "image_three": "https://images.luxuryescapes.com/4huv95jh0qny3fvj3k33",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "PARKROYAL Collection Pickering, Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Singapore Garden Oasis in Chinatown with Infinity Pool",
      "description": "Reach a state of relaxation in a garden oasis in the heart of Singapore with a stay at the five-star PARKROYAL COLLECTION Pickering. Known as Singapore's first hotel-in-a-garden, this architectural marvel features four garden terraces guaranteed to leave you amazed. Laze by the hotel's shimmering infinity pool, head to award-winning St. Gregory Spa for a rejuvenating treatment or embark on a diverse culinary experience at vibrant, open-kitchen-concept Lime Restaurant.",
      "location_subheading": "Singapore",
      "price": 274,
      "original_price": 274,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cw2UeAAJ",
      "hero_image": "https://images.luxuryescapes.com/h376irv0j97dhrxsr9x",
      "image_two": "https://images.luxuryescapes.com/zr3uve3twmtlowu6o2h9",
      "image_three": "https://images.luxuryescapes.com/0nio72hhc8rn1ruy77qo",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Pan Pacific Serviced Suites Orchard",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Elegant Singapore Escape in Heart of Orchard Road",
      "description": "Explore Singapore’s bustling Orchard Road like a local with a stay at the inner-city sanctuary of Pan Pacific Serviced Suites Orchard. Spring into the dazzling shopping precinct of Orchard Road and spend balmy nights discovering world-class dining aplenty, all a short stroll away. Cool off by taking a dip in the shimmering outdoor pool for a serene moment or head to Bedrock Bar and Grill for an unforgettable gastronomical feast offering a festival of flavour from across the world.",
      "location_subheading": "Singapore",
      "price": 1803,
      "original_price": 1803,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cw2WaAAJ",
      "hero_image": "https://images.luxuryescapes.com/xv7dcjj38payauua8589",
      "image_two": "https://images.luxuryescapes.com/fo6l6mpz6rfostnxlzg",
      "image_three": "https://images.luxuryescapes.com/r89pluyxmboc51j41cozq",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "COMO Metropolitan Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Singapore COMO Luxury Moments from Orchard Road with Onsite Gourmet Dining & Expansive Wellness Studio",
      "description": "Experience the best of Singapore's spoils at this luxury retreat just moments from the world-famous Orchard Road shopping and dining precinct. Satisfy your palate onsite at COTE Singapore, a Korean steakhouse by Michelin-alum chef Simon Kim, sip cocktails at the Sky Bar and savour flaky pastries from Cédric Grolet's first patisserie in Asia. Start your day with a coffee made by the in-house robot barista, Bruno, and then head to the expansive COMO Shambhala spa offering a range of rejuvenating and holistic treatments.",
      "location_subheading": "Singapore",
      "price": 251,
      "original_price": 251,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002HYW6IAO",
      "hero_image": "https://images.luxuryescapes.com/q80uok6ieqip4vtbg1m",
      "image_two": "https://images.luxuryescapes.com/jv6sfdsser3erfgp9vbp",
      "image_three": "https://images.luxuryescapes.com/7vwk0yzrd1a8c6s68frf",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Singapore Orchard (Previously Grand Park Orchard)",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Glamorous Singapore Stay on Orchard Road with Gourmet Restaurant & Chic Beach Club",
      "description": "Delve into a world of designer fashion and sophistication with a stay at this luxurious Pullman sanctuary, nestled in the heart of Singapore's iconic Orchard Road. Discover the vibrancy of the city's premier shopping and entertainment district with a vast array of boutiques, restaurants, bars and dazzling malls right at your doorstep, waiting to be explored. Spend your days making memories at the Instagram-friendly P.S.O. Beach Club, serving up artisanal cocktails at the swim-up bar and hosting retro pool parties that capture the spirit of tropical fun in the middle of the city. Swim laps in the outdoor pool or embark on a culinary journey at the stunning glasshouse restaurant, Eden where you can sample modern Asian delicacies.",
      "location_subheading": "Singapore",
      "price": 209,
      "original_price": 209,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvxIAC",
      "hero_image": "https://images.luxuryescapes.com/gr5dhjd2dpncm2r0uhi",
      "image_two": "https://images.luxuryescapes.com/360frck7khjhpc2r2cg",
      "image_three": "https://images.luxuryescapes.com/bgmr8b93fvt8gpuzpea",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Raffles Hotel Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Iconic Raffles Singapore Opulence with Historic Bars & Dining Venues",
      "description": "As the world's first Raffles destination and one of the most iconic hotels in the world, this Singapore landmark sets the standard for five-star luxury. Experience a monumental stay with world-class facilities and regal design, backed by legendary and impeccable hospitality. Savour exquisite dining at the hotel's renowned Tiffin Room, serving authentic North Indian cuisine, or indulge in a signature Singapore Sling at its birthplace at the Long Bar. Sit where legendary authors have clinked cocktails at the Writers Bar and indulge in sumptuous wellness therapies at the spa.",
      "location_subheading": "Singapore",
      "price": 789,
      "original_price": 789,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvmIAC",
      "hero_image": "https://images.luxuryescapes.com/b4oix5itd8r5yiixkm49k",
      "image_two": "https://images.luxuryescapes.com/tn1zrfwy5sws7787g94o",
      "image_three": "https://images.luxuryescapes.com/adebt3578rjok56a2uu",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pan Pacific Orchard",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Opulent Singapore Pan Pacific Escape Above Prime Shopping Street",
      "description": "Discover Pan Pacific Orchard, a verdant sanctuary on the iconic Orchard Road that integrates nature across four tropical levels. Visit Florette bar, where bubbles and caviar unite against a smouldering backdrop. Get the wow-factor at Mosella restaurant, serving farm-to-table fare in a gilded setting. Or take to the sand-edged pool on the Beach Terrace and find where the coast meets the sky.",
      "location_subheading": "Singapore",
      "price": 255,
      "original_price": 255,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Exv2DAAR",
      "hero_image": "https://images.luxuryescapes.com/3e98kurg8685y8c4k0q6",
      "image_two": "https://images.luxuryescapes.com/scx5la5jgdodfj4qmk8j",
      "image_three": "https://images.luxuryescapes.com/8vwtmmnuovtt3nkty53",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Dao by Dorsett AMTD Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Five-Star Singapore CBD Apartment-Style Stay with Infinity Pool & Restaurant",
      "description": "Between historic hawker centres, spectacular skylines and supertrees stands the modern, five-star Dao by Dorsett AMTD Singapore, offering guests an apartment-style stay in the heart of the city’s vibrant central business district. After days spent shopping on Orchard Road or witnessing the wondrous Gardens by the Bay, return to a top-notch fitness centre and relax by the hotel's serene, seventh-floor infinity pool, seemingly disappearing into the skyline beyond. Two sumptuous dining and drinking venues await at Dao by Dorsett AMTD Singapore - savour international plates with Singaporean flair at Collective or sip handcrafted cocktails beneath avant-garde chandeliers in the hotel’s Grand Lobby. Positioned just moments from MRT Tanjong Pagar Station and the city's many delights, each spacious, contemporary apartment boasts everything you need to discover Singapore's very best.",
      "location_subheading": "Singapore",
      "price": 179,
      "original_price": 179,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Flo7bAAB",
      "hero_image": "https://images.luxuryescapes.com/mwv9p91bdd2o1wk56o",
      "image_two": "https://images.luxuryescapes.com/3av3mid5kp9p34tjerio",
      "image_three": "https://images.luxuryescapes.com/jq7p8krvtcje7zc4q9fb",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Swissotel The Stamford Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Singapore Urban Luxury with Panoramic Views & Michelin-Starred Restaurant",
      "description": "Step into a world of modern comfort and opulence with a stay at one of the tallest hotels in Southeast Asia. Take in scenic views of Singapore’s cityscape from your balcony before indulging in the hotel's extensive collection of restaurants and bars, including two Michelin-starred JAAN by Kirk Westaway. Watch the sun set with a cocktail in hand at SKAI Bar, lounge by one of two pools, or unwind with a treatment at Willow Stream Spa before exploring vibrant Singapore.",
      "location_subheading": "Singapore",
      "price": 269,
      "original_price": 269,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000IbsWwAAJ",
      "hero_image": "https://images.luxuryescapes.com/g1y6p28tvjitv1ly4iph",
      "image_two": "https://images.luxuryescapes.com/vnlon90d7rq3bxc4ndoc",
      "image_three": "https://images.luxuryescapes.com/tz52zb3moehjwwoizigj",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Sofitel Singapore Sentosa Resort & Spa",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Elegant Singapore French-Inspired Luxury on Sentosa Island with Pool, Three Restaurants & Jazz Bar",
      "description": "Perched on a cliff overlooking the shimmering waters of the South China Sea, this five-star Sofitel sanctuary boasts a coveted spot on the southern edge of Singapore's ever-vibrant Sentosa Island. Sprawled out over 27 acres, this resort offers direct access to the Tanjong Beach and brings French sophistication at every turn - from luxurious suites and rooms to glittering seafront pools. Savour gastronomic delights at Kwee Zeen, which serves Pan-Asian, Western, and Indian cuisine, while The Cliff, an alfresco restaurant, specialises in Italian fare. For indulgent high teas, find yourself at LeBar and unwind in style at Maduro, the resort's onsite whisky and jazz bar. When you wish to explore, the bustle of downtown is a short drive away.",
      "location_subheading": "Singapore",
      "price": 237,
      "original_price": 237,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GUDHyYAP",
      "hero_image": "https://images.luxuryescapes.com/bpya2toozl0y9k86fkpg",
      "image_two": "https://images.luxuryescapes.com/3o0ja0uctoyelx0tdel",
      "image_three": "https://images.luxuryescapes.com/kfxe85ug1lpk8m6ecs",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Singapore On Stevens",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Lush Singapore Retreat Near Gardens by the Bay with Infinity Pool & Gourmet Dining",
      "description": "Step into an urban oasis minutes from Singapore's retail heart Orchard Road and the UNESCO World Heritage-listed Singapore Botanic Gardens. Inspired by the city's iconic colonial black-and-white houses, the stylish rooms blend heritage charm with modern luxury. Unwind at the 24-hour gym, take a dip in the infinity or lap pool or test your skills on the tennis court. Savour global cuisine at Winestone Restaurant and enjoy room service at your leisure. For food enthusiasts, the hotel is ideally located near a wide range of dining options, from bustling hawker centres to world-class restaurants. Explore iconic landmarks like Marina Bay Sands and Gardens by the Bay for a truly unforgettable Singapore experience.",
      "location_subheading": "Singapore",
      "price": 99,
      "original_price": 99,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnGfrYAF",
      "hero_image": "https://images.luxuryescapes.com/5ak955ybie6erkvuxy2n",
      "image_two": "https://images.luxuryescapes.com/8gs9s8cfyqvia41lyla",
      "image_three": "https://images.luxuryescapes.com/vhcfeb6qqt9qa17sfaca",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Holiday Inn Singapore Orchard City Centre",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Stylish Singapore Stay Near Orchard Road w. Rooftop Pool",
      "description": "Holiday Inn Singapore Orchard City Centre, an IHG Hotel is the ultimate launchpad to experience the refined elegance of Singapore's glittering Orchard Road. Invigorate body and mind at the fitness centre or with a refreshing dip in the rooftop pool, before venturing out into the famed shopping district and beyond. Return from your adventures and sate your appetite at the hotel's sumptuous Tandoor restaurant - a renowned Indian restaurant serving fragrant fare.",
      "location_subheading": "Singapore",
      "price": 150,
      "original_price": 150,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DGfhWAAT",
      "hero_image": "https://images.luxuryescapes.com/x1zn7cemosvnojtpdzb",
      "image_two": "https://images.luxuryescapes.com/qvkcrh7lad8wz0u5lnd",
      "image_three": "https://images.luxuryescapes.com/x5uaccx1xtdni6xl77v",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Singapore Tyrwhitt",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Chic Singapore City Stay near Little India with Rooftop Pool & Onsite Restaurant",
      "description": "Immerse yourself in the eclectic energy of Singapore with a sophisticated stay at this Mercure sanctuary, perfectly situated in the trendy Jalan Besar district, popular for its vibrant mix of hipster cafes, stylish boutiques and traditional hawker centres. Soak up the charms of Singapore from the floor-to-ceiling windows of the well-appointed rooms, take a refreshing dip in the hotel's rooftop pool and cool off with a drink from the bar. Explore the nearby cultural heritage sites of Little India and Chinatown while the iconic Mustafa Centre and the world-class shopping precinct of Orchard Road are also within easy reach. Return to your hotel and indulge in a gastronomic experience with creatively prepared dishes and Western delicacies at Applause on Tyrwhitt Bistro & Bar.",
      "location_subheading": "Singapore",
      "price": 124,
      "original_price": 124,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP09YAF",
      "hero_image": "https://images.luxuryescapes.com/i5qaidejglfj7gaxblpf",
      "image_two": "https://images.luxuryescapes.com/61yiqpab8s3m25vvylg",
      "image_three": "https://images.luxuryescapes.com/m4wyffi1im8maga5pid3",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Holiday Inn Singapore Little India",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Central Stay in Singapore's Vibrant & Colourful Little India District",
      "description": "Enjoy a stylish stay at the Holiday Inn Singapore Little India, an IHG Hotel, in the heart of the city's colourful Little India district, full of heritage shop fronts and quaint eateries. Soak up authentic Thai street food and endless panaromic city views at the onsite restaurant, Blue Jasmine, ponder your trip over a coffee and superfood bowl at Soul Brew, or cool down with a dip in the sparkling outdoor pool. Located atop Farrer Park MRT station, this hotel connects you to the best Singapore has to offer.",
      "location_subheading": "Singapore",
      "price": 147,
      "original_price": 147,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DH7vgAAD",
      "hero_image": "https://images.luxuryescapes.com/2lpyr1muj79o6xgq6tlj",
      "image_two": "https://images.luxuryescapes.com/dt1rxcb4yc6gmkse4slj",
      "image_three": "https://images.luxuryescapes.com/7hwp8v16se7xxljznx6u",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Singapore On Stevens",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Singapore Novotel Sophistication Near Orchard Road with Infinity Pool & Onsite Restaurant",
      "description": "Experience the sophisticated elegance and refined luxury of the bustling Orchard Road with a stay at the cosmopolitan Novotel Singapore On Stevens. Sink into sleek rooms that feel like your own stylish sanctuary. Decompress in the rejuvenating spa treatment or float away in the glittering infinity pool. Offering superb access to the famed shopping district, shop 'til you drop before retreating to this elegant hotel. Savour indulgent treats at the Food Exchange buffet, and end your day at the L'Apéritif Lobby Bar, serving French-inspired cocktails and European and Asian tapas.",
      "location_subheading": "Singapore",
      "price": 134,
      "original_price": 134,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2yXIAS",
      "hero_image": "https://images.luxuryescapes.com/dvgqsrr8fovb2ofal3",
      "image_two": "https://images.luxuryescapes.com/jzf2xqwleqd6dd765xg5",
      "image_three": "https://images.luxuryescapes.com/ojttb256g8cb2h1f8bu",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Singapore Hill Street",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Trendy Singapore Pullman Stay Moments from Fort Canning Park with Pool & Onsite Dining",
      "description": "Be at the forefront of Singapore’s energetic offerings with a stay at this renowned Pullman location. Perfectly positioned in the city's bustling arts and heritage district, the hotel lands you within walking distance of Fort Canning Park, the famous Orchard Road and Marina Bay precinct. Delight in culinary experiences, from craft cocktails at Moga, to rooftop Mexican at El Chido and New York dishes at Madison’s, before taking time out for a refreshing dip in the sun-dappled pool.",
      "location_subheading": "Singapore",
      "price": 219,
      "original_price": 219,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000IbsNoAAJ",
      "hero_image": "https://images.luxuryescapes.com/hr2nzyiv11yc4yoh4nc",
      "image_two": "https://images.luxuryescapes.com/lnfza43tdrmb26594yb",
      "image_three": "https://images.luxuryescapes.com/0qluq73rli3rr6zv4lb",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "PARKROYAL Serviced Suites Singapore",
      "offer_country_name": "Singapore",
      "location_heading": "Singapore",
      "title": "Singapore Serviced Suite Stay with Tranquil Day Spa",
      "description": "Singapore's effortlessly cool city centre beats with intrigue and culture and is yours to explore when you stay at PARKROYAL Serviced Suites Singapore. Celebrate the royal heritage of Kampong Glam and the bustle of Suntec City, where traditions and culture meet modern living. Don't miss a chance to be pampered at St. Gregory, for heavenly treatments like Ayurveda therapy, hot stone massages and facials using top-of-the-line Elemis products. When wining and dining, four onsite venues offer up everything from Sichuan cuisine to Chinese tea, Singaporean dishes with a twist and craft cocktails.",
      "location_subheading": "Singapore",
      "price": 1607,
      "original_price": 1607,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cw2YCAAZ",
      "hero_image": "https://images.luxuryescapes.com/fyi7rs74mjqrkwehanj",
      "image_two": "https://images.luxuryescapes.com/zuoofqaqusz3tqoori5",
      "image_three": "https://images.luxuryescapes.com/u0mgzc76q07hnt7nh7r",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hoteles en Singapore - Singapore Hotels & Travel Guide 2024",
    "description": "Encuentra los mejores hoteles en Singapore, Singapore con ofertas exclusivas. Reserva tu escapada perfecta con hasta 60% de descuento.",
    "keywords": [
      "singapore hotels",
      "singapore travel",
      "singapore hotels"
    ],
    "canonical": "https://mondoexplora.com/es/destination/singapore",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/singapore",
      "es": "https://mondoexplora.com/es/destination/singapore",
      "fr": "https://mondoexplora.com/fr/destination/singapore",
      "it": "https://mondoexplora.com/it/destination/singapore"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 42,
    "average_price": 338,
    "average_discount": 2
  }
}