[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eMWOPQA4",
    "hero_image": "https://images.luxuryescapes.com/eitjwydfnx1hmpnnq9i",
    "image_two": "https://images.luxuryescapes.com/z8z9b0fljmd2kduoied5",
    "image_three": "https://images.luxuryescapes.com/v8msg8r2pyfpxfx6sthg",
    "vendor_name": "Bab Al Qasr",
    "title": "Luxury Five-Star City Break with Daily Dining",
    "description": "Unlock the secrets of Abu Dhabi from one of the best positions in the city with a stay at the luxurious Bab Al Qasr, Biltmore Collection by Millennium, your gateway to the treasures of the exclusive Corniche area, close to the Presidental Palace, the Marina Mall and Heritage Village. Set on its own private beachfront and draped in iconic architecture with quintessential Arabian style and Moroccan flair, this Middle East treasure of high ceilings, gold tiles and Arabic architecture is the ultimate stopover destination en route to Europe.\n\nMake the most of your stay with daily buffet breakfast, nightly dinner, a welcome drink per person, per stay, and 25% off all spa treatments. **Bringing the family?** Upgrade to the Deluxe Room and two children (aged 11 years and under) stay free with daily breakfast and nightly dinner.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Bab Al Qasr, Biltmore Collection by Millennium",
    "offer_address": "Corniche Rd W - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 433.0,
    "value": 1263.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2mHhQAJ",
    "hero_image": "https://images.luxuryescapes.com/qddpivrgrqyx5wevhawx",
    "image_two": "https://images.luxuryescapes.com/zwg4garaecd2pofcrr8s",
    "image_three": "https://images.luxuryescapes.com/pzx7fh8uwosxntql0fns",
    "vendor_name": "Conrad at Etihad Towers",
    "title": "Five-Star Abu Dhabi Opulence with Daily Breakfast and Dinner",
    "description": "Experience the cultural capital of the United Arab Emirates in five-star opulence with a luxurious stay at Jumeirah at Etihad Towers. Rated the #1 hotel in Abu Dhabi on TripAdvisor, this lavish property boasts a private beach, on-site spa with 13 treatment rooms, seven restaurants, three bars and the Observation Deck at 300, offering panoramic views from the 74th floor, the highest vantage point in Abu Dhabi. Includes daily buffet breakfast, nightly dinner, one beer or wine per person and unlimited access to the Observation Deck at 300. Plus, one child (aged 11 and under) stays free, with breakfast and dinner included.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Jumeirah at Etihad Towers - OLD",
    "offer_address": "Etihad Towers,West Corniche, - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 400.0,
    "value": 1471.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cpPdkQAE",
    "hero_image": "https://images.luxuryescapes.com/w4fs87kc71yugplmq6b",
    "image_two": "https://images.luxuryescapes.com/fcjid77m9uw0jtodmae",
    "image_three": "https://images.luxuryescapes.com/bq8ehcoerrx5hss324hj",
    "vendor_name": "The Ritz-Carlton, Abu Dhabi",
    "title": "Venetian Elegance at The Ritz-Carlton Abu Dhabi, Grand Canal",
    "description": "Experience Middle Eastern opulence with an Italian twist at The Ritz-Carlton Abu Dhabi, Grand Canal, the only hotel with direct views of Sheikh Zayed Grand Mosque. The location is second to none: just 20 minutes from the airport, yet in the city, meaning it’s easy to get to the Grand Mosque, Ferrari World, malls and more. Situated on the Grand Canal of Abu Dhabi, the hotel boasts Venetian touches including the Venetian Village with its winding cobblestone streets and Renaissance-inspired architecture. Your escape includes daily buffet breakfast, nightly buffet dinner, one daily glass of wine, beer or soft drink per person, private arrival airport transfer and 25% off food, beverages and spa treatments. Plus, one child (aged 11 years and under) stays free with full package inclusions.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "The Ritz-Carlton Abu Dhabi, Grand Canal",
    "offer_address": "Al Maqta, Abu Dhabi 0000, United Arab Emirates",
    "percentage_discount": 77.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 522.0,
    "value": 2277.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008goGaAAI",
    "hero_image": "https://images.luxuryescapes.com/6938mu6t86fzsijavifp",
    "image_two": "https://images.luxuryescapes.com/bt1k8mnjgeoe4ko4p86oi",
    "image_three": "https://images.luxuryescapes.com/mwtb3rycxjx82blzzl9i",
    "vendor_name": "Conrad at Etihad Towers",
    "title": "Top-Rated Five-Star Abu Dhabi Opulence with Daily Breakfast & Nightly Dinner",
    "description": "Discover the epitome of opulence at the glistening Conrad Abu Dhabi Etihad Towers, a five-star city icon towering above the stunning Corniche where you'll find eight kilometres of manicured waterfront. This supremely luxurious launchpad delivers personalised Conrad service and style across a spectacular 10,000-square-foot setting.\n\nChoose from 12 onsite bars and restaurants showcasing everything from international cuisine to handcrafted cocktails, and enjoy a lavish spa offering an extensive treatment menu guaranteed to elevate relaxation. Cool off with a plunge in the outdoor pool, soothe jetlag with a revitalising massage or soar up to the Observation Deck at 300 to take in mesmerising views of the city skyline from the 74th floor. Further afield, uncover the UAE's desert sand dunes, fragrant souks, and futuristic theme parks before returning to your lavish retreat.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Conrad Abu Dhabi Etihad Towers",
    "offer_address": "Etihad Towers, West Corniche, Al Khubeirah, Abu Dhabi, United Arab Emirates",
    "percentage_discount": null,
    "min_duration": null,
    "max_duration": null,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Uxb95QAB",
    "hero_image": "https://images.luxuryescapes.com/iyvwcxlemlmifb97wtq3",
    "image_two": "https://images.luxuryescapes.com/t3atktovxpfimvqst7us",
    "image_three": "https://images.luxuryescapes.com/hssrnwjtra0ajdztnwge",
    "vendor_name": "Radisson Blu Hotel Abu Dhabi Yas Island",
    "title": "Fun in the Sun at Abu Dhabi’s Entertainment Capital, Yas Island",
    "description": "Enjoy a sun-kissed stay in the midst of Abu Dhabi’s premier entertainment destination Yas Island, staying at Radisson Blu Hotel, Abu Dhabi Yas Island - where the white sands of Yas Beach and attractions such as Ferrari World Abu Dhabi, Yas Waterworld, Yas Mall and Warner Bros. World Abu Dhabi are all just minutes away. Includes daily breakfast, one dining experience, guaranteed late checkout until 1pm, a 20% discount on drinks and spa treatments and a complimentary shuttle service to Yas Beach and Yas Mall.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Radisson Blu Hotel, Abu Dhabi Yas Island - 2018*",
    "offer_address": "Abu Dhabi - Emirate - United Arab Emirates",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 221.0,
    "value": 723.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LmbZAAS",
    "hero_image": "https://images.luxuryescapes.com/jyd8k766mocg02ok67l",
    "image_two": "https://images.luxuryescapes.com/zlvgyb2lun5ykdqbrwn8",
    "image_three": "https://images.luxuryescapes.com/gfddwrg288vjuglkfxlf",
    "vendor_name": "Conrad at Etihad Towers",
    "title": "Abu Dhabi Jumeirah Opulence with Nightly Dinner",
    "description": "Discover the pinnacle of Abu Dhabi opulence at the glistening Jumeirah at Etihad Towers, located on the stunning Corniche waterfront opposite Emirates Palace. One of Abu Dhabi’s top hotels, this supremely luxurious five-star hotel delivers personalised Jumeirah service and style in a spectacular setting with a private beach, an award-winning spa and 10 restaurants and bars. Experience it all with daily buffet breakfast, nightly buffet dinner, a one-time poolside cocktail per adult, guaranteed early check-in or late check-out and 20% off at Talise Spa. Plus, enjoy unlimited access to Observation Deck at 300, offering the most mesmerising (and highest) views of the city skyline from the 74th floor.\n\nTravelling with the family? One child (aged 11 years and under) stays free with daily breakfast and nightly dinner.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Jumeirah at Etihad Towers old",
    "offer_address": "Etihad Towers,West Corniche, - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 359.0,
    "value": 1477.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C53w5AAB",
    "hero_image": "https://images.luxuryescapes.com/fpby5ux53hk14zs9tnqd",
    "image_two": "https://images.luxuryescapes.com/f9odupxtbifdlpwm5ada",
    "image_three": "https://images.luxuryescapes.com/4t3cyhssg9tw7xqbxcds",
    "vendor_name": "Sofitel Abu Dhabi Corniche",
    "title": "Five-Star Sofitel Stay on Abu Dhabi's Iconic Corniche with Daily Breakfast & Nightly Dinner",
    "description": "Position yourself in the heart of Abu Dhabi’s prestigious Corniche - a sparkling stretch of coastline with waterfront pedestrian pathways leading to pristine sands and countless dining and entertainment options - with a luxe five-star stay at Sofitel Abu Dhabi Corniche. Feel immediately refreshed with a dip in the sparkling pool, sweat it out at the expansive fitness centre with steam room and sauna, visit Sofitel SPA for a moment of bliss, or embark on a culinary journey at the five contemporary restaurants and two bars onsite. Further afield, don't miss a visit to Sheikh Zayed Grand Mosque - the largest mosque in the country - experience thrilling rides at Ferrari World Abu Dhabi or marvel at the treasures of Louvre Abu Dhabi.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Sofitel Abu Dhabi Corniche",
    "offer_address": "Corniche Road East Capital Plaza Complex, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 351.0,
    "value": 1020.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvsdKQAR",
    "hero_image": "https://images.luxuryescapes.com/rjlwrqd2xtfl5q4knz6y",
    "image_two": "https://images.luxuryescapes.com/vcfcgogcrez2gkmfgnht",
    "image_three": "https://images.luxuryescapes.com/fqdely0shsgri98arhhc",
    "vendor_name": "Park Hyatt Abu Dhabi Hotel and Villas",
    "title": "Stunning Beachfront Escape at Park Hyatt Abu Dhabi",
    "description": "Experience the cultural capital of the United Arab Emirates in the natural paradise of Saadiyat Island and indulge in true Arabian luxury only 15 minutes from downtown. Enjoy a three or five-night stay at the five-star and award-winning Park Hyatt Abu Dhabi Hotel and Villas. This luxurious stay includes daily buffet breakfast, nightly buffet or a la carte dinners, welcome in-room bottle of wine, guaranteed late checkout and more.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Park Hyatt Abu Dhabi Hotel and Villas 2018",
    "offer_address": "PO Box 52007 Abu Dhabi, United Arab Emirates,",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 636.0,
    "value": 1501.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X9MiGQAV",
    "hero_image": "https://images.luxuryescapes.com/z2gzp3f0vklx6jbacbrq",
    "image_two": "https://images.luxuryescapes.com/rpmw26r76ihxtrrh3r0q",
    "image_three": "https://images.luxuryescapes.com/z8n0pwhpef3ra5njfg5w",
    "vendor_name": "Fairmont Bab Al Bahr",
    "title": "Iconic Abu Dhabi Escape with Exclusive Access to the Fairmont Gold Lounge",
    "description": "Discover the magic of the ‘Arabian Jewel’ in style and grace, staying at the iconic Fairmont Bab Al Bahr - one of the most recognizable hotels in the city, where sheer luxury meets prime waterfront location. Holiday like royalty with exclusive access to the Fairmont Gold Lounge and its VIP privileges, including: a private check-in and checkout at the Fairmont Gold reception area located on the 7th floor of the hotel, daily breakfast, all day tea, coffee and soft drinks, decadent daily afternoon tea, cocktail and canapés with a nightly happy hour and a daily hour of sweet treats. Plus, enjoy an AED200 voucher per person for Marco Pierre White Steak House & Grill, and your choice of early check-in or late checkout.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Fairmont Bab Al Bahr",
    "offer_address": "Between The Bridges, Khor Maqta, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 380.0,
    "value": 1146.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005Jci6AAC",
    "hero_image": "https://images.luxuryescapes.com/tq2ubvvd53ul1i7ezdjh",
    "image_two": "https://images.luxuryescapes.com/mnvhnkynbmo64c563q",
    "image_three": "https://images.luxuryescapes.com/3lvi6kf3tchy0j4mbbyk",
    "vendor_name": "Sofitel Abu Dhabi Corniche",
    "title": "Five-Star Sofitel Stay on Abu Dhabi's Prestigious Corniche with Daily Breakfast & Nightly Dinner",
    "description": "Position yourself in the heart of Abu Dhabi’s prestigious Corniche - a sparkling stretch of coastline with waterfront pedestrian pathways leading to a pristine stretch of beach and countless dining and entertainment options - with a luxe stay at Sofitel Abu Dhabi Corniche. Experience five-star, French-inspired luxury and take advantage of world-class facilities. Feel immediately refreshed with a dip in the sparkling pool, relax on the terrace, sweat it out at the expansive fitness centre with steam room and sauna, visit Sofitel SPA for a moment of bliss, or embark on a culinary journey at the contemporary restaurants and bars onsite. At the end of the day, sink into the plush comfort of your room, where French elegance seamlessly fuses with Middle Eastern sophistication.\n\nWith its glossy high rises, incredible shopping and Arabian architecture, Abu Dhabi is undoubtedly one of the UAE’s most exciting cities to visit. Spend your days strolling along the waterfront on the palm-fringed Corniche Beach, considered one of Abu Dhabi’s best thanks to its pristine sand and turquoise water. Don’t miss a visit to Sheikh Zayed Grand Mosque, the largest mosque in the country and a fantastic example of ornate Islamic architecture. Ferrari World is the ideal spot for keeping car enthusiasts entertained, while Louvre Abu Dhabi is a treasure trove for culture vultures, and Marina Mall is on hand to satisfy shopaholics.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Sofitel Abu Dhabi Corniche",
    "offer_address": "Corniche Road East Capital Plaza Complex, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 304.0,
    "value": 673.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000OfWKRAA3",
    "hero_image": "https://images.luxuryescapes.com/khtp0ibfoiytlqvhetit",
    "image_two": "https://images.luxuryescapes.com/aahmhuetpza4gno7wace",
    "image_three": "https://images.luxuryescapes.com/lm3ji15vxpmvyamdigce",
    "vendor_name": "Rosewood Abu Dhabi",
    "title": "Abu Dhabi Cultural Escape with Manor Club Access",
    "description": "Discover the magic of the ‘Arabian Jewel’ with an opulent stay at the Rosewood Abu Dhabi, located a mere 15 minutes away from the Louvre Abu Dhabi. Enjoy three or five nights of luxury in one of the top 20 hotels in the city with exclusive access to the Manor Club Executive Lounge, unlocking VIP’s extras such as daily artisan breakfast, all-day refreshments, a decadent afternoon tea, pre-dinner drinks and hors d’oeuvres, a complimentary fitness consultation with a personal trainer, 20% discount at Sense, a Rosewood Spa, 20% discount on food and drinks at the hotel’s restaurants, and a leisurely late guaranteed 4pm check out.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Rosewood Abu Dhabi",
    "offer_address": "Al Maryah Island - 41184 , Al Maryah Island, 41184 Abu Dhabi, United Arab Emirates",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 476.0,
    "value": 860.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cJMoJQAW",
    "hero_image": "https://images.luxuryescapes.com/62khirp676i6bqmmd1z4",
    "image_two": "https://images.luxuryescapes.com/mv1awn204naczbn8e6a7",
    "image_three": "https://images.luxuryescapes.com/hfqkxkktb0zbcfxu02h",
    "vendor_name": "Conrad at Etihad Towers",
    "title": "Five-Star Abu Dhabi Opulence with Daily Breakfast and Dinner",
    "description": "Experience the cultural capital of the United Arab Emirates in five-star opulence with a luxurious stay at Jumeirah at Etihad Towers. Located on the stunning Corniche waterfront, this lavish property boasts a private beach, on-site spa, thirteen restaurants and bars and the Observation Deck at 300, offering panoramic views from the 74th floor, the highest vantage point in Abu Dhabi. Includes daily buffet breakfast, nightly dinner, one beer, wine or soft drink per person and unlimited access to the Observation Deck at 300. Plus, one child (aged 11 years and under) stays free, with breakfast and dinner included.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Jumeirah at Etihad Towers 2019",
    "offer_address": "Etihad Towers,West Corniche, - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 434.0,
    "value": 1421.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cJMmDQAW",
    "hero_image": "https://images.luxuryescapes.com/z5nzv4nxjgrvjckt92op",
    "image_two": "https://images.luxuryescapes.com/kqt8iio2zdygnp5f5so9",
    "image_three": "https://images.luxuryescapes.com/kri0k4crdrf4ksi410wp",
    "vendor_name": "Emirates Palace Mandarin Oriental, Abu Dhabi",
    "title": "Five-Star Luxury in Abu Dhabi's Most Iconic Hotel with Lounge Access and Free-Flow Drinks",
    "description": "Discover the magic of the Arabian Jewel from an ultra-luxurious launchpad: the award-winning, five-star Emirates Palace. Experience a lavish stay fit for royalty with access to the hotel’s prestigious Palace Club Lounge with daily breakfast, daily refreshments, nightly cocktail reception and free-flow alcoholic drinks from 12pm onwards. Your ultra-luxe escape also includes a private airport pick up, tickets to the newly-opened Qasr Al Watan Presidential Palace - located next to Emirates Palace, up to 25% discount on spa treatments at the award-winning Emirates Palace Spa and 15% discount at selected hotel dining venues.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Emirates Palace",
    "offer_address": "West Corniche Road - United Arab Emirates",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 853.0,
    "value": 3179.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006yp15AAA",
    "hero_image": "https://images.luxuryescapes.com/6fa9e7kp1sco1idak5ss",
    "image_two": "https://images.luxuryescapes.com/lso4c77wei4qx0435emt",
    "image_three": "https://images.luxuryescapes.com/2fn5htpebaq1xcwn7ot",
    "vendor_name": "Conrad at Etihad Towers",
    "title": "Top-Rated Five-Star Abu Dhabi Opulence with Daily Breakfast & Nightly Dinner",
    "description": "Discover the epitome of opulence at the glistening Conrad Abu Dhabi Etihad Towers, a five-star city icon towering above the stunning Corniche Road where you'll find eight kilometres of manicured waterfront. Ranked among Abu Dhabi’s top 10 hotels in Abu Dhabi on Tripadvisor (and among the top 10% worldwide), this supremely luxurious launchpad delivers personalised Conrad service and style across a spectacular 10,000 square-foot setting. \n\nChoose from 12 onsite restaurants showcasing everything from international cuisine to handcrafted cocktails, and a lavish spa offering an extensive treatment menu guaranteed to elevate relaxation. Cool off with a plunge in the outdoor pool, soothe jetlag with a revitalising massage or soar up to the Observation Deck at 300 to take in mesmerising views of the city skyline from the 74th floor. Further afield, uncover the UAE's desert sand dunes, fragrant souks, and futuristic theme parks before returning to your lavish retreat.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Conrad Abu Dhabi Etihad Towers",
    "offer_address": "Etihad Towers, West Corniche, Al Khubeirah, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 399.0,
    "value": 860.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y1K1QQAV",
    "hero_image": "https://images.luxuryescapes.com/vlxpfmos2gb9gs7uqzva",
    "image_two": "https://images.luxuryescapes.com/flb3hge5sc50lw9ksbxv",
    "image_three": "https://images.luxuryescapes.com/orfbxlj5tescrvc4kkvs",
    "vendor_name": "Al Wathba A Luxury Collection Desert Resort & Spa",
    "title": "Grand Opening: Jumeirah Elegance Amid Abu Dhabi's Awe-Inspiring Desert",
    "description": "Deep within the desert landscape of Abu Dhabi, you will find a brand new, boutique retreat where natural beauty and serene tranquillity abound. The newest addition to the Jumeirah group’s family, Jumeirah Al Wathba Desert Resort & Spa invites you to discover quintessential Arabian-style in a spectacular natural location just 60 minutes from downtown Abu Dhabi. Be treated to daily breakfast, nightly dinners and a 20% discount on spa treatments at the blissful Talise Spa. Plus, one child aged 11 years and under stays free with daily breakfast, nightly dinner and Sinbad's Kids Club access.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Jumeirah Al Wathba Desert Resort & Spa 2019",
    "offer_address": "Al Wathba District, 50 KM South East - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 71.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 500.0,
    "value": 1729.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DYKrKYAX",
    "hero_image": "https://images.luxuryescapes.com/wonri1xqou1o48gde68",
    "image_two": "https://images.luxuryescapes.com/lbrzwog7ng5kov9mvb78",
    "image_three": "https://images.luxuryescapes.com/5g0lafo61etdbc90h2bp",
    "vendor_name": "Bab Al Nojoum Bateen Liwa",
    "title": "Abu Dhabi Desert Oasis with Private Pools, Daily Breakfast & Nightly Dinner",
    "description": "Immerse yourself in the Arabian desert and discover a true oasis among the dunes at this unforgettable Abu Dhabi retreat. Set at the heart of the mesmerising Liwa Oasis, the largest continuous desert in the world, each villa is framed by towering sand slopes and boundless sunsets, and boasts a private plunge pool with sunbeds for the ultimate relaxation. \n\nWith endless activities on offer, spend your days camel trekking, dune bashing, sand boarding and more before cooling off with a drink in hand at The Oasis bar. Soothe sore muscles at the Hidden Spa, find inner balance with a yoga or meditation session, and get a better appreciation of the local culture with a heritage tour.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Al Dhafra Region",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Bab Al Nojoum Bateen Liwa",
    "offer_address": "Tal Mur’ib Road, Mzeer’ah, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 429.0,
    "value": 1174.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zPqUAAU",
    "hero_image": "https://images.luxuryescapes.com/e77i7gb71uh7xycfjpj",
    "image_two": "https://images.luxuryescapes.com/iwax3324i7mfuxa6gfk",
    "image_three": "https://images.luxuryescapes.com/moe8dfotq9zk05utudwm",
    "vendor_name": "Andaz Capital Gate, Abu Dhabi",
    "title": "Five-Star Abu Dhabi Leaning Hotel Stay with Decadent Dining & Wine Tastings",
    "description": "Forget Pisa with a gravity-defying stay in one of the world’s most intriguing buildings at the five-star Andaz Capital Gate, Abu Dhabi - a concept by Hyatt. An architectural masterpiece heralded the ‘Leaning Tower of Abu Dhabi’, this icon of the United Arab Emirates skyline promises an utterly unique escape.\n\nPart modern art museum and a member of the world-renowned Hyatt Group, this five-star hotel is a record-breaking, art-filled oasis where you can plunge into Abu Dhabi’s highest suspended infinity pool, soaring 100 metres above the ground, and descend all the way to the 165 Below Art Gallery.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Andaz Capital Gate, Abu Dhabi - a concept by Hyatt old",
    "offer_address": "Al Khaleej Al Arabi Street Capital Gate - Capital Centre - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 72.0,
    "min_duration": 3,
    "max_duration": 11,
    "price": 299.0,
    "value": 1055.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070njeAAA",
    "hero_image": "https://images.luxuryescapes.com/z8z2p4s4462c1rqnw4d8",
    "image_two": "https://images.luxuryescapes.com/arihf1adqkx7kqoowex6",
    "image_three": "https://images.luxuryescapes.com/f1ag0xracxfhk7g70id",
    "vendor_name": "Grand Hyatt Abu Dhabi",
    "title": "Five-Star Abu Dhabi Grand Hyatt Luxury with Daily Breakfast & Nightly Dinner",
    "description": "Tap into a new level of luxury and experience a stay with a difference at Grand Hyatt Abu Dhabi Hotel & Residences Emirates Pearl - a five-star accommodation perfectly set in the beautiful West Corniche area. The hotel’s facilities are nothing short of exquisite, with a stunning, sky-high fitness centre, shimmering infinity pool overlooking the Arabian Gulf and a sophisticated spa.\n\nHowever, the excitement of Abu Dhabi will immediately lure you away from your stylish haven. Get your adrenaline fix at Ferrari World or Warner Bros. Plaza, where you can explore the many rides and attractions at your fingertips. Escape the heat and shop all day at Yas Mall, The Galleria Mall or Marina Mall, or admire the stunning collection of artworks at Louvre Abu Dhabi. Before you go, don’t forget to stop by the Sheikh Zayed Grand Mosque - one of the world’s largest mosques. To round out each day, refuel at one of the sleek eateries onsite, including Verso for elegant Italian fare, Lexx for cocktails accompanied by spectacular views, and Sahha for a hearty breakfast and international cuisine.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Grand Hyatt Abu Dhabi Hotel & Residences Emirates Pearl",
    "offer_address": "West Corniche, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 459.0,
    "value": 1267.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CdM3NYAV",
    "hero_image": "https://images.luxuryescapes.com/78vidtofqo83plovg3txi",
    "image_two": "https://images.luxuryescapes.com/4an2lg9qj7es9gnn492m",
    "image_three": "https://images.luxuryescapes.com/9j0pih2duqocotrfnxb",
    "vendor_name": "Jumeirah Saadiyat Island Abu Dhabi",
    "title": "Award-Winning Abu Dhabi Beachfront Serenity on Saadiyat Island with Daily Breakfast & Nightly Dinner",
    "description": "Sun, sand, beach and Arabian magic all await at this exquisite beachfront property on heavenly Saadiyat Island, just 20 minutes from downtown Abu Dhabi. Enjoy eco-friendly luxury against a backdrop of the Arabian Sea. Soak in breathtaking vistas of the clear sky and the ocean blue from the beachfront infinity pool before dipping your toes in the sand.\n\nDelight in a culinary journey across seven unique dining venues, including fresh Italian at Mare Mare and authentic Levantine cuisine at Tean. Explore the nearby Louvre Abu Dhabi, the vibrant Saadiyat Beach Golf Club or just head to the spa's Moroccan hammam when you're looking for things to get steamy.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Jumeirah Saadiyat Island",
    "offer_address": "Saadiyat Island, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 719.0,
    "value": 2267.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z1T7AAI",
    "hero_image": "https://images.luxuryescapes.com/ev8rmn7lzpzb2eus4lwb",
    "image_two": "https://images.luxuryescapes.com/83j1ogu9elwn2n4dbz9k",
    "image_three": "https://images.luxuryescapes.com/ex06of8l182e76jrv3b2",
    "vendor_name": "Shangri-La Hotel, Qaryat al Beri Abu Dhabi",
    "title": "Beachfront Abu Dhabi Shangri-La Luxury with Daily Breakfast & Nightly Dinner",
    "description": "Experience the cultural capital of the United Arab Emirates in five-star opulence with a luxurious stay at the iconic Shangri-La Hotel, Qaryat Al Beri, Abu Dhabi. A peaceful beachfront oasis in the heart of one of the world's most exciting cities, this lavish property boasts a stunning one kilometre-long private beach, onsite spa and seven restaurants and bars, all connected by a winding waterway in which traditional Arabic boats move you throughout the property.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Shangri-La Hotel, Qaryat Al Beri, Abu Dhabi",
    "offer_address": "Khor Al Maqta,Qaryat al Beri - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 11,
    "price": 359.0,
    "value": 937.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000NNmDtAAL",
    "hero_image": "https://images.luxuryescapes.com/qsz2hkysdpmy8ndudafs",
    "image_two": "https://images.luxuryescapes.com/fyndv9bryb28ch66so4i",
    "image_three": "https://images.luxuryescapes.com/iisoi0wxm0fyqm4tgsau",
    "vendor_name": "Shangri-La Hotel, Qaryat al Beri Abu Dhabi",
    "title": "A magical escape to an Arabian oasis",
    "description": "Experience a five-star beachfront holiday with three nights at the Shangri-La Hotel, Qaryat Al Beri, Abu Dhabi. Includes a private airport transfer on arrival from Abu Dhabi International Airport, daily buffet breakfasts, nightly buffet dinners, complimentary shuttle service to city attractions, complimentary Abra boat service, an extra long late checkout and complimentary Wi-Fi.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Shangri-La Hotel, Qaryat Al Beri, Abu Dhabi 2018",
    "offer_address": "Khor Al Maqta,Qaryat al Beri - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 519.0,
    "value": 1420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPQzFQAW",
    "hero_image": "https://images.luxuryescapes.com/mrceneam8ozhdutak9hr",
    "image_two": "https://images.luxuryescapes.com/xq86vgm2gw7b1yokaxdb",
    "image_three": "https://images.luxuryescapes.com/sl1s5kxzlgzw6gfdtbwr",
    "vendor_name": "Sofitel Abu Dhabi Corniche",
    "title": "Signature Sofitel Stay in the Heart of Abu Dhabi's Prestigious Corniche",
    "description": "Experience five-star French-inspired luxury at Sofitel Abu Dhabi Corniche. Located on the Abu Dhabi Corniche - an 8km-stretch of manicured waterfront with cafés, restaurants, playgrounds, cycle and walking paths and more - the hotel’s location offers easy beach access and a myriad dining and entertainment options. Enjoy either buffet breakfast and dinner daily for two adults and one child aged 11 years and under OR pick the adults-only Club Package and benefit from daily breakfast with Club Millesime access, plus 20% off any additional food and beverage and a VIP early check-in and late checkout.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Sofitel Abu Dhabi Corniche 2019",
    "offer_address": "Capital Plaza Complex, Corniche Road East - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 85.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 375.0,
    "value": 2435.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ItFvLYAV",
    "hero_image": "https://images.luxuryescapes.com/0x280qndn7w940wu9bkg",
    "image_two": "https://images.luxuryescapes.com/9l4pq3rfntxig04422hqt",
    "image_three": "https://images.luxuryescapes.com/hmhr84zepvym6l9uvhnj",
    "vendor_name": "Bab Al Nojoum Bateen Liwa",
    "title": "Abu Dhabi Desert Villas with Daily Breakfast, Nightly Dinner, Sandboarding & Airport Transfers",
    "description": "Discover a true oasis among the dunes at this unforgettable Abu Dhabi retreat. Set in the heart of the mesmerising Liwa Oasis, the largest continuous desert in the world, each villa is framed by towering sand slopes and boundless sunsets, boasting private plunge pools and sunbeds for ultimate relaxation.\n\nWith endless activities on offer, spend your days camel trekking, dune bashing, sandboarding and hiking, before cooling off with a drink in hand at The Oasis Pool Side bar. Soothe tired muscles at Hidden Spa, find inner balance with a peaceful yoga or meditation session, and gain a deeper understanding of Bedouin culture on a heritage tour.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Al Dhafra Region",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Bab Al Nojoum Bateen Liwa",
    "offer_address": "Tal Mur’ib Road, Mzeer’ah, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 72.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 459.0,
    "value": 1645.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R7fU5QAJ",
    "hero_image": "https://images.luxuryescapes.com/jh6jtmxjrgbzldtztdjx",
    "image_two": "https://images.luxuryescapes.com/px2uqovkxcdqr8a27efo",
    "image_three": "https://images.luxuryescapes.com/tobontkydq8s0h8ng26l",
    "vendor_name": "Conrad at Etihad Towers",
    "title": "Experience Jumeirah Style at Abu Dhabi’s #1 Hotel",
    "description": "Experience the cultural capital of the United Arab Emirates and be one of the first to visit the stunning Louvre Abu Dhabi. Enjoy three nights of opulence at the five-star Jumeirah at Etihad Towers, rated the #1 hotel in Abu Dhabi. Includes daily buffet breakfasts, nightly dinners, nightly drinks and unlimited access to the Observation Deck at 300 (the highest vantage point in Abu Dhabi), a late checkout and more.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Jumeirah at Etihad Towers OLD*",
    "offer_address": "Etihad Towers,West Corniche, - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 379.0,
    "value": 1506.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004hAJ9AAM",
    "hero_image": "https://images.luxuryescapes.com/dq2e3yhq0m5w52nrvw8v",
    "image_two": "https://images.luxuryescapes.com/sayqlmhadrbeprk7uze",
    "image_three": "https://images.luxuryescapes.com/0741txswayhq0gp113",
    "vendor_name": "Andaz Capital Gate, Abu Dhabi",
    "title": "Five-Star Abu Dhabi Leaning Hotel Escape with Daily Breakfast & Nightly Wine Tasting",
    "description": "Forget Pisa with a gravity-defying stay in one of the world’s most intriguing buildings at the award-winning, five-star Andaz Capital Gate, Abu Dhabi - a concept by Hyatt. An architectural masterpiece heralded as the ‘Leaning Tower of Abu Dhabi’, this icon of the United Arab Emirates skyline promises an utterly unique escape.\n\nPart modern art museum and a member of the world-renowned Hyatt Group, this five-star hotel is a record-breaking, art-filled oasis where you can plunge into Abu Dhabi’s highest suspended infinity pool, soaring 100 metres above the ground, and descend all the way to the 165 Below Art Gallery. Arrive a visitor and depart a local, as the hotel's local touchpoints, exclusive amenities, traditional elegance and cultivated dining experiences will transform your stay.\n\n**Your handpicked inclusions:**\n\n- Daily breakfast helps you fuel up for a day of discovering Abu Dhabi\n- Indulge with one set-menu dinner for two at the main restaurant with panoramic 18-degree views\n- Nightly wine-tasting hour in the vibrant Andaz Lounge\n- Enjoy a 20% discount on onsite drinks and dining, including the signature restaurant, and 20% off treatments at Rayana Spa\n\n**Daily dining upgrades available**: When you choose this decadent package, you'll not only receive daily breakfast and nightly wine hour, but nightly dinner to round out your days of heightened luxury. See individual packages for details.\n\n**Book with 100% Confidence**: If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Andaz Capital Gate, Abu Dhabi - a concept by Hyatt",
    "offer_address": "Al Khaleej Al Arabi Street Capital Gate - Capital Centre - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 299.0,
    "value": 811.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cqWqXQAU",
    "hero_image": "https://images.luxuryescapes.com/5mygo28kqa9ljflsjrc8",
    "image_two": "https://images.luxuryescapes.com/5v373jr2ko72ij9p4it8",
    "image_three": "https://images.luxuryescapes.com/8l00zi2cyu1rf16o1ol",
    "vendor_name": "Al Wathba A Luxury Collection Desert Resort & Spa",
    "title": "Jumeirah Elegance Amid Abu Dhabi's Awe-Inspiring Desert",
    "description": "Deep within the desert landscape of Abu Dhabi, you will find a brand new, boutique retreat where natural beauty and serene tranquillity abound. The newest addition to the Jumeirah group’s family, Jumeirah Al Wathba Desert Resort & Spa invites you to discover quintessential Arabian-style in a spectacular natural location just 60 minutes from downtown Abu Dhabi. Be treated to daily breakfast, nightly dinners and a 20% discount on spa treatments at the blissful Talise Spa. Plus, one child aged 11 years and under stays free with daily breakfast, nightly dinner and Sinbad's Kids Club access.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Al Wathba, a Luxury Collection Desert Resort & Spa, Abu Dhabi",
    "offer_address": "Al Wathba South 56620 - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 75.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 434.0,
    "value": 1758.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cJMnkQAG",
    "hero_image": "https://images.luxuryescapes.com/cdymb9cqqaasnhpbe2xw",
    "image_two": "https://images.luxuryescapes.com/z5xpimw1vfgofpxjpb1b",
    "image_three": "https://images.luxuryescapes.com/0pyojjtpvlmz81ndxf4p",
    "vendor_name": "Park Hyatt Abu Dhabi Hotel and Villas",
    "title": "Stunning Park Hyatt Beachfront Escape with Nightly Buffet Dinner",
    "description": "Experience the cultural capital of the United Arab Emirates in the natural paradise of Saadiyat Island and indulge in true Arabian style only 15 minutes from downtown. Enjoy a luxe escape at the five-star, award-winning Park Hyatt Abu Dhabi Hotel and Villas, an island sanctuary blending understated elegance with regional charm. Be treated to daily buffet breakfast, nightly buffet dinners, guaranteed late check-out or early check-in, private arrival transfer from Abu Dhabi International airport, 25% discount on spa treatments and 20% discount on food and beverages at the resort's dining venues. Bring the kids along: one child aged five years and under stays for free with breakfast included.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Park Hyatt Abu Dhabi Hotel and Villas",
    "offer_address": "PO Box 52007 Abu Dhabi, United Arab Emirates,",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 614.0,
    "value": 1427.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZmVvQQAV",
    "hero_image": "https://images.luxuryescapes.com/wcv3uqbovtrm4ibiazjb",
    "image_two": "https://images.luxuryescapes.com/uzmkd9utys01swhgmsbx",
    "image_three": "https://images.luxuryescapes.com/i6rircv5eyjf6dqk8tfu",
    "vendor_name": "Bab Al Qasr",
    "title": "Grand Arabian Hotel in the Corniche District",
    "description": "All the attractions of Abu Dhabi are at your fingertips at Bab Al Qasr Hotel, an elegant Arabian-inspired oasis nestled on a private beachfront. Admire spectacular city and sea views from your room and enjoy daily buffet breakfast, a themed buffet dinner for two at Artisan Kitchen, a welcome drink each (beer or wine), your choice of early check-in or late check-out and a 25% discount on select spa treatments.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Bab Al Qasr Hotel 2018",
    "offer_address": "Corniche Rd W - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 318.0,
    "value": 1340.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECUBSAA5",
    "hero_image": "https://images.luxuryescapes.com/7w3unaxr8rn0nya59zd",
    "image_two": "https://images.luxuryescapes.com/rd2jfxg6fhdldxww9s",
    "image_three": "https://images.luxuryescapes.com/kfomxdr8a1il2q18vvm",
    "vendor_name": "Conrad at Etihad Towers",
    "title": "Top-Rated Sky-High Abu Dhabi Opulence with Private Beach, Daily Dining & Afternoon Drinks",
    "description": "Discover new heights of opulence at the glistening Conrad Abu Dhabi Etihad Towers, a five-star city icon towering above the shimmering Corniche, where you'll find eight kilometres of manicured waterfront. Personalised service and unmatched style abound - choose from 12 onsite bars and restaurants showcasing everything from international cuisine to handcrafted cocktails, and enjoy a lavish spa offering an extensive treatment menu guaranteed to elevate relaxation. Cool off with a plunge in the outdoor pool, laze on the resort's stretch of private golden shore or soar up to the Observation Deck at 300 to take in mesmerising views of the city skyline. Further afield, uncover the UAE's desert dunes, fragrant souks and futuristic theme parks before returning to your lavish retreat.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Conrad Abu Dhabi Etihad Towers",
    "offer_address": "Etihad Towers, West Corniche, Al Khubeirah, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 36.0,
    "min_duration": 3,
    "max_duration": 18,
    "price": 530.0,
    "value": 834.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxZqlQAF",
    "hero_image": "https://images.luxuryescapes.com/yi6ntbnhaxytoqrcjf5m",
    "image_two": "https://images.luxuryescapes.com/oxkmnlzggzyfsuk7xb2f",
    "image_three": "https://images.luxuryescapes.com/daie0w2h1u48udgsliit",
    "vendor_name": "Royal Rose Hotel Abu Dhabi",
    "title": "Opulent Escape in Abu Dhabi",
    "description": "Experience the cultural capital of the United Arab Emirates with an opulent stay at the Royal Rose Hotel Abu Dhabi, ranked one of the top 20 hotels in the city. Includes daily breakfast, an exotic dining experience, welcome drinks, early check-in and late checkout, complimentary Wi-Fi and more.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Royal Rose Hotel Abu Dhabi",
    "offer_address": "1025, Sheikh Zayed the 1st Street, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 72.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 202.0,
    "value": 718.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005InCSAA0",
    "hero_image": "https://images.luxuryescapes.com/4jkpqmy8epi9d955n76",
    "image_two": "https://images.luxuryescapes.com/0d3a1q6c2b0sd8ws6va5",
    "image_three": "https://images.luxuryescapes.com/culibiaf4dn5ar61y1gm",
    "vendor_name": "Conrad at Etihad Towers",
    "title": "Top-Rated Five-Star Abu Dhabi Opulence with Daily Breakfast & Nightly Dinner",
    "description": "Discover the epitome of Abu Dhabi opulence at the glistening Conrad Abu Dhabi Etihad Towers, a five-star city icon towering high above the stunning Corniche waterfront. Ranked among Abu Dhabi’s top 10 hotels on Tripadvisor (and among the top 10% worldwide), this supremely luxurious launchpad delivers personalised Conrad service and style across a spectacular 10,000 square-foot setting. Enjoy a pristine stretch of powder-white private beach, onsite restaurants showcasing everything from international cuisine to handcrafted cocktails, and a lavish spa offering an extensive treatment menu guaranteed to elevate relaxation.\n\nCool off with a plunge in the outdoor pool, soothe jetlag with a revitalising massage or soar up to the Observation Deck at 300 to take in mesmerising views of the city skyline from the 74th floor. Uncover the UAE's desert sand dunes, fragrant souks and futuristic theme parks in absolute five-star style at one of Abu Dhabi's most luxurious hotels.\n\n**Your** **handpicked inclusions:**\n\n- Start each day with buffet breakfast at Rosewater restaurant\n- Enjoy a nightly three-course dinner at a choice of three restaurants: Nahaam, Li Beirut or Sole\n- Celebrate your stay with one complimentary beer or glass of wine per person, per stay\n- Unwind with your favourite treatment thanks to 25% off at the spa\n- Treat yourself with 25% off drinks and dining across Conrad's exceptional bars and restaurants\n\n**Junior Suite Upgrade bonus**: Stay in a luxe King Junior Suite with Sea View and you'll also enjoy complimentary happy hour drinks at Rosewater between 5pm and 7pm every night.\n\n**Book with 100% Confidence:** Right up until 21 days before check-in you can enjoy unlimited, free date changes, or cancel and get a 100% credit to use at Luxury Escapes for any other Limited Time Lux Exclusive accommodation, tour or cruise offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Conrad Abu Dhabi Etihad Towers- DNU old",
    "offer_address": "Etihad Towers,West Corniche, - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 379.0,
    "value": 903.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000avhw1QAA",
    "hero_image": "https://images.luxuryescapes.com/dya6mwywk76m7etwn2vw",
    "image_two": "https://images.luxuryescapes.com/swfonddrqjbogziqn3ky",
    "image_three": "https://images.luxuryescapes.com/non6oj4op2hzburdd0t6",
    "vendor_name": "Radisson Blu Hotel Abu Dhabi Yas Island",
    "title": "Yas Island, Abu Dhabi Fun in the Sun for Couples and Families",
    "description": "Enjoy a sun-kissed stay in the midst of Abu Dhabi’s premier entertainment destination, Yas Island, staying at Radisson Blu Hotel, Abu Dhabi Yas Island - where the white sands of Yas Beach and attractions such as Ferrari World Abu Dhabi, Yas Waterworld, Yas Mall and the newly opened Warner Bros. World Abu Dhabi are all just minutes away. Includes daily breakfast, one international buffet dinner, guaranteed late 1pm checkout, 20% discount on drinks and spa treatments and a complimentary shuttle service to Yas Beach and Yas Mall.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Radisson Blu Hotel, Abu Dhabi Yas Island",
    "offer_address": "Abu Dhabi - Emirate - United Arab Emirates",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 239.0,
    "value": 699.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQzxYAAT",
    "hero_image": "https://images.luxuryescapes.com/sgufiqyof1vfnzd8kvc",
    "image_two": "https://images.luxuryescapes.com/2m40ix5ojcltjhh4zpvm",
    "image_three": "https://images.luxuryescapes.com/p4hr4gvjc5ecv1gmsqe",
    "vendor_name": "Sofitel Abu Dhabi Corniche",
    "title": "Glamorous Sofitel Abu Dhabi Corniche Stay with Daily Dining and Spa Discount",
    "description": "Welcome to the Sofitel Abu Dhabi Corniche, where French luxury meets Middle Eastern hospitality. This five-star retreat offers breathtaking city and ocean views along with easy access to the city's top sights. A myriad of dining options promises innovative flavours to please every palate, while a world of relaxation awaits at the luxurious spa. With state-of-the-art facilities and superlative service, a stay at this sleek hotel promises an extraordinary Abu Dhabi experience.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Sofitel Abu Dhabi Corniche",
    "offer_address": "Corniche Road East Capital Plaza Complex, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 299.0,
    "value": 721.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjTWAA0",
    "hero_image": "https://images.luxuryescapes.com/sqvcso55bc63o5u75j4",
    "image_two": "https://images.luxuryescapes.com/4hqtp9rlyo5o0itqipjnr",
    "image_three": "https://images.luxuryescapes.com/1vxm0s9upu0it19exv2l",
    "vendor_name": "Al Wathba A Luxury Collection Desert Resort & Spa",
    "title": "Jumeirah Elegance Amid Abu Dhabi's Awe-Inspiring Desert",
    "description": "Deep within the desert landscape of Abu Dhabi, you will find a brand new, boutique retreat where natural beauty and serene tranquillity abound. The newest addition to the Jumeirah group’s family, Jumeirah Al Wathba Desert Resort & Spa invites you to discover quintessential Arabian-style in a spectacular natural location just 60 minutes from downtown Abu Dhabi. Be treated to daily breakfast, nightly dinners and a 20% discount on spa treatments at the blissful Talise Spa. Plus, one child aged 11 years and under stays free with daily breakfast, nightly dinner and Sinbad's Kids Club access.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Al Wathba, a Luxury Collection Desert Resort & Spa, Abu Dhabi",
    "offer_address": "Al Wathba South 56620 - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 76.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 433.0,
    "value": 1770.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPG54AAH",
    "hero_image": "https://images.luxuryescapes.com/lenbefl87b7m8td4tswc",
    "image_two": "https://images.luxuryescapes.com/eckqtf03cxnmt456nvg",
    "image_three": "https://images.luxuryescapes.com/uaocaijxiqo427qc621",
    "vendor_name": "Al Wathba A Luxury Collection Desert Resort & Spa",
    "title": "Five-Star Desert Elegance near Abu Dhabi with Signature Cocktail Experience & Daily Dining",
    "description": "Deep within the desert landscape lies a once-in-a-lifetime escape at Al Wathba, a Luxury Collection Desert Resort & Spa, Abu Dhabi, the perfect space to reconnect and the freedom to lose yourself. Feel miles away from the excitement of Abu Dhabi when you arrive at this serene oasis filled with Arabian-inspired grandeur. Taste your way around multiple restaurants and bars to savour dishes inspired by the Arabian Gulf and beyond while admiring the dunes to panoramic perfection. Be sure to visit the exceptional Saray Spa, a hallmark of your stay, complete with salt rooms, snow caves and a Turkish hammam, then dive into the sprawling pool with sweeping desert views.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Al Wathba, a Luxury Collection Desert Resort & Spa, Abu Dhabi",
    "offer_address": "Al Wathba South 56620 - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 895.0,
    "value": 2220.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DYQ2DYAX",
    "hero_image": "https://images.luxuryescapes.com/tdsorfq39ddm8oixox5",
    "image_two": "https://images.luxuryescapes.com/j6s1xgqpwpl22cbgy6fi",
    "image_three": "https://images.luxuryescapes.com/pvifrnblocu63o4mabh",
    "vendor_name": "Rixos Premium Saadiyat Island",
    "title": "All-Inclusive Abu Dhabi Indulgence on Saadiyat Island with Free-Flow Drinks & One Child Stays Free",
    "description": "Break away from reality with an all-inclusive retreat to the clear blue waters and fine white sands of Saadiyat Island, just a stone's throw from the bustle of Abu Dhabi. Unwind in style with a lavish Turkish Bath treatment while the kids have their fun at the onsite aqua park before hitting the beach as a family.\n\nFrom Turkish fine dining to sumptuous Teppanyaki, the hotel's six onsite restaurants invite indulgence, paired with four inviting bars for refreshing sips. For the explorers, attractions such as the Louvre Abu Dhabi or the Sheikh Zayed Grand Mosque are ready to captivate mind, body and soul. Yas Island's thrilling theme parks are also just a short drive away.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Rixos Premium Saadiyat Island",
    "offer_address": "Saadiyat Island, Abu Dhabi 51249, United Arab Emirates",
    "percentage_discount": 28.0,
    "min_duration": null,
    "max_duration": null,
    "price": 1299.0,
    "value": 1816.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csequQAA",
    "hero_image": "https://images.luxuryescapes.com/xkva2qjf8fkdrr41zkuq",
    "image_two": "https://images.luxuryescapes.com/rqcx98zquyb6jd3tyuwh",
    "image_three": "https://images.luxuryescapes.com/xmoz3sedfbalqv5h5mf",
    "vendor_name": "Jumeirah Saadiyat Island Abu Dhabi",
    "title": "Jumeirah Luxury on the Natural Shores of Saadiyat Island",
    "description": "Combining Jumeirah’s refined signature luxury with sustainability, Jumeirah at Saadiyat Island Resort is the newest property to open on the natural island of Saadiyat - off the coast of Abu Dhabi in the Persian Gulf. You will experience the country’s best natural beach with five-star indulgence only 15 minutes from the city centre. Includes decadent nightly dinners and lavish daily breakfast at your choice of multiple Jumeirah restaurants, access to the Observation Deck at 300 at Jumeirah at Etihad Towers in central Abu Dhabi, welcome glass of wine or beer on arrival, 20% off blissful spa treatments and more. Plus, the package is valid for two adults and one child (aged 11 years and under).",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Jumeirah at Saadiyat Island Resort",
    "offer_address": "Abu Dhabi - United Arab Emirates",
    "percentage_discount": 78.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 614.0,
    "value": 2835.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNPUWAA5",
    "hero_image": "https://images.luxuryescapes.com/55nk17s9b79a63mk2u5",
    "image_two": "https://images.luxuryescapes.com/346l4xv8taawguv68lw",
    "image_three": "https://images.luxuryescapes.com/v63ddktfso1nue70gyza",
    "vendor_name": "InterContinental Residences Abu Dhabi",
    "title": "Pristine Serviced Abu Dhabi Apartments with Beach Access, Onsite Dining and Outdoor Pool",
    "description": "Soak up sleek city vibes and superior service at InterContinental Residences Abu Dhabi, an IHG Hotel, a high-rise collection of residences in the heart of the city. The building boasts two urban contemporary lounges and restaurants offering bites and drinks, a state-of-the-art fitness centre and lush outdoor pool. And with direct beach access and sun loungers looking onto the InterContinental Abu Dhabi Marina, guests' can prioritize their relaxation and well-being throughout their stay.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "InterContinental Residences Abu Dhabi , an IHG hotel",
    "offer_address": "Zayed The First Street Abu Dhabi 4171 United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 196.0,
    "value": 196.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DMICAA4",
    "hero_image": "https://images.luxuryescapes.com/rrjeeks96ctcahfm84ej",
    "image_two": "https://images.luxuryescapes.com/46vt4v1i8f8bzo5spk37",
    "image_three": "https://images.luxuryescapes.com/nbuyg2ao2t15jjymwbjj",
    "vendor_name": "Emirates Palace Mandarin Oriental, Abu Dhabi",
    "title": "Five-Star Abu Dhabi Emirates Palace Stay with Private Beach",
    "description": "Unmatched Arabian opulence awaits with a stay at Emirates Palace Mandarin Oriental, Abu Dhabi, an oasis of modern luxury elevated by magnificent views of the shimmering Persian Gulf and a private beach. Each room is masterfully appointed, furnished beyond comfort and enhanced with a blend of modern and traditional touches. \n\nThis urban oasis has everything you need for the ultimate escape, with two pools, an onsite spa and extraordinary dining venues ranging from traditional Spanish fare to Indian fine dining. You’ll also only be a short distance from some of Abu Dhabi’s best attractions, including the Presidential Palace, Louvre Abu Dhabi and the turquoise waters of Corniche Beach.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Emirates Palace Mandarin Oriental, Abu Dhabi",
    "offer_address": "West Corniche Rd - Al Ras Al Akhdar - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 338.0,
    "value": 338.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTO0AAO",
    "hero_image": "https://images.luxuryescapes.com/i2cvacozid1y9r655w7k",
    "image_two": "https://images.luxuryescapes.com/bdrpdsnrnimt625mgjl",
    "image_three": "https://images.luxuryescapes.com/cizeupgivvzib9kgs4mb",
    "vendor_name": "Eastern Mangroves hotel by Anantara",
    "title": "Five-Star Abu Dhabi Escape Between Mangroves & Skyscrapers",
    "description": "The Anantara Eastern Mangroves Abu Dhabi Hotel sits astride the border between Abu Dhabi’s skyscrapers and verdant expanses of tranquil mangroves. Strike out into the city for retail therapy or venture into the desert for immersive experiences like camel riding or archery. Savour sumptuous cuisine at restaurants on-site, and have a drink at the scenic Pool Deck. Indulge in a soothing treatment at the Anantara Spa before retiring to gaze over lush mangroves from the privacy of a lavish room or suite.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Anantara Eastern Mangroves Abu Dhabi Hotel",
    "offer_address": "P.O. Box 128555, Sheikh Zayed Street, Abu Dhabi, United Arab Emirates",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnJdjYAF",
    "hero_image": "https://images.luxuryescapes.com/4zoo8zwdzjnsm4hmlfv9",
    "image_two": "https://images.luxuryescapes.com/7aejkiyxpq90kwig2ws1",
    "image_three": "https://images.luxuryescapes.com/lmnwstg2tqcfag2qa30x",
    "vendor_name": "Club Prive By Rixos Saadiyat",
    "title": "Exclusive Abu Dhabi Luxury Villas on Private Beachfront with Seven Restaurants & Hammam-Inspired Spa",
    "description": "Enjoy the best of both worlds at these palatial villas, which offer secluded five-star comfort within the all-inclusive amenities of Rixos Premium Saadiyat Island. Discover opulent Abu Dhabi from these outstanding hideaways, located along the sands of a private beach, but within easy distance of landmarks like the grand Louvre Abu Dhabi. \n\nSavour the exquisite flavours of the Middle East and beyond across seven international restaurants, or enjoy a refreshing drink at Ame Beach Bar, perched on the sands of the resort's private beach. Balance the mind and body at Anjana Spa, inspired by the hammams of Turkey and Morocco, or simply spend time by the stunning infinity pool - either way, relaxation is guaranteed.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Club Privé By Rixos Saadiyat",
    "offer_address": "Rixos Premium Saadiyat Island, Saadiyat Island, Abu Dhabi 35665, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 2773.0,
    "value": 2773.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zXGhAAM",
    "hero_image": "https://images.luxuryescapes.com/d6bw9mr77fbjjppip8",
    "image_two": "https://images.luxuryescapes.com/jw0rex6hlyo8ti263v",
    "image_three": "https://images.luxuryescapes.com/94zzpn3lgs5zqsnsagkg",
    "vendor_name": "Traders Hotel, Qaryat Al Beri, Abu Dhabi",
    "title": "Seaside Abu Dhabi Retreat with Private Beach",
    "description": "Discover a playful side to Abu Dhabi at Traders Hotel, Qaryat Al Beri, Abu Dhabi, a beachfront haven in a serene pocket of this thriving metropolis. Days can be spent lounging on the resort's private beach, where pristine sands, lush green grass and sun-soaked loungers beckon. When hunger strikes, the onsite Afyä restaurant serves up a tasty assortment of Western specialties, fresh seafood and mouthwatering Asian fusion dishes. Poolside snacks and handcrafted cocktails can be savoured at Poolbar, while the Lobby Lounge, situated under a glorious glass roof, boasts a drink menu made to excite discerning palates. The fresh pops of lime and violet throughout common areas alongside statement furniture and contemporary artwork give the entire hotel a sleek, youthful feel.\n\nHousing a well-equipped fitness centre, a dedicated play area for children and a luxurious spa, Traders Hotel, Qaryat Al Beri, Abu Dhabi has plenty to keep you occupied onsite. Still, under a 10-minute drive away, you'll find the Sheikh Zayed Grand Mosque, while other top sights, including the Louvre Abu Dhabi, Ferrari World and Yas Waterworld waterpark, are under a 25-minute drive away.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Traders Hotel, Qaryat Al Beri, Abu Dhabi",
    "offer_address": "Khor Al Maqta, Qaryat Al Beri, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 63.0,
    "value": 63.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ElktlYAB",
    "hero_image": "https://images.luxuryescapes.com/zkex95fwpr1qjdejxqa",
    "image_two": "https://images.luxuryescapes.com/gixm8yqnelyrd4wb7mja",
    "image_three": "https://images.luxuryescapes.com/iabsh8cm4hrvmtnktrc",
    "vendor_name": "Fairmont Bab Al Bahr",
    "title": "Five-Star Fairmont Abu Dhabi Escape with Private Beach & Grand Mosque Views",
    "description": "Experience the grandeur of the Middle East with a stay at this opulent urban oasis, set on Abu Dhabi Creek and overlooking the white-marble minarets of the iconic Sheikh Zayed Grand Mosque. Spend your days lazing on the private beach, or indulge at the hotel's eight dining venues, including the renowned Marco Pierre White Steakhouse & Grill.\n\nExplore the city's range of experiences, from the traditional souks to the modern Yas Island, home to the Formula 1 circuit and the thrilling Ferrari World. Back at the hotel, plunge into one of the two temperature-controlled swimming pools or rejuvenate at the wellness centre, offering a range of relaxing treatments.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Fairmont Bab Al Bahr - Abu Dhabi",
    "offer_address": "Khor, Al Maqta' St, Rabdan, RB2, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 155.0,
    "value": 155.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPuddAAD",
    "hero_image": "https://images.luxuryescapes.com/akz5pbl3i59c1xgof3o8",
    "image_two": "https://images.luxuryescapes.com/qjspbp6rcsdf8h4kla",
    "image_three": "https://images.luxuryescapes.com/s91g289hhyrk8fr41sed",
    "vendor_name": "Crowne Plaza Abu Dhabi",
    "title": "Lavish Abu Dhabi Five-Star Oasis with Five Onsite Restaurants & Bars",
    "description": "Escape to the cultural heart of the United Arab Emirates with a decadent stay at the Crowne Plaza Abu Dhabi, an IHG Hotel. Located in the heart of Abu Dhabi, this hotel is the ideal destination to relax on the nearby beaches, partake in some retail therapy and explore the history of the city. Soak in your surroundings, then return to this oasis for a dip in the pool to escape the heat and dine in your choice of five onsite restaurants and bars.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Crowne Plaza Abu Dhabi, an IHG Hotel",
    "offer_address": "Sheikh Hamdan Street, Al Danah Zone 1, Abu Dhabi, United Arab Emirates",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP6lYAF",
    "hero_image": "https://images.luxuryescapes.com/7lgc1nt1trae5cqyisje",
    "image_two": "https://images.luxuryescapes.com/j6irq7qgr942txxgvu3",
    "image_three": "https://images.luxuryescapes.com/v86kbmigxf17v74gczkj",
    "vendor_name": "Novotel Abu Dhabi Gate",
    "title": "Contemporary Abu Dhabi City Break with Three Restaurants & Outdoor Pool",
    "description": "Uncover a blend of Arabian hospitality and modern elegance at this Novotel sanctuary, perfectly situated near Abu Dhabi's bustling business district and the Rabdan area. Soak up the panoramic city and mountain vistas, lounge by the sparkling pool and rejuvenate with treatments at the spa.\n\nWhen hunger strikes, tuck into Italian, Mediterranean or global delicacies across the hotel's three restaurants. Later, sip on cocktails from the trendy Al Nasseem Pool Bar and spend relaxing evenings in the shisha lounge. If you wish to explore, the Sheikh Zayed Mosque, Ferrari World and Yas Island are all within easy reach.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Novotel Abu Dhabi Gate",
    "offer_address": "222 Al Maqta Street, Rabdan, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 61.0,
    "value": 61.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zXGXAA2",
    "hero_image": "https://images.luxuryescapes.com/1dnq0hisx8as1v8ez5tc",
    "image_two": "https://images.luxuryescapes.com/a25hj8k7vmaeflvpcf2",
    "image_three": "https://images.luxuryescapes.com/rq1ib08d8b803srnc3i6",
    "vendor_name": "Shangri-La Hotel, Qaryat al Beri Abu Dhabi",
    "title": "Five-Star Luxury in the Heart of Abu Dhabi with a Private Beach",
    "description": "Experience the cultural capital of the United Arab Emirates in five-star luxury with a royal stay at the iconic Shangri-La Qaryat Al Beri, Abu Dhabi. A peaceful beachfront oasis in the heart of one of the world's most exciting cities, this lavish property boasts a stunning one-kilometre-long private beach, seven restaurants and bars, and CHI, The Spa, which promises to ramp up the relaxation with signature treatments in a tranquil setting. \n\nThe resort’s many high-end facilities are all connected by a winding waterway where traditional abra boats move you throughout the property. Other highlights include a pool where you can relax on one of the many surrounding sun loungers, a health club with a lap pool, fitness centre and yoga room. A short distance from the city centre, this beachfront retreat has spectacular views overlooking the Khor Al Maqta canal and Sheikh Zayed Grand Mosque. Abu Dhabi presents infinite opportunities to explore the country’s rich history with diverse museums and exhibitions, impressive monuments and delectable food - all sprinkled with a good measure of Arabian glamour.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Shangri-La Qaryat Al Beri, Abu Dhabi",
    "offer_address": "Khor Al Maqta, Qaryat al Beri, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 135.0,
    "value": 135.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pClzAAE",
    "hero_image": "https://images.luxuryescapes.com/ljlx4ankustt22zbbq8",
    "image_two": "https://images.luxuryescapes.com/t5bscd9jtv6e8eqvo56",
    "image_three": "https://images.luxuryescapes.com/7yk1pk8maj34ycj7e6xc",
    "vendor_name": "Dusit Thani Abu Dhabi",
    "title": "Five-Star City Glamour in the Heart of Abu Dhabi with Rooftop Pool & Bar",
    "description": "Stay in the heart of the action at Dusit Thani Abu Dhabi, a five-star hotel in the city's gleaming business district, housed in a striking glass tower. Ascend to the rooftop, where you will be rewarded with epic panoramic views of Abu Dhabi, a rooftop pool and the poolside Dusit Breeze bar, which serves up delicious light bites, fruit smoothies, vitamin boosters and handcrafted cocktails. A visit to Naam Spa is a must, with its eight tranquil treatment rooms and exceptional remedies that will leave you floating for the rest of the day.\n\nDusit Thani Abu Dhabi places its guests in a prime position to explore the UAE's sparkling capital. Louvre Abu Dhabi, housing world-class art collections within its 12 galleries, is just a 15-minute drive away. Sheikh Zayed Grand Mosque is only 13 minutes by car and is guaranteed to wow its visitors with its marble domes, soaring minarets and exquisite modern Islamic architecture and design. On the hotel's doorstep, discover Abu Dhabi's Mangrove National Park, home to flamingos, herons and scuttling crabs.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Dusit Thani Abu Dhabi",
    "offer_address": "925 Sultan Bin Zayed The First Street (Al Muroor Road), Abu Dhabi, United Arab Emirates",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTKXAA4",
    "hero_image": "https://images.luxuryescapes.com/wtas4oaepqwhap5tf7",
    "image_two": "https://images.luxuryescapes.com/lju58iif9nspy0znhcla",
    "image_three": "https://images.luxuryescapes.com/gwhe14xl4777ccq5de9",
    "vendor_name": "Anantara Sir Bani Yas Island Al Sahel Villa",
    "title": "Five-Star Anantara Abu Dhabi Safari-Inspired Villa Retreat",
    "description": "Embrace a safari-style stay in five-star luxury at Abu Dhabi's Anantara Sir Bani Yas Island Al Sahel Villa Resort, a boutique oasis masterfully positioned within the peacock-filled golden grasslands just off the mainland. Awaken to the sight of a wild gazelle and fall asleep under stars, savour days spent tasting authentic African flavours at Savannah Grill & Lounge, indulge in traditional treatments at Anantara Spa or explore the extraordinary via an open-roof four-wheel drive.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Sir Bani Yas Island",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Anantara Sir Bani Yas Island Al Sahel Villa Resort",
    "offer_address": "Island - Sir Bani Yas - Abu Dhabi - United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 439.0,
    "value": 439.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQJZGAA5",
    "hero_image": "https://images.luxuryescapes.com/ycylinh619i82naajo9",
    "image_two": "https://images.luxuryescapes.com/eto1sd2hnepwbtk87tk7",
    "image_three": "https://images.luxuryescapes.com/prcozliairnml2k01n1h",
    "vendor_name": "Crowne Plaza Abu Dhabi Yas Island",
    "title": "Abu Dhabi Beachfront Luxury with Award-Winning Restaurants & Bars",
    "description": "Say 'yas' to a stay at Crowne Plaza Abu Dhabi - Yas Island, an IHG Hotel, a dynamic city escape on the shores of the Arabian Gulf. There's no shortage of fun to be had here, with Yas Beach just a short stroll away and the island's exciting Ferrari World, Warner Bros. World, Yas Waterworld and Yas Mall within easy reach. Spend days swimming laps in the 25-meter outdoor pool, keep the little ones entertained at the Kids' Club, and be wined and dined at the four bars and restaurants.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Crowne Plaza Abu Dhabi - Yas Island, an IHG Hotel",
    "offer_address": "Yas Island, Abu Dhabi, 41880, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 134.0,
    "value": 134.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C2GwOAAV",
    "hero_image": "https://images.luxuryescapes.com/di3n7z1ou2uhgwugxurg",
    "image_two": "https://images.luxuryescapes.com/skyq80vyy4ef3ivxq",
    "image_three": "https://images.luxuryescapes.com/tgh9v6f4ibmpisxgogul",
    "vendor_name": "Jumeirah Saadiyat Island Abu Dhabi",
    "title": "Abu Dhabi Five-Star Jumeirah Resort on Saadiyat Island",
    "description": "Discover the cosmopolitan cultural heart of the United Arab Emirates in five-star luxury at the beautiful beachfront Jumeirah Saadiyat Island Abu Dhabi. Saadiyat Island is home to breathtaking beaches, with this spectacular oasis perfectly situated to offer panoramic views of the Persian Gulf, inviting you to relax into island life. Spend your days exploring the nearby cultural hub and soaking in the dramatic and opulent architecture, then return to the hotel to escape the heat with a dip in the pool and dinner in your choice of onsite restaurants.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Jumeirah at Saadiyat Island Resort",
    "offer_address": "Saadiyat Island, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 215.0,
    "value": 215.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP6mYAF",
    "hero_image": "https://images.luxuryescapes.com/5oejtnuhcjszyfd1nmjs",
    "image_two": "https://images.luxuryescapes.com/uggqmznwysxn7j6drhs",
    "image_three": "https://images.luxuryescapes.com/s64ilg67to8r20z68ee",
    "vendor_name": "Adagio Abu Dhabi Al Bustan",
    "title": "Sophisticated Apartment-Style Escape in Abu Dhabi with Onsite Pool & Spa",
    "description": "Discover a stylish blend of comfort and convenience at this Arabian gem in Abu Dhabi. With the stunning Sheikh Zayed Grand Mosque, the bustling Al Wahda Mall and the impressive Qasr Al Hosn fort within easy reach, this retreat offers an ideal base for exploring the city's myriad attractions. Post exploration, unwind at the outdoor pool, fitness and wellness centre, or rejuvenate in the spa.\n\nRetreat to your stylish studio or apartment, with a fully equipped kitchen and premium amenities ensuring a relaxing retreat in the Gulf. Moments from Zayed Sports City, this urban retreat places you at the heart of the capital’s culture and energy.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Aparthotel Adagio Abu Dhabi Al Bustan",
    "offer_address": "Shk. Rashid Bin Saeed, Rabdan Street, Abu Dhabi 95208, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 71.0,
    "value": 71.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt5QAAR",
    "hero_image": "https://images.luxuryescapes.com/wt4ooss09qoav8a80uf4",
    "image_two": "https://images.luxuryescapes.com/xnoawonul0ldmcdj0pf",
    "image_three": "https://images.luxuryescapes.com/tbweuy2q0wetbs8c4su",
    "vendor_name": "Intercontinental Abu Dhabi",
    "title": "Sophisticated Abu Dhabi Retreat with Private Beach near Marina Mall & Corniche",
    "description": "Abu Dhabi combines five-star luxury with the best of tradition, and the InterContinental Abu Dhabi, an IHG Hotel, is a perfect representation of that. Take in the panoramic waterfront and city views, dive into the glittering Arabian Gulf at the hotel’s private beach, or take a leisurely stroll along the iconic Corniche, a short distance away. With world-class dining options at the private marina, a luxurious wellness centre and opulent shopping districts surrounding the bespoke hotel, there’s an endless supply of entertainment at your fingertips.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "InterContinental Abu Dhabi, an IHG Hotel",
    "offer_address": "King Abdullah bin Abdul Aziz Al Saud Street, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 94.0,
    "value": 94.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP8MYAV",
    "hero_image": "https://images.luxuryescapes.com/vet64j76e98128yv4o7",
    "image_two": "https://images.luxuryescapes.com/bejv51964w2xhu0etah",
    "image_three": "https://images.luxuryescapes.com/h2sjsev25fbpd46kfsi9",
    "vendor_name": "Rixos Marina Abu Dhabi",
    "title": "Iconic Rixos Abu Dhabi Beachfront Opulence with Sparkling Pool, Luxe Spa & Seven Restaurants",
    "description": "Towering tall against the glittering Abu Dhabi skyline, this architecturally supreme Rixos oasis is drenched in opulence and seamlessly elevates luxury beyond the ordinary. Perched along the shimmering shores of the Arabian Gulf, this striking hotel boasts a private beach, world-class water sports and even an exclusive dive centre.\n\nDiscover the fine fusion of Arabic, Turkish and subtle aquatic aesthetics reflecting the UAE capital city's ancient seafaring origins to its present-day cosmopolitan flair. Retreat to the hotel's sophisticated rooms, or pamper yourself with services at the hammam-style Naturelife Spa, while your kids stay engaged at the lively kids' club.\n\nSpend your days under the sun, swimming in the sparkling outdoor pool, dip your toes in the powder-soft sands of the beach and cool off with cocktails from the Havana-inspired Isla Beach Bar. Later, embark on a culinary journey across the hotel's seven diverse dining venues, tucking into Italian, Argentinian and Middle Eastern fare.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Rixos Marina Abu Dhabi",
    "offer_address": "Marina Mall Ring Road, Abu Dhabi 61060, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 146.0,
    "value": 146.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTO1AAO",
    "hero_image": "https://images.luxuryescapes.com/x1l5jkvmq3nn47016p9t",
    "image_two": "https://images.luxuryescapes.com/7tu60qemlqf9bnyjq6q4",
    "image_three": "https://images.luxuryescapes.com/0vjvok2zd7dvadns4soa",
    "vendor_name": "Qasr Al Sarab Desert Resort by Anantara",
    "title": "Abu Dhabi Desert Adventure in the Empty Quarter",
    "description": "Embark on an Arabian adventure among the scintillating sands of the Empty Quarter at the Qasr Al Sarab Desert Resort by Anantara. Experience the world's largest sand desert with captivating camel encounters, try your hand at archery and adventure across desert dunes, or lounge in luxury with an ice-cold cocktail at the poolside bar. Venture into Abu Dhabi to experience this vibrant cosmopolitan city, or stay in and enjoy fine dining at the onsite restaurants.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Mahdar Bin Usayyan",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Qasr Al Sarab Desert Resort by Anantara",
    "offer_address": "1 Qasr Al Sarab Road, Al Mirayr, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 366.0,
    "value": 366.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTZmAAO",
    "hero_image": "https://images.luxuryescapes.com/mlov4sh42nt5mz5mxogn",
    "image_two": "https://images.luxuryescapes.com/x3yajw7r3h6lxzhe0gm",
    "image_three": "https://images.luxuryescapes.com/bk3q0lggvs0owinu9k2g",
    "vendor_name": "Oaks Liwa Executive Suites Abu Dhabi",
    "title": "Luxurious Centrally-Located Apartments near Abu Dhabi Mall",
    "description": "Explore the modern and cosmopolitan wonders of Abu Dhabi when you stay at Oaks Liwa Executive Suites Abu Dhabi. These luxurious serviced apartments put five-star service at your fingertips, with every type of creature comfort. Escape the heat and enjoy a leisurely dip in the pool, or cool off with an iced coffee at The Coffee Club. When you're ready to explore, Abu Dhabi Mall is just five minutes away, while the Grand Mosque and Abu Dhabi Golf Club are both under a 25-minute drive away.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Oaks Liwa Executive Suites Abu Dhabi",
    "offer_address": "Tourist Club Area, Plot C-19, Sector E-16, Abu Dhabi, ADE 52920, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 109.0,
    "value": 109.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GUO27YAH",
    "hero_image": "https://images.luxuryescapes.com/jie0wdn985uv7gqfx9u6",
    "image_two": "https://images.luxuryescapes.com/cs3mwtyaed8f0ojsq3zu",
    "image_three": "https://images.luxuryescapes.com/68z8camzp8h3c0o77tex",
    "vendor_name": "Sofitel Abu Dhabi Corniche",
    "title": "Downtown Abu Dhabi Seafront Opulence with Outdoor Pool, Six Eateries & Jazz Bar",
    "description": "Savour five-star opulence only a stone's throw from the dazzling Arabian Gulf at the high-rise Sofitel Abu Dhabi Corniche in the city's diverse centre. Take a plunge in the heated outdoor pool, savour mouthwatering dining experiences at one of four restaurants and two cafes, and close out the day with a cocktail at the sky-high Jazz & Fizz Bar.\n\nBeyond the hotel, spend your days strolling along the city's seafront, try your hand at bartering in the city's bustling souks, or visit the striking Sheikh Zayed Grand Mosque. After a day of exploration, find your zen at the Sofitel SPA before retreating to your elegant accommodation.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Sofitel Abu Dhabi Corniche",
    "offer_address": "Corniche Road East, Capital Plaza Complex, Abu Dhabi 44966, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 105.0,
    "value": 105.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTNWAA4",
    "hero_image": "https://images.luxuryescapes.com/ay5458bsisb3ssmkkv6k",
    "image_two": "https://images.luxuryescapes.com/f25xzwve53kmv64nwke",
    "image_three": "https://images.luxuryescapes.com/00jjvop3wq34loia93c",
    "vendor_name": "Desert Islands Resort & Spa by Anantara",
    "title": "Abu Dhabi Five-Star Desert Oasis with Adventure Sports & World-Class Spa",
    "description": "Discover a palm-fringed oasis at the Desert Islands Resort & Spa by Anantara, a five-star escape on its own protected wildlife sanctuary just off the coast of Abu Dhabi. During your stay, encounter free-roaming animals (including the Arabian oryx), an abundance of family-friendly activities, and three onsite restaurants serving everything from fresh seafood to themed buffets. For a spot of pampering, enjoy a Thai massage, desert sand body scrub or scalp massage at the Anantara Spa.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Sir Bani Yas Island",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Desert Islands Resort & Spa by Anantara",
    "offer_address": "12452, Al Ruwais, Sir Bani Yas Island, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 195.0,
    "value": 195.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI5r8AAD",
    "hero_image": "https://images.luxuryescapes.com/d64hdgej7oahtw8vme39",
    "image_two": "https://images.luxuryescapes.com/ao64msn04j7gvip9hm5",
    "image_three": "https://images.luxuryescapes.com/mvg3xyuhkets8mmq04gl",
    "vendor_name": "Holiday Inn Abu Dhabi",
    "title": "Stylish Abu Dhabi City Break with Rooftop Pool & Five Restaurants",
    "description": "Escape to the cultural heart of the United Arab Emirates with a comfortable stay at the centrally located Holiday Inn Abu Dhabi, an IHG Hotel. Discover Abu Dhabi’s beauty - the botanical mosaics and soaring pillars of the whitewashed Sheikh Zayed Grand Mosque - a five-minute drive from the hotel. Soak in your surroundings, then return to this oasis for a splash in the pool to escape the heat and explore the range of onsite dining venues and vibrant bars on offer.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Holiday Inn Abu Dhabi, an IHG Hotel",
    "offer_address": "Dhafeer Street (31st Street) between Muroor & Airport, Abu Dhabi, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 71.0,
    "value": 71.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI5r9AAD",
    "hero_image": "https://images.luxuryescapes.com/cpolhf6eep5dkej5skjp",
    "image_two": "https://images.luxuryescapes.com/gkirt0oftjtu2pxbg35l",
    "image_three": "https://images.luxuryescapes.com/p4sz3sb7vf8y457bnpbc",
    "vendor_name": "Holiday Inn Abu Dhabi Downtown",
    "title": "Centrally Located Abu Dhabi Escape with Rooftop Swimming Pool",
    "description": "Stay close to the action in this centrally placed escape at Holiday Inn Abu Dhabi Downtown, a stylish stay within close proximity to major sights including the Louvre Abu Dhabi and Sheikh Zayed Grand Mosque. While you're here, beat the heat with a dip in the rooftop swimming pool, indulge in modern Australian cuisine and top-notch coffee at Jones the Grocer, or go all out with pizza, burgers and grilled meats at the all-day dining restaurant La Piazza Restaurant.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "Uni Arab Emirates",
    "location_description": "Holiday Inn Abu Dhabi Downtown, an IHG Hotel",
    "offer_address": "Sheikh Zayed the 1st Rd, Abu Dhabi, 32430 United Arab Emirates",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP6jYAF",
    "hero_image": "https://images.luxuryescapes.com/dia18x6c5fs93o90v9l",
    "image_two": "https://images.luxuryescapes.com/54yr2mofswx263vw1kpc",
    "image_three": "https://images.luxuryescapes.com/9xrucee0th1npjnrh11h",
    "vendor_name": "Novotel Abu Dhabi Al Bustan",
    "title": "Contemporary Abu Dhabi Escape with Rooftop Bar, Pool & Spa",
    "description": "Embrace the charms of UAE's capital with a stay at this elegant Novotel sanctuary, perfectly situated in an exclusive neighbourhood, moments from the National Exhibition Centre. Take a refreshing dip in the rooftop pool, sip on cocktails with a view or pamper yourself with treatments at the spa.\n\nWhen hunger strikes, tuck into Mediterranean delicacies at Nea and savour baked delights from Mellow Italian Cafe and Bakery. The majestic Sheikh Zayed Grand Mosque, Yas Island and the Marina Malls are all within easy reach - making this an ideal base for all your Abu Dhabi adventures.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "UAE",
    "location_description": "Novotel Abu Dhabi Al Bustan",
    "offer_address": "Sheikh Rashid Bin Saeed Street, Abu Dhabi 95208, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 49.0,
    "value": 49.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwHIAS",
    "hero_image": "https://images.luxuryescapes.com/z07ulemgtgh788b32sg",
    "image_two": "https://images.luxuryescapes.com/hro1zw2y871h49nc183i",
    "image_three": "https://images.luxuryescapes.com/ljamall7mb3aryt4ja7q",
    "vendor_name": "Rixos Premium Saadiyat Island",
    "title": "Exclusive Saadiyat Island Escape along the Arabian Gulf with Water Sports, Turkish Hammam & Kids' Aqua Park",
    "description": "Experience unparalleled Arabian luxury at this Accor wonder, located on the stunning white sands of Abu Dhabi's Saadiyat Island. This opulent beachfront oasis offers a wealth of indulgent amenities, including a world-class spa, multiple gourmet dining options, two pools and a range of facilities for the little ones. Unwind in style with a lavish Turkish Bath treatment while the kids have their fun at the onsite aqua park before hitting the beach as a family.\n\nA host of experiences at the resort promises a memorable Arabian escape for all. For the explorers, the nearby Louvre Abu Dhabi or the stunning Sheikh Zayed Grand Mosque, both easily accessible from the resort, are ready to captivate mind, body and soul. Yas Island's thrilling and unique theme parks are also just a short drive away.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Abu Dhabi",
    "offer_geo_area_level_2": "Abu Dhabi",
    "location_heading": "Abu Dhabi",
    "location_subheading": "United Arab Emirates",
    "location_description": "Rixos Premium Saadiyat Island",
    "offer_address": "Saadiyat Island, Abu Dhabi 51249, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 602.0,
    "value": 602.0
  }
]