[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HnFnIAK",
    "hero_image": "https://images.luxuryescapes.com/kawehsdw95jp98r29fk",
    "image_two": "https://images.luxuryescapes.com/ulljjrhf9p5ht8yuuv2",
    "image_three": "https://images.luxuryescapes.com/71ntf0379v6wg39qafr",
    "vendor_name": "Canareef Resort Maldives",
    "title": "Extended by Popular Demand: All-Inclusive Maldives Oceanfront Villas with Free-Flow Drinks & Return Domestic Flight Transfers",
    "description": "Discover a world of shimmering lagoons, lush jungle and all-inclusive island bliss with this oceanfront villa stay, perfectly positioned in the heart of the spectacular Addu Atoll. Surrounded by Addu’s rich heritage, culture and abundance of natural wonders, there’s no better place to soak up the Maldives’ iconic surfside serenity. \n\nLaze by the resort’s magnificent central pool, plunge into some of the archipelago’s most awe-inspiring dive spots or witness migrating waterbirds and wartime history on Hulhumeedhoo Island. Catch DJ-spun tracks and each soul-soaring sunset poolside at Dhoni Bar or head to Kilhi Restaurant for a lavish spread of French-inspired and Maldivian culinary delights. \n\nWith an abundance of activities and experiences available - including dolphin cruises, snorkelling, nature walks and an onsite authorised SSI Dive Centre - there’s no better place to find magic in the Maldives.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Addu City",
    "offer_geo_area_level_2": "Herathera",
    "location_heading": "Addu Atoll",
    "location_subheading": "Maldives",
    "location_description": "Canareef Resort Maldives",
    "offer_address": "Herathera, Addu City, Seenu Atoll 19060, Maldives",
    "percentage_discount": 54.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1679.0,
    "value": 3611.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EDke9AAD",
    "hero_image": "https://images.luxuryescapes.com/18a5wt500d1igs0i142i",
    "image_two": "https://images.luxuryescapes.com/zx8ro8m1b9rhgvpq3tnz",
    "image_three": "https://images.luxuryescapes.com/b1jrkuv7zpti2ekds9p",
    "vendor_name": "Canareef Resort Maldives",
    "title": "Maldives Oceanfront Villas with All-Inclusive Breakfast, Lunch & Dinner & Unlimited Free-Flow Drinks",
    "description": "Discover a world of shimmering lagoons, lush jungle and all-inclusive island bliss with an oceanfront villa stay at Canareef Resort Maldives, perfectly positioned in the heart of the spectacular Addu Atoll. Surrounded by Addu’s rich heritage, culture and abundance of natural wonders, there’s no better place to soak up the Maldives’ iconic surfside serenity - laze by the resort’s magnificent central pool, plunge into some of the archipelago’s most awe-inspiring dive spots or witness migrating waterbirds and wartime history on Hulhumeedhoo Island.\n\nCatch DJ-spun tracks and each soul-soaring sunset poolside at Dhoni Bar or head to Kilhi for a lavish spread of French-inspired and Maldivian culinary delights. With an abundance of activities and experiences available - including dolphin cruises, snorkelling, nature walks and an onsite authorised SSI Dive Centre - there’s no better place to find magic in the Maldives.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Addu City",
    "offer_geo_area_level_2": "Herathera",
    "location_heading": "Addu Atoll",
    "location_subheading": "Maldives",
    "location_description": "Canareef Resort Maldives",
    "offer_address": "Herathera, Addu City, Seenu Atoll 19060, Maldives",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 1179.0,
    "value": 3247.0
  }
]