[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQ1tUAAT",
    "hero_image": "https://images.luxuryescapes.com/ge5lysfvcu4wzvy2jmj",
    "image_two": "https://images.luxuryescapes.com/7n71k0f6fwd7fvqk49ul",
    "image_three": "https://images.luxuryescapes.com/tkabtnvyqho6pulknxa8",
    "vendor_name": "Tree of Life Ecotainer Agra",
    "title": "Agra Ecotainer Escape near Taj Mahal with Daily Breakfast & One Dinner",
    "description": "Your next Agra escape just got a unique upgrade. Choose Tree of Life Ecotainer Agra, a one-of-a-kind hotel featuring four 'ecotainers', shipping containers offering contemporary accommodation units for adventure seekers. Scattered across three acres of a lush green landscape, just 20 minutes from the world-famous Taj Mahal, the hotel's eco-friendly containers blur the line between the inside and outside, with each one boasting a private garden of its own. Better yet, the hotel offers pet beds, bowls, pet mini-bars and even 'pooch menus', making it the perfect escape for your four-legged companions.\n\nYou can choose to have your meals served in your private garden or under a neem tree, where sweet-smelling mogras will fill the air with a delightful aroma and mood music will make you sway with joy. Stretch out your legs while playing badminton in the well-kept gardens, where your pets are free to chase butterflies. Easily accessible from Delhi (a four-hour drive), Tree of Life Ecotainer Agra also offers fun experiences such as Chambal River safari, Agra street food tours, cycling, barbecue evenings and Fatehpur Sikri tours.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttar Pradesh",
    "offer_geo_area_level_2": "Agra",
    "location_heading": "Agra",
    "location_subheading": "India",
    "location_description": "Tree of Life Ecotainer Agra",
    "offer_address": "Nauvee Meel, Janora Village Fatehabad Road, Agra Uttar Pradesh 283125 India",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 130.0,
    "value": 210.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcUpSAAV",
    "hero_image": "https://images.luxuryescapes.com/z2g7r5ja3gzinm7slefh",
    "image_two": "https://images.luxuryescapes.com/vzz08edq5f4q8w12tll5",
    "image_three": "https://images.luxuryescapes.com/y4p6zcrr8btxqzj16qta",
    "vendor_name": "The Oberoi Amarvilas Agra",
    "title": "Five-Star Oberoi Stay near Taj Mahal with Daily Breakfast & Daily Drinks",
    "description": "Relax and unwind in a palatial setting at The Oberoi Amarvilas, a five-star retreat, located just 650 metres from the Taj Mahal, the ultimate tribute to eternal love. Three hours from Delhi, The Oberoi Amarvilas was recognised in the Tripadvisor Travellers' Choice Best of the Best award for the top 25 hotels in India, placing it within the top 1% of properties on the site. A fairytale setting awaits anyone seeking a romantic escape, with reflection pools, bubbling fountains, and immaculate lawns. Featuring bespoke dining experiences, 24-hour butler service and a luxurious onsite spa, this is a regal retreat like no other.\n\nYour exotic holiday will be filled with a myriad of delights. Take a dip in the pool before visiting one of the four onsite restuarants and bars, where you can enjoy delicious Indian and international delicacies and handcrafted signature cocktails. During your stay, hop in a golf buggy and take advantage of the resort's complimentary shuttle service to the Taj Mahal, where you can wander the grounds and take in the majesty of one of the new Seven Wonders of the World.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttar Pradesh",
    "offer_geo_area_level_2": "Agra",
    "location_heading": "Agra",
    "location_subheading": "India",
    "location_description": "The Oberoi Amarvilas",
    "offer_address": "Taj East Gate Rd, Paktola, Tajganj, Agra, Uttar Pradesh 282001 India",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 776.0,
    "value": 1184.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eKXfwQAG",
    "hero_image": "https://images.luxuryescapes.com/fqniujc5a7mm09y8e0s",
    "image_two": "https://images.luxuryescapes.com/f6o1bifw0d66evb6rnbs",
    "image_three": "https://images.luxuryescapes.com/bp4c0aaqxfh7cbfr91b",
    "vendor_name": "Radisson Hotel Agra",
    "title": "Stylish Agra Escape with Spectacular Taj Mahal Views & Gourmet Inclusions",
    "description": "Overflowing with forts, monuments and three UNESCO World Heritage Listed sights to explore, the fascinating city of Agra is the ideal destination to witness the legacy of the Mughal empire. Explore all the city has on offer and enjoy unparalleled views over the iconic Taj Mahal from Radisson Agra, perfectly positioned on the banks of the Yamuna river with panoramic views over Agra's crowning glory. Your escape includes daily buffet breakfast, one buffet or one three-course dinner, a glass of wine or beer per person once during your stay, and 20% discount on food, drinks and spa treatments. Travelling with kids? Up to two children aged 11 years and under stay for free with meals as per package.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttar Pradesh",
    "offer_geo_area_level_2": "Agra",
    "location_heading": "Agra",
    "location_subheading": "India",
    "location_description": "Radisson Hotel Agra",
    "offer_address": "C-1, C-2, Fatehabad Rd, Taj Nagari Phase 1, R.K. Puram Phase-2, Basai Khurd, Tajganj, Agra, Uttar Pradesh 282004, India",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 182.0,
    "value": 256.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id0nmAAB",
    "hero_image": "https://images.luxuryescapes.com/pvbnd4lujfkbvfr6yrf",
    "image_two": "https://images.luxuryescapes.com/yp3wnvssactcm1ybd0h",
    "image_three": "https://images.luxuryescapes.com/18emejhewbae3jarv1z",
    "vendor_name": "The Oberoi Amarvilas Agra",
    "title": "Agra Romantic Oberoi Opulence with Taj Mahal Views & Palace-Inspired Gardens",
    "description": "Sitting just moments from the unmistakable ivory-white dome and freestanding minarets of the Taj Mahal, every room at The Oberoi Amarvilas Agra offers uninterrupted views over one of the most iconic sights in the world. Truly more palace than hotel, each element of The Oberoi Amarvilas Agra’s design pays loving homage to the splendorous courts of the Mughal dynasty that once called the city home.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttar Pradesh",
    "offer_geo_area_level_2": "Agra",
    "location_heading": "Agra",
    "location_subheading": "India",
    "location_description": "The Oberoi Amarvilas, Agra",
    "offer_address": "Taj East Gate Road, Agra, Uttar Pradesh 282001, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 352.0,
    "value": 352.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI6EgAAL",
    "hero_image": "https://images.luxuryescapes.com/8yehf8e4l7btyvp7wrr",
    "image_two": "https://images.luxuryescapes.com/bx59eam2mj11gmwh24r",
    "image_three": "https://images.luxuryescapes.com/nwrgcqhrscsa98gcpih",
    "vendor_name": "Holiday Inn Agra Mg Road",
    "title": "Central Agra Stay Minutes from Wonder of the World Taj Mahal",
    "description": "Holiday Inn Agra MG Road, an IHG Hotel, is a convenient city sanctuary only minutes from one of the eight wonders of the world. Situated within the Sanjay Place commercial district, the best shops and restaurants are close at hand. Take a refreshing dip in the pool, get energised at the fitness centre or discover the immense Taj Mahal - a marble mausoleum and UNESCO World Heritage Site famous as a testament to love - before returning for a smooth scotch at the lobby bar.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttar Pradesh",
    "offer_geo_area_level_2": "Agra",
    "location_heading": "Agra",
    "location_subheading": "India",
    "location_description": "Holiday Inn Agra MG Road, an IHG Hotel",
    "offer_address": "16/2/8 Sanjay Place Commercial Complex, Agra 282002, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 35.0,
    "value": 35.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id0nDAAR",
    "hero_image": "https://images.luxuryescapes.com/ohmr2wg56nqheb5zb88d",
    "image_two": "https://images.luxuryescapes.com/8a2v270rvjogp3zjm334",
    "image_three": "https://images.luxuryescapes.com/lbkqdk6nsqncpf7mniz",
    "vendor_name": "Trident, Agra",
    "title": "Modern Five-Star Agra Escape Minutes From Taj Mahal with Plush Spa & Pool",
    "description": "Discover the allure of India's Mughal elegance with a stay at this five-star sanctuary, sitting just minutes from the majestic UNESCO World Heritage-listed Taj Mahal. A tranquil low-rise oasis amid the bustling ancient city, the hotel offers an ideal base to explore Agra's rich heritage and culture. Soak up the comforts of your well-appointed room, unwind by the serene pool and rejuvenate with a spa treatment. Savour authentic Indian flavours at the onsite restaurant and sip on cocktails at the bar after a long day of exploration.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttar Pradesh",
    "offer_geo_area_level_2": "Agra",
    "location_heading": "Agra",
    "location_subheading": "India",
    "location_description": "Trident, Agra",
    "offer_address": "Fatehbad Road, Agra, Uttar Pradesh 282 001, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 107.0,
    "value": 107.0
  }
]