[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UwzmAAC",
    "hero_image": "https://images.luxuryescapes.com/2vtprr46wbdipkutx14",
    "image_two": "https://images.luxuryescapes.com/c7jjxya11pva5u7je7yj",
    "image_three": "https://images.luxuryescapes.com/ypegrvj5qm4wu290n58e",
    "vendor_name": "Hotel Kea",
    "title": "Elegant Northern Iceland Heritage Escape with Fjord Views",
    "description": "Discover the breathtaking natural splendour of Iceland’s north with a stay at the heritage Hotel Kea by Keahotels. Sitting in the heart of Akureyri, known as the 'Capital of the North', this classic hotel - first opened in 1944 - is a stone’s throw from the city’s attractions, including the Hof Cultural Centre, Akureyri Art Museum and its iconic church (Akureyrarkirkja), designed by renowned Icelandic architect Guðjón Samúelsson. Adrenaline-fuelled adventurers will find plenty to explore in the surrounding countryside - trot along a fjord on an Icelandic horse, try your luck with whale watching, go for a dip at Hrafnagil Swimming Pool, or take to the slopes at Hlíðarfjall ski resort, just an hour’s drive away.\n\nYou won’t even need to leave Hotel Kea by Keahotels to experience the region’s spectacular landscapes - it’s perfectly positioned for views over the awe-inspiring Eyjafjörður fjord. There's no need to venture far to taste some of the city’s best dishes either: the first-floor Mulaberg Bistro & Bar is beloved by locals and visitors for its fusion of French, Italian, Danish and Icelandic flavours, and extensive cocktail list.",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Northeastern Region",
    "offer_geo_area_level_2": "Akureyri",
    "location_heading": "Akureyri",
    "location_subheading": "Iceland",
    "location_description": "Hotel Kea by Keahotels",
    "offer_address": "Hafnarstræti 89, Akureyri, Iceland",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 32,
    "price": null,
    "value": null
  }
]