[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LrWYAA0",
    "hero_image": "https://images.luxuryescapes.com/yami9be1vfxwa7ethvta",
    "image_two": "https://images.luxuryescapes.com/sq3s7h2f17pvrvigrpa",
    "image_three": "https://images.luxuryescapes.com/kbho5avtbitb2s11rsln",
    "vendor_name": "WelcomHotel Amritsar",
    "title": "Heritage Amritsar Luxury with Gourmet Daily Dining & Drinks",
    "description": "Experience a winning combination of ITC luxury and heartwarming hospitality at Welcomhotel Amritsar, conveniently located close to Amritsar's famed attractions, including the opulent Golden Temple. Scattered across eight acres of lush landscape, and built around a 1900s collonaded mansion, this sophisticated retreat is the perfect way to discover the many charms of one of India's holiest cities. Offering the perfect blend of old-world ambience and contemporary luxury, the best of the city awaits you at Welcomhotel Amritsar.\n\nAlongside the unmissable Golden Temple, you'll be perfectly placed for checking off iconic sights such as Jallianwala Bagh public garden and memorial, Durgiana Temple, the Partition Museum and Akal Takht.\n\n**Your handpicked inclusions**\n\n- Begin every morning with buffet breakfast at Welcomcafe Phulkari\n- End every night with buffet/three-course dinner at Welcomcafe Phulkari\n- Every evening, enjoy one glass of wine/beer at the bar (one drink per person)\n- Access to Club Hours at the bar between 6pm and 8pm (buy one drink, get one free)\n- Make the most of your stay with a 25% discount on drinks, dining and spa (does not apply on drinks purchased during Club Hours and cannot be combined with any other offer)\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** One child (aged 11 years and under) stays free in existing bedding with breakfast included.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Punjab",
    "offer_geo_area_level_2": "Amritsar",
    "location_heading": "Amritsar",
    "location_subheading": "India",
    "location_description": "Welcomhotel Amritsar",
    "offer_address": "Raja Sansi, Ajnala Rd, Amritsar, Punjab 143101",
    "percentage_discount": 68.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 119.0,
    "value": 371.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EDKRIAA5",
    "hero_image": "https://images.luxuryescapes.com/eginq4ipxchtgikxn9mv",
    "image_two": "https://images.luxuryescapes.com/l014pquz3k6jm5ggg2s5",
    "image_three": "https://images.luxuryescapes.com/ndp0um2ivb3rvbxwfe",
    "vendor_name": "The Earth Amritsar",
    "title": "Grand Opening: Amritsar Heritage Escape with Daily Breakfast, Drinks & One Lunch/Dinner",
    "description": "Travel back in time and step into a heritage era at the brand new The Earth Amritsar - Trademark Collection by Wyndham that exudes an enviable blend of vintage as well as contemporary charm. Formerly home to a 130-year-old colonial heritage building - Victoria Jubilee Hospital, built to commemorate the 55th year of Queen Victoria’s reign, the historic establishment has now been given a new life and avatar. This luxurious property, which is lavishly spread out across several acres and located in the centre of the revered city of Amritsar, is just a 10-minute drive from the well-known Golden Temple and only 20 minutes from the Sri Guru Ram Dass Jee International Airport (ATQ).\n\nImmerse yourself in the grandeur of the heritage setting as you unwind in the outdoor pool by the banyan tree or destress at the (upcoming) EYWA Wellbeing Spa at this luxurious hotel, which marks the debut venture of Trademark Collection from Wyndham group in India. Feast on myriad global cuisines and savour lip-smacking regional specialities at the all-day dining restaurant, Lutyens, or simply surround yourself with serenity and comfort as you while your time in the spacious, well-appointed rooms.\n\nAs the deep Gurbani Sangeet from the revered Golden Temple binds you to its enchanted aura, you will feel the spiritual atmosphere pulse all around you. If you are a history-lover, a heritage walk through the city’s bylanes, past stunning palaces, colonial structures and vibrant bazaars and visiting the poignant site of the Jallianwala Bagh will be sure to evoke emotions. Further, you can experience the patriotic fervour of India with a visit to the Attari-Wagah Border and witness the energetic Beating Retreat Ceremony.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Punjab",
    "offer_geo_area_level_2": "Amritsar",
    "location_heading": "Amritsar",
    "location_subheading": "India",
    "location_description": "The Earth Amritsar - Trademark Collection by Wyndham",
    "offer_address": "Urban Haat, Crystal Chowk, Amritsar- Punjab -143 001",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 209.0,
    "value": 388.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dfle2AAB",
    "hero_image": "https://images.luxuryescapes.com/8wp84jk5jnkqwbkbgaqn",
    "image_two": "https://images.luxuryescapes.com/17w00fadg27e49kv9p",
    "image_three": "https://images.luxuryescapes.com/wioc0tz0g96ppgm0yolc",
    "vendor_name": "Holiday Inn Amritsar Ranjit Avenue",
    "title": "Elegant Five-Star India Escape with Rooftop Bar",
    "description": "Discover one of India’s most spiritual cities and beautiful temples with a stay at Holiday Inn Amritsar Ranjit Avenue, an IHG Hotel. Explore what this bustling city is known for, and why so many travellers flock to witness the glowing Golden Temple, as you dine at mouthwatering and authentic restaurants. Toast your holiday by soaking in the views at the rooftop Aqua Lounge with a well-deserved cocktail before visiting the exquisite Bell-A-Sia restaurant for a well-deserved feast.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Punjab",
    "offer_geo_area_level_2": "Amritsar",
    "location_heading": "Amritsar",
    "location_subheading": "India",
    "location_description": "Holiday Inn Amritsar Ranjit Avenue, an IHG Hotel",
    "offer_address": "District Shopping Complex, Ranjit Avenue, Amritsar, Punjab, India, 143001",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 43.0,
    "value": 43.0
  }
]