[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DJH4jAAH",
    "hero_image": "https://images.luxuryescapes.com/bc8sve021i3horhvvibx",
    "image_two": "https://images.luxuryescapes.com/mstv1rz5jcp14a7hn0c",
    "image_three": "https://images.luxuryescapes.com/h9e8k1yxdnzmmav0nq",
    "vendor_name": "Aurora Anguilla Resort & Golf Course",
    "title": "Anguilla Beachfront Luxury on Rendezvous Bay with 18-Hole Golf Course, Daily Breakfast & US$50 Food & Drink Credit",
    "description": "Fringed by the gleaming white-sand beaches and translucent waters of Rendezvous Bay, Aurora Anguilla Resort & Golf Club is nothing short of pure bliss. This expansive, Mediterranean-style resort allows guests to discover the Caribbean's natural splendour with 300 acres of world-class amenities just beyond their doorstep. Golf enthusiasts can tee off at the stunning Greg Norman-designed 18-hole championship course, while gourmands may forge a connection with the flavours of Anguilla at one of six exceptional onsite restaurants.\n\nTravellers who enjoy active escapes can make use of the onsite tennis courts, fitness centre, or bocce and volleyball grounds, or hit the beach for a sunrise boot camp on the shimmering sand. For moments of stillness, head to the refreshing, holistic Sorana Spa -  or simply stretch out in a cabana by the palm-lined pool. The resort even boasts a fleet of private planes for those who like to travel in style.",
    "offer_country_name": "Anguilla",
    "offer_country_code_alpha_2": "AI",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Rendezvous Bay",
    "location_heading": "Anguilla",
    "location_subheading": "Caribbean",
    "location_description": "Aurora Anguilla Resort & Golf Club",
    "offer_address": "Rendezvous Bay, Anguilla, 2640, Anguilla",
    "percentage_discount": 37.0,
    "min_duration": 4,
    "max_duration": 25,
    "price": 2317.0,
    "value": 3693.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070UYTAA2",
    "hero_image": "https://images.luxuryescapes.com/hmb3ritc3q3ha894xm7u",
    "image_two": "https://images.luxuryescapes.com/9m5zq2gjqdhu51b6bx9o",
    "image_three": "https://images.luxuryescapes.com/9a4iinlk3jahgruxwpmn",
    "vendor_name": "Malliouhana",
    "title": "Oceanfront Caribbean Island Glamour with Infinity Pool & Private Beach",
    "description": "Let the Caribbean sun melt your cares away when you escape to Malliouhana, a tropical island resort gracing one of Anguilla's best beaches. Beautifully poised atop a bluff leading down to powder-white sands lapped by translucent blue waves, this beachfront sanctuary,  ranked within the top 10% of properties on Tripadvisor, is the epitome of glamorous Caribbean living. Grab a cocktail from the beach bar and watch golden rays bounce off the cascading infinity pool, or take the plunge and gaze out to the endless sea. \n\nEnjoy a short stroll to the beachfront and sink your toes into some of the island's finest sands at Meads Bay, swing along to reggae beats from a hammock, or revel in privacy at Turtle Cove. When the sun begins to fade, retreat to Celeste alfresco restaurant for a delicious island feast or embrace the candlelit ambience of Bar Soleil.",
    "offer_country_name": "Anguilla",
    "offer_country_code_alpha_2": "AI",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "West End Village",
    "location_heading": "Anguilla",
    "location_subheading": "Caribbean",
    "location_description": "Malliouhana",
    "offer_address": "Meads Bay, 2640, Anguilla",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GdAQAA0",
    "hero_image": "https://images.luxuryescapes.com/ewob3rvg9jj08krkyrm8",
    "image_two": "https://images.luxuryescapes.com/8q09iinp7o8kdfdv9jiyc",
    "image_three": "https://images.luxuryescapes.com/qr9190i5pfslm7bxaj",
    "vendor_name": "Aurora Anguilla Resort & Golf Course",
    "title": "Anguilla Beachfront Luxury on Rendezvous Bay with 18-Hole Golf Course",
    "description": "Fringed by the gleaming white-sand beaches and translucent waters of Rendezvous Bay, Aurora Anguilla Resort & Golf Course is nothing short of pure bliss. This expansive, Mediterranean-style resort allows guests to discover the natural splendour of the Caribbean with 300 acres of world-class amenities at their fingertips.\n\nGolfing enthusiasts can tee off at the stunning Greg Norman-designed 18-hole championship course (opening early 2022), while gourmands can forge a stronger connection with the flavours of Anguilla at one of six exceptional onsite restaurants. Travellers who enjoy an active escape can make use of the onsite tennis courts, fitness centre, bocce, pickleball courts or hit the beach for a sunrise boot camp on the shimmering sands. For moments that call for stillness, the refreshing, holistic Sorana Spa is the place for a restorative experience - or simply stretch out in a cabana by the palm-lined pool. The resort also boasts a fleet of private planes for those who prefer to travel in style.",
    "offer_country_name": "Anguilla",
    "offer_country_code_alpha_2": "AI",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Rendezvous Bay",
    "location_heading": "Anguilla",
    "location_subheading": "Caribbean",
    "location_description": "Aurora Anguilla Resort & Golf Course",
    "offer_address": "Rendezvous Bay, Anguilla AI-2640, British West Indies",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 22,
    "price": 629.0,
    "value": 629.0
  }
]