[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DVa1JYAT",
    "hero_image": "https://images.luxuryescapes.com/69j6m83rnis1v67ib3cn",
    "image_two": "https://images.luxuryescapes.com/xmpchonezosvmt72tf8",
    "image_three": "https://images.luxuryescapes.com/ws8e4vik3rxtdtjvsxz",
    "vendor_name": "Crowne Plaza Resort Appi Kogen",
    "title": "Appi Kogen Ski-In Ski-Out Resort with Daily Breakfast, Ski Passes, Nine Restaurants & Onsen Access",
    "description": "Nestled in the postcard-perfect Appi Kogen Resort, renowned for its powder-soft snow, this retreat offers the ideal escape for seasoned skiers and tranquillity seekers alike. Located at the base of the mountain, this ski-in, ski-out haven provides seamless access to some of Japan’s most celebrated slopes, all just a 2.5-hour bullet train from Tokyo.\n\nWhen you’re not carving through fresh powder, relax in the resort’s serene indoor and outdoor onsen hot springs, where you can soak in breathtaking views of snow-dusted forests and majestic peaks. Stay active at the fully equipped fitness centre, or unwind with a rejuvenating spa treatment to ease away the day’s exertions.\n\nSatisfy your post-ski cravings at any of the seven on-site restaurants and bars. Begin your day with a sumptuous buffet breakfast before hitting the slopes. Later, savour the freshest seafood at Sushi Nagata, indulge in premium wagyu beef at Richoen or enjoy afternoon tea with panoramic mountain views at Brisa.",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Iwate Prefecture",
    "offer_geo_area_level_2": "Hachimantai",
    "location_heading": "Appi Kogen",
    "location_subheading": "Japan",
    "location_description": "ANA Crowne Plaza Resort Appi Kogen",
    "offer_address": "117-17 Appi Kogen, Iwate-Ken, Hachimantai-Shi, Iwate 028-7306, Japan",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 999.0,
    "value": 2520.0
  }
]