[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dZaQrQAK",
    "hero_image": "https://images.luxuryescapes.com/vb9ntewq128tkfka7ayo",
    "image_two": "https://images.luxuryescapes.com/k3ut5ey5qheuiy5g80p",
    "image_three": "https://images.luxuryescapes.com/hzeps2quwnknxt7theai",
    "vendor_name": "Ribeira Collection Hotel",
    "title": "Historic Hotel Stay in Beautiful Rural Portugal with Daily Breakfast and Nightly Three-Course Dinner",
    "description": "If you like to holiday off-the-beaten-track to get a true taste of local life, you’ll love this blissful riverside getaway just an hour from the city of Porto in sun-kissed northern Portugal. Check in to the Ribeira Collection Hotel by Piamonte Hotels, just five minutes from the charming historic Arcos de Valdevez with its ancient churches, stately homes and pretty riverfront. Enjoy daily continental buffet breakfast, nightly three-course dinner with wine, a complimentary welcome drink each on arrival, a welcome fruit basket, complimentary use of kayaks on the River Vez and more.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Viana do Castelo District",
    "offer_geo_area_level_2": "Arcos de Valdevez",
    "location_heading": "Arcos de Valdevez",
    "location_subheading": "Portugal",
    "location_description": "Ribeira Collection Hotel",
    "offer_address": "R. dos Milagres, 4970-592 Arcos de Valdevez, Portugal",
    "percentage_discount": 56.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 464.0,
    "value": 1045.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HqybIAC",
    "hero_image": "https://images.luxuryescapes.com/j1evnwboed59k49xhxat",
    "image_two": "https://images.luxuryescapes.com/f2ptqdv4ekql2ukcugl",
    "image_three": "https://images.luxuryescapes.com/la36y0yqdmhk6x1lv3a",
    "vendor_name": "Ribeira Collection Hotel",
    "title": "Tranquil Portugal Riverfront Retreat near Porto with Daily Breakfast & Unlimited Spa Access",
    "description": "Nestled in the picturesque countryside of Arcos de Valdevez, this tranquil riverside escape welcomes guests with modern amenities and a serene ambiance. Occupying a renovated heritage building in the country's mountainous north, the Ribeira Collection Hotel features elegantly furnished rooms with touches of local charm, guaranteeing a relaxing stay in a stunning natural setting.\n\nGuests can enjoy outdoor adventures like hiking and cycling in the nearby Serra da Peneda mountains, or savour some downtime at the Ribeira Essence spa, with rejuvenating treatments and zen spaces to unwind. \n\nVenture beyond the tranquil riverfront to explore nearby Braga, a historic town steeped in centuries of culture with awe-inspiring monuments such as the Bom Jesus do Monte hilltop sanctuary, famous for its Baroque stairway. For outdoor thrill seekers, the hotel offers kayaks and paddle boards for a refreshing escape into nature along the enchanting River Vez.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Viana do Castelo District",
    "offer_geo_area_level_2": "Arcos de Valdevez",
    "location_heading": "Arcos de Valdevez",
    "location_subheading": "Portugal",
    "location_description": "Ribeira Collection Hotel",
    "offer_address": "Largo dos Milagres, Arcos de Valdevez 4970-592, Portugal",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 279.0,
    "value": 759.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003I8ABAA0",
    "hero_image": "https://images.luxuryescapes.com/r4t8fgh3nkbxjfv57vdx",
    "image_two": "https://images.luxuryescapes.com/uck19cdiusphqk3g918u",
    "image_three": "https://images.luxuryescapes.com/efif2o9wqswrxxflhozl",
    "vendor_name": "Ribeira Collection Hotel",
    "title": "Award-Winning Northern Portugal Riverside Stay near Porto",
    "description": "Leave the hustle and bustle of the more popular Portuguese destinations behind for a relaxing break amid the picturesque country town of Arcos De Valdevez in northern Portugal, where the exquisite Ribeira Collection Hotel awaits. Experience refined elegance at this riverside retreat - a winner at the World Luxury Hotel Awards 2020 - housed in a thoughtfully renovated heritage building dating back to 1916. Facilities include a terrace overlooking the river, three bars, a beautiful spa with sauna, Turkish bath and jacuzzi, and a swimming pool that transforms from indoor to outdoor during the summer months.\n\nEmbrace the laidback lifestyle of idyllic Arcos de Valdevez - a country jewel showcasing a more traditional side of Portugal, bejewelled with tiny old churches, quaint houses, verdant hills and locally run restaurants offering Portuguese and Mediterranean cuisine. It's just a 1-hour drive to the nearby coastal city of Porto, where you'll find pretty beaches, narrow cobbled streets hiding old merchants' houses, and the lavish São Francisco Church, known for its baroque interiors and ornate gilded carvings.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Viana do Castelo District",
    "offer_geo_area_level_2": "Arcos de Valdevez",
    "location_heading": "Arcos de Valdevez",
    "location_subheading": "Portugal",
    "location_description": "Ribeira Collection Hotel",
    "offer_address": "R. dos Milagres, 4970-592 Arcos de Valdevez, Portugal",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 221.0,
    "value": 221.0
  }
]