[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FN5GUAA1",
    "hero_image": "https://images.luxuryescapes.com/weiby1l5mv1pah8h58l",
    "image_two": "https://images.luxuryescapes.com/z3rqi8l3b4pm9f6yw5",
    "image_three": "https://images.luxuryescapes.com/1iw22f2dvcatt7ftyo75h",
    "vendor_name": "The Westin Kierland Villas, Scottsdale",
    "title": "Lush Arizona Golf Retreat Overlooking Mountain Ranges with Pools, Hot Tub & Whirl Pool",
    "description": "Discover the desert oasis of your wildest dreams with an escape to The Westin Kierland Villas, Scottsdale, a luxurious retreat nestled at the feet of an array of magnificent mountain ranges. This upscale sanctuary, a stone's throw from the vibrant Scottsdale Old Town, offers the perfect blend of rustic charm and modern elegance. Admire stunning desert landscapes as you take a swing at the Kierland Golf Club, fuel up with tasty bites at McDowell Market & Grill and chill out in a sparkling pool or bubbling hot tub. As the sun sets, retreat to stylish rooms and villas to savor the mesmerizing Arizona sunset with a refreshing drink in hand.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Arizona",
    "offer_geo_area_level_2": "Scottsdale",
    "location_heading": "Arizona",
    "location_subheading": "Phoenix",
    "location_description": "The Westin Kierland Villas, Scottsdale",
    "offer_address": "15620 N Clubgate Dr, Scottsdale, AZ 85254, United States",
    "percentage_discount": 0.0,
    "min_duration": 3,
    "max_duration": 29,
    "price": 556.0,
    "value": 556.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ExQEmAAN",
    "hero_image": "https://images.luxuryescapes.com/qzesq9ospfpzme31zuf",
    "image_two": "https://images.luxuryescapes.com/xecui868a2ki695eh2nm",
    "image_three": "https://images.luxuryescapes.com/k6krnw7b9i34cb1p5dh",
    "vendor_name": "Sonesta Suites Scottsdale Gainey Ranch",
    "title": "Arizona Oasis-Style Ranch Escape with Daily Buffet Breakfast",
    "description": "Step into a world of orange desert tones, rugged mountains and eternally blue skies with a stay at Sonesta Suites Scottsdale Gainey Ranch - a thriving life source in the heart of Phoenix’s fashionable “Valley of the Sun”. Succumb to the call of this desert metropolis and live the true southwestern lifestyle, hiking the Sonoran Desert to catch the sunrise over the cactus-covered vistas, sipping local liquor along Scottsdale's fmaous wine and ale trails and indulging in lavish spa treatments before retreating to this charming ranch. Located in the foodie district of Phoenix, Scottsdale is brimming with farm-to-table goodness, authentic Mexican bites and mouthwatering pizza that will have you dreaming of fluffy crust and Neapolitan sauce.\n\nThe hotel resembles a palm-fringed oasis, with a crystal-clear pool in the centre lined by plush sun loungers, umbrellas, grassy spaces and a jacuzzi. Kickstart each morning with a hearty buffet breakfast in the Hearth Room, where the smell of freshly cooked bacon wafts across the al fresco dining area. Lounge in the Arizona sunshine and sip on a refreshing cocktail by the Terrace Bar as the warm air wraps around you and the sounds of a nearby bubbling fountain soothe your mind.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Arizona",
    "offer_geo_area_level_2": "Scottsdale",
    "location_heading": "Arizona",
    "location_subheading": "United States",
    "location_description": "Sonesta Suites Scottsdale Gainey Ranch",
    "offer_address": "7300 E. Gainey Suites Drive, Scottsdale 85258, Arizona, United States",
    "percentage_discount": 40.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 495.0,
    "value": 823.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lrjRAAQ",
    "hero_image": "https://images.luxuryescapes.com/jvipt5rzyk32vaxzv69i",
    "image_two": "https://images.luxuryescapes.com/lvwat1gals1fdm9k1zugn",
    "image_three": "https://images.luxuryescapes.com/jah8xfneeg342ozho8qp",
    "vendor_name": "Mountain Shadows Resort",
    "title": "Luxe Desert Resort in Paradise Valley with Citizens Club Access",
    "description": "Uncover the beauty of the Sonoran Desert from Mountain Shadows, a gorgeous resort at the height of desert luxury. Look out over the ochre gorges, thorny cacti and rugged mountainscapes of Paradise Valley from this fabulous resort, ranked in the top 10% of resorts worldwide by Tripadvisor. \n\nEstablished in the 1950s, Mountain Shadows evokes a retro vibe while still having the comforts of modern life. Spend days lounging poolside with a fresh juice in hand at the renowned Citizens Club, which features two swimming pools, a juice bar, and a fitness centre. Enjoy a round of golf at the par-3 course with views of Camelback Mountain, peruse exhibitions of local artwork in the adjacent gallery and savour world-class dining at Hearth ’61 restaurant. When you can pull yourself away from the resort, a desert wonderland awaits. Spend a morning among towering cacti and gargantuan succulents at Desert Botanical Garden, or put aside a full day to explore the Grand Canyon. A mere 15-minute drive away is downtown Scottsdale, known for its shopping, art galleries, dining, and nightlife.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Arizona",
    "offer_geo_area_level_2": "Paradise Valley",
    "location_heading": "Arizona",
    "location_subheading": "USA",
    "location_description": "Mountain Shadows Resort",
    "offer_address": "5445 E Lincoln Dr, Paradise Valley, AZ 85253, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 250.0,
    "value": 250.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HiIOIA0",
    "hero_image": "https://images.luxuryescapes.com/h0rmsoo7rc4a1upiz00a",
    "image_two": "https://images.luxuryescapes.com/tttrhep2zuhvk08bdw5da",
    "image_three": "https://images.luxuryescapes.com/vb1tjrl9ilq9hpzadkf",
    "vendor_name": "Omni Tempe Hotel at ASU",
    "title": "Vibrant Downtown Tempe Escape with Rooftop Pool & Four Restaurant & Bars",
    "description": "Experience the vibrant energy of Arizona with a stay at this stylish and beautifully designed hotel, perfectly positioned in the heart of Tempe. Offering easy access to the Arizona State University campus, the eclectic Mill Avenue for shopping and dining, and the Tempe Town Lake for scenic strolls, it couldn't be better located for days spent exploring this revitalised town. \n\nIndulge in authentic American cuisine at Neighbourhood Services restaurant, or refresh yourself with a dip in the rooftop pool, complete with private cabanas and poolside loungers. Start each day at Library Rules, where you'll find specialty coffee and pastries, before embarking on a daily adventure - both the breathtaking Papago Park and Desert Botanical Garden are just a short drive away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Arizona",
    "offer_geo_area_level_2": "Tempe",
    "location_heading": "Arizona",
    "location_subheading": "United States",
    "location_description": "Omni Tempe Hotel at ASU",
    "offer_address": "7 East University Drive, Tempe, AZ 85281, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 129.0,
    "value": 129.0
  }
]