[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JN5iGAAT",
    "hero_image": "https://images.luxuryescapes.com/dhp2dtui813mqpzfl7vdo",
    "image_two": "https://images.luxuryescapes.com/ph24g9h3amfz64oa7vr",
    "image_three": "https://images.luxuryescapes.com/lf8v47ky6uf586mk1zpm",
    "vendor_name": "Dolce by Wyndham Attica Riviera",
    "title": "Greek Beachfront Luxury near Athens with Daily Breakfast & One Child Stays Free",
    "description": "For a taste of Grecian grandeur and seaside relaxation, look no further than this idyllic beachfront retreat on the Attica Riviera. With direct beach access, dreamy onsite facilities and the city comforts of Athens within easy reach, this Greek haven offers all you need and more for your next escape.\n\nSpend your days lazing around the shimmering pool with a refreshing cocktail from the pool bar, or opt for the beach, mere moments away from your accommodation. Indulge in Mediterranean flavours at Filema A La Carte Restaurant, experience Greek cuisine at its finest at the picturesque Ammos Beach Bar & Restaurant, or simply try a different restaurant and bar each day - there are seven to spend time in, and a welcome cocktail per person to toast your stay.\n\nTake some time to yourself at Ageo Spa, or enjoy a game of tennis or volleyball on the hotel's courts - the options are endless. When you fancy exploring the surrounding area, Attica's pristine beaches and crystalline waters are right on your doorstep.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Markopoulo Mesogaias",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Dolce by Wyndham Athens Attica Riviera",
    "offer_address": "Vravronos Avenue, Vravrona 19003, Greece",
    "percentage_discount": 66.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 249.0,
    "value": 737.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gh5nPAAR",
    "hero_image": "https://images.luxuryescapes.com/ohihbuk407hb6ce2xmfa",
    "image_two": "https://images.luxuryescapes.com/vqevr2cdniux4kufs8q",
    "image_three": "https://images.luxuryescapes.com/wyl257wmr8koob2v4sf7",
    "vendor_name": "Praxitelous Luxury Suites - Athens",
    "title": "Stylish Contemporary Athens Stay in the Heart of City with Daily Breakfast",
    "description": "Be transported to the glamour of ancient Greece with a sophisticated stay at Praxitelous Luxury Suites. Situated in the centre of the charming Greek capital, this boutique hotel offers a gateway to the iconic Acropolis, the charming Plaka neighbourhood and the bustling Monastiraki flea market. Savour the flavours of traditional Greek cuisine at nearby eateries, relax for casual breakfast at the hotel's own restaurant and, after dark, enjoy the city's vibrant nightlife scene. When you're not out exploring, unwind in your elegantly appointed room or suite that overlooks the historic city.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Praxitelous Luxury Suites - Athens",
    "offer_address": "loannou Paparrigopoulou 17, Athens 105 61, Greece",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 289.0,
    "value": 547.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GI6H4YAL",
    "hero_image": "https://images.luxuryescapes.com/az8cw80kift5uny9bopp",
    "image_two": "https://images.luxuryescapes.com/i02zwx48ekl1oe71m1yx",
    "image_three": "https://images.luxuryescapes.com/y2g3qz7akr1ms7su1tj",
    "vendor_name": "Ace Hotel & Swim Club, Athens",
    "title": "Grand Opening: Chic Athens Seaside Indulgence with Daily Breakfast, Nightly Cocktails & Dining Credit",
    "description": "Set along the sun-drenched Athenian Riviera, this sleek new hotel perfectly balances laid-back beach vibes with urban cool. Be among the first to unwind in its stylish rooms, where turntables spin curated vinyl, D'Angelico guitars add a musical touch and balconies showcase stunning Mediterranean views.\n\nTwo pools and the exclusive Swim Club pulse with energy, while The Lobby bar crafts knockout mezcal cocktails alongside a lively lineup of music and art events. Just steps from Glyfada Beach, with Athens’ boutique-lined streets and ancient wonders close by, this is your gateway to the Riviera. Savour elevated Greek classics at Sebastian restaurant, then dive into DJ-fueled pool parties that keep the energy high long after sunset.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Glyfada",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Ace Hotel & Swim Club Athens",
    "offer_address": "Artemisiou 1, Athens, Glifada 166 75, Greece",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 26,
    "price": 299.0,
    "value": 714.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GfFgvAAF",
    "hero_image": "https://images.luxuryescapes.com/o7gaglgpxbaejlosijkag",
    "image_two": "https://images.luxuryescapes.com/4ya0iuebmr02k0gjy883",
    "image_three": "https://images.luxuryescapes.com/eop1ciu257s0cmq6nie7",
    "vendor_name": "Wyndham Grand Athens",
    "title": "Glamorous Athens Stay with Spectacular Rooftop Pool & Daily Breakfast",
    "description": "Discover the history, art and thriving culture of Greece’s sprawling capital city from an ultra-glamorous launchpad set in the heart of it all: Wyndham Grand Athens. As you step out the door, you're just a five-minute walk from the captial's artsy neighbourhoods, vibrant bars and traditional cafes. Enjoy a swim overlooking the city’s skyline at cooler-than-cool ABOVE, a rooftop bar and restaurant offering Mediterranean and international plates, as well as sweeping panoramic views of the legendary Acropolis of Athens. Sip on a casual drink at SILK, settle in for a relaxed evening of European-style dining at FOS Restaurant or unwind at the hotel's tranquil spa, offering everything from massages to aloe body wraps.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Wyndham Grand Athens",
    "offer_address": "Megalou Alexandrou Street 2, Athens 10437, Greece",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 299.0,
    "value": 692.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GhHpBYAV",
    "hero_image": "https://images.luxuryescapes.com/4f08cqj7t5e896ucd9b",
    "image_two": "https://images.luxuryescapes.com/topzbxny0npag3egh2r",
    "image_three": "https://images.luxuryescapes.com/y9v7x6vx4m6on96zt5ti",
    "vendor_name": "Royalty Hotel Athens",
    "title": "Boutique Central Athens Gem with Daily Breakfast, Nightly Drinks & Dining Credit",
    "description": "Nestled in the beating heart of the city, this boutique retreat delivers first-rate indulgence with unmistakable Greek soul. From the moment you step into Royalty Hotel Athens' marble-clad lobby adorned with Hellenic art, you're treated like modern-day royalty. The rooms balance timeless design with panoramic views that'll have you reaching for your camera before you unpack.\n\nBut the real showstopper? The rooftop terrace, where Acropolis views steal the scene, best enjoyed with a handcrafted cocktail. Work up an appetite from visiting historic sites before diving into authentic Greek cuisine at Royal Roof. Wrap up your day in the tranquil spa, a serene escape from Athens' electrifying energy.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Royalty Hotel Athens",
    "offer_address": "Athinas 6, Agias Irinis 43, Athens 105 51, Greece",
    "percentage_discount": 77.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 229.0,
    "value": 986.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMfoGAAT",
    "hero_image": "https://images.luxuryescapes.com/2hra6s0u3c802r2w2bo",
    "image_two": "https://images.luxuryescapes.com/b5ashl8ipj197fo7m93d",
    "image_three": "https://images.luxuryescapes.com/g5pujnmkxid1so5grko",
    "vendor_name": "Athens Mansion",
    "title": "Stylish Athens Escape with Acropolis Views & Daily Breakfast",
    "description": "Experience the pinnacle of southeast European sophistication in the heart of Greece’s capital with a relaxing stay at Athens Mansion Luxury Suites. Become immersed in rich Greek culture, spending your days wandering around breathtaking historical sites, crumbling ancient temples and vibrant local markets, before returning to the comforts of the restored 1930s building. Treat yourself to delicious breakfasts, authentic Greek fare and delightful afternoon drinks at the hotel’s open-air rooftop bar, while basking in magnificent views across the famed Acropolis.\n\nFeel yourself relax in a welcoming space where peace, comfort and culture all combine. Enjoy round-the-clock friendly service and beautifully appointed rooms, finished with chic baroque touches for a truly elegant and wonderfully historic escape.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Athens Mansion Luxury Suites",
    "offer_address": "11 Evripidou Street, Athens 10561, Greece",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 199.0,
    "value": 494.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dbMNtQAM",
    "hero_image": "https://images.luxuryescapes.com/4n3onvddb8gb9hz7m0d",
    "image_two": "https://images.luxuryescapes.com/i2dkh4zkb3ehhdn6jvl",
    "image_three": "https://images.luxuryescapes.com/gwdeelpapb5sug6o6k86s",
    "vendor_name": "Pallas Athena Grecotel Boutique Hotel Athens",
    "title": "Designer Athens Stay with Dining Inclusions and Acropolis Museum Tickets",
    "description": "The sprawling capital of Greece is at your feet when you stay at the quirky Grecotel Pallas Athena, a boutique hotel located in a prime position in the heart of the city. Discover the rich history and cosmopolitan flair of Athens staying in one of the hotel's ultra-cool rooms, all decorated with graffiti and unique design pieces. Your Greek escape includes daily breakfast, a traditional three-course Mediterranean dinner, a welcome drink on arrival, a one-way airport transfer and all Government taxes, plus a ticket to the Acropolis Museum, Athens’ crowning glory.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Grecotel Pallas Athena",
    "offer_address": "Athinas 65, Athina 105 51, Greece",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 433.0,
    "value": 894.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DqVoEYAV",
    "hero_image": "https://images.luxuryescapes.com/gonpyf8el5udefxgjvci",
    "image_two": "https://images.luxuryescapes.com/zk5jshufno933h53rsie",
    "image_three": "https://images.luxuryescapes.com/xjst20h3ffjq2pod4chy",
    "vendor_name": "Brown Acropol, a member of Brown Hotels",
    "title": "Athens Retro-Inspired Cosmopolitan Charm near Acropolis with Rooftop Bar & Daily Breakfast",
    "description": "Retro-chic style meets cosmopolitan flair at this central Athens hotel, showcasing swanky mid-century yet contemporary interiors inspired by '60s glam. When you’re not soaking in the designer surroundings, head straight to the rooftop for Mediterranean bites paired with stunning Acropolis views, or unwind in a hammock or one of three open-air hot tubs.\n\nFor extra relaxation, treat yourself at the onsite spa with indulgent massages, a dry sauna and a tranquil Hammam. Explore nearby landmarks like Syntagma Square, Ermou Street, the Acropolis and the Acropolis Museum, then cap off your day with a refreshing craft cocktail at the lobby bar or rooftop.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Brown Acropol Athens",
    "offer_address": "Panagi Tsaldari Pireos 1, Athens 105 52, Greece",
    "percentage_discount": 72.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 159.0,
    "value": 569.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DRWdlAAH",
    "hero_image": "https://images.luxuryescapes.com/qw2nsxa5yi6k3k9otirf",
    "image_two": "https://images.luxuryescapes.com/8wr5t6x4ng93dydelbt",
    "image_three": "https://images.luxuryescapes.com/epl19wxzhqfdd86zza6",
    "vendor_name": "Athens Mansion",
    "title": "Stylish Athens Escape with Impressive Acropolis Views, Daily Breakfast & Rooftop Bar Wine",
    "description": "Experience the pinnacle of southeast European sophistication in the heart of Greece’s capital with a relaxing stay at Athens Mansion Luxury Suites. Become immersed in rich Greek culture, spending your days wandering around surrounding breathtaking historical sites, crumbling ancient temples and vibrant local markets, before returning to the comforts of the restored 1930s building. Treat yourself to delicious breakfasts, authentic Greek fare and delightful afternoon drinks on the hotel’s open-air rooftop bar, while basking in magnificent views across the famed Acropolis.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Athens Mansion Luxury Suites",
    "offer_address": "11 Evripidou Street, Athens 10561, Greece",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 191.0,
    "value": 494.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000E4YnpYAF",
    "hero_image": "https://images.luxuryescapes.com/fn0u6yrd73ndjgjlzkk",
    "image_two": "https://images.luxuryescapes.com/0k6sb7zncr7bl3dsb6c",
    "image_three": "https://images.luxuryescapes.com/do9b05cyzgf0eyyu9vgq",
    "vendor_name": "Wyndham Grand Athens",
    "title": "Glamorous Central Athens Stay with Daily Breakfast & 360-Degree View Rooftop Pool & Restaurant",
    "description": "Discover the history, art and thriving culture of Greece’s sprawling capital city from an ultra-glamorous launchpad, complete with a rooftop bar and restaurant in the centre of it all. Step out the door and you're perfectly located to explore Athens' artsy neighbourhoods, buzzing bars and traditional cafes before retreating to the hotel's array of offerings.\n\nEnjoy a swim overlooking the city’s skyline at ABOVE, a rooftop bar and restaurant offering Mediterranean and international plates, as well as sweeping views of the legendary Acropolis of Athens. Then, change things up with a casual drink at SILK or a relaxed evening of European-style dining at FOS Restaurant - the choice is yours.\n\nWhen you're not lounging ABOVE it all or soaking up the city's vibrant energy, unwind at the hotel's tranquil spa, offering tried-and-true treatments like Ancient Greek or Cretan massages, aromatherapy and aloe body wraps. Here in the heart of Athens, there's something for everyone.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Wyndham Grand Athens",
    "offer_address": "Megalou Alexandrou Street 2, Athens 10437, Greece",
    "percentage_discount": 73.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 219.0,
    "value": 800.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Li5jAAC",
    "hero_image": "https://images.luxuryescapes.com/2x0978m1zp4jsbks1mr",
    "image_two": "https://images.luxuryescapes.com/68dkrxkwxh129lv4iym",
    "image_three": "https://images.luxuryescapes.com/9teeuoshdgde68ehkun",
    "vendor_name": "Wyndham Grand Athens",
    "title": "Glamorous Athens Stay with Spectacular Rooftop Pool & Unparalleled Views",
    "description": "Discover the history, art and thriving culture of Greece’s sprawling capital city from an ultra-glamorous launchpad set in the heart of it all: Wyndham Grand Athens. Taking you close to all that the city has to offer, this stylish hotel is the ideal starting point for your explorations, with world-class facilities including a rooftop pool, bar and restaurant boasting panoramic views across the city and the legendary Acropolis of Athens.\n\nYour Greek escape includes daily breakfast, a three-course dinner during your stay, a bottle of wine with fresh fruit on arrival, a drink per person and a 15-minute anti-stress massage at the blissful spa.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details). \n\n**Travelling to Europe?** [Browse our Europe Collection](https://luxuryescapes.com/au/destinations/europe)",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Wyndham Grand Athens",
    "offer_address": "Megalou Alexandrou Street 2, Athens 10437, Greece",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 508.0,
    "value": 1364.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcE46AAF",
    "hero_image": "https://images.luxuryescapes.com/czac65jnaqcg3erk4qeg",
    "image_two": "https://images.luxuryescapes.com/reobku7cjqx6k7gr2p9r",
    "image_three": "https://images.luxuryescapes.com/4zej3ywxsit4lypf59mi",
    "vendor_name": "Wyndham Grand Athens",
    "title": "Glamorous Central Athens Stay with Daily Breakfast & 360-Degree View Rooftop Pool & Restaurant",
    "description": "Discover the history, art and thriving culture of Greece’s sprawling capital city from an ultra-glamorous launchpad, with a cooler-than-cool rooftop bar and restaurant, set in the centre of it all. As you step out the door, you're perfectly located to explore Athens' artsy neighbourhoods, vibrant bars and traditional cafes before relishing all the hotel has to offer. Enjoy a swim overlooking the city’s skyline at ABOVE, a rooftop bar and restaurant offering Mediterranean and international plates, as well as sweeping panoramic views of the legendary Acropolis of Athens. Then change things up with a casual drink at SILK or a relaxed evening of European-style dining at FOS Restaurant - the choice is yours.\n\nWhen you're not lounging ABOVE it all or taking in the city's vibrant history and culture, try unwinding at the hotel's tranquil spa, offering tried-and-true treatments like Ancient Greek or Cretan massage, aromatherapy and aloe body wraps. Here in the heart of Athens, there's something for everyone.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Wyndham Grand Athens",
    "offer_address": "Megalou Alexandrou Street 2, Athens 10437, Greece",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 269.0,
    "value": 692.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LschAAC",
    "hero_image": "https://images.luxuryescapes.com/fzycbjvlrq6w1b2fmep",
    "image_two": "https://images.luxuryescapes.com/r09icgjfsawvwmquhch",
    "image_three": "https://images.luxuryescapes.com/tx3ndh1acw0iljpbfit",
    "vendor_name": "NEW Hotel, a Member of Design Hotels",
    "title": "Five-Star Designer Athens Stay with Gourmet Dining & Acropolis Tickets",
    "description": "Enjoy a Greek city break at the five-star NEW Hotel, Athens, with eye-popping views of the Acropolis from its boutique rooftop Art Lounge verandah and a location on the edge of Syntagma Square, just 15 minutes' walk from the Parthenon.\n\nStay in urban designer luxury with daily breakfast, a daily drink per person at the rooftop Art Lounge, one three-course dinner at the hotel's stunning art-inspired restaurant and two tickets to the fascinating Acropolis Museum.\n\n**Travelling with family?** One child (aged 11 years and under) stays free with daily breakfast.\n\n**Travelling to Europe?** [Browse our Europe Collection](https://luxuryescapes.com/au/destinations/europe).",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "NEW Hotel 2020",
    "offer_address": "Filellinon 16, Athina 105 57, Greece",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 569.0,
    "value": 1071.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IajPoAAJ",
    "hero_image": "https://images.luxuryescapes.com/n9wccd62h61ubbsqy",
    "image_two": "https://images.luxuryescapes.com/mavlo6l7neq0rze94us",
    "image_three": "https://images.luxuryescapes.com/z9o5z8gko8ipckg0s9o2",
    "vendor_name": "Athens Mansion",
    "title": "Sophisticated Athens Escape near Acropolis with Daily Breakfast & Rooftop Bar",
    "description": "Experience the pinnacle of southeastern European sophistication in the heart of Greece’s capital with a relaxing stay at Athens Mansion Luxury Suites. Become immersed in rich Greek culture, spending your days wandering around surrounding breathtaking historical sites, crumbling ancient temples and vibrant local markets, before returning to the comforts of the restored 1930s building.\n\nKickstart your mornings with a sumptuous breakfast, relish in the flavours of authentic Greek delicacies throughout the day, and as dusk descends, elevate your experience at the rooftop bar under the expansive sky, all while marvelling at the grandeur of the Acropolis, a symbol of classical architecture and the enduring legacy of the ancient Greeks.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Athens Mansion Luxury Suites",
    "offer_address": "11 Evripidou Street, Athens 10561, Greece",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 239.0,
    "value": 493.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HGC8AAO",
    "hero_image": "https://images.luxuryescapes.com/98el35aaskil8tvqtrp9j",
    "image_two": "https://images.luxuryescapes.com/8xjvdq69r35e0g9n3kz",
    "image_three": "https://images.luxuryescapes.com/y6otrrg3cro3ko0b7u6",
    "vendor_name": "St George Lycabettus Lifestyle Hotel",
    "title": "Luxe Central Athens Escape with Rooftop Pool & Panoramic Acropolis Views",
    "description": "Soak up the very best of Greece's storied capital, Athens, with a glorious stay at St. George Lycabettus Lifestyle Hotel - boasting panoramic views of the Acropolis and ranked within the top 10% of properties on Tripadvisor. From the moment of arrival, you'll immediately be charmed by this unique property. The interior pays homage to Athens’ neoclassical era while expertly balanced with striking, eye-catching modern design features. The hotel has its own art gallery, cinema, state-of-the-art gym, yoga and pilates studio, plus a rooftop pool with expansive city views. When the time calls for a retail fix, you're just a short walk away from Kolonaki’s endless restaurants, intriguing art galleries, museums, and alluring shops.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "​St. George Lycabettus Lifestyle Hotel",
    "offer_address": "2 Kleomenous Street 106 75 Athens Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 206.0,
    "value": 206.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HnLXAA0",
    "hero_image": "https://images.luxuryescapes.com/jcalcgztlhguu38vftb",
    "image_two": "https://images.luxuryescapes.com/ge6w1coniu5a5m5qstzk",
    "image_three": "https://images.luxuryescapes.com/wiha08dspezv57bxkzrt",
    "vendor_name": "NEW Hotel, a Member of Design Hotels",
    "title": "Five-Star Designer Athens Escape with Acropolis-View Rooftop Bar",
    "description": "Get your dose of Greece's ancient culture while enjoying cutting-edge design with a five-star stay at NEW Hotel in Athens. This avant-garde boutique hotel might be housed in a 1950s building, but the interior showcases forward-thinking touches from Brazilian designers Fernando and Humberto Campana.\n\nTake time to peruse the onsite art gallery, visit the library (home to over 2,000 books), luxuriate at NEW Sense Spa and see Athens from above at the stylish rooftop Art Lounge, boasting Acropolis views. When you’re feeling ready to explore, the charms of Athens are just a short stroll from your lavish hotel room.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "NEW Hotel",
    "offer_address": "Filellinon 16, Athina 105 57, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 217.0,
    "value": 217.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HuDTIA0",
    "hero_image": "https://images.luxuryescapes.com/ekiplv09m54n3g3az7tq",
    "image_two": "https://images.luxuryescapes.com/3zg8vd13dg8iif2myris",
    "image_three": "https://images.luxuryescapes.com/i8jarivz7d9pcr3d0z6mh",
    "vendor_name": "The Dolli at Acropolis, A Hotel to Live",
    "title": "Downtown Athens Boutique Haven with Infinity Pool & Rooftop Terrace",
    "description": "Once the grand Kallimasiotis Mansion in 1925, this historic gem has had quite the journey, morphing into a luxury fabric store before blossoming into the boutique hotel you see today, a glow-up that would make even Aphrodite jealous. The redesign has embraced the building's rich history while giving it a fresh twist, making it the ultimate hangout for your Athens getaway.\n\nStep inside and soak up the Athenian vibe. Relax in the numerous peaceful nooks and crannies, or take a dip in the infinity pool that creates the mesmerising illusion of swimming through the columns of the Parthenon. When it's time to indulge, ascend to Dolli's Rooftop Restaurant to satisfy your senses with everything from sushi, meat and fish.\n\nVenture outside and find yourself immersed in a vibrant tapestry of ancient wonders and modern delights. With the Acropolis, Ancient Agora and countless other historical treasures just moments away, prepare to let this magical city sweep you off your feet. Lose yourself in Plaka's charming streets, discover hidden courtyards, and create memories that will last a lifetime.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "The Dolli at Acropolis, A Hotel to Live",
    "offer_address": "Mitropoleos 49, Athens, Attica 105 56, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 494.0,
    "value": 494.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JELw6YAH",
    "hero_image": "https://images.luxuryescapes.com/u9n7trsgglbz0483z16r",
    "image_two": "https://images.luxuryescapes.com/71i9xwu3ggskfcpsz2ym",
    "image_three": "https://images.luxuryescapes.com/zeiv4gva7ewz0aarivt",
    "vendor_name": "Sofitel Athens Airport",
    "title": "Athens Airport Luxury with Spa, Pool & Multiple Onsite Restaurants",
    "description": "Perfectly positioned for a smooth layover, this luxury Sofitel hotel is conveniently located within the terminal of Athens Airport and a short drive from the vibrant city centre. Between flights savour contemporary Greek cuisine at the stylish Mesoghaia Restaurant or planespot with a cocktail in hand from Jenny's Rooftop Restaurant.\n\nKeep active in the well-equipped fitness centre, swim laps of the pool or explore attractions including the historic Acropolis, Parthenon or the storied Panathenaic Stadium.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Spata-Artemida",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Sofitel Athens Airport",
    "offer_address": "Athens International Airport, Athens, Spata, 19019, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 234.0,
    "value": 234.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPz1AAAT",
    "hero_image": "https://images.luxuryescapes.com/i82sh732qdiui0v4zd",
    "image_two": "https://images.luxuryescapes.com/jo34d4y3era4eledg0z",
    "image_three": "https://images.luxuryescapes.com/iyknq0k1br1tliywxj1",
    "vendor_name": "Crowne Plaza Athens City Centre",
    "title": "Athens City Centre Retreat with Rooftop Sundeck and Pool",
    "description": "Discover contemporary and classic Greece in convenience and comfort from the urban oasis that is Crowne Plaza Athens - City Centre, an IHG Hotel. Journey back in time, with the iconic Acropolis and Parthenon a short drive away. Dine on delectable Greek gastronomy at Ambrosia restaurant or bask in the Mediterranean sun by the pool and rooftop sun deck. When you're done exploring the best of Athens, soothe tired muscles at the onsite sauna.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Crowne Plaza Athens - City Centre, an IHG Hotel",
    "offer_address": "Michalakopoulou 50, Athens 115 28, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 136.0,
    "value": 136.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt68AAB",
    "hero_image": "https://images.luxuryescapes.com/d68y2ueodgnql0ipfnk",
    "image_two": "https://images.luxuryescapes.com/cd7fdjn2vlmfzki2l06s",
    "image_three": "https://images.luxuryescapes.com/i73bjmk01hepck2j3yt",
    "vendor_name": "Intercontinental Athenaeum Athens",
    "title": "Stylish Athens Escape with Acropolis Views & Rooftop Bar",
    "description": "The wonders of Ancient Greece are at your fingertips when you stay at InterContinental Athenaeum Athens, an IHG Hotel, where contemporary design meets the crumbling remains of the Acropolis. When you're not out there exploring UNESCO World Heritage-listed sites, head up to Premiere, a rooftop restaurant and bar with spectacular views of the Acropolis, then venture to the poolside Cafezoe Terrace for cocktails and desserts.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "InterContinental Athenaeum Athens, an IHG Hotel",
    "offer_address": "Leof. Andrea Siggrou 89-93, Athina 117 45, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 134.0,
    "value": 134.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI5yxAAD",
    "hero_image": "https://images.luxuryescapes.com/3om5dtyzcarz6v8no8m8",
    "image_two": "https://images.luxuryescapes.com/ikbvtmtetijs76gj279c",
    "image_three": "https://images.luxuryescapes.com/h1me4g7zlsxtdksperic",
    "vendor_name": "Holiday Inn Athens - Airport",
    "title": "Contemporary Athens Stay Close to Airport with Cosy Restaurant & Indoor Pool",
    "description": "If you’re looking for an incredibly comfortable and well-appointed stay just a stone’s throw from Athens Airport, Holiday Inn Athens - Airport, an IHG Hotel, is the ideal destination for guests exploring the vibrant city or just passing through. Traverse around the ancient city your way and return to splash in the indoor pool, or to indulge in a hearty serving of moussaka at Ruby Restaurant, or head to the gilded and opulent Golden Bar for dessert and a nightcap.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Spata-Artemida",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "Holiday Inn Athens - Airport, an IHG Hotel",
    "offer_address": "Attica Avenue, Athens 19002, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 101.0,
    "value": 101.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JKCfIAO",
    "hero_image": "https://images.luxuryescapes.com/qpw0ls4duqq583rj5vl9",
    "image_two": "https://images.luxuryescapes.com/vdwy7m3yle9jeujzbsf",
    "image_three": "https://images.luxuryescapes.com/dhkosf9xftok3zp0y1f",
    "vendor_name": "NJV Athens Plaza",
    "title": "Luxurious Central Athens Elegance Overlooking the Acropolis with Three Onsite Eateries",
    "description": "Discover Athens' historic heart with a stay at this timeless retreat, nestled in the heart of the city. Overlooking Syntagma Square, NJV Athens Plaza Hotel offers a front-row seat to iconic landmarks like the Acropolis, the bustling Plaka district and the chic boutiques of Ermou Street.\n\nInside, expect unparalleled hospitality and sophisticated rooms and suites featuring marbled bathrooms and sweeping views of this storied city. Enjoy a casual bite at the Plaza Café, indulge in Mediterranean cuisine crafted with fresh, local ingredients at the stylish Parliament Restaurant and wind down at the end of each day with a drink at Explorer's Bar Bistro.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "NJV Athens Plaza",
    "offer_address": "2 Vasileos Georgiou A' str., Syntagma Square, Athens 105 64, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 207.0,
    "value": 207.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FipNRAAZ",
    "hero_image": "https://images.luxuryescapes.com/0zeh3sebgiqb76bn0t1rs",
    "image_two": "https://images.luxuryescapes.com/ibxz3wjtp539pm26dec",
    "image_three": "https://images.luxuryescapes.com/3qmmaehrhpevy3363p0s",
    "vendor_name": "The Modernist Athens",
    "title": "Contemporary-Cool Athens Escape near the Acropolis with Rooftop Terrace",
    "description": "Transforming the once historic Canadian Embassy into a sanctuary of contemporary Nordic design, The Modernist Athens celebrates mid-century minimalism and Danish design principles in the capital of Classic style. Nestled on a quiet street overlooking a leafy square, its rooftop showcases sweeping views from the Acropolis to the Mediterranean.\n\nLocated in the upscale Kolonaki neighbourhood, you're steps away from iconic attractions and world-class museums such as the Benaki and the Museum of Cycladic Art, and nearby sophisticated shopping districts like Voukourestiou Street and Ermou invite you to immerse yourself in Athens' dynamic rhythm.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Attica",
    "offer_geo_area_level_2": "Athens",
    "location_heading": "Athens",
    "location_subheading": "Greece",
    "location_description": "The Modernist Athens",
    "offer_address": "Ioannou Gennadiou 4, Athens 115 21, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 191.0,
    "value": 191.0
  }
]