[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzMh0AAF",
    "hero_image": "https://images.luxuryescapes.com/acytuo0w0c07l7zjm9tu",
    "image_two": "https://images.luxuryescapes.com/nfuiqgzrbharz18zqe1s",
    "image_three": "https://images.luxuryescapes.com/byobh0gmunj2e5gfach",
    "vendor_name": "Headlands Austinmer Beach",
    "title": "Picturesque Self-Contained Beachfront Studios with Daily Breakfast just 60 Minutes from Sydney",
    "description": "Close your eyes and imagine it - the world falls away as you stand high above the golden sands of Austinmer Beach, surrounded by the boundless Pacific Ocean and the endless whispering of the waves. This is Headlands Austinmer Beach, a modern clifftop retreat offering countless moments of serenity just an hour’s drive south of Sydney. Road-tripping Australia’s iconic Grand Pacific Drive with family or friends? Upgrade to the Two Bedroom Penthouse Apartment for up to four guests and savour moments spent exploring one of the country’s most spectacular landscapes.\n\nYou can expect top-notch dining - head to the onsite brasserie and bar for laidback modern Australian fare, ultra-fresh oysters (best sampled with yuzu and wasabi) and spectacular ocean views as you dine, or wander to the hotel’s own food truck for beachside dumplings and pizza. And when you’re ready to explore, the Royal National Park, brilliant bushwalks and pristine beaches are all only moments away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Wollongong",
    "location_heading": "Austinmer",
    "location_subheading": "NSW",
    "location_description": "Headlands Austinmer Beach",
    "offer_address": "Cnr Headland Ave & Yuruga St, Austinmer NSW 2515 Australia",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 247.0,
    "value": 548.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FoMY5AAN",
    "hero_image": "https://images.luxuryescapes.com/89cvtmehdxdu36rmfxu",
    "image_two": "https://images.luxuryescapes.com/m1am2a87wmd6j1w69p58",
    "image_three": "https://images.luxuryescapes.com/7bs36dijti8s7whka0i",
    "vendor_name": "Headlands Austinmer Beach",
    "title": "NSW South Coast Apartment-Style Escape with Beachside Bar & Outdoor Pool",
    "description": "Trade city air for sea salt at the award-winning Headlands Austinmer Beach, mere minutes from the stunning shores of the NSW South Coast. This beachfront haven boasts panoramic ocean views, a rooftop bar and an outdoor pool, the perfect combination for the ultimate relaxation. Savour the taste of the ocean at the onsite restaurant, or venture out to explore the charming coastal village of Austinmer. Spend your days strolling the golden sands, exploring the lush Sublime Point walking track, or indulging in the vibrant local dining scene.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Wollongong",
    "location_heading": "Austinmer",
    "location_subheading": "NSW",
    "location_description": "Headlands Austinmer Beach",
    "offer_address": "Cnr Headland Ave & Yuruga St, Austinmer NSW 2515 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 105.0,
    "value": 105.0
  }
]