[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HBR4jYAH",
    "hero_image": "https://images.luxuryescapes.com/epcwi5hv2dfrcabfuh",
    "image_two": "https://images.luxuryescapes.com/dou4db9fi8uj2fu969h",
    "image_three": "https://images.luxuryescapes.com/6e9e9csabarm0pe6k4h",
    "vendor_name": "Le Jadis Beach Resort & Wellness Mauritius",
    "title": "Mauritius Beachfront All-Suite Bliss near Port Louis with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Nestled in paradise, Le Jadis Beach Resort & Wellness Mauritius embraces you with the magic of this island nation, where lush native greenery meets azure waters. Visionary design blends Oriental, Occidental and African influences through natural materials, showcasing thatched roofs dancing above rustic stone walls and refined marble flooring.\n\nDive into one of two sprawling pools or step directly onto pristine sands, where barefoot luxury prevails. With a lavish spa featured in the 2025 National Geographic Spa & Wellness Collection, relaxation and pampering take centre stage here. Balance mind, body and soul with expert treatments and find your zen at the open-top Hydrotherapy Pool or the rainmist room.\n\nExtend the indulgence across six exquisite bars and restaurants, including fresh seafood paired with ocean vistas at Cruso on the Beach, thirst-quenching juices and cocktails at the swim-up bar, or French and European flavours amid tropical surroundings at Sylea Restaurant.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Mauritius",
    "offer_geo_area_level_2": "Tombeau Bay",
    "location_heading": "Balaclava",
    "location_subheading": "Mauritius",
    "location_description": "Le Jadis Beach Resort & Wellness Mauritius",
    "offer_address": "Turtle Bay, Balaclava 21307, Mauritius",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 1399.0,
    "value": 3260.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gus4LAAR",
    "hero_image": "https://images.luxuryescapes.com/yt2k687u1j8p76ronbl",
    "image_two": "https://images.luxuryescapes.com/qw95ht22e45yao5dquu2",
    "image_three": "https://images.luxuryescapes.com/379ovux7lo0ascmnln1l",
    "vendor_name": "InterContinental Resort Mauritius",
    "title": "Tranquil Mauritius Beachfront Hideaway with Ocean Views, Daily Breakfast & Nightly Dinner",
    "description": "Embrace the warmth of the Indian Ocean's breeze on the sun-kissed shores of Mauritius, where peaceful luxury meets serene island living. On the palm-fringed shores of Balaclava Bay, this tranquil haven offers a front-row seat to lush gardens adorned with exotic trees and the azure coral-filled lagoon. Catering to every whim and desire, the InterContinental Mauritius Resort Balaclava Fort, an IHG Hotel boasts four exquisite restaurants, a stylish swim-up bar, two glittering pools and a passionate team devoted to ensuring a seamless and memorable stay. Whether you're a thrill-seeker or in search of some rest and relaxation, an array of resort activities await. Explore the island's extensive coral reefs from above in a glass-bottom boat or kayak, or below by snorkelling or learning to dive with an expert.\n\nCome time to dine, the resort's four restaurants will be sure to satisfy. Watch meticulous chefs prepare international delights at the buffet-style Senso, crafting cuisine from Indian tandoor to Middle Eastern grills in an open kitchen. Look out at volcanic mountain that stretches next to the turquoise ocean at Segala, encompassing the culinary traditions of Spain, Italy, Greece and Turkey. At Veda, sit against a backdrop of lush tropical greenery and discover the diverse flavours of India, or be soothed by the sound of waves at the open-air Noble House while savouring modern Asian dishes. Spend days lounging poolside and cool off with a drink at the swim-up Sugar Cane beach bar, offering an extensive list of cocktails and mocktails - the perfect way to end a day of tropical bliss.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Pamplemousses District",
    "offer_geo_area_level_2": "Balaclava",
    "location_heading": "Balaclava",
    "location_subheading": "Mauritius",
    "location_description": "InterContinental Mauritius Resort Balaclava Fort, an IHG Hotel",
    "offer_address": "Balaclava Fort Coastal Road, Balaclava 21306, Mauritius",
    "percentage_discount": 46.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 1439.0,
    "value": 2663.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gv2biAAB",
    "hero_image": "https://images.luxuryescapes.com/51txh4f96llx3bwrfq9k",
    "image_two": "https://images.luxuryescapes.com/fwvxk1e49or6kx8cjoj",
    "image_three": "https://images.luxuryescapes.com/yd0d76dsnz0rjslk7f",
    "vendor_name": "The Westin Turtle Bay Resort & Spa, Mauritius",
    "title": "Mauritius Luxury Suites near Turtle Bay Beach with Oceanfront Pool, Daily Breakfast & Nightly Dinner",
    "description": "Experience unmatched luxury with an escape to this tropical haven on Mauritius' picturesque coast in the spectacular Turtle Bay area. In a combination of pure relaxation and fun-for-all, The Westin Turtle Bay Resort & Spa, Mauritius offers the ultimate island retreat, with panoramic views of the Indian Ocean and countless onsite facilities and activities. Indulge in a variety of cuisines and exotic ingredients in one of five different onsite restaurants all offering a captivating tropical setting, or sit back and enjoy a smoothie or cocktail at The Retreat Bar. For those seeking tranquility, Heavenly Spa by Westin offers anything from massages to body wraps, and the resort boasts both a kids' and an adults-only pool for lounging with or without the little ones. If you're after something more active, take advantage of the resort's tennis courts, the 24-hour fitness centre, or complimentary watersports activities - there's something for everyone.\n\nWhen you're ready to venture out and explore the local area, the island's white sand beaches and crystal clear waters are at your fingertips. Try sailing, water-skiing or windsurfing if you're an adventure lover, or experience some of the best diving in Turtle Bay. For something a little more relaxed, Grand Baie is just a short drive away, offering vibrant restaurants and bars, as well as more serene beaches. The area is also known as the best place to shop on the island, if you're seeking some retail therapy. For a slight change of scenery, visit Pamplemousses Botanical Garden or the Sugar Museum and Factory and learn about the island's culture and history.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Pamplemousses District",
    "offer_geo_area_level_2": "Balaclava",
    "location_heading": "Balaclava",
    "location_subheading": "Mauritius",
    "location_description": "The Westin Turtle Bay Resort & Spa, Mauritius",
    "offer_address": "Balaclava, Turtle Bay 21307, Mauritius",
    "percentage_discount": 39.0,
    "min_duration": 6,
    "max_duration": 16,
    "price": 1799.0,
    "value": 2951.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt7JAAR",
    "hero_image": "https://images.luxuryescapes.com/d94763igr6gtm91dz07z8",
    "image_two": "https://images.luxuryescapes.com/juuj7nv6zgtqk9y31asa",
    "image_three": "https://images.luxuryescapes.com/jcbbgny41qmslk5uagu7",
    "vendor_name": "Intercontinental Mauritius",
    "title": "Beachfront Mauritius Hideaway with Poolside Bar",
    "description": "Traditional Mauritian culture blends seamlessly with modern conveniences at the InterContinental Resort Mauritius, an IHG Hotel, a fun-filled resort perfect for couples or families looking for a tropical escape. Spend balmy days in the crystalline seawater, or install yourself by the pool at Sugar Cane beach bar and enjoy light meals and signature sunset cocktails in a casual seaside setting. In between island adventures, head to the spa for a relaxing sauna session or massage treatment.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Pamplemousses District",
    "offer_geo_area_level_2": "Balaclava",
    "location_heading": "Balaclava",
    "location_subheading": "Mauritius",
    "location_description": "InterContinental Resort Mauritius, an IHG Hotel",
    "offer_address": "Balaclava Fort Coastal Road, Ville Valio, Balaclava, Mauritius 21306",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 255.0,
    "value": 255.0
  }
]