[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pQ7WAAU",
    "hero_image": "https://images.luxuryescapes.com/13imghzuu7u8q3rgrs8tch",
    "image_two": "https://images.luxuryescapes.com/w1ujiawajncx7aeirh8r",
    "image_three": "https://images.luxuryescapes.com/6tilspvp6bgvh9lemxe8",
    "vendor_name": "Barossa Unique Tours",
    "title": "Barossa Valley: Half-Day Personalised Winery Tour for Two with Tastings, Roundtrip Transfers & Cheese or Chocolate Pairing",
    "description": "Explore the historic landscape and picturesque wineries of the famous Barossa Valley in complete luxury. This premium experience allows you to decide how you want to spend your 3.5-hour tour, from where you want to be picked up and dropped off to your choice of thrilling vehicle and where you'd like to visit. Choose between a classic 1966 Mustang convertible, a stunning custom-built yellow trike or a modern luxury Jaguar to cruise in comfort for the day as you are driven around by a local guide who will inform you all about the culture and spectacular beauty of the Barossa. \n\nTake your pick of notable boutique wineries to explore during your tour, as well as a stop at The Barossa Valley Chocolate Co for an exclusive wine and cheese or wine and chocolate pairing curated especially for Luxury Escapes customers. This private tour is the most exciting, exhilarating and informative way to see the Barossa Valley. Tours have been handcrafted to ensure that you get a perspective that encapsulates the famed region's rich culture and winemaking heritage in a truly memorable way.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Tanunda",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Barossa Unique Tours",
    "offer_address": "Barossa Valley",
    "percentage_discount": 10.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 292.0,
    "value": 325.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006RO21AAG",
    "hero_image": "https://images.luxuryescapes.com/1hl3fbjc7etedo10qgn",
    "image_two": "https://images.luxuryescapes.com/h51ltv6xqvp3m1gq6ugm",
    "image_three": "https://images.luxuryescapes.com/cq2fi4c96q55jka4dx08",
    "vendor_name": "The Wine Vine Hotel",
    "title": "Serene Barossa Valley Wine Region Escape with Daily Breakfast",
    "description": "Explore the sunkissed vineyards, world-renowned wineries and boutique cellar doors of the Barossa Valley with a stay at The Barossa Motel, your laidback launchpad into one of Australia’s most prized wine regions.\n\nSpend your days exploring the countless wineries of the Barossa Valley that are within a short drive to the motel, including Penfolds, Château Tanunda and Kies Family Wines - just to name a few. Plus, there’s an abundance of world-class restaurants serving up exquisite meals made from locally sourced ingredients and picture-perfect landscapes to explore. Enjoy some downtime back at your motel in between exploring the wineries and restaurants of the region. Practice your swing on the onsite tennis court, take a dip in the seasonal swimming pool and crack open a bottle of the Barossa’s finest with a BBQ dinner in the alfresco dining area.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Tanunda",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "The Wine Vine Hotel",
    "offer_address": "182 Murray St, Tanunda SA 5352",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 148.0,
    "value": 211.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zVDQAA2",
    "hero_image": "https://images.luxuryescapes.com/a3r5i15yhzwbimiy3or",
    "image_two": "https://images.luxuryescapes.com/yzin2izr4ays3blp17lq",
    "image_three": "https://images.luxuryescapes.com/23g7xefq96hqhaulaib",
    "vendor_name": "Discovery Parks Barossa Valley",
    "title": "Eco-Friendly Barossa Valley Glamping with Luxe Adults-Only Facilities",
    "description": "Discover the ultimate alfresco indulgence in an eco-luxe safari-style glamping tent at Discovery Parks Barossa Valley. Find pure romance amid the native gums and rolling vines of South Australia's Barossa Valley wine country, sleeping under the stars in a luxury glamping tent and watching the sunset from your private deck.\n\nExperience the utmost privacy and seclusion with access to an adults-only glamping area, featuring a fire pit for nighttime stargazing, a heated swimming pool and spa, lounge areas and BBQ facilities. All your creature comforts are taken care of in your spacious glamping tent with plush king bed, kitchenette, ensuite and walk-in shower.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Tanunda",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Discovery Parks Barossa Valley",
    "offer_address": "Barossa Valley Way, Tanunda SA 5352",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 240.0,
    "value": 479.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IOHhIAO",
    "hero_image": "https://images.luxuryescapes.com/ijogkoda4k2k0pzt1is5f",
    "image_two": "https://images.luxuryescapes.com/9l09gbsj8suf688eqjcc",
    "image_three": "https://images.luxuryescapes.com/j445osjqslj1fntepaaa",
    "vendor_name": "Novotel Barossa Valley Resort",
    "title": "Barossa Valley Escape overlooking Jacob's Creek Vineyard with Daily Breakfast & Wine Tasting",
    "description": "Swap city streets for the leafy vineyards of the Barossa Valley with a stay at this peaceful oasis in the heart of it all. Discover an abundance of outstanding local wineries serving exquisite South Australian drops, alongside picture-perfect landscape views.\n\nVenture to a 19th-century cellar door to taste the nuances of Jacob's Creek Wines with your included wine tasting. Then, enjoy some downtime back at the resort between the vine-hopping. Practise your swing at the adjacent 18-hole Tanunda Pines Golf Club, take a dip in the outdoor swimming pool or work up a sweat in the fitness centre.\n\nSouth Australia’s world-renowned Barossa Valley is a haven for wine connoisseurs, gourmands and nature lovers alike. Surrounded by sweeping golf courses and world-class wineries - including Jacob’s Creek and St Hugo - this fabulously located resort is the perfect launchpad for exploring the region.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Rowland Flat",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Novotel Barossa Valley Resort",
    "offer_address": "42 Pioneer Avenue, Barossa Valley, South Australia 5352, Australia",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 259.0,
    "value": 609.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dZNJuQAO",
    "hero_image": "https://images.luxuryescapes.com/iglcdjoqul28km3cvmk3",
    "image_two": "https://images.luxuryescapes.com/qavjyxzddffw3kxnfh",
    "image_three": "https://images.luxuryescapes.com/1cmza3r928dczml2u2kd",
    "vendor_name": "Abbotsford Country House",
    "title": "Romantic Country House in the Heart of the Barossa Valley",
    "description": "Escape to the tranquil rolling hills of the Barossa Valley - one of Australia’s most renowned wine regions famous for its Shiraz - located just fifty minutes’ drive northeast of Adelaide. Enjoy a romantic retreat at Abbotsford Country House which includes daily a la carte breakfast, welcome bottle of local wine and a guaranteed leisurely, late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Lyndoch",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Abbotsford Country House",
    "offer_address": "219 Yaldara Dr, Lyndoch SA 5351",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 307.0,
    "value": 658.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LoBeAAK",
    "hero_image": "https://images.luxuryescapes.com/d6p5kqpuyj43aejmnkj4w",
    "image_two": "https://images.luxuryescapes.com/64uegu3zsl7cklo543",
    "image_three": "https://images.luxuryescapes.com/yn697gx2ebralgrrc77k",
    "vendor_name": "Le Mas Barossa Valley",
    "title": "French-Inspired Barossa Valley Vineyard Retreat with Daily Breakfast",
    "description": "Escape to the tranquil rolling hills of the Barossa Valley - one of Australia’s most renowned wine regions, located just over an hour's drive northeast of Adelaide - and enjoy a French-inspired escape at Le Mas Barossa, offering some of the newest luxury accommodation in the region. Discover the fierce landscape, rich soil and exquisite harvests that have inspired its occupants for decades and enjoy daily breakfast, a welcome bottle of local wine, a charcuterie board to share and a guaranteed late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Rowland Flat",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Le Mas Barossa",
    "offer_address": "1929 Barossa Valley Way, Rowland Flat 5352, South Australia",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 509.0,
    "value": 772.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004hghvAAA",
    "hero_image": "https://images.luxuryescapes.com/k07rjmgqnrays9znnw2l",
    "image_two": "https://images.luxuryescapes.com/8ybqctm06uffpshw0ky",
    "image_three": "https://images.luxuryescapes.com/9enwqgzkq9zvd1zhjzs6",
    "vendor_name": "Novotel Barossa Valley Resort",
    "title": "Barossa Valley Wine Escape with Daily Breakfast & Dining Credit",
    "description": "Discover one of the country's most celebrated wine regions with a stay at the newly-refurbished Novotel Barossa Valley Resort - the perfect launchpad for discovering everything the Barossa Valley has to offer. Exchange city streets for rolling paddocks as you embrace the serenity of this picturesque part of the world, only an hour's drive north of Adelaide. Relax amid sweeping vineyard views and world-class wineries, including Jacob’s Creek and St Hugo.\n\nThe resort's refurbishment saw a fresh look for all of its 140 guest rooms unveiled in December 2020. Enjoy outstanding service and superb elegance as days are spent exploring the lush grounds and vines, tasting gourmet food and fine wines or simply unwinding on your private balcony overlooking the historic vineyards, with a glass of shiraz. This wine-lover's retreat also features a pool, a golf course nearby, spa, gymnasium and so much more.\n\n**Your handpicked inclusions:**\n\n- Start the day with a delicious daily buffet breakfast at The Cellar Kitchen\n- Indulge with A$50 food credit per room to spend at The Cellar Kitchen\n- Relax until the last moment with a leisurely 12pm late checkout\n\n**Superior Room Upgrade:** Make your stay extra special by upgrading to a sophisticated Superior Room, which features added luxuries including an in-room Nespresso coffee machine and complimentary bathrobes and slippers.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Rowland Flat",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Novotel Barossa Valley Resort  APR 21",
    "offer_address": "Golflinks Rd, Rowland Flat SA 5352",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 255.0,
    "value": 452.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008J7hxAAC",
    "hero_image": "https://images.luxuryescapes.com/l0k78c32lj7v2le5wln",
    "image_two": "https://images.luxuryescapes.com/wdsgc6b3ee4ovjiid7s",
    "image_three": "https://images.luxuryescapes.com/3jnxpk3lgj8qr15e0fl",
    "vendor_name": "The Wine Vine Hotel",
    "title": "Serene Barossa Valley Wine Region Escape with Room Upgrade & Daily Breakfast",
    "description": "Explore the sun-kissed vineyards, world-renowned wineries and boutique cellar doors of the Barossa Valley with a stay at The Barossa Motel, your laidback launchpad into one of Australia’s most prized wine regions. Spend your days exploring the countless wineries of the Barossa Valley within a short drive from the motel, including Penfolds, Château Tanunda and Kies Family Wines - just to name a few.\n\nPlus, explore an abundance of world-class restaurants serving up exquisite meals made from locally sourced ingredients alongside picture-perfect landscapes. Enjoy some downtime back at your motel between exploring the wineries and restaurants of the region and practice your swing on the onsite tennis court, take a dip in the seasonal swimming pool or crack open a bottle of the Barossa’s finest with a BBQ dinner in the alfresco dining area.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Tanunda",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "The Wine Vine Hotel",
    "offer_address": "182 Murray St, Tanunda SA 5352",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 127.0,
    "value": 243.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HNhAAAW",
    "hero_image": "https://images.luxuryescapes.com/oeqto8psfigjmf5wx4lr",
    "image_two": "https://images.luxuryescapes.com/sczeqoq59voaabyaix2",
    "image_three": "https://images.luxuryescapes.com/u7iz1qu11t85hj43y6",
    "vendor_name": "Le Mas Barossa Valley",
    "title": "French-Inspired Barossa Valley Vineyard Retreat with Daily Breakfast & Gifted Bottle of Le Mas Wine",
    "description": "Escape to the tranquil rolling hills of the Barossa Valley - one of Australia’s most renowned wine regions - and enjoy a French-inspired escape at Le Mas Barossa, offering some of the newest luxury accommodation in the region. Discover the fierce landscape, rich soil and exquisite harvests that have inspired its occupants for decades. The homestead design has been inspired by the romance of the French wine region, with elegant public spaces and secluded rooms surrounded by rows of vineyards.\n\nFamous around the world for producing the finest shiraz and riesling, the Barossa Valley is one of Australia’s most significant and acclaimed wine regions. Le Mas Barossa is perfectly positioned so that you can make the most of your time, within easy reach of a number of decadent South Australian restaurants, stylish bars, charming vineyards and lush national parks. Choose to immerse yourself in farm-to-table eateries, raise a glass at one of the 150 rustic cellar doors, explore the idyllic countryside by car, foot or bike, walk the weekend markets or just switch off and watch the world go by. Whichever you choose, the Barossa has something for everyone to enjoy.\n\n**Your handpicked inclusions:**\n\n- Wake up to a daily French breakfast\n- A warm welcome awaits with a drink each on arrival\n- Enjoy a parting gift of a bottle of Le Mas family vineyard wine at the end of your stay\n- Graze on a delicious charcuterie board to share once per stay\n- Explore the region easily with one-time full-day e-bike hire per person\n- Relax up until the last moment with guaranteed 12pm late checkout\n\n**Winery Masterclass Upgrade available:** Enhance your stay in the Barossa Valley with a St. Hugo and Riedel masterclass, where you'll learn how Riedel crafts glassware that's perfect for sipping with a St. Hugo wine-tasting masterclass, before you're treated to a decadent four-course lunch each.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Rowland Flat",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Le Mas Barossa",
    "offer_address": "1929 Barossa Valley Way, Rowland Flat 5352, South Australia",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 895.0,
    "value": 1316.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csV9fQAE",
    "hero_image": "https://images.luxuryescapes.com/s865y3yf5dspzvtq01wh",
    "image_two": "https://images.luxuryescapes.com/yfhjnecxwplhx6e324ei",
    "image_three": "https://images.luxuryescapes.com/8jhxfvuqaqbx9jf0qpvw",
    "vendor_name": "The Louise Barossa Valley",
    "title": "Wine Country Escape with Dining Credit for Multi-Award-Winning Restaurant",
    "description": "Escape to the tranquil rolling hills of the Barossa Valley-one of Australia’s most renowned wine regions, famous for its Shiraz and located just 75 minutes’ drive northeast of Adelaide-and enjoy a romantic escape at The Louise, staying on the same grounds as renowned restaurant Appellation. Unwind in a massive, upgraded Stonewell Suite that epitomises country luxury and enjoy daily à la carte breakfast served to your suite, AU$100 dining credit to use at Appellation, one of the region’s best restaurants, a welcome bottle of premium wine and a guaranteed late 1pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Marananga",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "The Louise",
    "offer_address": "375 Seppeltsfield Rd, Marananga SA 5355",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 590.0,
    "value": 1378.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Znrz9QAB",
    "hero_image": "https://images.luxuryescapes.com/jh02qweij2qd10nquekf",
    "image_two": "https://images.luxuryescapes.com/ioae6dzdrserjxwjxzhz",
    "image_three": "https://images.luxuryescapes.com/yjgnqustlvsqxuaqqgmr",
    "vendor_name": "The Louise Barossa Valley",
    "title": "Wine Country Escape with Dining Credit for Multi-Award-Winning Restaurant",
    "description": "Escape to the tranquil rolling hills of the Barossa Valley-one of Australia’s most renowned wine regions famous for its shiraz and located just fifty minutes’ drive northeast of Adelaide-and enjoy a romantic escape at The Louise staying on the same grounds as renowned restaurant Appellation. Unwind in a massive, upgraded Stonewell Suite that epitomises country luxury and enjoy daily a la carte breakfast, AU$100 dining credit to share at one of the region’s best restaurants, welcome bottle of premium wine and a guaranteed late 1pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Marananga",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "The Louise",
    "offer_address": "375 Seppeltsfield Rd, Marananga SA 5355",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 603.0,
    "value": 1213.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GKE8AAO",
    "hero_image": "https://images.luxuryescapes.com/he19395drrv08pwjlfk",
    "image_two": "https://images.luxuryescapes.com/7kprgk0hwd58xk8kfmw5",
    "image_three": "https://images.luxuryescapes.com/t6qfam8pzm7gis237onk",
    "vendor_name": "Novotel Barossa Valley Resort",
    "title": "Picturesque Barossa Valley Escape with Bottle of Wine & Daily Breakfast",
    "description": "Exchange city streets for leafy vineyards with an indulgent stay at the fabulously located Novotel Barossa Valley Resort - the perfect launchpad for exploring one of South Australia’s most beautiful regions. Surrounded by sweeping golf course and vineyard views and world-class wineries - including Jacob’s Creek and St Hugo - spend your days meandering through rolling paddocks or soaring above the vines on a helicopter ride before retreating to the resort for a glass of shiraz on your private balcony. Whether you’re seeking a romantic escape or quality time with loved ones, Novotel Barossa Valley Resort offers an idyllic retreat only an hour's drive north of Adelaide.\n\nYour stay is complete with daily in-room continental boxed breakfast, a complimentary bottle of wine and guaranteed late checkout at 1pm, so you can make the most of your final day.\n\n**Travelling with friends or family?** Choose the Group Upgrade and relax together in a spacious Two-Bedroom Apartment with bonus dining credit included.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Rowland Flat",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Novotel Barossa Valley Resort OCT20",
    "offer_address": "Golflinks Rd, Rowland Flat SA 5352",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 210.0,
    "value": 387.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Cw579AAB",
    "hero_image": "https://images.luxuryescapes.com/34ljxpzj2f9k71savlwc",
    "image_two": "https://images.luxuryescapes.com/fh9qx4496ih27u090r6",
    "image_three": "https://images.luxuryescapes.com/2mugdgmxrlsa3nqr2ud",
    "vendor_name": "Novotel Barossa Valley Resort",
    "title": "Barossa Valley Novotel Wine Escape with Daily Buffet Breakfast & Nightly Drinks",
    "description": "Swap city streets for the leafy vineyards of the Barossa Valley, staying in the heart of it all at Novotel Barossa Valley Resort. Discover an abundance of outstanding local wineries serving exquisite South Australian drops alongside picture-perfect landscape views. Then, enjoy some downtime back at the resort between all that vine-hopping. Practise your swing at the adjacent 18-hole Tanunda Pines Golf Club, take a dip in the outdoor swimming pool or work up a sweat in the fitness centre.\n\nSouth Australia’s world-renowned Barossa Valley is a haven for wine connoisseurs, gourmands and nature-lovers alike. Surrounded by sweeping golf courses and world-class wineries - including Jacob’s Creek and St Hugo - this fabulously located resort is the perfect launchpad for exploring the region.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Rowland Flat",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Novotel Barossa Valley Resort",
    "offer_address": "42 Pioneer Avenue, Barossa Valley, South Australia 5352, Australia",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 283.0,
    "value": 742.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002yqaHAAQ",
    "hero_image": "https://images.luxuryescapes.com/hsad5qnbx05g99lst1t",
    "image_two": "https://images.luxuryescapes.com/91uoreesbnpgafh1h6xf",
    "image_three": "https://images.luxuryescapes.com/b6om27z68cdpof6gopc",
    "vendor_name": "Novotel Barossa Valley Resort",
    "title": "Barossa Valley Wine Escape with Daily Breakfast & Dining Credit",
    "description": "Swap city streets for the leafy vineyards of SA’s Barossa Valley, staying in the heart of it all at Novotel Barossa Valley Resort. Surrounded by sweeping golf courses and world-class wineries - including Jacob’s Creek and St Hugo - this fabulously located resort is the perfect launchpad for exploring the region. Enjoy daily in-room breakfast, A$50 dining credit to use at the resort’s paddock-to-plate restaurant The Cellar Kitchen, a complimentary bottle of wine on arrival and guaranteed late checkout at 1pm so you can make the most of your final day.\n\n**Looking for a gourmet experience?** Choose the VIP Upgrade to swap your dining credit for a two-course dinner at The Cellar Kitchen.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Light Regional Council",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Novotel Barossa Valley Resort - JUNE 2020",
    "offer_address": "Golflinks Rd, Rowland Flat SA 5352",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 239.0,
    "value": 416.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gi86AAA",
    "hero_image": "https://images.luxuryescapes.com/87yz52be3nzqd0zaaj4e",
    "image_two": "https://images.luxuryescapes.com/w59rnqznfmo81xy2o9gd",
    "image_three": "https://images.luxuryescapes.com/dxyzuer7hbu72fgsj6f",
    "vendor_name": "Novotel Barossa Valley Resort",
    "title": "Barossa Valley Novotel Wine Escape with A$50 Dining Credit & Daily Breakfast",
    "description": "Swap city streets for the leafy vineyards of the Barossa Valley, staying in the heart of it all at Novotel Barossa Valley Resort. Surrounded by sweeping golf courses and world-class wineries - including Jacob’s Creek and St Hugo - this fabulously located resort is the perfect launchpad for exploring the region.\n\nDiscover an abundance of outstanding local restaurants serving exquisite meals made from South Australian ingredients alongside picture-perfect landscape views. Then, enjoy some downtime back at the resort between all that vine-hopping. Practise your swing at the adjacent 18-hole Tanunda Pines Golf Club, take a dip in the outdoor swimming pool or work up a sweat in the fitness centre.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Rowland Flat",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Novotel Barossa Valley Resort",
    "offer_address": "42 Pioneer Avenue, Barossa Valley, South Australia 5352, Australia",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 301.0,
    "value": 507.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ibqw8AAB",
    "hero_image": "https://images.luxuryescapes.com/r2kiux8fqrx88lftff7b",
    "image_two": "https://images.luxuryescapes.com/bz1cd8mqwiq5kireq324",
    "image_three": "https://images.luxuryescapes.com/1k5frpjx38nmm1pf5sc",
    "vendor_name": "Novotel Barossa Valley Resort",
    "title": "Barossa Valley Novotel Escape with Wine Tasting, Daily Breakfast & Nightly Drink",
    "description": "Swap city streets for the leafy vineyards of the Barossa Valley, staying in the heart of it all at this peaceful oasis. Discover an abundance of outstanding local wineries serving exquisite South Australian drops alongside picture-perfect landscape views. Venture to a 19th-century cellar door to taste the nuances of Two Hands Wines with your included wine tasting. Then, enjoy some downtime back at the resort between the vine-hopping. Practise your swing at the adjacent 18-hole Tanunda Pines Golf Club, take a dip in the outdoor swimming pool or work up a sweat in the fitness centre.\n\nSouth Australia’s world-renowned Barossa Valley is a haven for wine connoisseurs, gourmands and nature lovers alike. Surrounded by sweeping golf courses and world-class wineries - including Jacob’s Creek and St Hugo - this fabulously located resort is the perfect launchpad for exploring the region.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Rowland Flat",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Novotel Barossa Valley Resort",
    "offer_address": "42 Pioneer Avenue, Barossa Valley, South Australia 5352, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 275.0,
    "value": 648.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mioOAAQ",
    "hero_image": "https://images.luxuryescapes.com/i0ejwqyqcai99pufkfe5",
    "image_two": "https://images.luxuryescapes.com/h6snnqll49kj9rxzxwdq",
    "image_three": "https://images.luxuryescapes.com/4thnwrfqfoyh4kyv1gi",
    "vendor_name": "The Wine Vine Hotel",
    "title": "Serene Barossa Valley Wine Region Escape with Daily Breakfast",
    "description": "Explore South Australia's sunkissed vineyards, award-winning wineries and boutique cellar doors in the heart of the Barossa Valley with a stay at the recently refurbished The Wine Vine Hotel, your laidback launchpad into one of the world's most prized wine regions. Spend your days exploring the internationally-acclaimed wineries of the Barossa Valley that are within a short drive of the hotel, including Penfolds, Château Tanunda and Kies Family Wines - just to name a few. Plus, there’s an abundance of world-class restaurants serving up exquisite meals made from locally sourced ingredients and picture-perfect landscapes for exploring. \n\nYou're sure to rest easy back at your hotel: practise your swing on the onsite tennis court, take a dip in the seasonal swimming pool and crack open a bottle of the Barossa’s finest with a BBQ dinner in the alfresco dining area.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Tanunda",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "The Wine Vine Hotel",
    "offer_address": "182 Murray St, Tanunda SA 5352",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 133.0,
    "value": 281.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CORKIAA5",
    "hero_image": "https://images.luxuryescapes.com/el8e1kvzuisarlc2cina",
    "image_two": "https://images.luxuryescapes.com/iw6842tv1kxi2096xvx8",
    "image_three": "https://images.luxuryescapes.com/gzdgwunaxp8mu2bac9iq",
    "vendor_name": "Le Mas Barossa Valley",
    "title": "French-Inspired Barossa Valley Vineyard Escape with Daily Breakfast & Welcome Bottle Wine",
    "description": "Settle into the tranquil rolling hills of the Barossa Valley - one of Australia’s most renowned wine regions - and enjoy an elegant escape at the boutique Le Mas Barossa. Discover the fierce landscape, abundant soil and exquisite harvests that inspire artisans to create some of the finest wines in Australia. Drawing inspiration from the French wine region, this homestead boasts elegant public spaces and secluded rooms, surrounded by rows of emerald grapevines. Tasting terroir and swirling world-famous reds are within easy reach - savour in farm-to-table eateries, raise a glass at one of the 150 rustic cellar doors, explore the idyllic countryside, walk the weekend markets or switch off and watch the world go by.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Rowland Flat",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Le Mas Barossa",
    "offer_address": "1929 Barossa Valley Way, Rowland Flat 5352, South Australia",
    "percentage_discount": 24.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 1084.0,
    "value": 1433.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GuFmAAK",
    "hero_image": "https://images.luxuryescapes.com/d8q6yrlozle5ohp86uc",
    "image_two": "https://images.luxuryescapes.com/eobil67dpc717xqoaap0d",
    "image_three": "https://images.luxuryescapes.com/bh4r1ddb8h19slh46yhv",
    "vendor_name": "Barossa Shiraz Estate",
    "title": "Barossa Valley Vineyard Cottage Escape",
    "description": "Sample the best of one of Australia’s most famous wine regions with a romantic cottage stay at Barossa Shiraz Estate. Set among acres of green and yellow vines with views to the distant hills, your heritage cottage comes equipped with all you’ll need for a relaxing and delicious weekend. Cycle through the vineyards to visit cellar doors or stroll to nearby restaurants that showcase local produce, before coming home to enjoy a sunset glass of wine on the veranda, soak in the spa bath or curl up by the fire.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Lyndoch",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Barossa Shiraz Estate",
    "offer_address": "1246 Barossa Valley Way Lyundoch SA 5351 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 14,
    "price": 313.0,
    "value": 313.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oUqQAAU",
    "hero_image": "https://images.luxuryescapes.com/23icqygmqd9pukgegttq",
    "image_two": "https://images.luxuryescapes.com/5ka6s1jajwr5lwhlsdem",
    "image_three": "https://images.luxuryescapes.com/7miagbpipla7zotiw6rhi",
    "vendor_name": "Lanzerac Country Estate",
    "title": "Boutique Vineyard Retreat near the Barossa Valley's Best Wineries",
    "description": "In the heart of South Australia's most renowned wine region, you'll find five leafy acres of lush garden at Lanzerac Country Estate, a boutique retreat surrounded by the Barossa Valley's fabulous food and wine destinations. The property is ranked in the top 1% of hotels worldwide by Tripadvisor with a Travellers' Choice Best of the Best 2022 award. The landscaped gardens feature shiraz and Pedro Ximénez grapevines that are over 90 years old and make for a romantic backdrop for a morning stroll. Meanwhile, neighbouring the estate are two of Barossa's most iconic vineyards - Chateau Tanunda and Turkey Flat - so your next great tipple is just a short walk away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Tanunda",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Lanzerac Country Estate",
    "offer_address": "278 Menge Rd, Tanunda SA 5352",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECudZAAT",
    "hero_image": "https://images.luxuryescapes.com/7776okhwf58il8bx9e",
    "image_two": "https://images.luxuryescapes.com/3gpu5rtw55eanjux03kr",
    "image_three": "https://images.luxuryescapes.com/1n690e4iajtm65q4dlq",
    "vendor_name": "The Louise Barossa Valley",
    "title": "Luxurious Vineyard-Framed Barossa Valley Escape with Award-Winning Appellation Restaurant",
    "description": "An opulent escape to the rolling hills of the Barossa Valley awaits at The Louise, an idyllic vineyard-framed lodge that delivers country luxury and gourmet dining. Flit from cellar doors and restaurants to vibrant farmers' markets and sophisticated art galleries as you explore what makes the Barossa Valley one of Australia's premier wine regions. Indulge in pre-dinner drinks before dining at multi-award-winning restaurant Appellation where the daily changing degustation menu is expertly paired with local wines. With a lavish in-suite bar replenished daily with delicious treats and the use of luxurious lodge facilities such as a wet-edge lap pool, fitness centre and sauna, an unforgettable stay is all but assured.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Marananga",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "The Louise",
    "offer_address": "Corner Seppeltsfield Road and Stonewell Road, Marananga, Barossa Valley, South Australia 5352, Australia",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 1296.0,
    "value": 1296.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004TvpzAAC",
    "hero_image": "https://images.luxuryescapes.com/g4cx8dvidrc8xyideq9q",
    "image_two": "https://images.luxuryescapes.com/ldu3fncn1hg6e8bdjvyd",
    "image_three": "https://images.luxuryescapes.com/nlw4mxekdkvabvncf4a",
    "vendor_name": "Barossa Shiraz Estate",
    "title": "Barossa Valley Heritage Vineyard Retreat in South Australia's Renowned Wine Region",
    "description": "Sample the best of South Australia’s wine region with a romantic cottage stay at Barossa Shiraz Estate. Set among acres of Barossa Valley vines, with views to the distant hills, your heritage cottage comes equipped with all you’ll need for a relaxing break. Cycle through the vineyards to visit cellar doors, before coming home to enjoy a sunset glass of wine on the verandah, soak in the spa bath or curl up by the fire.\n\nA Tripadvisor Travellers' Choice 2020 award-winner, Barossa Shiraz Estate is committed to making your winery escape extra special. Whether you'd like to arrange a cellar door tour, need restaurant recommendations, want to learn the art of winemaking or even soar across the scenic landscape in a helicopter, someone is always on hand to help you create a memorable experience. You're absolutely spoiled for choice when it comes to gourmet delights in the Barossa. Stroll to one of the fantastic restaurants within walking distance of the estate or discover iconic wine companies like Jacob’s Creek, Penfolds and Seppeltsfield nearby.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Lyndoch",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Barossa Shiraz Estate",
    "offer_address": "1246 Barossa Valley Way Lyundoch SA 5351 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 32,
    "price": 254.0,
    "value": 254.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HpYBIA0",
    "hero_image": "https://images.luxuryescapes.com/iy2rho12zlvfa3rbj0hp",
    "image_two": "https://images.luxuryescapes.com/oj36e4vnla3a2g3ao52l",
    "image_three": "https://images.luxuryescapes.com/ky4f3rl83c4uei01c7tt",
    "vendor_name": "Kingsford The Barossa",
    "title": "Heritage Barossa Valley Wine Country Retreat with Onsite Restaurant, Wine Cellar & Bush Bath",
    "description": "Embrace luxury at its finest at one of South Australia's most picturesque retreats, nestled amid riverbanks and rolling hills, in the renowned wine region of the Barossa Valley. Once the home of a 19th-century pastoralist, this 225-acre homestead has been beautifully restored to offer a gateway to the region's celebrated vineyards, and less than an hour from the bustling Adelaide CBD.\n\nStep into a world of signature Kingsford experiences: try a wine-tasting tour with the resident sommelier, explore the wine vaults, go on an ATV ride, try out Kegal in the onsite bowling alley or indulge in a 'Bush Bath' in the privacy of the great outdoors. Enjoy world-class wines, savour hearty plates at Orleana or sip on cocktails at the Peppertree Pool & Bar, for a truly indulgent escape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Kingsford The Barossa",
    "offer_address": "68 Kingsford Road, Kingsford, South Australia 5118, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 399.0,
    "value": 399.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008h1o9AAA",
    "hero_image": "https://images.luxuryescapes.com/aglop6vgbbkhowvwqlxv",
    "image_two": "https://images.luxuryescapes.com/l9gpnf29hsii2msmv7h",
    "image_three": "https://images.luxuryescapes.com/wjnq9l4nhioow6octn3r",
    "vendor_name": "Lanzerac Country Estate",
    "title": "Boutique Vineyard Retreat near the Barossa Valley's Best Wineries",
    "description": "In the heart of South Australia's most renowned wine region, you'll find five leafy acres of lush garden at Lanzerac Country Estate, a boutique retreat surrounded by the Barossa Valley's fabulous food and wine destinations. The property is ranked in the top 1% of hotels worldwide by Tripadvisor with a Travellers' Choice Best of the Best 2022 award. The landscaped gardens feature shiraz and Pedro Ximénez grapevines that are over 90 years old and make for a romantic backdrop. Neighbouring the estate are two of Barossa's most iconic vineyards - Chateau Tanunda and Turkey Flat.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Tanunda",
    "location_heading": "Barossa Valley",
    "location_subheading": "South Australia",
    "location_description": "Lanzerac Country Estate",
    "offer_address": "278 Menge Rd, Tanunda SA 5352",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]