[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FnopIAAR",
    "hero_image": "https://images.luxuryescapes.com/zik0nqncn25cbe74lkak",
    "image_two": "https://images.luxuryescapes.com/8vbmdx9e2ixqpo3uzh4s",
    "image_three": "https://images.luxuryescapes.com/7phv2loj2lhsvwjbrlhl",
    "vendor_name": "Anahita Golf & Spa Resort",
    "title": "Five-Star Mauritius Beachside Suite Luxury with Daily Breakfast, Gourmet Dining Experience & Championship Golf Courses",
    "description": "Between the shimmering turquoise waters of Ile aux Cerfs island and rolling emerald green stands Anahita Golf & Spa Resort, an oasis of tropical luxury. At the heart of one of Mauritius’ most exclusive estates, the property boasts just a handful of light-filled suites. It’s easy to lose yourself in paradise here - make a splash at Filibuster, the resort’s pristine private beach, relax into island life at Anahita Spa by Thémaé Paris or tee off on the resort’s two 18-hole championship golf courses, meticulously designed to offer an extraordinary game with views of the Indian Ocean. Make memories at Signature restaurant with an immersive fine dining experience, backed by cutting-edge technology and traditional Mauritian storytelling.\n\nReady to explore? Mauritius is a wonderland of picture-perfect beaches, lagoons, rainforests and reefs. Drive an hour southwest to discover the spectacular beauty of the Black River Gorges - including Alexandra Falls - or strike out to sample the nation’s rich history of rum distilling and tea production.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Flacq District",
    "offer_geo_area_level_2": "Grand River South East",
    "location_heading": "Beau Champ",
    "location_subheading": "Mauritius",
    "location_description": "Anahita Golf & Spa Resort",
    "offer_address": "Anahita Golf Resort, Beau Champ, Grande Rivière Sud Est 40901, Mauritius",
    "percentage_discount": 72.0,
    "min_duration": 4,
    "max_duration": 29,
    "price": 1299.0,
    "value": 4575.0
  }
]