[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JDjVpYAL",
    "hero_image": "https://images.luxuryescapes.com/onnfus38yqywtnrh8mc",
    "image_two": "https://images.luxuryescapes.com/ffnyvp1vf4qw7qdapi8",
    "image_three": "https://images.luxuryescapes.com/jjkj0rj9r5y9rz4ygvqw",
    "vendor_name": "The Benev",
    "title": "Beechworth Adults-Only Wellness Sanctuary with A$100 Spa Credit",
    "description": "Discover a tranquil all-suite sanctuary in leafy Beechworth, where nature sets the pace. Each suite is a restful retreat, featuring deep-soaking bathtubs, crackling fireplaces and serene interiors designed to calm and restore.\n\nStart your day with one nourishing in-room breakfast, filled with locally sourced produce, before easing into moments of stillness: unwind with a rejuvenating treatment at Benev Spa using your generous spa credit, or create a personalised bath ritual in the privacy of your suite. Meander along bush trails or cycle historic paths rich with local stories.\n\nJust a 10-minute walk from Beechworth’s gold rush-era heart, discover artisan bakeries and boutique stores. Follow the High Country Brewery Trail through King Valley to Bright, or take a scenic drive to nearby vineyards and cellar doors. This is a journey into stillness, wonder and rich local character, set within the quiet magic of the Australian bushland.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Beechworth",
    "location_heading": "Beechworth",
    "location_subheading": "Victoria",
    "location_description": "The Benev",
    "offer_address": "9 Warner Road, Beechworth, Victoria 3747, Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 329.0,
    "value": 565.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQ3oAAAT",
    "hero_image": "https://images.luxuryescapes.com/u640qwl0b8csx5p8yke",
    "image_two": "https://images.luxuryescapes.com/48nz1wvhmf6lhpomhddc",
    "image_three": "https://images.luxuryescapes.com/wjkuz9xww88kkkftqm",
    "vendor_name": "The Benev",
    "title": "Beechworth Wellness Suite Sanctuary within Victoria's High Country with A$100 Spa Credit & Deep-Soaking Bath",
    "description": "We all need a little more slow... find it among the lush surrounds of leafy Beechworth within The Benev spa and wellness retreat. Stay, spa and eat for mind, body and soul at this soulfully created all-suite sanctuary, curated for holistic betterment with a deep-soaking bathtub in each private oasis, dreamy interiors and a spa that inspires rest, recovery and renewal. Soak in The Spa Beechworth's bespoke wellness services and book a grounding full-body treatment, or create your own bath ritual from the comfort of your secluded suite. At this boutique oasis, slow living is key, allowing you to take a breather as you take a little time for you. \n\nWhen you're not leaning into the slower pace of Beechworth, explore this historic township surrounded by the High Country Brewery Trail stretching from King Valley (Prosecco Road) to Bright, venture to the eponymous bakery, savour some renowned honey or a take a short scenic drive to taste the region's finest at the many sprawling nearby vineyards.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Beechworth",
    "location_heading": "Beechworth",
    "location_subheading": "Victoria",
    "location_description": "The Benev",
    "offer_address": "9 Warner Road, Beechworth, Victoria 3747, Australia",
    "percentage_discount": 28.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 479.0,
    "value": 666.0
  }
]