[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgobCQAQ",
    "hero_image": "https://images.luxuryescapes.com/7wx792qthz08v6lrr3c",
    "image_two": "https://images.luxuryescapes.com/mpca42jya0ksiaesfb3",
    "image_three": "https://images.luxuryescapes.com/740flofez65jzz67eky",
    "vendor_name": "Lon Retreat",
    "title": "Escape the Everyday: Exclusive Adults-Only Beach Retreat with Revitalising Mineral Spa",
    "description": "Grand Opening: Escape to the unique beauty of Port Phillip Bay with a stay at the exclusive Lon Retreat, perched high on Point Lonsdale, on the edge of the Bellarine Peninsula. This stunning adults-only property provides the ultimate beach retreat, comprising just seven luxe suites and a mineral spa, sprawled across 200 acres of rural and conservation land. Detox from everyday life and reconnect with nature with an indulgent gourmet brunch hamper on one morning of your stay, a bottle of local sparkling wine on arrival, unlimited access to the Lon Mineral Spa Pool, AU$50 spa credit per person and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Point Lonsdale",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Lon Retreat & Spa",
    "offer_address": "25 Gill Road, Point Lonsdale, Victoria 3225, Australia",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 378.0,
    "value": 688.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006Qac1AAC",
    "hero_image": "https://images.luxuryescapes.com/zpizh9x3oin9cnfcmh8f",
    "image_two": "https://images.luxuryescapes.com/9hpivnamwbbjmaswm7h9",
    "image_three": "https://images.luxuryescapes.com/l0bpzh9i2zb6pllsdj",
    "vendor_name": "13th Beach Golf Lodges",
    "title": "Bellarine Peninsula 13th Beach Championship Golf Retreat with Daily Breakfast & 2-for-1 Green Fees",
    "description": "Get ready to rendezvous on the golf green with a stay at 13th Beach Golf Lodges, a spectacular golf resort along Victoria’s Bellarine Peninsula. Boasting two award-winning golf courses maintained with first-class,  year-round conditioning, this is the perfect spot to practice your swing, nab a hole-in-one, and admire the incredible surrounding coastal landscapes.\n\nWhen you're not on the course, enjoy an exquisite meal at the modern clubhouse restaurant where you have prime views over the beach course. The Bellarine Peninsula is renowned for its world-class wineries: follow your own wine trail to Bellarine Estate Winery, Oakdene Vineyards Cellar Door, and Scotchmans Hill, all within a 30-minute drive. The 13th Beach is a renowned surf beach, so grab a board and hit the waves, or simply enjoy a sunset beach stroll.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Connewarre",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "13th Beach Golf Lodges",
    "offer_address": "1732 Barwon Heads Rd, Barwon Heads VIC 3227 Australia",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 251.0,
    "value": 441.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dfk92AAB",
    "hero_image": "https://images.luxuryescapes.com/lfj4why6pv4noqjlx98s",
    "image_two": "https://images.luxuryescapes.com/mgi0s8fpyzdsrf6razv",
    "image_three": "https://images.luxuryescapes.com/m52n88pwp9fv54b1oajt",
    "vendor_name": "13th Beach Golf Lodges",
    "title": "Bellarine Peninsula 13th Beach Championship Golf Retreat with Daily Breakfast & A$100 Credit",
    "description": "Get ready to rendezvous on the green with a stay at 13th Beach Golf Lodges, a spectacular golf retreat along Victoria’s iconic Bellarine Peninsula. Boasting two award-winning golf courses - each maintained with first-class, year-round conditioning - and located just minutes from the region's pristine beaches, this is the perfect spot to practice your swing, nab a hole-in-one, and admire the incredible surrounding coastal landscapes.\n\nWhen you're not on the course, enjoy an exquisite meal at the modern clubhouse restaurant and savour prime views over the sprawling beach course. The Bellarine Peninsula is renowned for its world-class wineries: follow your own wine trail to Bellarine Estate Winery, Oakdene Vineyards Cellar Door, and Scotchmans Hill, all within a 30-minute drive. The 13th Beach is a renowned surf beach, so grab a board and hit the waves, or simply enjoy a sunset beach stroll.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Connewarre",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "13th Beach Golf Lodges",
    "offer_address": "1732 Barwon Heads Rd, Barwon Heads VIC 3227 Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 287.0,
    "value": 564.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjCzAAK",
    "hero_image": "https://images.luxuryescapes.com/iuyu13ec5ogdoa0wzy3a",
    "image_two": "https://images.luxuryescapes.com/s6gyvf2mpalkxi1pht93",
    "image_three": "https://images.luxuryescapes.com/oyllad70ss7zinco7g7",
    "vendor_name": "Starhaven Retreat",
    "title": "Award-Winning Bellarine Peninsula Escape Seen on Grand Designs Australia",
    "description": "Escape to Victoria’s stunning Bellarine Peninsula - just a 90-minute drive from Melbourne - for a relaxing stay at Starhaven Retreat, a bed and breakfast like no other with a spa, cocktail lounge, 15-seat cinema with a starlit ceiling and suites with private ensuite bathrooms. This award-winning-property - which featured on Grand Designs Australia and was ranked #3 in the Top 25 B&Bs and Inns in Australia in the TripAdvisor Travellers' Choice Awards 2019  - overlooks tranquil Port Phillip Bay and is perfectly positioned for discovering some of the finest wineries in the region. Your escape includes daily buffet and à la carte breakfast, a nightly cocktail each, an A$30 spa credit per adult, a popcorn and ice cream cinema experience and guaranteed late 12pm checkout.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Indented Head",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Starhaven Retreat",
    "offer_address": "13 Calimo Pl, Indented Head VIC 3223",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 309.0,
    "value": 993.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005G6VuAAK",
    "hero_image": "https://images.luxuryescapes.com/z8r5mxlbw36rp6vnx8u",
    "image_two": "https://images.luxuryescapes.com/bbos8kz3tg1dmhtk4ire",
    "image_three": "https://images.luxuryescapes.com/wi6j9qa58ifdbsffdnva",
    "vendor_name": "The White Shack",
    "title": "Bellarine Peninsula Private Country Cottage Escape for up to 6 Guests",
    "description": "An escape from everyday life beckons at The White Shack, a contemporary luxury property surrounded by the gourmet food, wineries, seaside villages and beautiful beaches of the historic Bellarine Peninsula. Offering 180-degree views over Port Phillip Bay and ideally nestled on a one-acre private property, The White Shack is moments from some of the Bellarine’s best wineries, including Jack Rabbit, Terindah and Scotchman’s Hill, with The Whiskery distillery just down the road.\n\nJust 20 minutes from Geelong and 90 minutes from Melbourne, The White Shack prides itself on creating a peaceful, homely environment for private groups. Enjoy exclusive use of the property and its stunning garden, relaxing amid the wisteria vines on the veranda, cosying up by the fireplace or walking amid the manicured lawns.\n\n**Your handpicked inclusions:**\n\n- Exclusive use of the cottage and garden for up to six guests\n- Celebrate on arrival with a bottle of wine ready and waiting\n\n**Longer stay bonus:** Stay five nights or longer and you'll find two bottles of wine on arrival. We'll drink to that!\n\n**This deal has NO peak surcharges** - travel any time you want, for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Bellarine",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "The White Shack",
    "offer_address": "261-269 Scotchmans Road Bellarine Victoria 3225 Australia",
    "percentage_discount": 23.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 899.0,
    "value": 1171.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ey9jAAAR",
    "hero_image": "https://images.luxuryescapes.com/gotz901rglxyn5b52r6m",
    "image_two": "https://images.luxuryescapes.com/ugomjmmiann1vcjz841t",
    "image_three": "https://images.luxuryescapes.com/25s8ewmre0ugdfzixjh",
    "vendor_name": "Lon Retreat",
    "title": "Adults-Only Point Lonsdale Boutique Retreat with Onsite Mineral Day Spa & Daily Breakfast",
    "description": "Switch off, unwind and embrace the tranquillity of Victoria's Bellarine Peninsula with an adults-only stay at the boutique Lon Retreat & Spa. This stunning property is exclusive to guests aged 16 and over and provides the ultimate beach escape, comprising just seven luxe suites and a mineral spa, sprawled across 200 acres of rural and conservation land. You will feel day-to-day life melt away amid the picturesque coastal setting, where you can experience the beauty of the great outdoors without forgoing life's little luxuries. Take in the therapeutic effects of the surrounding mineral springs with mineral-water-fed soaking tubs, steam rooms and a heated pool that leads out onto a sunroom and private gardens facing Port Phillip Bay.\n\nFamily-owned for 150 years, this unique property just 90 minutes from Melbourne's bustling CBD embraces the romance of a slower country life. Spend your days exploring the sprawling property, popping into Point Lonsdale where a selection of cafes beckon or simply go barefoot, feel the sand between your toes and embrace an exquisitely simple existence. Return to your luxurious private suite with its own distinct personality, boasting views of your stunning surroundings and with finishing touches from local artists",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Point Lonsdale",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Lon Retreat & Spa",
    "offer_address": "25 Gill Road, Point Lonsdale, Victoria 3225, Australia",
    "percentage_discount": 26.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 548.0,
    "value": 744.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003rxqnAAA",
    "hero_image": "https://images.luxuryescapes.com/ckesjnzgmnfn3dvzshl",
    "image_two": "https://images.luxuryescapes.com/e3c89qk2kff8i3mc1hno",
    "image_three": "https://images.luxuryescapes.com/zdjiz5jwvjtaumouo0oh",
    "vendor_name": "Starhaven Retreat",
    "title": "Award-Winning Bellarine Peninsula Escape with Daily Breakfast & Nightly Drinks",
    "description": "Escape to Victoria’s stunning Bellarine Peninsula - just a 90-minute drive from Melbourne - for a relaxing stay at Starhaven Retreat, a bed and breakfast like no other with a spa, cocktail lounge, 15-seat cinema with a starlit ceiling, and modern suites with private ensuite bathrooms. This award-winning-property - which featured on Grand Designs Australia and was ranked #1 in the Top 25 B&Bs and Inns in Australia in the Tripadvisor Travellers' Choice Awards 2020  - overlooks tranquil Port Phillip Bay and is perfectly positioned for discovering some of the finest wineries in the region.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Indented Head",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Starhaven Retreat",
    "offer_address": "13 Calimo Pl, Indented Head VIC 3223",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 299.0,
    "value": 961.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002yzCYAAY",
    "hero_image": "https://images.luxuryescapes.com/stn6pjgsvrbdqrngv1yk",
    "image_two": "https://images.luxuryescapes.com/y0e6q3lypdemzi5f9mar",
    "image_three": "https://images.luxuryescapes.com/zv748z37kh6vgyzsk3vd",
    "vendor_name": "Campbell Point House",
    "title": "French-Inspired Waterfront Estate with Gourmet Breakfast and Four-Course Dinner",
    "description": "Let us introduce you to Campbell Point House, a boutique, waterfront, multi-million-dollar former private mansion, re-opened as an exclusive hotel on the banks of Lake Connewarre on the Bellarine Peninsula. Experience unparalleled luxury and first-class service on this sprawling 16-hectare private estate - start your days with a chef-prepared breakfast each morning and on one of your evenings, indulge in a spectacular four-course tasting menu prepared using produce from the onsite garden. Be pampered with daily housekeeping, a complimentary minibar (with soft drinks), a lavish afternoon cheese platter with a bottle of sparkling wine, and A$50 per person towards a 60-minute treatment at the onsite spa.\n\n**Travelling with a group?** Check out the incredible upgrade with exclusive use of the Lake House for up to eight people.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Geelong",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Campbell Point House",
    "offer_address": "199 Matthews Rd, Leopold VIC 3224",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 599.0,
    "value": 1391.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JN1B0AAL",
    "hero_image": "https://images.luxuryescapes.com/fblti8mq1tibl5qubzh",
    "image_two": "https://images.luxuryescapes.com/9rchyeyonriiqozs43za",
    "image_three": "https://images.luxuryescapes.com/uonqzutbqctl168yxgbb",
    "vendor_name": "Lon Retreat",
    "title": "Adults-Only Point Lonsdale Boutique Luxury with Onsite Mineral Spa & Private Beach Access",
    "description": "Switch off, unwind and embrace the tranquillity of Victoria's Bellarine Peninsula with an adults-only stay at this charming property, exclusive to guests aged 18 and over. Take in the therapeutic effects of the surrounding mineral springs with mineral-water-fed soaking tubs, steam rooms and a heated pool that leads out onto a sunroom and private gardens facing Port Phillip Bay.\n\nFamily-owned for 150 years, this unique property just 90 minutes from Melbourne's bustling CBD embraces the romance of a slower country life. Spend your days exploring the estate and return to your luxurious private suite boasting views of the stunning surroundings and with finishing touches from local artists.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Point Lonsdale",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Lon Retreat & Spa",
    "offer_address": "25 Gill Road, Point Lonsdale, Victoria 3225, Australia",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 439.0,
    "value": 698.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mF0JAAU",
    "hero_image": "https://images.luxuryescapes.com/3jld9of3qba9xj3sum7n",
    "image_two": "https://images.luxuryescapes.com/crfumr9fsjr6yoyl3f",
    "image_three": "https://images.luxuryescapes.com/wkjetd11bi6479dfcdv9",
    "vendor_name": "The White Shack",
    "title": "Bellarine Peninsula Private Country Cottage Escape for up to Six Guests",
    "description": "Easy freedom beckons at The White Shack, a contemporary luxury cottage flanked on all sides by countless incredible restaurants, picturesque villages and stunning beaches of the Bellarine Peninsula. Offering panoramic views over Port Phillip Bay and nestled on a one-hectare private property, The White Shack is only minutes away from some of the Bellarine’s best wineries, including Jack Rabbit Vineyard, Terindah Estate and Scotchman’s Hill. And if gin and whiskey are more your jam, the Bellarine Distillery (and cellar door) is only a short drive down the road.\n\nThe White Shack prides itself on creating a peaceful, homely environment for private groups. Enjoy exclusive use of the property and its stunning garden. Relax amid the wisteria vines on the veranda, cosy up by the fireplace or take a long walk amid the manicured lawns. Just 90 minutes from Melbourne (and 20 minutes from Geelong), it’s the perfect rural escape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Bellarine",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "The White Shack",
    "offer_address": "261-269 Scotchmans Road Bellarine Victoria 3225 Australia",
    "percentage_discount": 24.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 951.0,
    "value": 1255.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgofJQAQ",
    "hero_image": "https://images.luxuryescapes.com/myjaqyka2yyq0fkkhdqr",
    "image_two": "https://images.luxuryescapes.com/xtloyxqyr8mb3phwb85e",
    "image_three": "https://images.luxuryescapes.com/xspfvfuinfsbqeuq9fjy",
    "vendor_name": "Campbell Point House",
    "title": "Grand Reopening: Adults-Only, Ultra-Exclusive Mansion Escape with Nightly 8-Course Degustations",
    "description": "Let us introduce you to Campbell Point House, a stunning multi-million-dollar former private mansion, newly re-opened as an ultra-exclusive boutique hotel on the banks of Lake Connewarre on the Bellarine Peninsula. Experience unparalleled luxury and first-class service among this sprawling, 16-hectare private estate - exclusively open to guests of the property. Daily fine dining is included in your package, beginning with chef-prepared breakfast served in the conservatory each morning and culminating in a spectacular nightly eight-course degustation dinner prepared by Tobin Kent, former head chef at the famed Gladioli restaurant. Enjoy a warm welcome with a bottle of sparkling plus a gourmet platter of the finest cheeses on arrival, treat yourself to pre-dinner drinks with an AU$30 bar credit and unwind at the on-site spa with AU$50 towards a 60-minute treatment each.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Geelong",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Campbell Point House",
    "offer_address": "199 Matthews Rd, Leopold VIC 3224",
    "percentage_discount": 70.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 630.0,
    "value": 2114.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IEMZIA4",
    "hero_image": "https://images.luxuryescapes.com/nama2caypk5p7khv5q",
    "image_two": "https://images.luxuryescapes.com/cs9de84xoivd9yb1crx",
    "image_three": "https://images.luxuryescapes.com/7nami9tvfy2cm13zpy6d",
    "vendor_name": "Portarlington Grand Hotel",
    "title": "Recently-Refurbished Bellarine Peninsula Heritage Hotel with Breakfast Hamper & Dining Credit",
    "description": "Established in 1888, this charming seaside hotel is the Bellarine Peninsula's heritage jewel. The century-old facade houses a spectacular modern refurbishment, paying homage to the hotel's history as a seaman's reprieve, while offering the highest standard of luxury.\n\nPortarlington is a region famous for its seafood and award-winning wine - don't miss out on sampling the renowned produce at onsite venues. The Atrium, a friendly neighbourhood pub frequented by locals, serves fresh favourites like locally caught fish of the day and salt and pepper calamari. The Bistro takes it up a notch with signature Portarlington mussels, and local Bellarine distillers, breweries and wineries champion a thoughtful drinks menu at the Front Bar.\n\nJust over an hour's ferry ride from Melbourne, Portarlington Grand Hotel couldn't be better poised for exploring the peninsula. Take a ride on the famous Q Train, enjoy a degustation board at Bennets Winery or take a scenic drive to some of Victoria's best coastlines.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Portarlington",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Portarlington Grand Hotel",
    "offer_address": "76 Newcombe Street, Portarlington, Victoria 3223, Australia",
    "percentage_discount": 27.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 299.0,
    "value": 409.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000De1sLYAR",
    "hero_image": "https://images.luxuryescapes.com/j4evxz5e4cyglt6lyzdq",
    "image_two": "https://images.luxuryescapes.com/6jia44r8xhqypq7wrgt8",
    "image_three": "https://images.luxuryescapes.com/9dkpic7ccjgi5pn6mgdjt",
    "vendor_name": "Portarlington Grand Hotel",
    "title": "Boutique Bellarine Peninsula Heritage Hotel with Breakfast Hamper & Dining Credit",
    "description": "Established in 1888, this charming seaside hotel is the Bellarine Peninsula’s heritage jewel. The century-old facade houses a spectacular modern refurbishment, paying homage to the hotel’s history as a seaman’s reprieve, while offering the highest standard of luxury.\n\nPortarlington is a region famous for its seafood and award-winning wine - don’t miss out on sampling the renowned produce at onsite venues with your included A$50 dining credit. The Atrium, a neighbourhood pub frequented by locals, serves fresh favourites like locally caught fish of the day. The Bistro takes it up a notch with signature Portarlington mussels, and local Bellarine distillers, breweries and wineries champion a thoughtful drinks menu at the Front Bar.\n\nJust over an hour’s ferry ride from Melbourne, Portarlington Grand Hotel couldn’t be better poised for exploring the peninsula. With return transfers to local wineries included in your stay, graze at a degustation board at Bennets Winery, sample award-winning drops at Jack Rabbit or soak up panoramic vineyard views at Terindah Estate.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Portarlington",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Portarlington Grand Hotel",
    "offer_address": "76 Newcombe St, Portarlington VIC 3223, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 249.0,
    "value": 488.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biCoKQAU",
    "hero_image": "https://images.luxuryescapes.com/ui0a8amiliy7w19jpig",
    "image_two": "https://images.luxuryescapes.com/92i0ob95gmbtxme71etr",
    "image_three": "https://images.luxuryescapes.com/5xdl3sjm18vsvu3bksm4",
    "vendor_name": "Starhaven Retreat",
    "title": "Rest & Relaxation: Designer Adults-Only Coastal Retreat",
    "description": "Escape to Victoria’s stunning Bellarine Peninsula and enjoy a chic, eco-friendly retreat in Portarlington at Starhaven Retreat - just 90 minutes’ drive from Melbourne. This holiday-home-turned-award-winning-property - which featured on Grand Designs Australia - overlooks tranquil Port Phillip Bay and includes daily buffet and à la carte breakfast, nightly cocktail each, popcorn and ice cream cinema experience, spa credits and a guaranteed late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Indented Head",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Starhaven Retreat",
    "offer_address": "13 Calimo Pl, Indented Head VIC 3223",
    "percentage_discount": 71.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 316.0,
    "value": 1091.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eMjg8QAC",
    "hero_image": "https://images.luxuryescapes.com/dpoq4n8genr3yuxgjf",
    "image_two": "https://images.luxuryescapes.com/lclf01g8t7ke3fxcgqmn",
    "image_three": "https://images.luxuryescapes.com/yrvs57zm620u6kz10l8o",
    "vendor_name": "Campbell Point House",
    "title": "Ultra-Luxe Gourmet Escape with Eight-Course Degustation Dinner and Lavish High Tea",
    "description": "Let us introduce you to Campbell Point House, a stunning multi-million-dollar former private mansion, newly re-opened as an ultra-exclusive boutique hotel on the banks of Lake Connewarre on the Bellarine Peninsula. Experience unparalleled luxury and first-class service on this sprawling 16-hectare private estate. Begin your days with a chef-prepared breakfast served each morning; on your first evening, indulge in a spectacular eight-course degustation dinner prepared by a team of elite chefs. Be pampered with a lavish high tea with a bottle of sparkling wine and unwind at the on-site spa with A$50 towards a 60-minute treatment each.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Geelong",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Campbell Point House",
    "offer_address": "199 Matthews Rd, Leopold VIC 3224",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 618.0,
    "value": 1540.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005IxeVAAS",
    "hero_image": "https://images.luxuryescapes.com/5x2lqzuewkoqdpt1s9",
    "image_two": "https://images.luxuryescapes.com/02gry8ryy928ohbk533s",
    "image_three": "https://images.luxuryescapes.com/16z8pjq1ikwqufsl252u",
    "vendor_name": "13th Beach Golf Lodges",
    "title": "Bellarine Peninsula 13th Beach Championship Golf Retreat with Daily À La Carte Breakfast",
    "description": "Reconnect with the beauty of simplicity amid 405 acres of championship golfing green at 13th Beach Golf Lodges, your coastal Bellarine Peninsula retreat just moments from the champagne sands of 13th Beach. Tucked away less than a 90-minute drive from Melbourne CBD, this boutique lodge in Barwon Heads is the perfect weekend escape in the home of the renowned Victorian Open.\n\nPractise your handicap on the serene Beach Course - rated as one of Australia’s top 10 public-access courses by Golf Australia 2021 - and find your groove on the Creek Course designed by Cashmore with six-time major championship winner, Sir Nick Faldo. While away days savouring authentic local produce at the modern Clubhouse Restaurant, discovering the region’s bounty of world-class cellar doors, and hitting the waves of nearby Barwon Heads and Ocean Grove.\n\n**Your handpicked inclusions:**\n\n- Tantalise the tastebuds with daily à la carte breakfast at Clubhouse Restaurant\n- Toast your serene escape with a welcome glass of wine or beer per adult\n- Enjoy buy-one-get-one-free green fees and complimentary cart hire throughout your stay\n- Guaranteed 12pm late checkout for a well-deserved sleep-in\n\n**Gourmet Dining Upgrade:** Choose the Gourmet Dining Upgrade and enjoy a welcome bottle of Bellarine Peninsula wine on arrival and one three-course set menu dining experience for two per stay. See the Fine Print for details.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Connewarre",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "13th Beach Golf Lodges JUN21",
    "offer_address": "1732 Barwon Heads Rd, Barwon Heads VIC 3227 Australia",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 251.0,
    "value": 479.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HTxjAAG",
    "hero_image": "https://images.luxuryescapes.com/da142duzwxaznwshz7st",
    "image_two": "https://images.luxuryescapes.com/vj9bbq4axdrpuaoix6wm",
    "image_three": "https://images.luxuryescapes.com/839lbf0udv8dv1j4velf",
    "vendor_name": "Starhaven Retreat",
    "title": "Award-Winning Eco-Conscious Bellarine Peninsula Retreat",
    "description": "An escape from everyday life beckons at Starhaven Retreat, a contemporary hideaway set amid the striking beauty of the Bellarine Peninsula. A short drive yet a world away from Melbourne's CBD, this award-winning property - which featured on Grand Designs Australia and ranks among the world's top 1% in Tripadvisor's Best of the Best awards 2020 and 2021  - overlooks tranquil Port Phillip Bay and offers guests the opportunity to curate their own escape, with a spa, cocktail lounge, 15-seat cinema with a starlit ceiling and all-suite accommodation with private ensuite bathrooms.\n\nJoining the growth to green, Starhaven Retreat enjoys Tripadvisor GreenLeaders Platinum Level certification and promotes numerous environmental initiatives among the three categories of electricity, water and recycling. From the production of energy from solar power and using water from 20,000L water tanks to using FSC Certified papers and recycling rigorously, this retreat strives for a sustainable future, without compromising on luxury.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Indented Head",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Starhaven Retreat",
    "offer_address": "13 Calimo Pl, Indented Head VIC 3223",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z2E8AAI",
    "hero_image": "https://images.luxuryescapes.com/t0s7s9b81flh5x6tbwc6",
    "image_two": "https://images.luxuryescapes.com/5dy63qgq3u1vi30p788",
    "image_three": "https://images.luxuryescapes.com/k4quj3ix38s6fi4ewgv",
    "vendor_name": "Campbell Point House",
    "title": "Bellarine Peninsula Chateau-Inspired Stay",
    "description": "Experience a first-class chateau-inspired escape on the banks of Lake Connewarre at Campbell Point House, sprawled across a 16-hectare private estate just 1.5 hours' drive from Melbourne. Accommodating just 30 guests at a time, this boutique private mansion on the Bellarine Peninsula was made for intimate escapes, with a private day spa, jetty, lake house and even a helipad onsite.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Geelong",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Campbell Point House",
    "offer_address": "199 Matthews Rd, Leopold VIC 3224",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HTz1AAG",
    "hero_image": "https://images.luxuryescapes.com/9fpchkbhtf0au12hcmw",
    "image_two": "https://images.luxuryescapes.com/r0z9nfeif9j8hn1q66nb",
    "image_three": "https://images.luxuryescapes.com/iv48kvce36nq3j7iyfd",
    "vendor_name": "Starhaven Retreat",
    "title": "Bellarine Peninsula Award-Winning Adults-Only Retreat with Private Cinema & Cocktail Lounge",
    "description": "An escape from everyday life beckons at Starhaven Retreat, a contemporary hideaway set amid the striking beauty of the Bellarine Peninsula with its beaches, lakes, wineries and stunning views. A short drive yet a world away from Melbourne's CBD, this award-winning property - which featured on Grand Designs Australia - overlooks tranquil Port Phillip Bay and offers guests the opportunity to curate their own escape, with a spa, cocktail lounge, 15-seat cinema with a starlit ceiling and all-suite accommodation with private ensuite bathrooms. Joining the growth to green, Starhaven Retreat enjoys Tripadvisor GreenLeaders Platinum Level certification and promotes numerous environmental initiatives among the three categories of electricity, water and recycling. From the production of energy from solar power and using water from 20,000L water tanks to using FSC Certified papers and recycling rigorously, this retreat strives for a sustainable future, without compromising on luxury.  \n\nIf you can tear yourself away from the comfort of your accommodation, Victoria's Bellarine Peninsula is bursting with natural delights. Stroll along pristine beaches, discover the rich history of Geelong and taste spectacular local food and wine, freshly produced by some of Australia’s most awarded makers and growers. Browse local art galleries, sample the fare of local breweries and wineries, stroll the markets and while an afternoon away to live music: it's all here on the Bellarine Peninsula.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Indented Head",
    "location_heading": "Bellarine Peninsula",
    "location_subheading": "Victoria",
    "location_description": "Starhaven Retreat",
    "offer_address": "13 Calimo Pl, Indented Head VIC 3223",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 360.0,
    "value": 360.0
  }
]