[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI6cTAAT",
    "hero_image": "https://images.luxuryescapes.com/xfogkgfokshycmx0dc",
    "image_two": "https://images.luxuryescapes.com/g2o78ktu5g85chnq10e",
    "image_three": "https://images.luxuryescapes.com/k9uuwci10psvxbq91rp",
    "vendor_name": "Marramarra Lodge",
    "title": "Hawkesbury River All-Inclusive Adults-Only Retreat with Nightly Degustation Dinner & Matched Wines",
    "description": "Less than an hour from Sydney but miles from the bustle of the city, Marramarra Lodge is the definition of luxurious back-to-nature escapism. Perched on the banks of the Hawkesbury River and framed by Marramarra National Park, this exclusive adults-only retreat invites you to drink in the majestic river and bushland views on your outdoor deck. Let time slow down with a paddleboard or kayak along the river, explore the bush with historic walks or sample local delicacies on a champagne and oyster cruise.\n\nContinue the culinary adventure at Budyari Restaurant where you can savour an all-inclusive culinary experience. From house-made pastries in the morning to degustation dinners made with seasonal and fresh produce and paired with local and international wines, every day is a gourmet affair. Between meals, lose yourself to total pampering at Iyora Day Spa with signature aromatherapy massages, facials, and body polishes using Australian-made LaGaia luxury spa care products.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Berowra Waters",
    "location_subheading": "New South Wales",
    "location_description": "Marramarra Lodge",
    "offer_address": "4 Fishermans Point, Berowra Waters NSW 2082 Australia",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 1574.0,
    "value": 2646.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lkXcAAI",
    "hero_image": "https://images.luxuryescapes.com/62mown3jfxag9mvi9svlm",
    "image_two": "https://images.luxuryescapes.com/f65trrb03biw3f2nf6",
    "image_three": "https://images.luxuryescapes.com/ug6qtym8tzcdm3w91r",
    "vendor_name": "Marramarra Lodge",
    "title": "Hawkesbury River All-Inclusive Adults-Only Retreat with Nightly Degustation Dinner & Matched Wines",
    "description": "Less than an hour from Sydney but a million miles from the bustle of the city, Marramarra Lodge is the definition of luxurious back-to-nature escapism. Perched on the banks of the Hawkesbury River and framed by Marramarra National Park, this exclusive adults-only retreat serves as a luxurious gateway to some of the state’s most picturesque natural landscapes, paired with outstanding facilities and unique accommodation.\n\nChoose between a Hawkesbury Bungalow or Peninsula Tent before settling in for days spent on your outdoor balcony listening to birdsong and the river flowing below. Take to the water on a paddleboard or kayak, explore the surrounding bushland with guided walks, or sample local delicacies on a champagne and oyster cruise. Continue the culinary adventure at Budyari Restaurant, or lose yourself at Iyora Day Spa with signature aromatherapy massages, facials, and body polishes. Then sit back and just breathe.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Berowra Waters",
    "location_subheading": "New South Wales",
    "location_description": "Marramarra Lodge",
    "offer_address": "4 Fishermans Point, Berowra Waters NSW 2082 Australia",
    "percentage_discount": 27.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 1889.0,
    "value": 2574.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bfx7EAAR",
    "hero_image": "https://images.luxuryescapes.com/5ws7f2mmqspox3i0p09",
    "image_two": "https://images.luxuryescapes.com/60lv6ya3makl984xqww",
    "image_three": "https://images.luxuryescapes.com/wkcfyprify6rz35bstl",
    "vendor_name": "Marramarra Lodge",
    "title": "Hawkesbury River All-Inclusive Adults-Only Retreat with Nightly Degustation Dinner & Matched Wines",
    "description": "Less than an hour from Sydney but a million miles from the bustle of the city, Marramarra Lodge is the definition of luxurious back-to-nature escapism. Perched on the banks of the Hawkesbury River and framed by Marramarra National Park, this exclusive adults-only retreat invites you to drink in majestic river and bushland views on your outdoor deck, letting birdsong and the flowing river soothe you.\n\nTake to the water on a paddleboard or kayak, explore the bush with historic walks or sample local delicacies on a champagne and oyster cruise. Continue the culinary adventure at Budyari Restaurant, or lose yourself at Iyora Day Spa with signature aromatherapy massages, facials, and body polishes.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Berowra Waters",
    "location_subheading": "New South Wales",
    "location_description": "Marramarra Lodge",
    "offer_address": "4 Fishermans Point, Berowra Waters NSW 2082 Australia",
    "percentage_discount": 28.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 1793.0,
    "value": 2481.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gbuLAAQ",
    "hero_image": "https://images.luxuryescapes.com/p005dtdzv832w3zain0b",
    "image_two": "https://images.luxuryescapes.com/kndew1rg8cdaey4ize7w",
    "image_three": "https://images.luxuryescapes.com/v5fgyoykyim97isz31",
    "vendor_name": "Marramarra Lodge",
    "title": "Adults-Only Hawkesbury River All-Inclusive Retreat Less Than an Hour from Sydney",
    "description": "Less than an hour from Sydney but a million miles from the bustle of the city, Marramarra Lodge is the definition of luxurious back-to-nature escapism. Perched on the banks of the Hawkesbury River and framed by Marramarra National Park, this adults-only lodge is a luxurious gateway to some of the state’s most picturesque natural landscapes.\n\nFeel at one with nature as you immerse yourself in majestic river and bushland views on your outdoor deck, with nothing but the sound of birdsong and the river flowing below. Take to the water on a paddleboard or kayak, explore the bush with historic walks or sample local delicacies on a champagne and oyster cruise. Continue the culinary adventure at Budyari Restaurant, or lose yourself at Iyora Day Spa with signature aromatherapy massages, facials, and body polishes. Signature experiences showcase the best of the wilderness or go even further with added experiences like a local Indigenous guided walk or a helicopter ride to the renowned Hunter Valley (surcharges apply).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Berowra Waters",
    "location_subheading": "New South Wales",
    "location_description": "Marramarra Lodge",
    "offer_address": "4 Fishermans Point, Berowra Waters NSW 2082 Australia",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 1864.0,
    "value": 1864.0
  }
]