[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G1tLpAAJ",
    "hero_image": "https://images.luxuryescapes.com/m0vwm1ex8acx0dprmzbh",
    "image_two": "https://images.luxuryescapes.com/4tg5p4llj7frg64jkam",
    "image_three": "https://images.luxuryescapes.com/dwsgwc20bs4wkp1act1g",
    "vendor_name": "Berri Hotel",
    "title": "South Australia Berri Escape on the Banks of the Murray River with Daily Breakfast",
    "description": "Wake up to the sound of South Australian birds chirping and the river flowing at the much-loved Berri Hotel. This charming retreat, nestled on the banks of the mighty Murray River, is the perfect base to explore the area's best wineries, citrus groves, and national parks. Savour local flavours at the hotel's bistro with a classic pizza or hearty pub favourite, or venture out to the local eateries for a taste of the region's fresh produce. With stunning river views and an array of outdoor activities at your doorstep, the Berri Hotel offers an authentic and cosy South Australian escape, just waiting to be discovered.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Berri",
    "location_heading": "Berri",
    "location_subheading": "South Australia",
    "location_description": "Berri Hotel",
    "offer_address": "Riverview Drive, Berri, South Australia 5343 Australia",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 167.0,
    "value": 462.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CUvrcYAD",
    "hero_image": "https://images.luxuryescapes.com/c2u9fy8x4c7iw64qj3we",
    "image_two": "https://images.luxuryescapes.com/qe0f7sqw0ob1l8h8idwq",
    "image_three": "https://images.luxuryescapes.com/15v45dusi14xiz67nrv7",
    "vendor_name": "Berri Hotel",
    "title": "Tranquil South Australia Retreat on the Banks of the Murray River with Daily Breakfast",
    "description": "Located along the banks of the Murray River, experience the charms of South Australia's Riverlands from this idyllic sanctuary, perfectly situated to explore the area’s best wineries, citrus groves and national parklands.\n\nAwaken to the sounds of South Australian birds chirping and the river gently babbling as you relax and rejuvenate in the hotel's well-appointed rooms and take a refreshing dip in the sparkling pool.\n\nFor the foodies, dine alfresco-style and savour local flavours with a wide array of seasonal dishes, pizzas and other pub favourites at the charming bistro, with views overlooking the region's most iconic river.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Berri",
    "location_heading": "Berri",
    "location_subheading": "South Australia",
    "location_description": "Berri Hotel",
    "offer_address": "Riverview Drive, Berri, South Australia 5343 Australia",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 182.0,
    "value": 467.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009F7GRAA0",
    "hero_image": "https://images.luxuryescapes.com/5lk266st7f0fiqqci8p",
    "image_two": "https://images.luxuryescapes.com/58j2usaeoww2w3pldx",
    "image_three": "https://images.luxuryescapes.com/jjmj2ya7wivwj9rnhux",
    "vendor_name": "Big River Golf and Country Club",
    "title": "Serene South Australia Riverland Golf Retreat with Daily Breakfast",
    "description": "Escape to the rolling bushland, gentle zigzagging waters and river red gum forests of South Australia's renowned Riverland region for a magnificent golf getaway at the relaxed Big River Golf and Country Club. Perfectly placed in Berri - just a few hours' drive from Adelaide and surrounded by over 3,000 hectares of vineyards and fruit orchids - the region is a paradise for foodies and wine-lovers alike. The hotel’s onsite restaurant, the Tavern, delivers classic pub favourites and fresh seafood in a family-friendly, relaxed environment. However, Big River Golf and Country Club’s greatest hole in one is its easy access to a dazzling range of acclaimed 18-hole golf courses - including Berri, Barmera, Loxton and Walkerie - offering challenges for new and experienced golfers alike.\n\nWhen you’re ready to explore the Riverland’s extraordinary natural attractions, historic hotels and exceptional breweries, wineries and restaurants, you won’t find a better launchpad than Big River Golf and Country Club. Visit the Berri Estates Winery, one of Australia’s oldest vineyards, or sip the afternoon away at boutique wine cellar 919 Wines, both less than a 10-minute drive away. For an adventure you’ll never forget, hire a kayak or canoe and explore the countless creeks and riverways at your leisure, savouring every minute of the serenity.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Berri",
    "location_heading": "Berri",
    "location_subheading": "South Australia",
    "location_description": "Big River Golf and Country Club",
    "offer_address": "45 Shiell Rd, Berri SA 5343",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 187.0,
    "value": 347.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bhDXHQA2",
    "hero_image": "https://images.luxuryescapes.com/t2gwakuyrwy4kty7msar",
    "image_two": "https://images.luxuryescapes.com/goguryatyi71fziunv0z",
    "image_three": "https://images.luxuryescapes.com/a07asu1zq0sc2tcipeha",
    "vendor_name": "Big River Golf and Country Club",
    "title": "Tranquil Golf Getaway only 2.5 Hours from Adelaide",
    "description": "Escape to the renowned Riverland region for a magnificent golf getaway in Berri - 2.5 hours’ drive from Adelaide. Surrounded by five famed golf courses - including Berri, Renmark, Barmera, Loxton and Walkerie - an escape at Big River Motor Inn is for the golf enthusiast. Includes daily continental breakfast, welcome bottle of wine, guaranteed late 12pm checkout and options to upgrade to a play package, which included two complimentary rounds of golf each at the 18-hole Berri Golf Course.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Berri",
    "location_heading": "Berri",
    "location_subheading": "South Australia",
    "location_description": "Big River Motor Inn",
    "offer_address": "Old Sturt Hwy, Berri SA 5343",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 113.0,
    "value": 297.0
  }
]