[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biMVjQAM",
    "hero_image": "https://images.luxuryescapes.com/ncm9iplrw7midsgjqcl1",
    "image_two": "https://images.luxuryescapes.com/skktk4zzx6stpq6p5tph",
    "image_three": "https://images.luxuryescapes.com/wxcft6rc79e59vxca2y3",
    "vendor_name": "Mauna Kea Beach Hotel",
    "title": "🌿CONSCIOUS COLLECTION: Beachfront Bliss on One of the World’s Best Beaches",
    "description": "Take your holiday to the next level and experience the Island of Hawaii with a stay at the award-winning Mauna Kea Beach Hotel, located on Kauna`oa Beach, voted the most stunning beach in the world. Located an easy 45-minute flight from Honolulu, the Island of Hawaii is the most naturally diverse of all of the Hawaiian islands. Feel your troubles float away as you unwind on the pristine white sands of the bay or take in amazing Pacific Ocean views from the resort’s world-class golf course. Whether you’re going on a romantic couples’ escape or a fun family getaway, there’s something for everyone. Includes daily buffet breakfast, USD$200 resort credit, a round of golf for one at Mauna Kea Golf Course, a manager’s cocktail reception with free-flow drinks and hors d’oeuvres, a welcome drink on arrival and much more. Plus, exclusive to Luxury Escapes, two kids stay free with breakfast included!",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kamuela",
    "location_heading": "Big Island",
    "location_subheading": "Hawaii",
    "location_description": "Mauna Kea Beach Hotel",
    "offer_address": "62-100 Mauna Kea Beach Dr, Waimea, HI 96743, USA",
    "percentage_discount": 65.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1900.0,
    "value": 5440.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biMWmQAM",
    "hero_image": "https://images.luxuryescapes.com/kr89r0jr94m8oh3x5ls",
    "image_two": "https://images.luxuryescapes.com/s7vwbr8koclepdcdceqc",
    "image_three": "https://images.luxuryescapes.com/s0bcno49mj8fsifprck9",
    "vendor_name": "The Westin Hapuna Beach Resort",
    "title": "Stay on One of the World’s Best Beaches at a Top Hawaii Hotel",
    "description": "Voted among the top ten beaches in Hawaii, Hapuna Beach is famous for boasting some of the whitest sands and clearest waters in this stunning cluster of islands. Located an easy 45-minute flight from Honolulu, the Island of Hawaii is the most naturally diverse of all of the Hawaiian islands. Discover it all in renovated luxury at The Westin Hapuna Beach Resort-a beachfront paradise that underwent an extensive multi-million-dollar renovation last year. Includes daily buffet breakfast, a three-course decadent dinner, US$50 food and beverage credit, a round of golf for one at the award-winning Arnold Palmer-designed Hapuna Golf Course, a manager’s cocktail reception with free-flow drinks and canapes, and a welcome cocktail on arrival. Plus, exclusive to Luxury Escapes, two kids stay free with breakfast included!",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kamuela",
    "location_heading": "Big Island",
    "location_subheading": "Hawaii",
    "location_description": "The Westin Hapuna Beach Resort",
    "offer_address": "62-100 Kaunaʻoa Dr, Waimea, HI 96743, USA",
    "percentage_discount": 59.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1537.0,
    "value": 3709.0
  }
]