[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JTWOXAA5",
    "hero_image": "https://images.luxuryescapes.com/e92sm007hlrwqhr3pn",
    "image_two": "https://images.luxuryescapes.com/0rgwk9p3vorrl0363pab",
    "image_three": "https://images.luxuryescapes.com/m3l9go9umqqk6s5rdbpee",
    "vendor_name": "Angsana Resort Bintan",
    "title": "Indonesia Oceanfront Bintan Island Opulence with Private Beach, Daily Breakfast & Nightly Cocktails",
    "description": "Run away to this secluded island paradise, just a 60-minute ferry ride from Singapore, in sun-soaked Bintan. This tranquil resort offers direct access to the pristine beaches of the South China Sea, while the lush rainforests and traditional fishing villages of Bintan are just a short journey away.\n\nIndulge in all-day eats at the resort's Lotus Cafe, sip cocktails at XANA Beach Club, rejuvenate with signature treatments at the award-winning Angsana Spa or enjoy a round of golf at the nearby Laguna Bintan Golf Club. For those seeking adventure, the resort offers a range of water sports, from jet skiing to windsurfing.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Bintan",
    "location_heading": "Bintan",
    "location_subheading": "Indonesia",
    "location_description": "Angsana Bintan",
    "offer_address": "Laguna Bintan Resort, Jalan Teluk Berembang, Sebong Lagoi, Kec. Tlk. Sebong, Kabupaten Bintan, Kepulauan Riau 29155, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 25,
    "price": 289.0,
    "value": 728.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UNXeAAO",
    "hero_image": "https://images.luxuryescapes.com/koa20h6kdrlnhin7rirr",
    "image_two": "https://images.luxuryescapes.com/jintfmhqreu67n5scl6",
    "image_three": "https://images.luxuryescapes.com/dea2fo258n01h67uybt",
    "vendor_name": "Banyan Tree Bintan",
    "title": "Bintan Island Ocean-View Pool Villa Paradise",
    "description": "Leave the rest of the world behind for the magic of Indonesia’s gorgeous Riau Islands with a tropical villa stay at Banyan Tree Bintan. Surrounded by virgin rainforest and a private beach, this dreamy resort is the perfect place to hide away in luxury. Stay in a Balinese-style private pool villa built into the hillside, accessible from the thatched-roof lobby by golf buggy. \n\nFabulous facilities include three incredible restaurants, serving everything from modern European dishes to Thai cuisine, two refreshing swimming pools when you’d like to cool off, and the blissful Banyan Tree Spa, where traditional Balinese massages with homemade oils await. Just beyond the resort’s perimeter, keen golfers can delight in the Greg Norman-designed 18-hole Laguna Bintan Golf Club, boasting breathtaking ocean views from the green. Bintan's white-sand beaches, tropical greenery, monkey-filled mangrove forest and sacred temples invite exploration in between lounging poolside with a cocktail in hand.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Bintan",
    "location_heading": "Bintan",
    "location_subheading": "Indonesia",
    "location_description": "Banyan Tree Bintan",
    "offer_address": "Jalan Teluk Berembang, Laguna Bintan Resort, Lagoi, Sebong Lagoi, Tlk. Sebong, Kabupaten Bintan, Kepulauan Riau 29155, Indonesia Riau 29155 Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 309.0,
    "value": 309.0
  }
]