[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004QQfvAAG",
    "hero_image": "https://images.luxuryescapes.com/id2ozqdj1esv9xh13yh",
    "image_two": "https://images.luxuryescapes.com/qn8om2ynbt6o8skm6e1",
    "image_three": "https://images.luxuryescapes.com/d3qhhupb9z2fhzwlab5m",
    "vendor_name": "Ratho Farm",
    "title": "Tasmania Countryside Retreat an hour from Hobart with a Decadent Dinner & Daily Breakfast",
    "description": "Let romance find you at the blissfully secluded Ratho Farm - a boutique country retreat housed in a rustic colonial farmhouse built in 1822, in Tasmania’s lush central highlands. Nestled a scenic one-hour drive north of Hobart, on the cusp of Bothwell Village, this charming heritage homestead offers a collection of lavish rooms set in carefully restored farm cottages, surrounded by the manicured greens of Australia’s oldest golf course - dating back more than 150 years.\n\nWith a spectacular location between Hobart and Launceston, this idyllic property is the perfect base for day trips and the perfect starting point for exciting adventures amid the kaleidoscopic beauty of Tasmania. Whether you are ready to tee off, want to enjoy walks and river fishing, or are simply looking for a boutique escape filled with fine wine and delicious local produce, Ratho Farm is the ideal place to whisk away your special someone.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Bothwell",
    "location_heading": "Bothwell",
    "location_subheading": "Tasmania",
    "location_description": "Ratho Farm",
    "offer_address": "2122 Highland Lakes Road, Bothwell, Tasmania 7030, Australia",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 219.0,
    "value": 365.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DHUWAA4",
    "hero_image": "https://images.luxuryescapes.com/niibgmoxd4hsfjxguut6",
    "image_two": "https://images.luxuryescapes.com/9lv53aqbdbywcslt0hl",
    "image_three": "https://images.luxuryescapes.com/3a4nkdtywgr97jh1bnr",
    "vendor_name": "Ratho Farm",
    "title": "Heritage Tasmania Countryside Retreat an hour from Hobart with Delicious Dinner & Daily Breakfast",
    "description": "Let romance find you at the blissfully secluded Ratho Farm - a boutique country retreat hidden in Tasmania’s lush central highlands. Ideally located a scenic one-hour drive north of Hobart, on the cusp of Bothwell Village, this charming heritage highland homestead offers a collection of lavish rooms, and is perfect for wintery escapes or adventures year-round. Relax in carefully restored farm cottages, convict barns, stables and a historic farmhouse built in 1822, all surrounded by the manicured greens of Australia’s oldest golf course - dating back more than 150 years.\n\nWith a spectacular location between Hobart and Launceston, this idyllic property is the perfect base for day trips (especially in the cooler months when the Apple Isle really comes to life) and the perfect starting point for exciting adventures amid the kaleidoscopic beauty of Tasmania. Whether you are ready to tee off, relish four kilometres of walks and trout fishing, visit nearby attractions such as distilleries and Lake St. Clair, or simply unwind in a boutique escape filled with fine wine and delicious local produce, Ratho Farm is the ideal place to whisk away your special someone or family.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Bothwell",
    "location_heading": "Bothwell",
    "location_subheading": "Tasmania",
    "location_description": "Ratho Farm",
    "offer_address": "2122 Highland Lakes Road, Bothwell, Tasmania 7030, Australia",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 263.0,
    "value": 395.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CvitjAAB",
    "hero_image": "https://images.luxuryescapes.com/rxwao3yma9sjy72fvxci",
    "image_two": "https://images.luxuryescapes.com/4rka5t6eakj7gvl4978p",
    "image_three": "https://images.luxuryescapes.com/eazgsid2cklk59e8lf6",
    "vendor_name": "Ratho Farm",
    "title": "Heritage Tasmania Countryside Retreat an Hour from Hobart with Daily Breakfast & Welcome Drink",
    "description": "Discover a love of romance, great golf, fun festivals, rich history and highland scenery at Ratho Farm, a blissfully secluded boutique country retreat hidden in Tasmania’s lush central highlands. Ideally located a scenic one-hour drive north of Hobart on the cusp of Bothwell Village, this charming heritage property offers a collection of carefully restored farm cottages, barns, stables and a historic homestead. Surrounded by the manicured greens of Australia’s oldest golf course dating back more than 150 years, Ratho Farm is a place for learning, laughing and re-connecting. This historic site is perfect for travellers visiting the island for one of Tasmania’s many colourful, wild winter festivals, or as a weekend getaway from the city.\n\nWith a serene location between Hobart and Launceston, this idyllic property is the perfect base for day trips amid the peaceful beauty of Tasmania, with nearby attractions including local distilleries and Lake St Clair. Whether you want to work on your golf game, set off on four kilometres of walking trails or spend days fly fishing, or if you're simply after a boutique escape filled with fine wine and delicious local produce, Ratho Farm is the ideal place for an escape with a special someone or family.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Bothwell",
    "location_heading": "Bothwell",
    "location_subheading": "Tasmania",
    "location_description": "Ratho Farm",
    "offer_address": "2122 Highland Lakes Road, Bothwell, Tasmania 7030, Australia",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 231.0,
    "value": 356.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FhAoHYAV",
    "hero_image": "https://images.luxuryescapes.com/106e2hnopsvu1h4yox0n",
    "image_two": "https://images.luxuryescapes.com/wg9jkzpoa4tluewfchj",
    "image_three": "https://images.luxuryescapes.com/orbhb5wg54m3wcnhduj",
    "vendor_name": "Ratho Farm",
    "title": "Heritage Tasmania Countryside Retreat with Australia’s Oldest Golf Course & Daily Breakfast",
    "description": "Discover a love of romance, great golf, fun festivals, rich history and highland scenery at Ratho Farm, a blissfully secluded boutique country retreat hidden in Tasmania’s lush central highlands. Ideally located a scenic one-hour drive north of Hobart on the cusp of Bothwell Village, this charming heritage property offers a collection of carefully restored farm cottages, barns, stables and a historic homestead.\n\nSurrounded by the manicured greens of Australia’s oldest golf course dating back more than 150 years, Ratho Farm is a place for learning, laughing and re-connecting. This historic site is perfect for travellers visiting the island for one of Tasmania’s many colourful, wild winter festivals, or as a weekend getaway from the city.\n\nWith a serene location between Hobart and Launceston, this idyllic property is the perfect base for day trips amid the peaceful beauty of Tasmania, with nearby attractions including local distilleries and Lake St Clair.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Bothwell",
    "location_heading": "Bothwell",
    "location_subheading": "Tasmania",
    "location_description": "Ratho Farm",
    "offer_address": "2122 Highland Lakes Road, Bothwell, Tasmania 7030, Australia",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 239.0,
    "value": 374.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JvgFAAS",
    "hero_image": "https://images.luxuryescapes.com/fxab6k0hdnclxfr4caso",
    "image_two": "https://images.luxuryescapes.com/sbh3sl0ctrc3qr1kbc4b",
    "image_three": "https://images.luxuryescapes.com/44x40uo4o2rruy9oxu",
    "vendor_name": "Ratho Farm",
    "title": "Heritage Tasmania Countryside Retreat an hour from Hobart with Delicious Dinner & Daily Breakfast",
    "description": "Let romance find you at the blissfully secluded Ratho Farm - a boutique country retreat hidden in Tasmania’s lush central highlands. Ideally located a scenic one-hour drive north of Hobart, on the cusp of Bothwell Village, this charming heritage highland homestead offers a collection of lavish rooms set in carefully restored farm cottages, convict barns, stables and historic farmhouse built in 1822, surrounded by the manicured greens of Australia’s oldest golf course - dating back more than 150 years.\n\nWith a spectacular location between Hobart and Launceston, this idyllic property is the perfect base for day trips and the perfect starting point for exciting adventures amid the kaleidoscopic beauty of Tasmania. Whether you are ready to tee off, relish four kilometres of walks and fly fishing, visit nearby attractions such as distilleries and Lake St. Clair, or simply looking for a boutique escape filled with fine wine and delicious local produce, Ratho Farm is the ideal place to whisk away your special someone or family.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Bothwell",
    "location_heading": "Bothwell",
    "location_subheading": "Tasmania",
    "location_description": "Ratho Farm",
    "offer_address": "2122 Highland Lakes Road, Bothwell, Tasmania 7030, Australia",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 220.0,
    "value": 359.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CO9CyAAL",
    "hero_image": "https://images.luxuryescapes.com/y2ggd1mm9woz50y0dhd",
    "image_two": "https://images.luxuryescapes.com/4aksyyc1dkxgsm5qapo9",
    "image_three": "https://images.luxuryescapes.com/xy5odkmm5ja5hntuxnh",
    "vendor_name": "Ratho Farm",
    "title": "Heritage Tasmania Countryside Retreat Just an Hour From Hobart with Daily Breakfast & Welcome Drinks",
    "description": "Let romance find you at the blissfully secluded Ratho Farm, a boutique historic country retreat hidden in Tasmania’s lush central highlands. Ideally located a scenic one-hour drive north of Hobart, this charming heritage highland homestead offers a collection of lavish rooms, all surrounded by manicured greens of Australia’s oldest golf course. There's no better place to discover the region's charming collection of distilleries, fine wineries and delicious local produce.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Bothwell",
    "location_heading": "Bothwell",
    "location_subheading": "Australia",
    "location_description": "Ratho Farm",
    "offer_address": "2122 Highland Lakes Road, Bothwell, Tasmania 7030, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 15,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070VE2AAM",
    "hero_image": "https://images.luxuryescapes.com/cv03b3a3jbwrj7lngji",
    "image_two": "https://images.luxuryescapes.com/y2t3qclg1bemfomuaj4e",
    "image_three": "https://images.luxuryescapes.com/0ucb18l4pzors3crv1q",
    "vendor_name": "Ratho Farm",
    "title": "Tasmania Central Highlands Retreat an Hour from Hobart",
    "description": "Encounter a world of countryside bliss just an hour from Hobart with a charming stay at Ratho Farm, set on the edge of Bothwell village in Tasmania’s Central Highlands. Set in a classic homestead built in 1822, this exquisite retreat seamlessly blends rustic charm and modern amenities and is surrounded by the manicured greens of Australia’s oldest golf course - dating back more than 150 years. Enjoy a round or two on the course, then stop by the Atrium restaurant for delicious fare crafted with local produce. \n\nFrom Ratho Farm, you’ll be perfectly located to reach some of Tasmania’s top attractions. Visit distilleries and wineries, and enjoy activities amid nature, from walks to horse riding, river fishing and more. With its captivating landscapes and unrivalled gourmet experiences, Tasmania offers an abundance of things to see and do.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Bothwell",
    "location_heading": "Bothwell",
    "location_subheading": "Tasmania",
    "location_description": "Ratho Farm",
    "offer_address": "2122 Highland Lakes Road, Bothwell, Tasmania 7030, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CO9BCAA1",
    "hero_image": "https://images.luxuryescapes.com/qwu0b2qrsvw14mad326",
    "image_two": "https://images.luxuryescapes.com/rqhlq4e5fx983c7zhsr",
    "image_three": "https://images.luxuryescapes.com/g6pphahjcpsfz5a3c8n9",
    "vendor_name": "Ratho Farm",
    "title": "Heritage Tasmania Countryside Retreat just an Hour from Hobart",
    "description": "Let romance find you at the blissfully secluded Ratho Farm, a boutique country retreat hidden in Tasmania’s lush central highlands. Ideally located a scenic one-hour drive north of Hobart, this charming heritage homestead offers a collection of lavish rooms, all surrounded by the manicured greens of Australia’s oldest golf course. There's simply no finer place to discover the region's charming collection of fine distilleries, wineries and delicious local produce.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Bothwell",
    "location_heading": "Bothwell",
    "location_subheading": "Australia",
    "location_description": "Ratho Farm",
    "offer_address": "2122 Highland Lakes Road, Bothwell, Tasmania 7030, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 83.0,
    "value": 83.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oKvKAAU",
    "hero_image": "https://images.luxuryescapes.com/8xkqp896njwnaq7numg9",
    "image_two": "https://images.luxuryescapes.com/gkqsbw6jmlykeccox4r",
    "image_three": "https://images.luxuryescapes.com/k3ly4qa6htldcyzuimy",
    "vendor_name": "Ratho Farm",
    "title": "Tasmania Central Highlands Retreat an Hour from Hobart with Australia's Oldest Golf Course",
    "description": "Behold a world of countryside bliss just one hour from Hobart with a charming stay at Ratho Farm, set upon the edge of Bothwell village in Tasmania’s Central Highlands. With it's captivating landscapes and unrivalled gourmet experiences, Tasmania offers an abundance of things to see and do.\n\nSet in a classic homestead originally built in 1822, this exquisite retreat seamlessly blends rustic charm and modern amenities and is surrounded by the manicured greens of Australia’s oldest golf course - dating back more than 150 years. Enjoy a round or two on the course, then stop by the Atrium restaurant for a taste of delicious fare crafted with local produce. From Ratho Farm, you’ll be perfectly located to reach some of Tasmania’s top attractions. Visit distilleries and wineries, and enjoy activities amid nature, from walks to horse riding, river fishing and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Bothwell",
    "location_heading": "Bothwell",
    "location_subheading": "Tasmania",
    "location_description": "Ratho Farm",
    "offer_address": "2122 Highland Lakes Road, Bothwell, Tasmania 7030, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]