[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HAEKrYAP",
    "hero_image": "https://images.luxuryescapes.com/z4b60qxxskotjnefmcv",
    "image_two": "https://images.luxuryescapes.com/4cyemhoogbac7jgos5wa",
    "image_three": "https://images.luxuryescapes.com/edchx8d6gkq5gkk49sz1",
    "vendor_name": "Bel Air Broadbeach",
    "title": "Broadbeach One- & Two-Bedroom Apartments opposite Pacific Fair Shopping Centre with Multi-Tiered Pool",
    "description": "Soak up the laid-back Gold Coast lifestyle with a stay at Bel Air on Broadbeach, perfectly positioned in the heart of Broadbeach. Stay in a self-contained apartment with everything you need for a relaxing beachside escape, including a fully equipped kitchen, private balcony and floor-to-ceiling windows letting in natural light.\n\nStep outside to discover the Gold Coast's golden sands, buzzing cafes, restaurants, Pacific Fair Shopping Centre and The Star Gold Coast, all just moments away. Venture a little further for a day of thrills at the Gold Coast's renowned theme parks. Between explorations, pull up a sunlounger by the multi-tiered outdoor pool or refresh with a drink from Little Beach Cafe.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Bel Air Broadbeach",
    "offer_address": "2633 Gold Coast Highway, Broadbeach, Queensland 4218, Australia",
    "percentage_discount": 32.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 274.0,
    "value": 404.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HDziEYAT",
    "hero_image": "https://images.luxuryescapes.com/gc0ccp9qsu5kztj51gy",
    "image_two": "https://images.luxuryescapes.com/cl2w6ndrbw3gjr7azo4i",
    "image_three": "https://images.luxuryescapes.com/m6mkzbl1shkt0m04k1po",
    "vendor_name": "Ocean Pacific Broadbeach",
    "title": "Broadbeach Oceanview Apartments Steps from Pacific Fair with Welcome Wine",
    "description": "Soak up the Gold Coast sunshine at this laidback beachside retreat in one of Queensland’s most sought-after destinations. Just a short stroll from the sand and steps to Pacific Fair’s designer boutiques, this contemporary high-rise resort places you right in the heart of it all - surf, shopping and sensational eats.\n\nStart your day with coffee on your private balcony, where sparkling ocean views set the tone. Each self-contained apartment is designed for breezy coastal living with full kitchens, laundry facilities and plenty of space to unwind after a day of sun and sand.\n\nCool off with a dip in the heated outdoor pool or soak your cares away in the bubbling spa. There’s a sauna for quiet moments, a gym to keep the routine going and a games room to keep everyone entertained.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Ocean Pacific Resort Broadbeach",
    "offer_address": "25 Surf Parade, Broadbeach, Queensland 4218, Australia",
    "percentage_discount": 32.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 629.0,
    "value": 923.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HVllfYAD",
    "hero_image": "https://images.luxuryescapes.com/lbkm86le9cnhmu3z63se",
    "image_two": "https://images.luxuryescapes.com/tvaqk3l8ly8k4a73tuhds",
    "image_three": "https://images.luxuryescapes.com/ns47wdlolbe2eo809ow",
    "vendor_name": "Sofitel Gold Coast Broadbeach",
    "title": "Elevated Gold Coast Opulence with Ocean Views, Daily Breakfast, A$100 Dining Credit & Parking",
    "description": "Are you ready to spoil yourself with luxury at one of the Gold Coast's most lavish hotels? Combining chic, contemporary furnishings with French-inspired decor, this iconic escape brings all the Sofitel opulence, mixed with the casual beach lifestyle for which the area is famous.\n\nFind yourself just steps from the oceanfront and right in the heart of cosmopolitan Broadbeach's buzzing restaurants and bars. You’ll be able to experience the best dining venues and entertainment - be it the famous Warner Bros. Movie World, Star Casino or the extravagant Pacific Fair Shopping Centre.\n\nSofitel Gold Coast Broadbeach delivers outstanding service, along with two swimming pools - one with a poolside bar - and three top-tier dining experiences. Savour a buffet spread every morning at the all-day eatery Bistro On3, sip handcrafted cocktails and graze on charcuterie at Room81, and enjoy pub classics while watching sports at TC's Bar And Gaming Lounge.\n\nYou can stay on top of your routine at the onsite cutting-edge fitness centre, endota spa and Privé Hair & Makeup. A truly laidback Broadbeach experience paired with elegant French luxury just moments from the sun-soaked beach, this escape is perfect for the ultimate romantic experience or a fun-filled family trip.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Sofitel Gold Coast Broadbeach",
    "offer_address": "81 Surf Parade, Broadbeach, Gold Coast, Queensland 4218, Australia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 469.0,
    "value": 1121.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003dR69AAE",
    "hero_image": "https://images.luxuryescapes.com/mmny72t8ucldwtexa66k",
    "image_two": "https://images.luxuryescapes.com/jinoduhv1dord8a5w31h",
    "image_three": "https://images.luxuryescapes.com/7i0892zgkqfdt9kdk0m6",
    "vendor_name": "Synergy Broadbeach",
    "title": "Stylish Gold Coast Family Apartments in the Heart of Broadbeach",
    "description": "Escape with family or friends to the super-stylish Synergy Broadbeach, a collection of self-contained modern apartments located in the heart of Queensland's high-end holiday hotspot only a short stroll from boutiques, restaurants and the sparkling sands of Kurrawa Beach.\n\nEach spacious apartment features two bathrooms, a fully equipped kitchen and a private balcony with spectacular hinterland vistas. Explore the area's natural beauty, chase thrills at theme parks, whip up a family feast in the resort's BBQ area, or relax year-round in the outdoor heated swimming pool and spa. Secure underground parking makes exploring the Gold Coast by car easy, or you'll find the light rail tram conveniently located in front of the resort.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Synergy Broadbeach",
    "offer_address": "2729 Gold Coast Hwy, Broadbeach QLD 4218",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 389.0,
    "value": 825.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009C2vFAAS",
    "hero_image": "https://images.luxuryescapes.com/d0osbjkv7maa977a7mqc",
    "image_two": "https://images.luxuryescapes.com/bkk0xsfafv9c0206mq7b",
    "image_three": "https://images.luxuryescapes.com/oad1x6t6ykkdqmfti5qm",
    "vendor_name": "Sofitel Gold Coast Broadbeach",
    "title": "Five-Star Sofitel Gold Coast Luxury with Ocean-View Upgrade, Daily Breakfast & Nightly Drinks",
    "description": "Spoil yourself with French-inspired luxury at the iconic Sofitel Gold Coast Broadbeach, nestled just steps from the oceanfront, among the restaurants and boutiques of this gorgeous location. One of the most lavish hotels in the area, it combines chic, contemporary furnishings with French-inspired décor, mixed with the casual beach lifestyle the area is famous for. Located right in the heart of cosmopolitan Broadbeach, you’ll be able to experience the best dining venues and entertainment - be it the famous Warner Bros. Movie World, Star Casino or the extravagant Pacific Fair Shopping Centre.\n\nThis dynamic hotel delivers outstanding service and a long list of state-of-the-art facilities including the award-winning restaurant Room81, two spectacular skyline swimming pools, a stylish bar and plenty more. A true laidback Broadbeach experience paired with elegant French luxury right next to the sun-soaked beach, perfect for the ultimate romantic experience or a fun-filled family trip.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Sofitel Gold Coast Broadbeach",
    "offer_address": "81 Surf Parade, Broadbeach, Gold Coast, Queensland 4218, Australia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 527.0,
    "value": 1410.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqUyiAAF",
    "hero_image": "https://images.luxuryescapes.com/q647pj2gpp5etwf70hm",
    "image_two": "https://images.luxuryescapes.com/jyp60l49csjngvop3jzc",
    "image_three": "https://images.luxuryescapes.com/at41ovrk7o0drwm4lpetv",
    "vendor_name": "Sofitel Gold Coast Broadbeach",
    "title": "Five-Star Sofitel Gold Coast Luxury with Ocean-View Upgrade, Daily Breakfast & Nightly Drinks",
    "description": "Spoil yourself with French-inspired luxury at the iconic Sofitel Gold Coast Broadbeach, just steps from the oceanfront and set among buzzing restaurants and bars. One of the most lavish hotels in the area, it combines chic, contemporary furnishings with French-inspired decor, mixed with the casual beach lifestyle for which the area is famous. Located right in the heart of cosmopolitan Broadbeach, you’ll be able to experience the best dining venues and entertainment - be it the famous Warner Bros. Movie World, Star Casino or the extravagant Pacific Fair Shopping Centre.\n\nThis dynamic hotel delivers outstanding service, along with the exquisite Room81 restaurant, two spectacular swimming pools -  one heated -  a stylish bar and plenty more. A truly laidback Broadbeach experience paired with elegant French luxury just moments from the sun-soaked beach, this escape is perfect for the ultimate romantic experience or a fun-filled family trip.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Sofitel Gold Coast Broadbeach",
    "offer_address": "81 Surf Parade, Broadbeach, Gold Coast, Queensland 4218, Australia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 487.0,
    "value": 1046.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aiMIKQA2",
    "hero_image": "https://images.luxuryescapes.com/i45piafzbcnoyraxssmq",
    "image_two": "https://images.luxuryescapes.com/bl3l16ec9grfcvhe0nzl",
    "image_three": "https://images.luxuryescapes.com/nthm2mbd7czaypnhxtyo",
    "vendor_name": "Bel Air Broadbeach",
    "title": "Sun-Soaked Apartment Escape Opposite the Waterfront in Broadbeach",
    "description": "Immerse yourself in the coastal lifestyle at the Gold Coast's sun-kissed Broadbeach, staying in a fully self-contained apartment at the deluxe Bel Air on Broadbeach. Sitting in the heart of this beachfront hub, you’ll have a plethora of restaurants, buzzing bars, public transport options and more right on your doorstep. Whether you’re looking for a couples’ getaway or a family adventure on the coast, Bel Air on Broadbeach is the perfect spot. Enjoy welcome chocolates, guaranteed late 11am checkout, unlimited in-room movie rental and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Bel Air on Broadbeach",
    "offer_address": "2633 Gold Coast Hwy, Broadbeach QLD 4218",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 410.0,
    "value": 1105.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4vxMQAR",
    "hero_image": "https://images.luxuryescapes.com/rvj2xldfuh3kesxabauj",
    "image_two": "https://images.luxuryescapes.com/fo9gitfaa0czd64tlmws",
    "image_three": "https://images.luxuryescapes.com/tsvmopyqvz3sz7tbhawx",
    "vendor_name": "Bel Air Broadbeach",
    "title": "Sun-Soaked Apartment Escape Opposite the Waterfront in Trendy Broadbeach",
    "description": "Immerse yourself in the coastal lifestyle at the sun-kissed Broadbeach, staying in a fully self-contained apartment at the deluxe Bel Air on Broadbeach. Sitting in the heart of this beachfront hub, you’ll have a plethora of restaurants, buzzing bars, public transport options and more right on your doorstep. Enjoy welcome chocolates, a late 11am checkout, unlimited in-room movie rental and options of Two Bedroom Apartment stays perfect for groups or families.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Bel Air on Broadbeach",
    "offer_address": "2633 Gold Coast Hwy, Broadbeach QLD 4218",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 415.0,
    "value": 1120.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X9LOtQAN",
    "hero_image": "https://images.luxuryescapes.com/i8klf92c1vmyfyyieepx",
    "image_two": "https://images.luxuryescapes.com/caklel0oudx11nn7rs8t",
    "image_three": "https://images.luxuryescapes.com/moixnw5u7ffzkuxwqfsj",
    "vendor_name": "Neptune Resort",
    "title": "Resort Relaxation on the Gold Coast",
    "description": "Enjoy a couple’s getaway or fun for the whole family at the perfectly located Neptune Resort in Broadbeach, Queensland. Just a short walk from the beachfront, shops, restaurants and local attractions such as the iconic Star Casino, your comfortable, fully equipped apartment will be well placed for exploring all the Gold Coast has to offer. Daily tennis and beach towel hire will help you make the most of your stay, while wine and chocolates on arrival and a leisurely late 12pm checkout will ensure your holiday is a relaxing experience from start to finish.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "QLD",
    "location_description": "Neptune Resort 2018",
    "offer_address": "32 Surf Parade, Broadbeach QLD 4218",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 253.0,
    "value": 480.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gh06JAAR",
    "hero_image": "https://images.luxuryescapes.com/bium1g57rmeumex7kvm3",
    "image_two": "https://images.luxuryescapes.com/yae9nmdrjupwpv0qp76a",
    "image_three": "https://images.luxuryescapes.com/hibpi9aj7nufwwm4csmk",
    "vendor_name": "Sofitel Gold Coast Broadbeach",
    "title": "Elevated Sofitel Gold Coast Luxury with Ocean-View Upgrade, Daily Breakfast & Nightly Drinks",
    "description": "Are you ready to spoil yourself with luxury at one of the Gold Coast's most lavish hotels? Combining chic, contemporary furnishings with French-inspired decor, this iconic escape brings all the Sofitel opulence, mixed with the casual beach lifestyle for which the area is famous. Find yourself just steps from the oceanfront and right in the heart of cosmopolitan Broadbeach's buzzing restaurants and bars. You’ll be able to experience the best dining venues and entertainment - be it the famous Warner Bros. Movie World, Star Casino or the extravagant Pacific Fair Shopping Centre.\n\nThe dynamic Sofitel Gold Coast Broadbeach delivers outstanding service, along with the exquisite Room81 restaurant, two spectacular swimming pools - one heated - a stylish bar and plenty more. A truly laidback Broadbeach experience paired with elegant French luxury just moments from the sun-soaked beach, this escape is perfect for the ultimate romantic experience or a fun-filled family trip.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Sofitel Gold Coast Broadbeach",
    "offer_address": "81 Surf Parade, Broadbeach, Gold Coast, Queensland 4218, Australia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 479.0,
    "value": 1028.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JlGkkYAF",
    "hero_image": "https://images.luxuryescapes.com/0azsy1b4fi52ouc0zob",
    "image_two": "https://images.luxuryescapes.com/jg6z6mumg921sf1s8k5",
    "image_three": "https://images.luxuryescapes.com/x50qsw5xrrtf3vk5y4q",
    "vendor_name": "Peppers Broadbeach",
    "title": "Gold Coast Family Fun: Broadbeach Two-Bedroom Suites for Four Guests with Unlimited Dreamworld Entry",
    "description": "Soak up the Gold Coast’s beachside buzz at this sleek all-suite sanctuary rising above the action. Just steps from Kurrawa Beach and surrounded by Broadbeach’s top dining, shopping and entertainment, this coastal escape pairs laidback luxury with unbeatable convenience.\n\nSettle into your self-contained suite, with all the space and convenience of home. Then, step beyond the every day with an impressive suite of facilities, including two fitness centres, two sparkling pools, a private cinema for nights in and a BBQ area perfect for balmy evenings.\n\nWhen it’s time to explore, you’re perfectly placed for the Gold Coast’s best. Stroll to The Star Gold Coast, Pacific Fair or hop on the nearby G:link tram to reach attractions across the region. Enjoy unlimited entry to Dreamworld for all-day thrills, or take in sweeping coastal views from SkyPoint at the top of the iconic Q1 building - perfect for families or small groups of friends.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Peppers Broadbeach",
    "offer_address": "21 Elizabeth Avenue, Broadbeach, Queensland 4218, Australia",
    "percentage_discount": 68.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1049.0,
    "value": 3321.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bh6YEQAY",
    "hero_image": "https://images.luxuryescapes.com/ao8i1ctdtugbpifa2vio",
    "image_two": "https://images.luxuryescapes.com/piyjt4whzjlcnagonedw",
    "image_three": "https://images.luxuryescapes.com/phu4ir9bv3hzqd9u6kyc",
    "vendor_name": "Qube Broadbeach",
    "title": "Grand Opening: Luxury Apartments in the Heart of Broadbeach",
    "description": "Explore Queensland’s most famous beach town staying at Qube Resort - Broadbeach's newest property offering a collection of luxury apartments in an enviable location, steps away from the iconic Kurrawa Beach and dining and entertainment precinct. Stay in a brand-new, two bedroom self-contained apartment - perfect for four people - and enjoy access to premium Foxtel Platinum package, complimentary parking and unlimited, high-speed Wi-Fi.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Qube Resort Broadbeach 2019",
    "offer_address": "31 Queensland Ave",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 500.0,
    "value": 1017.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000KUd0PYAT",
    "hero_image": "https://images.luxuryescapes.com/5h7ea50mhqlm22s8msxi",
    "image_two": "https://images.luxuryescapes.com/ioee7ufwg4shdffywnj",
    "image_three": "https://images.luxuryescapes.com/n7ciynko4xniwr5fuqg",
    "vendor_name": "Peppers Broadbeach",
    "title": "Gold Coast Two-Bedroom Luxury Suites for Four Guests near Pacific Fair Shopping Centre & Kurrawa Beach",
    "description": "Soak up the Gold Coast’s beachside buzz at this sleek all-suite sanctuary rising above the action. Just steps from Kurrawa Beach and surrounded by Broadbeach’s top dining, shopping and entertainment, this coastal escape pairs laidback luxury with unbeatable convenience.\n\nSettle into your self-contained suite, with all the space and convenience of home. Then, step beyond the everyday with an impressive suite of facilities, including two fitness centres, two sparkling pools, a private cinema for nights in and a BBQ area perfect for balmy evenings.\n\nWhen it’s time to explore, you’re perfectly placed for the Gold Coast’s best. Stroll to The Star Gold Coast, Pacific Fair or hop on the nearby G:link tram to reach attractions across the region.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Peppers Broadbeach",
    "offer_address": "21 Elizabeth Avenue, Broadbeach, Queensland 4218, Australia",
    "percentage_discount": 73.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 879.0,
    "value": 3262.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CMzgeAAD",
    "hero_image": "https://images.luxuryescapes.com/tkohjlepck52uf0qw37",
    "image_two": "https://images.luxuryescapes.com/ev1bxxlxpya9pb04vbh9",
    "image_three": "https://images.luxuryescapes.com/ms0dufuedmck3clpyql",
    "vendor_name": "Sofitel Gold Coast Broadbeach",
    "title": "Extended by Popular Demand! Five-Star Sofitel Gold Coast Luxury with Ocean-View Upgrade, Daily Breakfast & Nightly Drinks",
    "description": "Spoil yourself with French-inspired luxury at the iconic Sofitel Gold Coast Broadbeach, just steps from the oceanfront and set among buzzing restaurants and boutiques. One of the most lavish hotels in the area, it combines chic, contemporary furnishings with French-inspired decor, mixed with the casual beach lifestyle for which the area is famous. Located right in the heart of cosmopolitan Broadbeach, you’ll be able to experience the best dining venues and entertainment - be it the famous Warner Bros. Movie World, Star Casino or the extravagant Pacific Fair Shopping Centre.\n\nThis dynamic hotel delivers outstanding service, along with the exquisite Room81 restaurant, two spectacular skyline swimming pools, a stylish bar and plenty more. A true laidback Broadbeach experience paired with elegant French luxury just moments from the sun-soaked beach, this escape is perfect for the ultimate romantic experience or a fun-filled family trip.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Sofitel Gold Coast Broadbeach",
    "offer_address": "81 Surf Parade, Broadbeach, Gold Coast, Queensland 4218, Australia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 511.0,
    "value": 1224.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000WKER7QAP",
    "hero_image": "https://images.luxuryescapes.com/wmwzz64mfsh4yts241ay",
    "image_two": "https://images.luxuryescapes.com/dmgdwrjqwrovvaeft2mu",
    "image_three": "https://images.luxuryescapes.com/ez6ljkm0jif7knauxzrr",
    "vendor_name": "Aria Apartments",
    "title": "Relaxing Gold Coast Apartment Stay in the Heart of Broadbeach",
    "description": "Explore Queensland's most famous beach town, staying at Aria Apartments, located in the heart of Gold Coast's iconic Broadbeach. Spend five nights in an ultra-modern Two-Bedroom Apartment, with space for a family of four or group of friends and myriad dining and entertainment options right at your door. Included in your escape is a bottle of wine and chocolates on arrival, an AU$30 dining voucher for the nearby Sage Café Restaurant & Pizzeria, beach towel hire for all guests and a guaranteed late 12pm check-out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Aria Apartments - Nov 2018",
    "offer_address": "19 Albert Avenue, Broadbeach",
    "percentage_discount": 43.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 553.0,
    "value": 965.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z0KHAAY",
    "hero_image": "https://images.luxuryescapes.com/u6bwv5yljnludnhg62y",
    "image_two": "https://images.luxuryescapes.com/2gsf0imarmqp6n0xqdo7",
    "image_three": "https://images.luxuryescapes.com/oy40hqqic89v99hks3zr",
    "vendor_name": "Sofitel Gold Coast Broadbeach",
    "title": "Five-Star Sofitel Gold Coast Luxury with Ocean-View Upgrade & Nightly Drinks",
    "description": "Indulge in French-inspired Sofitel luxury at this iconic Gold Coast hotel, nestled just steps from the oceanfront, restaurants and boutiques of popular Broadbeach. One of the most luxurious hotels in the area, Sofitel Gold Coast Broadbeach delivers outstanding service and a long list of state-of-the-art facilities including the award-winning restaurant Room81, two spectacular skyline swimming pools, a stylish bar and more.\n\nEnjoy an automatic upgrade to a luxurious Superior Ocean View Room with deluxe daily à la carte breakfast, a nightly drink per person, a cheese platter to share and a leisurely late 12pm checkout all included in your package.\n\n**Travelling with kids?** Two children (aged 11 years and under) stay free in a Family Ocean View Twin Room.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Sofitel Gold Coast Broadbeach",
    "offer_address": "81 Surf Parade, Broadbeach, Gold Coast, Queensland 4218, Australia",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 439.0,
    "value": 877.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004SnFMAA0",
    "hero_image": "https://images.luxuryescapes.com/ebtn0tm5ja3l6bq004gs",
    "image_two": "https://images.luxuryescapes.com/6j0at64fjehz601xgwl",
    "image_three": "https://images.luxuryescapes.com/vedtozrx0w6qrxowua4",
    "vendor_name": "Neptune Resort",
    "title": "Relaxing Broadbeach Apartment Escape",
    "description": "Embrace the coastal lifestyle with a sun-kissed escape to Neptune Resort Broadbeach, staying in a self-contained apartment with a fully equipped kitchen and private balcony, only moments from Pacific Fair Shopping Centre and the Gold Coast's glistening beachfront. Featuring a glorious heated pool and spa, tennis court, sauna and BBQ entertainment area, this relaxing resort offers everything you need for an idyllic couples' or family retreat, while also serving as the ideal launchpad for exploring the very best of Broadbeach and surrounds. \n\nTake a thrilling day trip to the Gold Coast's famous theme parks, shop 'til you drop at Broadbeach's premier shopping and dining destination, Pacific Fair or simply lap up the sea breeze from the sparkling sands of Kurrawa Beach - within a five-minute stroll of your apartment.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Neptune Resort Broadbeach",
    "offer_address": "32 Surf Parade, Broadbeach QLD 4218",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gw9gLAAR",
    "hero_image": "https://images.luxuryescapes.com/qgd6g6ju1al7kwf92r5n",
    "image_two": "https://images.luxuryescapes.com/xqe1ouux46wuexkml3qi",
    "image_three": "https://images.luxuryescapes.com/yywjyyazle7z3672iv4m",
    "vendor_name": "Peppers Broadbeach",
    "title": "Sparkling Broadbeach Suite Stay in Shopping & Dining Precinct with Pool, Sauna & Outdoor Spa",
    "description": "Embrace the easy-going glamour of the Gold Coast with a stay at Peppers Broadbeach. In the heart of Broadbeach's dining and shopping scene, just moments from the golden sands of Kurrawa Beach, this relaxing retreat offers stunning ocean views from each of the private balconies extending from the modern suites and apartments. Spend your days exploring the best local eats, spend an afternoon wandering the hotel's gardens, or take a dip in the pool followed by a sauna session.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Australia",
    "location_description": "Peppers Broadbeach",
    "offer_address": "21 Elizabeth Avenue, Broadbeach, Queensland 4218, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 157.0,
    "value": 157.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbsWCAAZ",
    "hero_image": "https://images.luxuryescapes.com/bund4x0uy9ail943vke",
    "image_two": "https://images.luxuryescapes.com/ggovd471joeim12pcql3",
    "image_three": "https://images.luxuryescapes.com/tyelcztoowinuat81yc",
    "vendor_name": "Sofitel Gold Coast Broadbeach",
    "title": "Elevated Sofitel Gold Coast Luxury Moments from Broadbeach with Resort-Style Pool",
    "description": "Spoil yourself with French-inspired luxury at this iconic Gold Coast hotel, just steps from the golden sands of Broadbeach and set among buzzing restaurants and boutiques. The five-star Sofitel Gold Coast Broadbeach delivers outstanding service and a long list of state-of-the-art facilities including the sophisticated Room81 restaurant, two spectacular rooftop swimming pools - one heated - a stylish bar and plenty more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Queensland",
    "location_description": "Sofitel Gold Coast Broadbeach",
    "offer_address": "81 Surf Parade, Broadbeach, Queensland 4218, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 92.0,
    "value": 92.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdejIAAR",
    "hero_image": "https://images.luxuryescapes.com/vqaazdd6bcevnmmscn6c",
    "image_two": "https://images.luxuryescapes.com/ee2gvb34navkqi5mej",
    "image_three": "https://images.luxuryescapes.com/nktn0lajlkvxzboa6kpo",
    "vendor_name": "Mantra Sierra Grand",
    "title": "Sky-High Oceanfront Broadbeach Apartment Stay with Two Serene Swimming Pools & In-House Theatre",
    "description": "Soar above the bustling heart of Broadbeach at this high-rise retreat, perfectly situated along the Gold Coast's pristine beaches. Soak up breathtaking ocean vistas from the comfort of your plush apartment, take a dip in the hotel's two sparkling pools or cosy up with a movie in the private theatre. Epic sunsets await at nearby Kurrawa and Mermaid Beach, while Queensland's largest shopping centre, Pacific Fair, is great for some retail therapy.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Australia",
    "location_description": "Mantra Sierra Grand Broadbeach",
    "offer_address": "22 Surf Parade, Broadbeach, Queensland, 4218, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 94.0,
    "value": 94.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRerlAAD",
    "hero_image": "https://images.luxuryescapes.com/xspw1jnt8cjjlotkif",
    "image_two": "https://images.luxuryescapes.com/dr8om86ny6yqbeurrcq",
    "image_three": "https://images.luxuryescapes.com/pc5gfb4hqghm434dp59",
    "vendor_name": "BreakFree Diamond Beach",
    "title": "Tropical Broadbeach Self-Contained Apartment Escape with Two Lagoon Pools, Playground & BBQ Facilities",
    "description": "Bask in the laidback charms of the Gold Coast with an idyllic apartment stay, perfect for families, situated mere moments from the powder-soft sands and blue waters of Broadbeach. Surrounded by lush tropical gardens, make a splash in the lagoon-style pools with cascading waterfalls while the kids take advantage of the wading pool and shaded play areas. Later, you can cook up a barbecue feast.\n\nAn ideal base for beach lovers, venture out and explore the local area, soak up the sun and indulge in water sports adventures. Plus, if you are in the mood for some retail therapy, stroll over to the Pacific Fair Shopping Centre and splurge away!",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Australia",
    "location_description": "BreakFree Diamond Beach Broadbeach",
    "offer_address": "10/16 Alexandra Ave, Broadbeach, Queensland, 4218, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 102.0,
    "value": 102.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdegrAAB",
    "hero_image": "https://images.luxuryescapes.com/wt4v98n8dmb8re5wmwri",
    "image_two": "https://images.luxuryescapes.com/w1rg5kkb5iw5zwa2ss8j",
    "image_three": "https://images.luxuryescapes.com/3j718z7gwb4431z3zt79",
    "vendor_name": "Mantra Broadbeach on the Park",
    "title": "Chic Broadbeach One-, Two- or Three- Bedroom Apartment Escape near Kurrawa Beach with Tranquil Outdoor Pool",
    "description": "Discover the glamour of the Gold Coast and indulge in a rejuvenating stay in the heart of Broadbeach. The hotel is a short stroll from the golden sands and surf-friendly waters of Kurrawa Beach and the vibrant dining scene of Oracle Boulevard. After days of exploration, take a dip in the outdoor pool or indulge in a workout at the fully equipped gym. Savour the spectacular skyline views from your private apartment balcony, or venture to the nearby Pacific Fair Shopping Centre.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Broadbeach",
    "location_subheading": "Australia",
    "location_description": "Mantra Broadbeach on the Park",
    "offer_address": "2685 Gold Coast Highway, Broadbeach , Queensland, 4218, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 90.0,
    "value": 90.0
  }
]