[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dfk9CAAR",
    "hero_image": "https://images.luxuryescapes.com/60omkco49aly6zt8vz0h",
    "image_two": "https://images.luxuryescapes.com/wscmcynbvjb03mtsn",
    "image_three": "https://images.luxuryescapes.com/t5q0mw1w4ssz9hxexgk",
    "vendor_name": "Splitters Farm",
    "title": "Family-Friendly Bundaberg Glamping with Breakfast Hamper & Farm Tour",
    "description": "Treat the family to a unique glamping experience at Splitters Farm, a peaceful property full of rescued farm animals. Located just a 15-minute drive from the historic sugar cane city of Bundaberg, this expansive 160-acre property is close enough to the action for you to explore the wider Bundaberg region and the Southern Great Barrier Reef, yet is remote enough for you to make the most of Queensland's rural beauty. Established in 2017, Splitters Farm is a playground for native species, such as wallabies, platypus and 150 documented varieties of Australian birdlife. During your stay, get up close and personal with the property’s furry residents, wandering through the farm on a self-guided tour and feeding the likes of friendly horses, goats and alpacas.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sharon",
    "location_heading": "Bundaberg",
    "location_subheading": "Queensland",
    "location_description": "Splitters Farm",
    "offer_address": "205 Blairs Road, Sharon, 4670, Queensland, Australia",
    "percentage_discount": 31.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 262.0,
    "value": 379.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gt1vAAA",
    "hero_image": "https://images.luxuryescapes.com/4t8j4m6kag4c8wro4nb",
    "image_two": "https://images.luxuryescapes.com/3xwfi72hic5qid4yzayh",
    "image_three": "https://images.luxuryescapes.com/fpz9ob2d4eom6d1lrwe",
    "vendor_name": "Splitters Farm",
    "title": "Family-Friendly Bundaberg Farm Glamping with Breakfast Hamper & Sparkling Wine",
    "description": "Treat the family to a unique glamping experience at Splitters Farm, a peaceful haven for rescued farm animals. Located just a 15-minute drive from the historic sugar cane city of Bundaberg, this gorgeous 160-acre property is close enough to the action for you to explore the wider Bundaberg region and the Southern Great Barrier Reef, yet is remote enough for you to truly immerse yourself in the rural beauty of Queensland. Established in 2017, Splitters Farm is a playground for native species, such as wallabies, platypus and 150 documented varieties of Australian birdlife, as well as a safe place for barnyard animals looking for a new home. During your stay, get up close and personal with the property’s furry residents, wandering through the farm on a self-guided tour and feeding friendly horses, goats, alpacas and more along the way.\n\nLuxury facilities in your two-bedroom glamping tent offer the best of both worlds - enjoy modern comforts, such as a private bathroom and full kitchen, combined with the magic of a striking stay amid the great outdoors. Spend your days exploring the property, then relax by your private fire pit at sunset with a glass of wine in hand.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sharon",
    "location_heading": "Bundaberg",
    "location_subheading": "Queensland",
    "location_description": "Splitters Farm",
    "offer_address": "205 Blairs Road, Sharon, 4670, Queensland, Australia",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 301.0,
    "value": 433.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PsFcAAK",
    "hero_image": "https://images.luxuryescapes.com/xr8mx7pi1r0ar373p0ga",
    "image_two": "https://images.luxuryescapes.com/l8n5eq7i2aaz7tc2d34d",
    "image_three": "https://images.luxuryescapes.com/09pgqtrm7l3bmai8a3y",
    "vendor_name": "Splitters Farm",
    "title": "Family-Friendly Bundaberg Farm Glamping with Breakfast Hamper & Sparkling Wine",
    "description": "Treat the family to a unique glamping experience at Splitters Farm, home to almost 400 rescue animals. Located just a 10-minute drive from the historic sugar cane city of Bundaberg, this gorgeous 160-acre property is close enough to the action for you to explore the wider Bundaberg region and the Southern Great Barrier Reef, but far enough away for you to truly immerse yourself in the rural beauty of Queensland. Since 2017, the property has been a haven for rescued farm animals and a playground for native species such as wallabies and platypus, plus over 150 documented varieties of Australian birdlife. Take a self-guided tour of the farm, feeding friendly horses, goats, alpacas and more along the way.\n\nLuxe facilities within your two-bedroom glamping tent offer the best of both worlds - enjoy modern comforts such as a private bathroom and full kitchen, combined with the magic of a striking stay amid the great outdoors. Spend your days exploring the property, then relax by your private fire pit at sunset with a glass of wine in hand.\n\n**Your handpicked inclusions**:\n\n- Indulge with a one-time breakfast hamper for four plus daily fresh bread\n- Arrive to a bottle of sparkling wine and a cheeseboard in your glamping tent\n- Get a taste for farm life on a self-guided tour with food for the animals\n- Stay nice and toasty with included wood to use in your private fire pit\n- Make the most of your stay with 1pm early check-in (subject to availability)\n\n**Travelling as a larger family?** Up to two additional guests (six total) may stay. See the package for extra guest surcharges.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sharon",
    "location_heading": "Bundaberg",
    "location_subheading": "Queensland",
    "location_description": "Splitters Farm",
    "offer_address": "205 Blairs Road, Sharon, 4670, Queensland, Australia",
    "percentage_discount": 19.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 285.0,
    "value": 353.0
  }
]