[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UIpTBQA1",
    "hero_image": "https://images.luxuryescapes.com/iafeokf4vrdzqyawwybe",
    "image_two": "https://images.luxuryescapes.com/im5rfktqtn5802pfoclt",
    "image_three": "https://images.luxuryescapes.com/j2yqqdlzd9kiksev15g0",
    "vendor_name": "Halcyon House",
    "title": "Boutique Waterfront Luxury in Cabarita Beach, NSW",
    "description": "Get a taste of the Mediterranean on the shores of Northern NSW at the designer Halcyon House - the highly acclaimed hotel that is quickly becoming one of Australia’s most talked about boutique beachfront escapes. Located on Cabarita Beach, the hotel is just two hours from Brisbane, 20 minutes from the Gold Coast airport and 30 minutes north of Byron Bay. Stay for two nights or take in the stunning stretch of coastline for a luxurious three nights as you enjoy daily à la carte breakfast, a two-course lunch at the hatted Paper Daisy, a bottle of prosecco upon arrival, a late checkout, spa treatment credit for each guest and much more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tweed Heads",
    "location_heading": "Cabarita Beach",
    "location_subheading": "New South Wales",
    "location_description": "Halcyon House 2018*",
    "offer_address": "21 Cypress Cres, Cabarita Beach NSW 2488",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 637.0,
    "value": 912.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cIw2lQAC",
    "hero_image": "https://images.luxuryescapes.com/yhlglbonadwsbdiqatr1",
    "image_two": "https://images.luxuryescapes.com/j77ka0kkl5ljlnginqj7",
    "image_three": "https://images.luxuryescapes.com/f8oay7qjubnjxwqq9hmb",
    "vendor_name": "Halcyon House",
    "title": "Boutique Waterfront Luxury with Exclusive Dining at Two-Hatted Restaurant Paper Daisy",
    "description": "Get a taste of the Mediterranean on the shores of Northern NSW at the designer Halcyon House - the highly acclaimed hotel that is quickly becoming one of Australia’s most talked about boutique beachfront escapes. Located on Cabarita Beach, the hotel is just two hours from Brisbane, 20 minutes from the Gold Coast airport and 30 minutes north of Byron Bay. Stay for two nights or take in the stunning stretch of coastline for a luxurious three nights as you enjoy daily à la carte breakfast, a chef’s plate lunch experience and a sumptuous four-course degustation dinner at the two-hatted Paper Daisy, a bottle of prosecco upon arrival, a late checkout, spa treatment credit for each guest and welcome drink on arrival.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tweed Heads",
    "location_heading": "Cabarita Beach",
    "location_subheading": "New South Wales",
    "location_description": "Halcyon House",
    "offer_address": "21 Cypress Cres, Cabarita Beach NSW 2488",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 633.0,
    "value": 1073.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DoducAAB",
    "hero_image": "https://images.luxuryescapes.com/5j0zx48tta06z8urhp56",
    "image_two": "https://images.luxuryescapes.com/80e5zqyo9gytyigllhe4",
    "image_three": "https://images.luxuryescapes.com/jyi4hyajetm0yiitar",
    "vendor_name": "The Beach Resort Cabarita",
    "title": "Sun-Kissed NSW Apartment Escape for up to Four Guests 30 minutes from Byron Bay with Direct Beach Access",
    "description": "Kick your feet up and enjoy a prime oceanfront position overlooking one of Australia’s most beautiful stretches of coast at The Beach Cabarita. Boasting beautifully designed and incredibly spacious two and three bedroom apartments, with a home-away-from-home atmosphere and room enough for you and your loved ones, experience the epitome of laid-back beach fun. With direct access to the sparkling shoreline, the location is ideal for ocean-lovers keen to spend warm days atop the sand and surf and exploring all that the Tweed and Byron Coasts have to offer.\n\nWhen a calm break from the roaring coastfront is needed, slip in to one of the resort's three sparkling pools - one of which is perfectly heated - and enjoy a swim sans waves, or spend an evening in the outdoor heated spa, reinvigorating your body after days spent on the sand. Take a walk around the breathtaking natural surrounds, or explore the vibrant coastal town's quirky boutiques, scrumptious cafes and fresh restaurants by foot with ease. Keep your beach body fit with access to the fully-equipped gym, or treat yourself to a signature facial at the spa in between fun-filled water activities.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tweed Heads",
    "location_heading": "Cabarita Beach",
    "location_subheading": "New South Wales",
    "location_description": "The Beach Cabarita",
    "offer_address": "2-6 Pandanus Parade, Cabarita Beach NSW 2488",
    "percentage_discount": 37.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 464.0,
    "value": 735.0
  }
]