[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gtS8AAI",
    "hero_image": "https://images.luxuryescapes.com/d8dwuu8raxxmfcb74dd",
    "image_two": "https://images.luxuryescapes.com/7woq3d92fkgj77lj75c",
    "image_three": "https://images.luxuryescapes.com/q56371hiedf49s8ztfm8",
    "vendor_name": "Six Senses Botanique",
    "title": "Six Senses Brazil Mountain Serenity near São Paulo",
    "description": "Connect with nature at the dreamy Six Senses Botanique, a hidden oasis within the luscious Brazilian rainforest. This idyllic retreat can be found at the confluence of three river valleys in the heart of the Mantiqueira Mountains, known as the 'mountains that weep' due to the abundance of freshwater springs and rivers nearby. It is here that you'll enjoy endless sun-kissed days embraced by rolling greenery and birdsong, integrating mountain serenity with signature Six Senses luxury and wellness.\n\nMake the most of your serene retreat by exploring the region's natural wonders. Relax by one of the property's seven glistening freshwater springs, go horseback riding or watch the birdlife. Later, recharge within the resort and make use of the luxurious facilities. Indulge at one of the exquisite restaurants - serving ingredients sourced from the organic garden onsite - dive into the sparkling outdoor mineral pool, curl up at the private cinema or treat yourself to a luxurious spa treatment. For an active escape, drop into the fitness centre or go hiking along the many trails that wrap around the resort.",
    "offer_country_name": "Brazil",
    "offer_country_code_alpha_2": "BR",
    "offer_geo_area_level_1": "Sao Paulo State",
    "offer_geo_area_level_2": "Campos do Jordao",
    "location_heading": "Campos Do Jordao",
    "location_subheading": "Sao Paulo",
    "location_description": "Six Senses Botanique",
    "offer_address": "R. Elídio Gonçalves da Silva, 4000 - Bairro dos Mellos, Campos do Jordão - SP, 12460-000, Brazil",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]