[
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037Jk9AAE",
    "hero_image": "https://images.luxuryescapes.com/bn0mg1ane2j3bwzk3s7",
    "image_two": "https://images.luxuryescapes.com/us3gex1hsq70kjrjcu6o",
    "image_three": "https://images.luxuryescapes.com/6d3z4vocnboef445v0hp",
    "vendor_name": "Nishi Apartments by Ovolo",
    "title": "Canberra Designer Ovolo Apartment Stay with Daily Breakfast",
    "description": "Indulge in contemporary designer style at its best with a stay in Canberra’s Nishi Apartments Eco-Living by Ovolo, housed in the artistic-inspired boutique hotel, Ovolo Nishi. Surrounded by trendy bars and glam restaurants within walking distance of the Australian War Memorial and Parliament House, this contemporary apartment escape invites you to dive into the rich culture and vibrant food scene of the new capital of cool.\n\nIndulge in sustainable luxury with a stay in a fully equipped apartment with kitchen and laundry facilities, daily continental plated breakfast, a welcome bottle of wine on arrival and guaranteed 12pm late checkout.\n\n**Travelling with family?** Upgrade to the spacious Two Bedder, featuring two beds for up to four guests.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Nishi Apartments Eco-Living by Ovolo.",
    "offer_address": "25 Edinburgh Ave, Canberra ACT 2601",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 240.0,
    "value": 421.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Hv2sIAC",
    "hero_image": "https://images.luxuryescapes.com/c428r8xf9bjfxr2ahhi",
    "image_two": "https://images.luxuryescapes.com/r7poth0rjq34czcykiyg",
    "image_three": "https://images.luxuryescapes.com/9e2o399xahezs5wrt8",
    "vendor_name": "Ramada by Wyndham Diplomat Hotel Canberra",
    "title": "Canberra City Break near Capital Hill & National Gallery of Australia with Daily Breakfast",
    "description": "Step into Canberra's vibrant culture and charm with a cosy stay at this hotel, located just a short drive from Capital Hill. Here, you'll be perfectly positioned to explore the best of the city: Old Parliament House and the famous Parliamentary Triangle are less than a 10-minute drive away, as are cultural must-sees such as the National Gallery of Australia, National Portrait Gallery and Australian War Memorial.\n\nAfter a day of sightseeing, savour delicious cuisine with a refreshing drink at the Diplomat Bar & Grill, or venture out to explore Canberra's offerings, from local favourites to national landmarks and even local tipples from the district's wine region.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ramada by Wyndham Diplomat Canberra",
    "offer_address": "2 Hely Street, Griffith, Australian Capital Territory, 2603, Australia",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 223.0,
    "value": 504.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GMog5AAD",
    "hero_image": "https://images.luxuryescapes.com/9fszg3h0a00atgjg50c",
    "image_two": "https://images.luxuryescapes.com/r712ndsefocq7cu8nu3w",
    "image_three": "https://images.luxuryescapes.com/bu3jlsem3gz4hev6nv9",
    "vendor_name": "QT Canberra",
    "title": "Elegant QT Escape in the Heart of Canberra with Daily Breakfast & Nightly Drinks",
    "description": "For a slice of cultural cool, discover your ultimate base for exploring Australia’s capital city at QT Canberra. With a unique architectural design fusing wooden beams, polished marble flooring and splashes of colourful decor, QT tips its hat to a city that needs no introduction. Cast your vote for a luxurious stay close to Molonglo River and experience an escape that places you within walking distance of stylish bars, restaurants, art galleries and Parliament House. After days spent exploring, retreat to your stylish abode in the heart of the NewActon precinct and feast on innovative Italian delights at Capitol Bar & Grill, a must for dining during your stay.\n\nStepping out of the hotel has you in the centre of all things most-loved about Canberra. The buzzing Kingston Foreshore is the place to be on a summer day, where you can hop between bars and restaurants while enjoying the lakeside views, and it's only a 10-minute drive away. Detour past the Australian War Memorial for a heartfelt look into the country's past, and for arguably the best view of Canberra, head straight down Anzac Parade, across Lake Burley Griffin, and over to Old Parliament House.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "QT Canberra",
    "offer_address": "1 London Circuit, Canberra 2601, Australian Capital Territory, Australia",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 239.0,
    "value": 502.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EDEKoAAP",
    "hero_image": "https://images.luxuryescapes.com/zue035wl6er8scz4t2kd",
    "image_two": "https://images.luxuryescapes.com/csbz5f84ry40786w8x",
    "image_three": "https://images.luxuryescapes.com/0f428uuzysov2es53hfu",
    "vendor_name": "A by Adina, Canberra",
    "title": "Contemporary Canberra Apartments in the Heart of the CBD with A$100 Dining Credit",
    "description": "Live the A-list life in Canberra's bustling CBD with an ultra-sleek apartment stay at A by Adina Canberra. A collection of glossy studios and self-contained apartments designed by award-winning architects at Bates Smart, this modern, sustainably-built property features everything you need for a comfortable Canberra escape. Rooms are decked out with kitchenettes, Nespresso coffee machines, and personal touches including designer Hunter Lab bathroom amenities and signature Dreamcatcher bedding. The perfect retreat after a day exploring the nation’s capital, you'll also find Such & Such restaurant, Mu Omakase and The Meat & Wine Co., all renowned as some of the city's finest dining establishments.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "A by Adina Canberra",
    "offer_address": "1 Constitution Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 294.0,
    "value": 630.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y27hMQAR",
    "hero_image": "https://images.luxuryescapes.com/ayhec11zaxjbwe3huqun",
    "image_two": "https://images.luxuryescapes.com/xrusdawhh0ntdy26hlzt",
    "image_three": "https://images.luxuryescapes.com/slqwvkf0fv8lpa11fjsw",
    "vendor_name": "Hotel Kurrajong Canberra",
    "title": "Heritage Stay in One of the World’s Hottest Cities for 2018",
    "description": "Discover the art, culture and heritage of Canberra - hotly tipped by Lonely Planet as one of the world’s top cities to visit in 2018 - staying at Hotel Kurrajong Canberra. This historic hotel, which dates back to 1926, was designed by the architect behind Old Parliament House and was once home to Prime Minister Ben Chifley. Your escape includes daily buffet breakfast, convenient late checkout at 12pm, an AU$25 food credit for the Chifley Bar & Grill and premium Wi-Fi throughout your stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Hotel Kurrajong Canberra",
    "offer_address": "8 National Circuit, Barton, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 202.0,
    "value": 650.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JAbMIAW",
    "hero_image": "https://images.luxuryescapes.com/wzj4a3uqacusfcp8oqxr",
    "image_two": "https://images.luxuryescapes.com/exru9ajc9b3fm2r9jvoh",
    "image_three": "https://images.luxuryescapes.com/gmu0emw4ovvblnhypc1i",
    "vendor_name": "Mercure Canberra",
    "title": "Heritage-Listed Canberra Inner North Escape near War Memorial with Daily Breakfast",
    "description": "Soak up Canberra’s impressive cultural experiences, top-notch restaurants and burgeoning art scene with a central city stay at this welcoming heritage-listed hotel. Originally opened in 1927 and listed on the Register of the National Estate, the Mercure Canberra is part of the capital's rich history.\n\nUse this conveniently located abode, on the fringe of the CBD and vibrant Braddon precinct, as your home base while exploring treasures like the Australian War Memorial or Old Parliament House. Boasting outstanding service, superb old-world charm and a welcoming atmosphere, guests of this iconic Canberra institution are guaranteed a relaxing retreat.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Mercure Canberra",
    "offer_address": "Corner of Ainslie and Limestone Avenue, Braddon 2612, ACT",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 189.0,
    "value": 379.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuzPpAAJ",
    "hero_image": "https://images.luxuryescapes.com/wpe00flpe0jx8k5y2i8se",
    "image_two": "https://images.luxuryescapes.com/nporrddjdoizdyqlnpg",
    "image_three": "https://images.luxuryescapes.com/5dw6cek1unqtx1w4ul",
    "vendor_name": "Jamala Wildlife Lodge",
    "title": "Five-Star Canberra Wildlife Lodge Stay with Daily Breakfast & Dinner, Guided Safari & Animal Experiences",
    "description": "Creature comfort takes on new meaning with a stay alongside some of the world's most majestic animals with a five-star stay within Canberra's National Zoo & Aquarium. Go where the wild things are and stay in safari-style lodge accommodation, offering views over the enclosures or pristine nature.\n\nEnjoy an included animal encounter, which could involve meeting a tiger, lion or hyena, having an owl perch on your arm or hanging out with playful meerkats (please note that personal choices and preferences cannot be accommodated).\n\nJamala Wildlife Lodge is so much more than a once-in-a-lifetime stay; it's an invitation to learn more about the importance of wildlife conservation. As a member of the Zoo and Aquarium Association, proudly accredited under their Animal Welfare program, this incredible lodge aims to raise funds that help the zoo and aquarium grow and support its breeding programs.\n\nAnimal welfare is one of the top priorities and animals have the option to be near the room or far away and out of sight. This incredible lodge simply affords you the bucket-list opportunity to stay in opulent surroundings and gain a fascinating insight into the National Zoo & Aquarium's incredible wildlife.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Jamala Wildlife Lodge",
    "offer_address": "National Zoo & Aquarium, 999 Lady Denman Drive, Canberra, Australian Capital Territory 2611, Australia",
    "percentage_discount": 23.0,
    "min_duration": 1,
    "max_duration": 8,
    "price": 929.0,
    "value": 1209.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zJ7KAAU",
    "hero_image": "https://images.luxuryescapes.com/chj87w1x3dheddprcszf",
    "image_two": "https://images.luxuryescapes.com/dlifx3wfdk8xwjdnb3wo",
    "image_three": "https://images.luxuryescapes.com/laxlfa4zqqyozfe9979",
    "vendor_name": "Hyatt Hotel Canberra - A Park Hyatt Hotel",
    "title": "Five-Star Heritage Hyatt Canberra Break with Daily Breakfast",
    "description": "Dive into the rich culture and vibrant food scene of Canberra with an upscale stay close to all the city has to offer. Discover the charming beauty of Australia’s capital staying at the Hyatt Hotel Canberra - A Park Hyatt Hotel, a luxurious 1920s-style property within walking distance of the National Gallery of Australia.\n\nEnjoy daily breakfast, a bottle of wine on arrival, 10% discount on food and drinks at the hotel's restaurants and bars and a convenient 12pm checkout, allowing you to make the most of your final morning.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Hyatt Hotel Canberra - A Park Hyatt Hotel",
    "offer_address": "120 Commonwealth Ave, Yarralumla ACT 2600",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 269.0,
    "value": 512.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006RNYaAAO",
    "hero_image": "https://images.luxuryescapes.com/2vk75k95urzu0ox5b2z",
    "image_two": "https://images.luxuryescapes.com/y0xsieo4vp8lsqdvhph",
    "image_three": "https://images.luxuryescapes.com/umdm5rwcdw0edhgukdpp",
    "vendor_name": "Mercure Canberra",
    "title": "Heritage-Listed Mercure Canberra Escape with Room Upgrade & Daily Buffet Breakfast",
    "description": "Soak up Canberra’s impressive cultural experiences, top-notch restaurants and burgeoning art scene with a central city stay at the beautiful Mercure Canberra, a heritage-listed property set amid a lush, landscaped garden, just moments from the CBD and vibrant NewActon precinct. Opened in 1927 and listed on the Register of the National Estate, Mecure Canberra is part of the city's rich history. Use this conveniently located hotel as your base for exploring the very best of the city's iconic monuments, including the National Gallery of Australia, Old Parliament House, Mount Ainslie and the Australian War Memorial.\n\nEnjoy outstanding service, superb old-world charm and a welcoming atmosphere as days are spent exploring the country’s underrated capital, tasting gourmet food or simply relaxing in your comfortable room. This charming retreat also features a family-friendly courtyard restaurant and sleek bistro with a beer garden overlooking Mount Ainslie, a fitness centre and secure car parking.\n\n**Your handpicked inclusions:**\n\n- Enjoy a complimentary upgrade from a Standard Queen Room to a Superior King Room\n- Indulge in a delicious daily buffet breakfast served in the Courtyard Restaurant\n- Toast your escape with a welcome drink per person on arrival\n- Make the most of self-parking for one vehicle throughout your stay\n- Stay in and relax with complimentary in-room movies\n\n**Travelling with family?** Choose the Deluxe Loft, a spacious, split-level retreat for up to two adults and two children (11 years and under).\n\n**This deal has NO peak surcharges**: Travel any time, including school holidays, for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Mercure Canberra Feb 22",
    "offer_address": "Corner of Ainslie & Limestone Ave, Braddon ACT 2612",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 185.0,
    "value": 298.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DpmG1YAJ",
    "hero_image": "https://images.luxuryescapes.com/wtaivgpfgv2j1m48zzq7",
    "image_two": "https://images.luxuryescapes.com/jpjpcm0my55098wd01wk",
    "image_three": "https://images.luxuryescapes.com/3co75oe7yivr44wf1tg",
    "vendor_name": "A by Adina, Canberra",
    "title": "Contemporary Canberra Studios & Apartments in Parliament Triangle with A$50 Minibar Credit & Parking",
    "description": "Live the A-list life in Canberra's bustling CBD with an ultra-sleek apartment stay at A by Adina Canberra. A collection of glossy studios and self-contained apartments designed by award-winning architects at Bates Smart, this modern, sustainably-built property features everything you need for a comfortable Canberra escape.\n\nRooms are decked out with personal touches including designer Hunter Lab bathroom amenities and signature Dreamcatcher bedding. The perfect retreat after a day exploring the nation’s capital, you'll also find Such & Such restaurant, Mu Omakase and The Meat & Wine Co., all renowned as some of the city's finest dining establishments.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "A by Adina Canberra",
    "offer_address": "1 Constitution Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 249.0,
    "value": 611.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FcL7CAAV",
    "hero_image": "https://images.luxuryescapes.com/ru5pb06t6r0bbyh79jzm",
    "image_two": "https://images.luxuryescapes.com/k59gmezhpktpk9vohegp",
    "image_three": "https://images.luxuryescapes.com/rjlueq2hj4tp9x1xlgxj",
    "vendor_name": "Nishi Apartments by Ovolo",
    "title": "Ultra-Modern Ovolo Canberra Designer Apartments with Daily Breakfast",
    "description": "Experience modern designer style and eco-living at its finest with a stay in Canberra’s Nishi Eco-Living Apartments by Ovolo, housed in the artist-inspired boutique hotel, Ovolo Nishi. This contemporary escape invites you to dive into the rich culture and vibrant food scene of the new capital of cool from one of Canberra’s most inspiring precincts: NewActon. You’ll be surrounded by trendy bars, art galleries and quirky entertainment venues, while being within easy reach of the Australian War Memorial, Parliament House and the sparkling Lake Burley Griffin.\n\nWhen you are ready to relax, retreat to one of Nishi Apartments by Ovolo to discover sophisticated and effortlessly cool spaces. Outside your door, explore lavish facilities such as the all-vegetarian Monster Kitchen and Bar, a fully-equipped fitness centre and a vibrant art library perfect for curling up with a good book.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Nishi Apartments Eco-Living by Ovolo",
    "offer_address": "25 Edinburgh Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 299.0,
    "value": 587.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bhhmVQAQ",
    "hero_image": "https://images.luxuryescapes.com/vbadwnp47fspyf6wh0va",
    "image_two": "https://images.luxuryescapes.com/tphyw4oftza9e5pgrmev",
    "image_three": "https://images.luxuryescapes.com/nvz5ycdit8lqeky87zvi",
    "vendor_name": "Abode Murrumbateman",
    "title": "Stylish Stay in the Heart of Canberra’s Wine Country",
    "description": "Discover Canberra’s wine country in style with a stay at the chic Abode Murrumbateman. Surrounded by world-class wineries and just a few minutes’ walk from local farmers markets, bakeries, cafés and parks, it’s the ideal location for a quick getaway. Enjoy a bottle of wine on arrival and an AU$10 credit to spend at the Abode Pantry shop, with a Breakfast Upgrade package also available.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Murrumbateman",
    "location_heading": "Canberra",
    "location_subheading": "Australia",
    "location_description": "Abode Murrumbateman - May 19",
    "offer_address": "57 Rose St, Murrumbateman NSW 2582",
    "percentage_discount": 61.0,
    "min_duration": 1,
    "max_duration": 2,
    "price": 69.0,
    "value": 178.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EcEMAA0",
    "hero_image": "https://images.luxuryescapes.com/8lfzhuycwe102z9lwhk7",
    "image_two": "https://images.luxuryescapes.com/ifgmy2i7nqvqn69lxapc",
    "image_three": "https://images.luxuryescapes.com/uecb81nj9nperhekoc7",
    "vendor_name": "Ovolo Nishi",
    "title": "Designer Canberra Break with Daily Minibar & Nightly Drinks",
    "description": "Indulge in stylish urban luxury with a boutique stay at the coolest designer hotel in Canberra, Ovolo Nishi. Dive into the rich culture and food scene of Australia's vibrant capital with an upscale stay close to all the city has to offer, from museums to galleries and historic sites.\n\nEnjoy a daily continental breakfast box delivered to your room, evening social hour with a glass of wine or beer each and bar nibbles, a complimentary in-room minibar replenished daily, a complimentary lolly and water station in the lobby, a welcome loot bag with surprise snacks in-room, leisurely late 12pm checkout and daily bike hire to help you explore the city.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Ovolo Nishi - June 20",
    "offer_address": "NewActon Precinct, 25 Edinburgh Ave, Canberra, Canberra ACT 2601",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 239.0,
    "value": 420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aiPMmQAM",
    "hero_image": "https://images.luxuryescapes.com/tssljqdjiltbjutzpzp2",
    "image_two": "https://images.luxuryescapes.com/zqnapbtrtv3k0yiutstw",
    "image_three": "https://images.luxuryescapes.com/smpzmvhbub2yrtcvjoir",
    "vendor_name": "Hotel Realm",
    "title": "Five-Star Weekend in the Capital",
    "description": "Indulge in a stylish weekend escape to the national capital of Australia at the five-star Hotel Realm, located in a cosmopolitan food and beverage precinct and within walking distance of the National Gallery of Australia. Included is a daily buffet breakfast for two, a bottle of wine on arrival and a leisurely late 2pm check-out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Hotel Realm",
    "offer_address": "18 National Circuit, Canberra ACT 2600",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 230.0,
    "value": 625.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbIj9AAF",
    "hero_image": "https://images.luxuryescapes.com/r1kh56kt03btgh4fu",
    "image_two": "https://images.luxuryescapes.com/91daqm82ltc3e87va72",
    "image_three": "https://images.luxuryescapes.com/h2u1mcy4tfk08nzmyn3",
    "vendor_name": "Novotel Canberra",
    "title": "Central Canberra CBD Stay with Daily Breakfast & Welcome Drink",
    "description": "Experience Australia's intimate and cultural capital city with a central stay at this contemporary retreat, located just steps from the lively dining scene in Braddon and shopping at Canberra Centre.\n\nWith the city's vibrant dining scene, boutique shopping and picturesque Lake Burley Griffin within walking distance, you won't run out of things to do during your stay. After a day of exploring, stop by the hotel's indoor heated pool for a refreshing dip, relax and unwind in the sauna or work up a sweat in the fitness centre. End the day with a sumptuous meal at the First Edition restaurant and bar, where you can indulge in locally sourced dishes and a selection of drinks.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Novotel Canberra",
    "offer_address": "65 Northbourne Avenue, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 209.0,
    "value": 410.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GlIRAA0",
    "hero_image": "https://images.luxuryescapes.com/4m93npaxdew77gqhu8a",
    "image_two": "https://images.luxuryescapes.com/m7fn0dp2n946648m5hh",
    "image_three": "https://images.luxuryescapes.com/6tnvr0ktow6z4m3mt9w",
    "vendor_name": "Peppers Gallery Hotel Canberra",
    "title": "Elegant Peppers Canberra Escape with Daily Breakfast, Dining Credit & Winery Experience",
    "description": "Tucked away in the new capital of cool amid the NewActon precinct's stylish bars, glam restaurants, hip cinemas and quirky entertainment venues, Peppers Gallery Hotel Canberra sets the standard for pure Peppers indulgence. The hotel's unique 'gallery' theme ensures a one-of-a-kind stay, with a sculpture garden that spills into the foyer, wall hangings and art installations that turn corridors into creative spaces.\n\nTake in the full Canberra experience with tailored culinary moments and immersive cultural experiences on your doorstep, with your hotel located near Lake Burley Griffin and within walking distance of Parliament House, or indulge in a bespoke gourmet experience at the hotel's renowned Canberra institution, the acclaimed Italian trattoria Bicicletta.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Peppers Gallery Hotel Canberra",
    "offer_address": "15 Edinburgh Avenue, Canberra 2601, ACT",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 197.0,
    "value": 554.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GMLCfYAP",
    "hero_image": "https://images.luxuryescapes.com/kavwi54orb965hxublrj",
    "image_two": "https://images.luxuryescapes.com/w9dy6zfnmr6ne9v2v7f",
    "image_three": "https://images.luxuryescapes.com/k3be5aehx9s8ut4f5d8w",
    "vendor_name": "Midnight Hotel, Autograph Collection",
    "title": "Sophisticated Canberra Stay near Lonsdale Street with Daily Breakfast, Nightly Drinks & A$50 Dining Credit",
    "description": "Discover Australia’s capital of cool in unrivalled comfort with this boutique five-star stay. Inspired by the provocative midnight hour - beloved by creatives and night owls - this sophisticated inner-city haven balances modernist flourishes and personal touches alike to provide moments of serenity in the heart of Braddon, Canberra’s ever-evolving culture and dining precinct. \n\nHead to onsite eatery Braddon Merchant for market-fresh Australian plates designed to share, paired with a superb wine list - or savour a well-deserved nightcap at Midnight Bar.\n\nWith easy access to the light rail and Northbourne Avenue, exploring Canberra’s best is a breeze - head out to discover Lake Burley Griffin, the National Zoo and Aquarium, Parliament House and the Australian War Memorial. Lonsdale Street, with its trendy boutiques, bars and cafes, is only a block away. \n\nReturn to Midnight Hotel, a member of Marriott’s prestigious Autograph Collection, and check out the spectacular wellness centre, featuring a fully equipped gym and atmospheric pool overlooking the courtyard, or get cozy by the fire in the designer-furnished lobby.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Midnight Hotel, Autograph Collection",
    "offer_address": "1 Elouera Street, Braddon, Australian Capital Territory 2612, Australia",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 299.0,
    "value": 556.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ie5rbAAB",
    "hero_image": "https://images.luxuryescapes.com/8ygyczvuonxu3ev2mu5",
    "image_two": "https://images.luxuryescapes.com/v1qsims94ll3y9226akf",
    "image_three": "https://images.luxuryescapes.com/4heez48nynl1vp28e4i",
    "vendor_name": "Midnight Hotel, Autograph Collection",
    "title": "Sophisticated Canberra Stay near Lonsdale Street with Daily Breakfast, Nightly Drinks & A$50 Dining Credit",
    "description": "Discover Australia’s capital of cool in unrivalled comfort with this boutique five-star stay. Inspired by the provocative midnight hour - beloved by creatives and night owls - this sophisticated inner-city haven balances modernist flourishes and personal touches alike to provide moments of serenity in the heart of Braddon, Canberra’s ever-evolving culture and dining precinct. Head to onsite eatery Braddon Merchant for market-fresh Australian plates designed to share, paired with a superb wine list - or savour a well-deserved nightcap at Midnight Bar.\n\nWith easy access to the light rail and Northbourne Avenue, exploring Canberra’s best is a breeze - head out to discover Lake Burley Griffin, the National Zoo and Aquarium, Parliament House and the Australian War Memorial. Lonsdale Street, with its trendy boutiques, bars and cafes, is only a block away. Return to Midnight Hotel, a member of Marriott’s prestigious Autograph Collection, and check out the spectacular wellness centre, featuring a fully equipped gym and atmospheric pool overlooking the courtyard, or get cozy by the fire in the designer-furnished lobby.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Midnight Hotel, Autograph Collection",
    "offer_address": "1 Elouera Street, Braddon, Australian Capital Territory 2612, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 299.0,
    "value": 592.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CJpKuYAL",
    "hero_image": "https://images.luxuryescapes.com/94i57zor881eps2ol4g",
    "image_two": "https://images.luxuryescapes.com/6gpyjfhuv9ui6fqzjvcm",
    "image_three": "https://images.luxuryescapes.com/vt2msyov98tq9mnwi7hl",
    "vendor_name": "Rydges Canberra",
    "title": "Canberra Stay near Parliament House with Daily Breakfast, A$50 Dining Credit & Parking",
    "description": "Escape to the heart of Canberra, where a stay near the iconic Parliamentary Triangle awaits. Nestled in the exclusive Forrest neighbourhood, you'll be immersed in the city's vibrant cafe and dining scene while enjoying the comfort of a spacious, contemporary room.\n\nStep out to discover the country's history, with top attractions such as Parliament House, the National Gallery of Australia and the National Portrait Gallery all within close reach. After a day of adventure, return to secure underground parking with unlimited access, then unwind at The George Bar & Grill with a signature cocktail or indulge in the region's finest cuisine using your A$50 dining credit.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Rydges Canberra",
    "offer_address": "17 Canberra Avenue, Forrest, Canberra, Australian Capital Territory 2603, Australia",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 219.0,
    "value": 462.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IUEfuYAH",
    "hero_image": "https://images.luxuryescapes.com/gr3wudfdcszz5knz9g6p",
    "image_two": "https://images.luxuryescapes.com/yx6fqh1vrgmuhe41khlci",
    "image_three": "https://images.luxuryescapes.com/bk90zfvabi0h5cqhqm5m",
    "vendor_name": "Mercure Canberra",
    "title": "Heritage-Listed Canberra City Escape Steps from City Centre with Daily Breakfast",
    "description": "Soak up Canberra’s impressive cultural experiences, top-notch restaurants and burgeoning art scene with a central city stay at this welcoming heritage-listed hotel. Originally opened in 1927 and listed on the Register of the National Estate, the Mercure Canberra is part of the capital's rich history.\n\nUse this conveniently located abode as your home base while exploring treasures like the Australian War Memorial or Old Parliament House. Boasting outstanding service, superb old-world charm and a welcoming atmosphere, guests of this iconic Canberra institution are guaranteed a relaxing retreat.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Mercure Canberra",
    "offer_address": "Corner of Ainslie and Limestone Avenue, Braddon 2612, ACT",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 159.0,
    "value": 298.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GubBhAAJ",
    "hero_image": "https://images.luxuryescapes.com/aopdowq2z9hoi83fhpdk",
    "image_two": "https://images.luxuryescapes.com/mwsv9icx2c8hn718qqg",
    "image_three": "https://images.luxuryescapes.com/cldtppu3xnpa7i154n6s",
    "vendor_name": "Peppers Gallery Hotel Canberra",
    "title": "Elegant Central Canberra Escape with Daily Breakfast, Nightly Drinks & Dining Credit",
    "description": "Tucked away amid the NewActon precinct's stylish bars, glam restaurants and quirky entertainment venues, Canberra’s hidden gem sets the standard for pure indulgence. Peppers Gallery Hotel Canberra’s unique 'gallery' theme ensures a one-of-a-kind stay, with a sculpture garden that spills into the foyer, wall hangings and art installations that turn corridors into creative spaces.\n\nTake in the full Canberra experience with tailored culinary moments and immersive cultural experiences on your doorstep, with your hotel located near Lake Burley Griffin and within walking distance of Parliament House. Indulge in a bespoke gourmet experience at the hotel's renowned Canberra institution, the acclaimed Italian trattoria, Bicicletta.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Peppers Gallery Hotel Canberra",
    "offer_address": "15 Edinburgh Avenue, Canberra 2601, ACT",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 209.0,
    "value": 451.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006C6cqAAC",
    "hero_image": "https://images.luxuryescapes.com/pml548cq39ej0vc7xhda",
    "image_two": "https://images.luxuryescapes.com/bpi6w0udivoe167tqy00i",
    "image_three": "https://images.luxuryescapes.com/goaiulnxzkm93fm2n9ee",
    "vendor_name": "Ovolo Nishi",
    "title": "Canberra Ovolo Designer Break with Daily Breakfast, Nightly Drinks & Complimentary Minibar",
    "description": "Indulge in urban luxury with a boutique stay at the most stylish designer hotel in Canberra, Ovolo Nishi. Nestled in the contemporary NewActon hub - amid popular bars, glam restaurants and a selection of unique art galleries, hip cinemas and quirky entertainment venues - this uber-cool hotel puts you within a stone's throw of Canberra's icons, including Parliament House.\n\nEnjoy innovative dining at the award-winning onsite Monster Kitchen and Bar and take the hotel's complimentary bicycles for a spin to discover the surrounding delights of Australia's capital. Sweet tooths will delight in a help-yourself lolly bar, while a 24-hour gym and self-service laundry facilities make your stay ultra convenient.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ovolo Nishi",
    "offer_address": "NewActon Precinct, 25 Edinburgh Avenue, Canberra, 2601, Australian Capital Territory, Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 262.0,
    "value": 464.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hptiAAA",
    "hero_image": "https://images.luxuryescapes.com/jokz3avh8chknkhr6gkn",
    "image_two": "https://images.luxuryescapes.com/cpmwb0m281th7wo4hf6",
    "image_three": "https://images.luxuryescapes.com/oyjyj9s9n8sawl76mho",
    "vendor_name": "Hotel Kurrajong Canberra",
    "title": "Heritage Art Deco Canberra Luxury with Daily Breakfast",
    "description": "Discover the culture and heritage of Australia's capital staying at the Art Deco-style Hotel Kurrajong Canberra. A city that has recently reinvented itself from political capital to cultural hotspot, Canberra is brimming with world-class museums, high-end restaurants and trendy speakeasies and bars. The hotel is ideally positioned to discover it all, just a short stroll from Parliament House, the National Gallery of Australia and Lake Burley Griffin.\n\nIn between bouts of exploration, return to Hotel Kurrajong Canberra to recharge your batteries - being sure to wine and dine at the onsite Chifley’s Bar & Grill.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Hotel Kurrajong Canberra",
    "offer_address": "8 National Circuit, Barton, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 267.0,
    "value": 493.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FiL49AAF",
    "hero_image": "https://images.luxuryescapes.com/qf38kanul7b5oifc886",
    "image_two": "https://images.luxuryescapes.com/66vivimrttz0mioiw8q",
    "image_three": "https://images.luxuryescapes.com/tq8tax6p1nn09zyvipg",
    "vendor_name": "Midnight Hotel, Autograph Collection",
    "title": "Sophisticated Canberra Stay near Lonsdale Street with Daily Breakfast, Complimentary Minibar & A$50 Dining Credit",
    "description": "Discover Australia’s capital of cool in unrivalled comfort with a boutique five-star stay at Midnight Hotel, a member of Marriott’s prestigious Autograph Collection. Inspired by the provocative midnight hour - beloved by creatives and night owls - this sophisticated inner-city haven balances modernist flourishes and personal touches alike to provide moments of serenity in the heart of Braddon, Canberra’s ever-evolving culture and dining precinct. Head to onsite eatery Braddon Merchant for market-fresh Australian plates designed to share, paired with a superb wine list - or savour a well-deserved nightcap at Midnight Bar.\n\nWith easy access to the light rail and Northbourne Avenue, exploring Canberra’s best is a breeze - head out to discover Lake Burley Griffin, the National Zoo and Aquarium, Parliament House and the Australian War Memorial. Lonsdale Street, with its trendy boutiques, bars and cafes, is only a block away. Return to Midnight Hotel, Autograph Collection’s spectacular wellness centre, featuring a fully equipped gym and atmospheric pool overlooking the courtyard, or to a cozy spot by the fire in the designer-furnished lobby.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Midnight Hotel, Autograph Collection",
    "offer_address": "1 Elouera Street, Braddon, Australian Capital Territory 2612, Australia",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 324.0,
    "value": 546.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbIfCAAV",
    "hero_image": "https://images.luxuryescapes.com/ojr5w8z6b8l54kg5xhiu",
    "image_two": "https://images.luxuryescapes.com/lhze3x0tegvorsjz3fn",
    "image_three": "https://images.luxuryescapes.com/pdicelay83vuv4j9ukd7",
    "vendor_name": "Mercure Canberra",
    "title": "Heritage-Listed Mercure Canberra Escape with Daily Breakfast",
    "description": "Soak up Canberra’s impressive cultural experiences, top-notch restaurants and burgeoning art scene with a central city stay at this welcoming heritage-listed hotel. Originally opened in 1927 and listed on the Register of the National Estate, the Mercure Canberra is part of the capital's rich history. \n\nUse this conveniently located abode, mere moments from the CBD and vibrant New Acton precinct, as your home base while exploring treasures like the National Gallery of Australia or Old Parliament House. Boasting outstanding service, superb old-world charm and a welcoming atmosphere, guests of this iconic Canberra institution are guaranteed a relaxing retreat.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Mercure Canberra",
    "offer_address": "Corner of Ainslie and Limestone Avenue, Braddon 2612, ACT",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 17,
    "price": 179.0,
    "value": 305.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GwsfmAAB",
    "hero_image": "https://images.luxuryescapes.com/is0fuyldtuf003jajl6",
    "image_two": "https://images.luxuryescapes.com/unaar6smmm9voa1ua4b9",
    "image_three": "https://images.luxuryescapes.com/uwlkd4ff5aytgziglve",
    "vendor_name": "Nishi Apartments by Ovolo",
    "title": "Ultra-Modern Ovolo Canberra Designer One- & Two-Bedroom Apartments with Daily Breakfast",
    "description": "Experience modern style and eco-living at its finest with an eco-living retreat housed in an artist-inspired boutique hotel. This contemporary escape invites you to dive into the rich culture and vibrant food scene of the new capital of cool from one of Canberra’s most inspiring precincts: NewActon. You’ll be surrounded by trendy bars, art galleries and quirky entertainment venues, while being within easy reach of the Australian War Memorial, Parliament House and the sparkling Lake Burley Griffin. Explore lavish facilities such as the all-vegetarian Monster kitchen and bar, a fully-equipped fitness centre and a vibrant art library perfect for curling up with a good book.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Nishi Apartments Eco-Living by Ovolo",
    "offer_address": "25 Edinburgh Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 299.0,
    "value": 587.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DA7woYAD",
    "hero_image": "https://images.luxuryescapes.com/6akatnaif9tc1yniyms",
    "image_two": "https://images.luxuryescapes.com/4wbxmrm93afqh8x4hajl",
    "image_three": "https://images.luxuryescapes.com/eo1lrkw4oofy3ovea1c",
    "vendor_name": "Hotel Kurrajong Canberra",
    "title": "Canberra Heritage Art Deco Glamour near Parliament House with Daily Breakfast",
    "description": "Immerse yourself in a harmonious blend of vintage Australian charm and modern elegance at this Art Deco-inspired retreat. Nestled in the heart of the nation's capital, this esteemed property offers the ideal base for exploring Canberra - a city that seamlessly evolves from a political epicentre to a cultural hotspot.\n\nOriginally opened in 1926, this heritage-listed masterpiece was designed by the esteemed architect John Smith Murdoch, who also crafted Old Parliament House. Conveniently located, the hotel is just a short stroll from iconic Australian landmarks such as Parliament House, the National Gallery of Australia and the serene Lake Burley Griffin.\n\nAfter a day of discovery, return to the hotel for a refined and relaxing escape. Savour an unforgettable meal at the acclaimed Chifley’s Bar & Grill, or unwind in your elegantly appointed room.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Hotel Kurrajong Canberra",
    "offer_address": "8 National Circuit, Barton, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 229.0,
    "value": 455.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000crPtVQAU",
    "hero_image": "https://images.luxuryescapes.com/j7qzaejifrgnw3b4lprq",
    "image_two": "https://images.luxuryescapes.com/zurueaxbjgzksa9lpx",
    "image_three": "https://images.luxuryescapes.com/s8r4w8mjo88r1hbpq3k8",
    "vendor_name": "Mercure Canberra",
    "title": "Heritage-Listed Stay in the Heart of Canberra",
    "description": "Old-world charm and modern comforts come together at Mercure Canberra, located just moments from the city centre and a short drive from the airport. Enjoy a city break in Australia’s capital with one bottle of wine on arrival, a leisurely late 1pm checkout and complimentary on-site parking for one car.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Mercure Canberra Feb 21",
    "offer_address": "Corner of Ainslie & Limestone Ave, Braddon ACT 2612",
    "percentage_discount": 63.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 73.0,
    "value": 199.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aiUwjQAE",
    "hero_image": "https://images.luxuryescapes.com/gqsfxjvvwrmfsjs0qdix",
    "image_two": "https://images.luxuryescapes.com/pzfjuua7oedwyjzaqrww",
    "image_three": "https://images.luxuryescapes.com/ezzcucclr6oufllsob36",
    "vendor_name": "Hotel Kurrajong Canberra",
    "title": "Art Deco Weekend Stay in One of the World's Top Cities to Visit",
    "description": "Discover the art, culture and heritage of Canberra - voted as one of Lonely Planet’s top cities to visit in 2018 - staying at the Art Deco-style Hotel Kurrajong Canberra, located just a stone's throw from Parliament House. Your escape includes daily buffet breakfast, convenient late 12pm checkout, AU$25 food credit for Chifley's Bar & Grill and unlimited, high-speed Wi-Fi throughout your stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Hotel Kurrajong Canberra",
    "offer_address": "8 National Circuit, Barton, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 206.0,
    "value": 413.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3wHkQAJ",
    "hero_image": "https://images.luxuryescapes.com/imnxdahwxw6mlhqgdi0p",
    "image_two": "https://images.luxuryescapes.com/jlni38du8hzffgz9aba1",
    "image_three": "https://images.luxuryescapes.com/n4nunl8xo7tbydjjqnll",
    "vendor_name": "Hyatt Hotel Canberra - A Park Hyatt Hotel",
    "title": "Five-Star City Getaway in Iconic Hyatt Luxury",
    "description": "Dive into the rich culture and vibrant food scene of the new capital of cool with an upscale stay close to all the city has to offer. Discover the charming beauty of Australia’s capital city staying at the Canberra Hyatt Hotel, a luxurious, 1920’s-style property within walking distance to the National Gallery of Australia. Enjoy a daily buffet breakfast, welcome glass of house wine for two on arrival and a convenient late midday checkout allowing you to make the most of your final morning.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Hyatt Hotel Canberra - a Park Hyatt Hotel - 2019",
    "offer_address": "120 Commonwealth Ave, Yarralumla ACT 2600",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 276.0,
    "value": 523.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pRCQAA2",
    "hero_image": "https://images.luxuryescapes.com/3tx04vqauj1rf1kw4qw",
    "image_two": "https://images.luxuryescapes.com/zlfgn8hkdncf0b1lmapa",
    "image_three": "https://images.luxuryescapes.com/c1loy6fjlikf5ezk4nuq",
    "vendor_name": "Ovolo Nishi",
    "title": "Stylish Canberra Ovolo Designer Break with Daily Breakfast, Nightly Drinks & Complimentary Minibar",
    "description": "Immerse yourself in urban luxury with a boutique stay at the most stylish designer hotel in Canberra, the top-rated Ovolo Nishi. Nestled in the contemporary NewActon hub - amid popular bars, glam restaurants and a selection of unique art galleries, hip cinemas and quirky entertainment venues - this uber-cool, eclectic hotel puts you within a stone's throw of Canberra's hottest spots and icons, including Parliament House.\n\nEnjoy innovative dining at the award-winning onsite Monster Kitchen and Bar and take the hotel's complimentary bicycles for a spin to discover the surrounding delights of Australia's capital. Sweet tooths will delight in a help-yourself lolly bar, while a 24-hour gym and self-service laundry facilities make your stay ultra convenient.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ovolo Nishi",
    "offer_address": "NewActon Precinct, 25 Edinburgh Avenue, Canberra, 2601, Australian Capital Territory, Australia",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 301.0,
    "value": 509.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070QUQAA2",
    "hero_image": "https://images.luxuryescapes.com/p4u144h7wdxuekhyyvgj",
    "image_two": "https://images.luxuryescapes.com/m3ix2aj3zgjbo2oai50j",
    "image_three": "https://images.luxuryescapes.com/n27tadjoevnq7fiuvu",
    "vendor_name": "A by Adina, Canberra",
    "title": "Canberra Brand-New Self-Contained Studios with Guaranteed Room Upgrade & Welcome Cocktails",
    "description": "Live the A-list life in the heart of Canberra's bustling CBD with an ultra-sleek stay at the brand-new A by Adina Canberra apartments. Designed by award-winning architects at Bates Smart, this modern, sustainably-built property features glossy, studios and self-contained apartments.\n\nRooms are decked out with kitchenettes, Nespresso coffee machines, and personal touches including designer Hunter Lab bathroom amenities, signature Dreamcatcher bedding. There's even a collaboration with Deliveroo and The Meat & Wine Co. for a seamless dining experience. The perfect retreat after a day exploring the nation’s capital, you're also just moments from what's described as the city's best steakhouse, The Meat & Wine Co. and Mu Omakase.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "A by Adina Canberra",
    "offer_address": "1 Constitution Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 275.0,
    "value": 686.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003Gpo6AAC",
    "hero_image": "https://images.luxuryescapes.com/01yrycpbfamem1kuhi98q",
    "image_two": "https://images.luxuryescapes.com/99ej05ddniczdhjmgt4s",
    "image_three": "https://images.luxuryescapes.com/tm0bgdlcearjpomox3bv",
    "vendor_name": "Ovolo Nishi",
    "title": "Ovolo Canberra Designer Break with Daily Minibar & Nightly Drinks",
    "description": "Indulge in stylish urban luxury with a boutique stay at the coolest designer hotel in Canberra, Ovolo Nishi. Nestled in the contemporary NewActon hub amid stylish bars, glam restaurants, and a selection of unique art galleries, hip cinemas and quirky entertainment venues, this achingly cool hotel puts you within a stone's throw of Canberra's icons, including Parliament House.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ovolo Nishi",
    "offer_address": "NewActon Precinct, 25 Edinburgh Avenue, Canberra, 2601, Australian Capital Territory, Australia",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 239.0,
    "value": 420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AbCt4AAF",
    "hero_image": "https://images.luxuryescapes.com/sive7e3lzri0r4jqgmih",
    "image_two": "https://images.luxuryescapes.com/nil0mzr0yp896kwxsg3t",
    "image_three": "https://images.luxuryescapes.com/zb1rb2bwchqqf63ouk8",
    "vendor_name": "Ramada by Wyndham Diplomat Hotel Canberra",
    "title": "Canberra Escape near Capital Hill with Daily Breakfast & Nightly Drinks",
    "description": "Discover Canberra's urban delights with a stay at the Ramada by Wyndham Diplomat Canberra, located just a short drive from Capital Hill. Here, you'll be perfectly positioned to explore the best of the city: the famous Parliamentary Triangle (home to Old Parliament House) is less than a 10-minute drive away, as are cultural must-sees such as the National Gallery of Australia, National Portrait Gallery and Australian War Memorial. For days when you prefer to dine in, the hotel has an excellent restaurant and bar open from breakfast to last-call drinks, where you can enjoy pub favourites and a local tipple from the Canberra District wine region.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ramada by Wyndham Diplomat Canberra",
    "offer_address": "2 Hely Street, Griffith, Australian Capital Territory, 2603, Australia",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 237.0,
    "value": 548.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Hz3zIAC",
    "hero_image": "https://images.luxuryescapes.com/24ise9t9d9zy3kzx6pxt",
    "image_two": "https://images.luxuryescapes.com/cqvmxtvatpdbn2h8be44",
    "image_three": "https://images.luxuryescapes.com/gz1d9oqbrxmpdw5kbah",
    "vendor_name": "Vibe Hotel Canberra",
    "title": "Sleek Canberra Stay Just 10 Minutes from City Centre with Daily Breakfast",
    "description": "Elevate your next escape to Australia's capital with a stay at this masterfully designed hotel, just a 10-minute drive from the city centre. The hotel's spectacular lobby, inspired by New York's iconic Guggenheim Museum, features a seven-story atrium, contemporary fireplace and striking circular geometry.\n\nYou'll find yourself conveniently close to the big-brand shops of Majura Park and just a short walk from the manicured gardens and refined dining of Pialligo Estate. When it’s time to retreat for the night, head to Helix Bar & Dining for craft beers, laid-back dining and live music.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Vibe Hotel Canberra",
    "offer_address": "1 Rogan Street, Canberra, Australian Capital Territory 2609, Australia",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 229.0,
    "value": 473.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPWCUQA4",
    "hero_image": "https://images.luxuryescapes.com/gn4ifod3k1isc05uooej",
    "image_two": "https://images.luxuryescapes.com/ewodwapuigpwdj2ug1wz",
    "image_three": "https://images.luxuryescapes.com/bz2mnyxisstbulug9z00",
    "vendor_name": "Mantra MacArthur Hotel",
    "title": "Mantra City Break with Complimentary Room Upgrade and Gourmet Inclusions",
    "description": "Experience Canberra's Mantra MacArthur Hotel, centrally located and close to popular attractions like Parliament House and the National Gallery. Your luxurious city break includes a complimentary upgrade to a Deluxe Studio, daily continental breakfast, AU$50 dining credit to spend on dinner at the on-site restaurant, a wine tasting and winery tour for two, plus a late 1pm check-out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Mantra MacArthur Hotel",
    "offer_address": "219 Northbourne Ave, Turner, Canberra, Australian Capital Territory 2612, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 175.0,
    "value": 343.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R9CiVQAV",
    "hero_image": "https://images.luxuryescapes.com/ioolpy7xrazsuy4qlwl9",
    "image_two": "https://images.luxuryescapes.com/jtq9dfynifrhsysjk6hm",
    "image_three": "https://images.luxuryescapes.com/mgqh8gpwoiqcmqckvkxr",
    "vendor_name": "Hyatt Hotel Canberra - A Park Hyatt Hotel",
    "title": "Five-Star Hyatt Weekend Getaway in Canberra",
    "description": "Discover the charming beauty of Australia's capital city with a weekend stay at the Hyatt Hotel Canberra - a Park Hyatt Hotel, within walking distance to the National Gallery of Australia. Indulge in three days/two nights of timeless elegance staying in a plush Park King Room with daily full buffet breakfast, welcome drink, late midday checkout and much more for two adults.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Hyatt Canberra - A Park Hyatt Hotel - OLD",
    "offer_address": "120 Commonwealth Ave, Yarralumla ACT 2600",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 291.0,
    "value": 550.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GrqfBYAR",
    "hero_image": "https://images.luxuryescapes.com/qgidhju8j9tw1j4owsw8",
    "image_two": "https://images.luxuryescapes.com/vpwdotr89ciahnyn8pd",
    "image_three": "https://images.luxuryescapes.com/tm1c5czxuiwq45mf1bcn",
    "vendor_name": "Ramada by Wyndham Diplomat Hotel Canberra",
    "title": "Canberra City Break near Capital Hill & Kingston Foreshore with Daily Breakfast",
    "description": "Step into Canberra's vibrant culture and charm with a cosy stay at this hotel, just a short drive away from Capital Hill. You'll be perfectly positioned to explore the best of the city, with cultural must-sees such as the National Gallery of Australia, National Museum of Australia and the Australian War Memorial all within easy reach.\n\nAfter a day of sightseeing, savour delicious cuisine with a refreshing drink at the Diplomat Bar & Grill, or venture out to explore Canberra's offerings. Access local favourites like the Kingston Foreshore, with its vibrant eateries by the water, to national landmarks and even local tipples from the district's wine region - there’s something here for everyone.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ramada by Wyndham Diplomat Canberra",
    "offer_address": "2 Hely Street, Griffith, Australian Capital Territory, 2603, Australia",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 199.0,
    "value": 439.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GKZhAAO",
    "hero_image": "https://images.luxuryescapes.com/z1i3erbf7z1lv2qt4li",
    "image_two": "https://images.luxuryescapes.com/bhd5hk60k54qyogvaucc",
    "image_three": "https://images.luxuryescapes.com/5psmn662wape7ptfnf0u",
    "vendor_name": "Hotel Kurrajong Canberra",
    "title": "Art Deco Canberra Luxury with Daily Breakfast",
    "description": "Discover the art, culture and heritage of Australia's capital staying at the Art Deco-style Hotel Kurrajong Canberra. Ideally located a short stroll from Parliament House, world-class cultural and dining experiences and wildlife-filled bushland reserves, this heritage property was once a base for some of Australia's most senior politicians - the echo of the past is never far away. Immerse yourself in the delights of the nation’s capital in style with daily breakfast, a bottle of wine on arrival, late 12pm checkout and unlimited, high-speed Wi-Fi throughout your stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Hotel Kurrajong Canberra",
    "offer_address": "8 National Circuit, Barton, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 179.0,
    "value": 368.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GYz6HYAT",
    "hero_image": "https://images.luxuryescapes.com/1it76yt73dnunmd8o60g",
    "image_two": "https://images.luxuryescapes.com/ktn45qyi3y4umm4nnegj",
    "image_three": "https://images.luxuryescapes.com/ecljxkpfd6zucrazi8nu",
    "vendor_name": "Vibe Hotel Canberra",
    "title": "Stylish Canberra City Break Just 10 Minutes from City Centre with Daily Breakfast",
    "description": "Elevate your next escape to Australia’s capital with a stay at this elegant, design-forward hotel, just a 10-minute drive from the city centre. The hotel’s spectacular lobby, inspired by New York’s iconic Guggenheim Museum, features a seven-story atrium, a contemporary fireplace and striking circular geometry.\n\nYou’ll find yourself conveniently close to the big-brand shops of Majura Park and just a short walk from the manicured gardens and refined dining of Pialligo Estate. When it’s time to retreat for the night, head to Helix Bar & Dining for craft beers, laid-back dining and live music.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Vibe Hotel Canberra",
    "offer_address": "1 Rogan Street, Canberra, Australian Capital Territory 2609, Australia",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 219.0,
    "value": 449.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G1iSLAAZ",
    "hero_image": "https://images.luxuryescapes.com/dcyu0jzt73c7e33sqmn",
    "image_two": "https://images.luxuryescapes.com/2hdtdpc7vrbf3pj328m",
    "image_three": "https://images.luxuryescapes.com/qelrtb3ln874o27felcmo",
    "vendor_name": "Novotel Canberra",
    "title": "Stylish Central Canberra Stay with Daily Breakfast, A$50 Dining Credit & Welcome Cocktail",
    "description": "Engage with Australia's intimate and cultured capital city with a central stay at Novotel Canberra, a contemporary retreat located just steps from the iconic Australian War Memorial and the National Gallery of Australia. After a day of exploring, retreat to the hotel's indoor heated pool, unwind at the onsite fitness centre or savour a meal at the First Edition Restaurant & Bar, where you can indulge in locally sourced dishes and a selection of drinks. When it's time to explore, you're within walking distance of Canberra's vibrant dining scene, boutique shopping and picturesque Lake Burley Griffin.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Novotel Canberra",
    "offer_address": "65 Northbourne Avenue, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 243.0,
    "value": 459.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eMjUqQAK",
    "hero_image": "https://images.luxuryescapes.com/72jv147c6xtrdceohkn",
    "image_two": "https://images.luxuryescapes.com/ou6zwillzp9a3yngcy",
    "image_three": "https://images.luxuryescapes.com/p009iu4qh0e6feo0m1j",
    "vendor_name": "Hyatt Hotel Canberra - A Park Hyatt Hotel",
    "title": "Five-Star City Break in Heritage Hyatt Luxury with Daily Breakfast",
    "description": "Dive into the rich culture and vibrant food scene of Canberra with an upscale stay close to all the city has to offer. Discover the charming beauty of Australia’s capital staying at the Hyatt Hotel Canberra, a luxurious 1920s-style property within walking distance of the National Gallery of Australia.\n\nEnjoy daily buffet breakfast, a welcome drink per person on arrival, 10% discount on food and drinks at the hotel's restaurants and bars, and a convenient late 12pm checkout, allowing you to make the most of your final morning.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Hyatt Hotel Canberra - A Park Hyatt Hotel - Jan 2020",
    "offer_address": "120 Commonwealth Ave, Yarralumla ACT 2600",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 278.0,
    "value": 527.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mYb8AAE",
    "hero_image": "https://images.luxuryescapes.com/ptzr61dc1izw83f05wmg",
    "image_two": "https://images.luxuryescapes.com/o13vu04tmixnxclf13p3",
    "image_three": "https://images.luxuryescapes.com/lxg5ty73cfkslu6gka4r",
    "vendor_name": "Ramada by Wyndham Diplomat Hotel Canberra",
    "title": "Canberra Escape near Capital Hill with Daily Breakfast & Nightly Drinks",
    "description": "Discover Canberra's urban delights from Ramada by Wyndham Diplomat Canberra, located just a short drive from Capital Hill. Here, you'll be perfectly positioned to explore the best of the city and its inner-south: the city's famous Parliamentary Triangle (home to Old Parliament House) is less than a 10-minute drive away, as are cultural must-sees such as the National Gallery of Australia, National Portrait Gallery and Australian War Memorial. \n\nCanberra's city centre is also just a 10-minute drive away, where you'll find an abundance of top-notch restaurants and cool bars. For days when you prefer to dine in, the hotel has an excellent restaurant and bar open from breakfast to last-call drinks, where you can enjoy pub favourites and a local tipple from the Canberra District wine region.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ramada by Wyndham Diplomat Canberra",
    "offer_address": "2 Hely Street, Griffith, Australian Capital Territory, 2603, Australia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 203.0,
    "value": 507.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DZ8fzYAD",
    "hero_image": "https://images.luxuryescapes.com/q776yyp5ziwhekpgjzxb",
    "image_two": "https://images.luxuryescapes.com/h8w2pwci3pyhh7gmtfcj",
    "image_three": "https://images.luxuryescapes.com/maw302b25baredlokty",
    "vendor_name": "Ramada by Wyndham Diplomat Hotel Canberra",
    "title": "Canberra Inner South City Break near Capital Hill & Kingston Foreshore with Daily Breakfast",
    "description": "Step into Canberra's vibrant culture and charm with a cosy stay, just a short drive away from Capital Hill. You'll be perfectly positioned to explore the best of the city, with cultural must-sees such as the National Gallery of Australia, National Museum of Australia and the Australian War Memorial all within easy reach.\n\nAfter a day of sightseeing, savour delicious cuisine with a refreshing drink at the Diplomat Bar & Grill, or venture out to explore Canberra's offerings. Access local favourites like the Kingston Foreshore, with its vibrant eateries by the water, to national landmarks and even local tipples from the district's wine region - there’s something here for everyone.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ramada by Wyndham Diplomat Canberra",
    "offer_address": "2 Hely Street, Griffith, Australian Capital Territory, 2603, Australia",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 213.0,
    "value": 470.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ddOIgQAM",
    "hero_image": "https://images.luxuryescapes.com/5abpdsi0pikv9m6y43q",
    "image_two": "https://images.luxuryescapes.com/09bnocvcneq8gv6bdab",
    "image_three": "https://images.luxuryescapes.com/ykt8qf4xkb7lsfhm26z",
    "vendor_name": "Ovolo Nishi",
    "title": "Designer City Break With Daily Minibar and Nightly Drinks",
    "description": "Indulge in stylish luxury at its best with a two-night break at the chicest designer hotel in Canberra, the five-star Ovolo Nishi. Dive into the rich culture and vibrant food scene of the new capital of cool with an upscale stay close to all the city has to offer from museums to galleries and historic sites galore. Enjoy a daily European Table breakfast, evening social hour serving drinks and bar nibbles, complimentary in-room minibar replenished daily, a complimentary lolly and water station in the lobby, a welcome loot bag with surprise snacks in-room, guaranteed 12pm late checkout and daily bike hire that’ll allow you to explore the nearby city (subject to availability).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Ovolo Nishi 2019",
    "offer_address": "NewActon Precinct, 25 Edinburgh Ave, Canberra, Canberra ACT 2601",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 247.0,
    "value": 433.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EbFlAAK",
    "hero_image": "https://images.luxuryescapes.com/nzn5mxug69uq7pqgm5j",
    "image_two": "https://images.luxuryescapes.com/k9fbcih06abfam6ndvbg",
    "image_three": "https://images.luxuryescapes.com/o6ocn0ukoh3r90x7uqo",
    "vendor_name": "Nishi Apartments by Ovolo",
    "title": "Ultra-Modern Canberra Apartment Stay with Daily Breakfast",
    "description": "Indulge in contemporary designer style at its best with a stay in Canberra’s Nishi Apartments Eco-Living by Ovolo, housed in the artistic and designer hotel, Ovolo Nishi. Dive into the rich culture and vibrant food scene with an upscale stay close to all the city has to offer - museums, galleries and historic sites galore. Enjoy daily continental breakfast, a bottle of wine on arrival and a guaranteed 12pm late checkout to make the most of your last day in Canberra.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Nishi Apartments Eco-Living by Ovolo May 2020",
    "offer_address": "NewActon Precinct, 25 Edinburgh Ave, Canberra ACT 2601",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 219.0,
    "value": 385.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FrofZYAR",
    "hero_image": "https://images.luxuryescapes.com/80gmudg6ur5444dqwyb",
    "image_two": "https://images.luxuryescapes.com/vtuny88hkjguktze9ej",
    "image_three": "https://images.luxuryescapes.com/3tvyq5tn9m0z2qqq7d98",
    "vendor_name": "Mantra MacArthur Hotel",
    "title": "Contemporary Canberra Escape near CBD with Daily Breakfast & Nightly Drinks",
    "description": "Immerse yourself in the spirit of Australia’s capital with a stay at this stylish escape, located on the leafy outskirts of Canberra's CBD and offering easy access to the city’s vibrant dining scene, lively markets and world-renowned cultural landmarks.\n\nStep outside and find yourself just moments from the National Gallery of Australia, the Australian War Memorial and the tranquil shores of Lake Burley Griffin. Inside, contemporary design meets comfort with spacious rooms that serve as the perfect base for those seeking Canberra's best. Return to delicious international and Asian flavours at the hotel’s onsite restaurant, Podilato.\n\nWhether you're visiting for business or immersing yourself in the rich cultural offerings of this dynamic city, Mantra MacArthur Hotel is the perfect place to unwind and recharge.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Mantra MacArthur Hotel",
    "offer_address": "219 Northbourne Ave, Turner, Canberra, Australian Capital Territory 2612, Australia",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 179.0,
    "value": 366.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bfvKHQAY",
    "hero_image": "https://images.luxuryescapes.com/iiwffasnnl13jwpuhuti",
    "image_two": "https://images.luxuryescapes.com/zmslz5xenoyai0oiqijw",
    "image_three": "https://images.luxuryescapes.com/eknlqtb8losmoylyeyvw",
    "vendor_name": "Peppers Gallery Hotel Canberra",
    "title": "Elegant Peppers Escape with Dining Credit and Nightly Drinks",
    "description": "Discover the rich culture and vibrant food scene of the new capital of cool with an upscale stay at Peppers Gallery Hotel. Explore all Canberra has to offer while enjoying a daily continental breakfast, nightly cocktail at the stylish Library Bar, an AU$50 food and drinks credit to share, a self-guided tour of Mount Majura Vineyard and a leisurely late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Peppers Gallery Hotel - 2019",
    "offer_address": "15 Edinburgh Ave, Canberra ACT 2601",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 219.0,
    "value": 453.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VK9gAAG",
    "hero_image": "https://images.luxuryescapes.com/e5iudzokrkv4rl1dicw",
    "image_two": "https://images.luxuryescapes.com/7comqas0zndt7yzac9lk",
    "image_three": "https://images.luxuryescapes.com/gjvb3e1xnny4yh226zm",
    "vendor_name": "Ovolo Nishi",
    "title": "Cool Canberra Designer Break with Daily Minibar & Nightly Drinks",
    "description": "Indulge in stylish urban luxury with a boutique stay at the coolest designer hotel in Canberra, Ovolo Nishi. Nestled in the contemporary NewActon hub - amid popular bars, glam restaurants, and a selection of unique art galleries, hip cinemas and quirky entertainment venues - this uber-cool hotel puts you within a stone's throw of Canberra's icons, including Parliament House.\n\nEnjoy innovative dining at the onsite Monster Kitchen and Bar and take the hotel's complimentary bicycles for a spin to discover the surrounding delights of Australia's capital.\n\n**Your handpicked inclusions:** \n\n- Daily continental plated breakfast at Monster Kitchen and Bar\n- Nightly social hour with one round of complimentary drinks and bar nibbles\n- Complimentary in-room minibar replenished daily with wine, beer and soft drinks\n- Enjoy a complimentary welcome loot bag with surprise snacks\n- Help yourself to lollies at the lobby candy station\n- Guaranteed 12pm late checkout for a lazy last day\n- Daily bike hire to help you explore the city (subject to availability)\n\n**Looking for luxury?** Upgrade to the Meandering Atrium room, Ovolo Nishi's largest hotel room, boasting a separate sitting area, twin overhead rain shower and concrete bathtub.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ovolo Nishi",
    "offer_address": "NewActon Precinct, 25 Edinburgh Avenue, Canberra, 2601, Australian Capital Territory, Australia",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 251.0,
    "value": 441.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FOCz7AAH",
    "hero_image": "https://images.luxuryescapes.com/0sszett0mxi06urtmno8",
    "image_two": "https://images.luxuryescapes.com/xfcchfyvl5ee6rvltth",
    "image_three": "https://images.luxuryescapes.com/44sn12fb8kkyq5r5q2d",
    "vendor_name": "Peppers Gallery Hotel Canberra",
    "title": "Elegant Central Canberra Escape with Dining Credit, Daily Breakfast & Nightly Drinks",
    "description": "Tucked away in the new capital of cool, amid the NewActon precinct's stylish bars, glam restaurants, hip cinemas and quirky entertainment venues, Peppers Gallery Hotel Canberra sets the standard for pure Peppers indulgence. The hotel's unique 'gallery' theme ensures a one-of-a-kind stay, with a sculpture garden that spills into the foyer, wall hangings and art installations that turn corridors into creative spaces.\n\nTake in the full Canberra experience with tailored culinary moments and immersive cultural experiences on your doorstep, with your hotel located near Lake Burley Griffin and within walking distance of Parliament House. Indulge in a bespoke gourmet experience at the hotel's renowned Canberra institution, the acclaimed Italian trattoria, Bicicletta.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Peppers Gallery Hotel Canberra",
    "offer_address": "15 Edinburgh Avenue, Canberra 2601, ACT",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 213.0,
    "value": 459.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G1veeAAB",
    "hero_image": "https://images.luxuryescapes.com/e3fwgebks7zo5ygxxei",
    "image_two": "https://images.luxuryescapes.com/x84owf1cc742m8f1bp5s",
    "image_three": "https://images.luxuryescapes.com/q77i5h2g5eqjktelw9fe",
    "vendor_name": "Hotel Kurrajong Canberra",
    "title": "Elegant Art Deco Canberra Luxury with Daily Breakfast, Nightly Drinks & A$50 Dining Credit",
    "description": "Old Australian charm meets contemporary luxury in the heart of the country's capital with an Art Deco-inspired stay at Hotel Kurrajong Canberra. Transforming seamlessly from political capital to cultural hotspot, Canberra's brimming with world-class museums, high-end restaurants and trendy speakeasies and bars. You'll be perfectly ideally positioned to discover it all - Hotel Kurrajong Canberra is just a short stroll from Parliament House, the National Gallery of Australia and Lake Burley Griffin.\n\nIn between bouts of exploration, return to the contemporary hotel to recharge your batteries - wine and dine at the onsite Chifley’s Bar & Grill, or simply sink into the plush bedding in your stylish room.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Hotel Kurrajong Canberra",
    "offer_address": "8 National Circuit, Barton, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 257.0,
    "value": 432.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dZlqPQAS",
    "hero_image": "https://images.luxuryescapes.com/y6um0mkcnmbta2unymm",
    "image_two": "https://images.luxuryescapes.com/x8qe0v7xqhb5i8eigyxk",
    "image_three": "https://images.luxuryescapes.com/rkkyzzwtrlrbydgozepj",
    "vendor_name": "Hotel Kurrajong Canberra",
    "title": "Canberra: Art Deco Luxury in Former Political Residence",
    "description": "Discover the art, culture and heritage of Canberra - last year voted one of Lonely Planet’s top cities to visit - staying at the Art Deco-style Hotel Kurrajong Canberra, located just a stone's throw from Parliament House. This heritage property formerly served as housing for Labour party politicians, so fully immerses you in Canberra's fascinating past. Your escape includes daily buffet breakfast, a bottle of wine on arrival, late 12pm checkout, AU$25 dining credit to use at Chifley's Bar & Grill and unlimited, high-speed Wi-Fi throughout your stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Hotel Kurrajong Canberra",
    "offer_address": "8 National Circuit, Barton, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 213.0,
    "value": 421.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hptdAAA",
    "hero_image": "https://images.luxuryescapes.com/4o1x21l8xbn0c3vf9jgkh",
    "image_two": "https://images.luxuryescapes.com/avsbmcicbvpxjju906r",
    "image_three": "https://images.luxuryescapes.com/gey45rbkj7rkktpf5e6",
    "vendor_name": "A by Adina, Canberra",
    "title": "Canberra Apartments in the Heart of the CBD with Guaranteed Room Upgrade",
    "description": "Live the A-list life in Canberra's bustling CBD with an ultra-sleek stay at A by Adina Canberra. A collection of glossy studios and self-contained apartments designed by award-winning architects at Bates Smart, this modern, sustainably-built property features everything you need for a comfortable Canberra escape. Rooms are decked out with kitchenettes, Nespresso coffee machines, and personal touches including designer Hunter Lab bathroom amenities and signature Dreamcatcher bedding. The perfect retreat after a day exploring the nation’s capital, you're also just moments from Mu Omakase and The Meat & Wine Co., described as the city's best steakhouse.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "A by Adina Canberra",
    "offer_address": "1 Constitution Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 281.0,
    "value": 691.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xyKGAAY",
    "hero_image": "https://images.luxuryescapes.com/bcmke8xb4p4m20jtej",
    "image_two": "https://images.luxuryescapes.com/rpmk9y282x1cnfg67j3j",
    "image_three": "https://images.luxuryescapes.com/8ozk3mi6h7g0cjkm2ug",
    "vendor_name": "Hotel Kurrajong Canberra",
    "title": "Heritage Art Deco Canberra Luxury with Daily Breakfast & Welcome Wine",
    "description": "Discover the art, culture and heritage of Australia's capital staying at the Art Deco-style Hotel Kurrajong Canberra, a stylish hotel stamped with a Tripadvisor Travellers' Choice 2021 award. A city that has recently reinvented itself from political capital to cultural hotspot, Canberra is brimming with art, world-class museums, high-end restaurants and trendy speakeasies and bars.\n\nThe hotel is ideally located a short stroll from Parliament House, world-class cultural and dining experiences and wildlife-filled bushland reserves. This heritage property was once a base for some of Australia's most senior politicians - the echo of the past is never far away. In between bouts of exploration, return to Hotel Kurrajong Canberra to recharge your batteries - being sure to wine and dine at the onsite Chifley’s Bar & Grill.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Hotel Kurrajong Canberra",
    "offer_address": "8 National Circuit, Barton, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 210.0,
    "value": 449.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zIkmAAE",
    "hero_image": "https://images.luxuryescapes.com/vafiknyg37dvh298pzh",
    "image_two": "https://images.luxuryescapes.com/1p7zzrxa2cfvaj4fnac",
    "image_three": "https://images.luxuryescapes.com/6wjb18h0z8ytat9enzwv",
    "vendor_name": "Jamala Wildlife Lodge",
    "title": "Five-Star All-Inclusive Zoo Wildlife Escape with Animal Introduction",
    "description": "Experience five-star creature comforts alongside some of the rarest animals on the planet at Jamala Wildlife Lodge, hidden within Canberra's National Zoo & Aquarium. This African safari-style escape invites you to be part of the Lodge's efforts to help save some of the world's most endangered species from extinction while staying in luxury lodge accommodation, offering views over giraffes, meerkats, sharks, lions or pristine nature.\n\nGo where the wild things are - a mere 10-minute drive outside Canberra’s CBD - and enjoy an included animal introduction, which, depending on the day, could include meeting a tiger, lion, hyena or giraffe, having an owl perched on your arm or hanging out with playful meerkats. Your escape also includes all-inclusive dining (featuring a decadent dinner with Champagne and wine), a complimentary bottle of Moët & Chandon Champagne and one daily tour, including a morning guided zoo safari.\n\n**'Mix and Match' to extend your stay**: why not switch up your stay with a second or third night of accommodation, perhaps spending each night in a new room with different animal views? You could wake up to giraffes one morning and meerkats and more the next - the ultimate wildlife experience. Simply book separate one-night packages to create your perfect escape.\n\n**Travelling with family?** Additional guests can be added to the uShaka Suite, Giraffe Treehouse and Jungle Bungalow for a surcharge, see the Fine Print for details.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Jamala Wildlife Lodge",
    "offer_address": "National Zoo & Aquarium 999 Lady Denman Drive Weston Creek ACT 2611 Australia",
    "percentage_discount": 19.0,
    "min_duration": 1,
    "max_duration": 3,
    "price": 929.0,
    "value": 1150.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbLSpAAN",
    "hero_image": "https://images.luxuryescapes.com/ton2mtzg881hpc7xdm7",
    "image_two": "https://images.luxuryescapes.com/sym2twna725rj9ilnvm",
    "image_three": "https://images.luxuryescapes.com/supntax97p64ehz7s07g",
    "vendor_name": "Ramada by Wyndham Diplomat Hotel Canberra",
    "title": "Canberra City Break near Capital Hill and National Gallery of Australia with Daily Breakfast",
    "description": "Step into the heart of Canberra's vibrant culture and charm with  cosy stay at this stylish hotel, located just a short drive from Capital Hill. Here, you'll be perfectly positioned to explore the best of the city: Old Parliament House and the famous Parliamentary Triangle are less than a 10-minute drive away, as are cultural must-sees such as the National Gallery of Australia, National Portrait Gallery and Australian War Memorial. After a day of sightseeing, indulge in delicious cuisine with a refreshing drink at the Diplomat Bar & Grill, or venturing out to explore Canberra's diverse culinary offerings, from local favourites to acclaimed fine dining and even local tipples from the district's wine region.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ramada by Wyndham Diplomat Canberra",
    "offer_address": "2 Hely Street, Griffith, Australian Capital Territory, 2603, Australia",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 215.0,
    "value": 488.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R9Z9LQAV",
    "hero_image": "https://images.luxuryescapes.com/pm9xfyqzezejx1v7qtp6",
    "image_two": "https://images.luxuryescapes.com/v7zkcfwkjtogzyparxhz",
    "image_three": "https://images.luxuryescapes.com/agyvb4s6t8ycxcnepmzh",
    "vendor_name": "Peppers Gallery Hotel Canberra",
    "title": "Elegant Peppers Escape with Dining Credit and Nightly Drinks",
    "description": "Discover the rich culture and vibrant food scene of the new capital of cool with an upscale stay at Peppers Gallery Hotel. Explore all Canberra has on offer while enjoying deluxe daily continental breakfast, nightly cocktails at the stylish Library Bar, an AU$50 food and drinks credit, a self-guided tour of Mount Majura Vineyard, an AU$15 credit towards a Segway experience, discounted tickets for Palace Electric Cinema and a leisurely late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Peppers Gallery Hotel - 2018",
    "offer_address": "15 Edinburgh Ave, Canberra ACT 2601",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 215.0,
    "value": 444.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004SYN5AAO",
    "hero_image": "https://images.luxuryescapes.com/dqzsjiaa80oor7x0reae",
    "image_two": "https://images.luxuryescapes.com/5rkr427p3kzmi2kn8xgp",
    "image_three": "https://images.luxuryescapes.com/2xm1u53uqe8od72cq3np",
    "vendor_name": "Mercure Canberra",
    "title": "Heritage-Listed Canberra Retreat with Complimentary Room Upgrade",
    "description": "Soak up Canberra’s impressive cultural experiences and discover the home of Australia's government with a stay at the beautiful Mercure Canberra, a heritage-listed property set amid a lush, landscaped garden, just moments from the city centre and vibrant NewActon precinct. Part of the city's history, opened in 1927 and listed on the Register of the National Estate, Mecure Canberra is the perfect base to experience the very best of Canberra's iconic monuments, including the National Gallery of Australia and Old Parliament House.\n\nEnjoy outstanding service and superb old-world charm as days are spent exploring the country’s capital, tasting gourmet food or simply relaxing in your comfortable room. This charming retreat also features a courtyard restaurant and sleek bistro with beer garden overlooking Mount Ainslie, a fitness centre and secure car parking.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Mercure Canberra Feb 21",
    "offer_address": "Corner of Ainslie & Limestone Ave, Braddon ACT 2612",
    "percentage_discount": 52.0,
    "min_duration": 1,
    "max_duration": 3,
    "price": 83.0,
    "value": 172.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LoJsAAK",
    "hero_image": "https://images.luxuryescapes.com/5mfqn1047c1abpvrqe9bl",
    "image_two": "https://images.luxuryescapes.com/1d0deu7hmafwu7wt09ukl",
    "image_three": "https://images.luxuryescapes.com/syuf2hmcxobae1nroze",
    "vendor_name": "QT Canberra",
    "title": "Boutique QT Escape in Australia's Capital with Daily Breakfast",
    "description": "Discover Canberra’s history, culture, trendy speakeasies and buzzing restaurant scene while living the QT life at one of the city’s coolest hotels. Enjoy a two or three-night stay in boutique luxury in the stylish NewActon precinct, a stone’s throw from all the city has to offer. Enjoy daily buffet breakfast, one cocktail each, a welcome bottle of premium local wine, nightly secure undercover parking and a guaranteed late, 1pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "QT Canberra",
    "offer_address": "1 London Circuit, Canberra 2601, Australian Capital Territory, Australia",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 239.0,
    "value": 776.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G2VhHAAV",
    "hero_image": "https://images.luxuryescapes.com/o24tljxabtunyofwjye",
    "image_two": "https://images.luxuryescapes.com/8xvy8yl0nmm0853s843",
    "image_three": "https://images.luxuryescapes.com/j2uveipdg8sevksx2js5",
    "vendor_name": "Ramada by Wyndham Diplomat Hotel Canberra",
    "title": "Canberra City Break near Capital Hill with Onsite Restaurant & Daily Breakfast",
    "description": "Put a spring in your step as you discover Canberra's urban delights with a stay at the Ramada by Wyndham Diplomat Canberra, located just a short drive from Capital Hill and the Floriade flower festival - Australia’s largest celebration of spring. Here, you'll be perfectly positioned to explore the best of the city: Old Parliament House and the famous Parliamentary Triangle are less than a 10-minute drive away, as are cultural must-sees such as the National Gallery of Australia, National Portrait Gallery and Australian War Memorial, all with free general entry. For breaks between adventures, the hotel has an excellent restaurant and bar open from breakfast to last-call drinks, where you can enjoy pub favourites and a local tipple from the Canberra District wine region.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ramada by Wyndham Diplomat Canberra",
    "offer_address": "2 Hely Street, Griffith, Australian Capital Territory, 2603, Australia",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 224.0,
    "value": 432.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DzbIAAS",
    "hero_image": "https://images.luxuryescapes.com/cq6cj1rgfkvkff3impy",
    "image_two": "https://images.luxuryescapes.com/838rn3nbuayzopmvji3",
    "image_three": "https://images.luxuryescapes.com/bo9cc69awhfquy5vhql",
    "vendor_name": "Nishi Apartments by Ovolo",
    "title": "Ovolo Canberra Ultra-Modern Designer Apartments with Daily Breakfast",
    "description": "Experience a stay to remember in Canberra’s Nishi Apartments Eco-Living by Ovolo, housed in the artistic-inspired boutique hotel, Ovolo Nishi. This contemporary escape invites you to dive into the rich culture and vibrant food scene of the new capital of cool from one of Canberra’s most inspiring precincts: NewActon. You’ll be surrounded by trendy bars, art galleries and quirky entertainment venues, while being within easy reach of the Australian War Memorial, Parliament House, and Lake Burley Griffin.\n\nWhen you are ready to relax, retreat to one of Nishi Apartments Eco-Living by Ovolo apartments' sophisticated and effortlessly cool spaces, boasting lavish facilities such as Monster Kitchen and Bar.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Nishi Apartments Eco-Living by Ovolo",
    "offer_address": "25 Edinburgh Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 305.0,
    "value": 625.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AbBDCAA3",
    "hero_image": "https://images.luxuryescapes.com/m3d68m92kho4fqv27e8l",
    "image_two": "https://images.luxuryescapes.com/ehvh1ygw7un2jnhv1b",
    "image_three": "https://images.luxuryescapes.com/akfdd1ai0pzvc3i535ov",
    "vendor_name": "Mercure Canberra",
    "title": "Heritage-Listed Mercure Canberra Escape with Room Upgrade & Daily Breakfast",
    "description": "Soak up Canberra’s impressive cultural experiences, top-notch restaurants, and burgeoning art scene with a central city stay at the beautiful Mercure Canberra. Opened in 1927 and listed on the Register of the National Estate, Mercure Canberra is part of the city's rich history. Use this conveniently located hotel just moments from the CBD and vibrant NewActon precinct, as your stylish base and explore the National Gallery of Australia or Old Parliament House.\n\nBoasting outstanding service, superb old-world charm, and a welcoming atmosphere, guests of this iconic Canberra institution are guaranteed a relaxing retreat. After days exploring the country's capital, relax at The Courtyard Restaurant, or pull up a seat in the beer garden at Olims Bar & Bistro and soak up the views of Mount Ainslie.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Mercure Canberra",
    "offer_address": "Corner of Ainslie and Limestone Avenue, Braddon 2612, ACT",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 220.0,
    "value": 334.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dp0nFAAR",
    "hero_image": "https://images.luxuryescapes.com/vwkmi07lg5wgivb6cnz8",
    "image_two": "https://images.luxuryescapes.com/06b6gs8o4183t505ssu",
    "image_three": "https://images.luxuryescapes.com/tmjz9zlekg6p995jt8f7",
    "vendor_name": "Jamala Wildlife Lodge",
    "title": "Five-Star Canberra Wildlife Lodge Stay with Daily Breakfast & Dinner, Guided Safari & Animal Encounter",
    "description": "Creature comfort takes on new meaning with a stay alongside some of the world's most majestic animals at the five-star Jamala Wildlife Lodge, hidden within Canberra's National Zoo & Aquarium. Go where the wild things are and stay in safari-style lodge accommodation, offering views over the enclosures or pristine nature. Enjoy an included animal encounter, which could involve meeting a tiger, lion or hyena, having an owl perch on your arm or hanging out with playful meerkats (please note that personal choices and preferences cannot be accommodated).\n\nJamala Wildlife Lodge is so much more than a once-in-a-lifetime stay; it's an invitation to learn more about the importance of wildlife conservation. As a member of the Zoo and Aquarium Association, proudly accredited under their Animal Welfare program, the aim of this incredible lodge is to raise funds that help the zoo and aquarium grow and support its breeding programs. Animal welfare is one of the top priorities and animals have the option to be near the room or far away and out of sight. This incredible lodge simply affords you the bucket-list opportunity to stay in opulent surroundings and gain a fascinating insight into the National Zoo & Aquarium's incredible wildlife.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Jamala Wildlife Lodge",
    "offer_address": "National Zoo & Aquarium, 999 Lady Denman Drive, Canberra, Australian Capital Territory 2611, Australia",
    "percentage_discount": 21.0,
    "min_duration": 1,
    "max_duration": 5,
    "price": 839.0,
    "value": 1062.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009EEBFAA4",
    "hero_image": "https://images.luxuryescapes.com/vhfpq7kwnlumt0xpwng",
    "image_two": "https://images.luxuryescapes.com/76qfrcbu3kaf12fe41c",
    "image_three": "https://images.luxuryescapes.com/hkl56qfi7lc5hls348r",
    "vendor_name": "Jamala Wildlife Lodge",
    "title": "Five-Star Canberra Wildlife Lodge Stay with Daily Breakfast & Dinner, Guided Safari & Animal Introduction",
    "description": "Creature comfort takes on new meaning with a stay alongside some of the world's rarest animals at the five-star Jamala Wildlife Lodge, hidden within Canberra's National Zoo & Aquarium. Go where the wild things are and stay in safari-style lodge accommodation, offering views over the enclosures or pristine nature. Enjoy an included animal introduction, which could involve meeting a tiger, lion, hyena or having an owl perch on your arm or hanging out with playful meerkats.\n\nJamala Wildlife Lodge is so much more than a once-in-a-lifetime stay; it's an invitation to learn more about the importance of wildlife conservation. As a member of the Zoo and Aquarium Association, proudly accredited under their Animal Welfare program, the aim of this incredible lodge is to raise funds that help the Zoo and National Aquarium grow and support its breeding programs. Animal welfare is one of the top priorities and animals have the option to be near the room or far away and out of sight. This incredible lodge simply affords you the bucket-list opportunity to stay in opulent surroundings and gain a fascinating insight into National Zoo & Aquarium's incredible wildlife.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Jamala Wildlife Lodge",
    "offer_address": "National Zoo & Aquarium, 999 Lady Denman Drive, Canberra, Australian Capital Territory 2611, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 4,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dZlplQAC",
    "hero_image": "https://images.luxuryescapes.com/qhfz8qwsjji7e9rg3tp4",
    "image_two": "https://images.luxuryescapes.com/pj4kffg90qunmx8idf7r",
    "image_three": "https://images.luxuryescapes.com/2qxymqcz5locwsgk72s",
    "vendor_name": "QT Canberra",
    "title": "Stylish Boutique Escape in the Nation's Capital",
    "description": "Discover Canberra’s historic culture, trendy speakeasies and buzzing restaurant scene while living the QT life at one of the city’s coolest hotels. Enjoy a two or three-night stay in quirky luxury in the neighbourhood of NewActon, a stone’s throw from all the city has to offer, and just five minutes' drive from the location of Floriade. Enjoy daily buffet breakfast, a cocktail each, welcome bottle of premium local wine, nightly secure undercover parking and a guaranteed late 1pm checkout. Plus, experience the Southern Hemisphere's largest spring festival, Floriade, with an exclusive Floriade Package available throughout the celebration that'll get you in the blooming spirit with flower-inspired cocktails and desserts.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "QT Canberra",
    "offer_address": "1 London Circuit, Canberra 2601, Australian Capital Territory, Australia",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 247.0,
    "value": 790.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3O3fQAF",
    "hero_image": "https://images.luxuryescapes.com/wxl8prdpzrt7wuqzu2oc",
    "image_two": "https://images.luxuryescapes.com/qfoa5dt9hbcqhvosfafv",
    "image_three": "https://images.luxuryescapes.com/rv3px1nk4uld4trard88",
    "vendor_name": "Ovolo Nishi",
    "title": "Designer City Break With Complimentary Mini-bar And Nightly Tapas",
    "description": "Indulge in stylish luxury at its best with a two-night break at the hottest designer hotel in Canberra, the five-star Ovolo Nishi. Dive into the rich culture and vibrant food scene of the new capital of cool with an upscale stay close to all the city has to offer. Enjoy a daily Ovolo Breakfast, evening social hour serving drinks and tapas, complimentary in-room minibar, late checkout and daily bike hire that’ll allow you to explore the nearby city.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Ovolo Nishi - DEC 2018",
    "offer_address": "NewActon Precinct, 25 Edinburgh Ave, Canberra, Canberra ACT 2601",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 245.0,
    "value": 643.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EeK8gAAF",
    "hero_image": "https://images.luxuryescapes.com/fqjj7kc6dg9sckakeh6a",
    "image_two": "https://images.luxuryescapes.com/srs7m67wqfalhkpxzfbg",
    "image_three": "https://images.luxuryescapes.com/0c3hfy0ui81jll0errmy",
    "vendor_name": "Ovolo Nishi",
    "title": "Stylish Canberra Ovolo Designer Break with Daily Breakfast, Nightly Drinks & Complimentary Minibar",
    "description": "Immerse yourself in urban luxury with a boutique stay at the most stylish designer hotel in Canberra, the top-rated, innovative Ovolo Nishi. Nestled in the contemporary NewActon hub - amid popular bars, glam restaurants and a selection of unique art galleries, hip cinemas and quirky entertainment venues - this uber-cool, eco-conscious hotel puts you within a stone's throw of Canberra's hottest spots and icons, including Parliament House. Enjoy innovative dining at award-winning onsite vegetarian eatery Monster Kitchen and Bar, led by executive chef Matthew Bentley, with a strong focus on home-grown produce and food preservation.\n\nRelish this destination's ideal locale and take the hotel's complimentary bicycles for a spin to discover the surrounding delights of Australia's capital. Sweet tooths will delight in a help-yourself lolly bar, while a 24-hour gym and self-service laundry facilities make your stay ultra-convenient.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ovolo Nishi",
    "offer_address": "NewActon Precinct, 25 Edinburgh Avenue, Canberra, 2601, Australian Capital Territory, Australia",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 304.0,
    "value": 633.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EhAVAA0",
    "hero_image": "https://images.luxuryescapes.com/yppwemmhqk4ud7dfcmz",
    "image_two": "https://images.luxuryescapes.com/efqnflkejt0yvb30q965",
    "image_three": "https://images.luxuryescapes.com/oqocl0cxxig42aewu3rg",
    "vendor_name": "Midnight Hotel, Autograph Collection",
    "title": "Boutique Designer Canberra Luxury with Daily Breakfast & Minibar",
    "description": "Discover a stylish new addition to Canberra - the boutique Midnight Hotel, part of Marriott’s acclaimed Autograph Collection. Experience a celebration of innovative architecture and high design from a sophisticated base near the very best of the city’s culture, food and fashion.\n\nImmerse yourself in the luxe life and enjoy daily breakfast, daily A$25 food and drink credit per room to spend at the seductive Midnight Bar or Braddon Merchant restaurant, a daily replenished complimentary minibar featuring local wines, beers and snacks, free parking and leisurely 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Midnight Hotel, Autograph Collection",
    "offer_address": "1 Elouera Street, Braddon, Australian Capital Territory 2612, Australia",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 276.0,
    "value": 415.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQ5XWAA1",
    "hero_image": "https://images.luxuryescapes.com/3jexpu87krdsfkmkn7fh",
    "image_two": "https://images.luxuryescapes.com/eg2dn59qhtzlw35neajh",
    "image_three": "https://images.luxuryescapes.com/c5gtq5wh6kidfvo667x",
    "vendor_name": "Vibe Hotel Canberra",
    "title": "Sleek Canberra Stay just 10 Minutes from City Centre with Daily Breakfast",
    "description": "Elevate your next ACT escape with a stay at the super-stylish Vibe Hotel Canberra, located just moments from the airport and only a short 10-minute drive from the city centre. The sleek, award-winning architecture of this contemporary hotel makes it a modern icon of the Canberra skyline and not your usual airport stay. When you're not exploring Australia's vibrant 'bush capital' - including unmissable landmarks like the National Gallery of Australia, the Australian War Memorial and Old Parliament House - head to Helix Bar & Dining for craft beers, laidback dining and live music, or savour classic cocktails within the hotel's soaring, zebra-like central atrium.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Vibe Hotel Canberra",
    "offer_address": "1 Rogan Street, Canberra, Australian Capital Territory 2609, Australia",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 9,
    "price": 236.0,
    "value": 445.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000OKsjRAAT",
    "hero_image": "https://images.luxuryescapes.com/uxng6awv5tkdi9qy5gwq",
    "image_two": "https://images.luxuryescapes.com/df1wl604fqo0ogvizjed",
    "image_three": "https://images.luxuryescapes.com/drdbqxow2e8bpzgzkfxq",
    "vendor_name": "Mantra MacArthur Hotel",
    "title": "Mantra Escape at Canberra’s Newest Hotel",
    "description": "Experience the newly opened Mantra MacArthur Hotel, centrally located close to attractions like Parliament House and the National Gallery. Stay two nights and enjoy daily continental breakfast, an antipasto share plate and two glasses of wine, a wine tasting at Shaw Vineyard Estate, self-guided winery tour and tasting at Mt Majura Vineyard and complimentary Wi-Fi for two.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Mantra MacArthur Hotel OLD",
    "offer_address": "219 Northbourne Ave, Turner ACT 2612",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 189.0,
    "value": 346.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IfMxIAK",
    "hero_image": "https://images.luxuryescapes.com/t5cs3l3q5e6rv1c50xpi",
    "image_two": "https://images.luxuryescapes.com/192wfmvmllve01tsr2y",
    "image_three": "https://images.luxuryescapes.com/g40y4g5agjpz9sybrwn",
    "vendor_name": "QT Canberra",
    "title": "Canberra Glamour in the Heart of the CBD with Award-Winning Onsite Restaurant, Daily Breakfast & Complimentary Parking",
    "description": "With a slice of cultural cool, this retreat is your ultimate base for exploring Australia’s capital city. With a unique architectural design fusing wooden beams, polished marble flooring and splashes of colourful decor, QT tips its hat to a city that needs no introduction.\n\nAfter days exploring the cultural precinct of New Acton - known for its restaurants, cinema and art galleries - retreat to your stylish abode. In the evening, feast on modern Australian cuisine at Capitol Bar & Grill, specialising in premium steaks and wood-fired theatrics.\n\nAmong breathtaking natural scenery, Canberra is peppered with markers of Australia’s history. Visit the Australian War Memorial for a heartfelt look into the country’s past. For arguably the best view of Canberra, head straight down Anzac Parade, across Lake Burley Griffin, and over to the Old Parliament House.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "QT Canberra",
    "offer_address": "1 London Circuit, Canberra 2601, Australian Capital Territory, Australia",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 22,
    "price": 249.0,
    "value": 475.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pSK7AAM",
    "hero_image": "https://images.luxuryescapes.com/tk7gy6n9a1nsinwlob",
    "image_two": "https://images.luxuryescapes.com/pfwcz5tr70363jcic3",
    "image_three": "https://images.luxuryescapes.com/6xn4rs51xc9dg47sntmi",
    "vendor_name": "Mercure Canberra",
    "title": "Heritage-Listed Mercure Canberra Escape with Room Upgrade & Daily Breakfast",
    "description": "Soak up Canberra’s impressive cultural experiences, top-notch restaurants, and burgeoning art scene with a central city stay at the beautiful Mercure Canberra, a heritage-listed property set amid a lush, landscaped garden, just moments from the CBD and vibrant NewActon precinct.\n\nOpened in 1927 and listed on the Register of the National Estate, Mercure Canberra is part of the city's rich history. Use this conveniently located hotel as your base for exploring the very best of iconic monuments, including the National Gallery of Australia, Old Parliament House, and the Australian War Memorial. Ranked within the top 10% of properties on Tripadvisor, you'll enjoy outstanding service, superb old-world charm, and a welcoming atmosphere. After days exploring the country's capital, relax at The Courtyard Restaurant, or pull up a seat in the beer garden at Olims Bar & Bistro and soak up the views of Mount Ainslie.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Mercure Canberra Feb 22",
    "offer_address": "Corner of Ainslie & Limestone Ave, Braddon ACT 2612",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 188.0,
    "value": 333.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G26NtAAJ",
    "hero_image": "https://images.luxuryescapes.com/eotkc8p5xo62zl85ui2n",
    "image_two": "https://images.luxuryescapes.com/twf1xvslnbeu9y1k6v1g",
    "image_three": "https://images.luxuryescapes.com/t851l1k6uyjyqh2ecgun",
    "vendor_name": "Mercure Canberra",
    "title": "Heritage-Listed Mercure Canberra Escape with Daily Breakfast",
    "description": "Soak up Canberra’s impressive cultural experiences, top-notch restaurants and burgeoning art scene with a central city stay at the Mercure Canberra. Opened in 1927 and listed on the Register of the National Estate, Mercure Canberra is part of the city's rich history. Use this conveniently located hotel moments from the CBD and vibrant NewActon precinct as your home base and explore the National Gallery of Australia or Old Parliament House. Boasting outstanding service, superb old-world charm and a welcoming atmosphere, guests of this iconic Canberra institution are guaranteed a relaxing retreat.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Mercure Canberra",
    "offer_address": "Corner of Ainslie and Limestone Avenue, Braddon 2612, ACT",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 176.0,
    "value": 355.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HyaKAAS",
    "hero_image": "https://images.luxuryescapes.com/9ajexrl71f1doqbomn",
    "image_two": "https://images.luxuryescapes.com/pagdc4cxgssvndkl6in",
    "image_three": "https://images.luxuryescapes.com/qo0yl7o2v8z5avctrw17",
    "vendor_name": "Garden City Hotel BW Signature Collection",
    "title": "Modern Comfort in Canberra with Daily Breakfast, Welcome Wine & Nightly Drinks",
    "description": "Discover the art, culture and heritage of the nation’s capital with a stay at Garden City Hotel, BW Signature Collection - a winner in the coveted Tripadvisor Travellers' Choice Awards 2021 - located in the heart of Canberra’s vibrant inner-south. Let the hotel's stylish surroundings and convenient location inspire you to discover nearby attractions including Parliament House, the National Gallery of Australia, National Library of Australia and the dining precincts of Kingston and Kingston Foreshore. Return to your hotel for a dip in the lagoon-style pool, work up a sweat in the gymnasium, enjoy contemporary cuisine in the relaxed Secret Garden Restaurant or a drink at Secret Garden Bar.\n\n**Your handpicked inclusions:**\n\n- Start the day with a delicious daily à la carte breakfast at the Secret Garden Bar & Restaurant\n- Celebrate your escape with a welcome bottle of red or white wine on arrival\n- Toast the sunset with one nightly drink each at the Secret Garden Bar\n- Relax until the last moment with a guaranteed 11am late checkout\n- Start your escape sooner with an early 1pm check-in, subject to availability\n- Enjoy the convenience of daily self-parking for one vehicle per stay\n\n**Travelling with family?** Check out the spacious Deluxe Room - Family upgrade, offering plenty of space for up to two adults and one child or baby (see individual packages for details).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Garden City Hotel, BW Signature Collection",
    "offer_address": "55 Jerrabomberra Avenue Narrabundah Canberra, 2603, Australia",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 13,
    "price": 185.0,
    "value": 316.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lhr8AAC",
    "hero_image": "https://images.luxuryescapes.com/ws0kehx1e9n86hcrmz5",
    "image_two": "https://images.luxuryescapes.com/ydd2llbnripy6nzd6sr",
    "image_three": "https://images.luxuryescapes.com/bwylewmkrtm6qhsl8a3f",
    "vendor_name": "Peppers Gallery Hotel Canberra",
    "title": "Boutique Peppers Canberra Escape with Nightly Cocktails",
    "description": "Discover the rich culture and vibrant food scene of the new capital of cool with an upscale stay at Peppers Gallery Hotel Canberra. The hotel's unique 'gallery' theme ensures a one-of-a-kind stay, with a sculpture garden that spills into the foyer, wall hangings and art installations that turn corridors into creative spaces. Ideally located near Lake Burley Griffin and within walking distance of many of Canberra’s national attractions, Peppers Gallery Hotel Canberra makes it easy to explore all the city has to offer.\n\nYour package includes daily continental breakfast, one nightly 'cocktail of the day' each at the stylish Library Bar, A$50 dining credit per room, a self-guided tour at Mount Majura Vineyard, two rejuvenating A$40 Jindi Spa vouchers, discounted Palace Cinema tickets and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Peppers Gallery Hotel Canberra - Feb 2020",
    "offer_address": "15 Edinburgh Ave, Canberra ACT 2601",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 217.0,
    "value": 505.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004URDcAAO",
    "hero_image": "https://images.luxuryescapes.com/1su6adjq0v14556tbahl",
    "image_two": "https://images.luxuryescapes.com/rf50xtkz4e9xlo3yv0dd",
    "image_three": "https://images.luxuryescapes.com/d3b9eoxd0h8j0g9i4zac",
    "vendor_name": "Nishi Apartments by Ovolo",
    "title": "Ovolo Canberra Ultra-Modern Designer Apartments with Daily Breakfast",
    "description": "Experience contemporary designer style and eco-living at its finest with a stay in Canberra’s Nishi Apartments Eco-Living by Ovolo, housed in the artistic-inspired boutique hotel, Ovolo Nishi.\n\nThis contemporary apartment escape invites you to dive into the rich culture and vibrant food scene of the new capital of cool from one of Canberra’s most inspiring precincts: NewActon. You’ll be surrounded by trendy bars, glam restaurants, a unique selection of art galleries, hip cinemas and quirky entertainment venues. You'll also be within close walking distance of many of Canberra's national attractions, including the Australian War Memorial and Parliament House, while the sparkling waters of Lake Burley Griffin sit only a few hundred metres away from the property. When you are ready to relax, retreat to one of Nishi Apartments Eco-Living by Ovolo apartments' sophisticated and effortlessly cool spaces, boasting lavish facilities such as Monster Kitchen and Bar.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Nishi Apartments Eco-Living by Ovolo",
    "offer_address": "25 Edinburgh Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 259.0,
    "value": 425.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JSKHAA4",
    "hero_image": "https://images.luxuryescapes.com/i3hkgbs5pjf12xdy5zvd",
    "image_two": "https://images.luxuryescapes.com/blxvdli1hu9x54ufyt",
    "image_three": "https://images.luxuryescapes.com/dvrt9zi2rwx45lcmhrs",
    "vendor_name": "Nishi Apartments by Ovolo",
    "title": "Ovolo Canberra Ultra-Modern Designer Apartments with Daily Breakfast",
    "description": "Experience contemporary designer style and eco-living at its finest with a stay in Canberra’s Nishi Apartments Eco-Living by Ovolo, housed in the artistic-inspired boutique hotel, Ovolo Nishi. This contemporary apartment escape invites you to dive into the rich culture and vibrant food scene of the new capital of cool from one of Canberra’s most inspiring precincts: NewActon.\n\nYou’ll be surrounded by trendy bars, glam restaurants, a unique selection of art galleries, hip cinemas and quirky entertainment venues. You'll also be within close walking distance of many of Canberra's national attractions, including the Australian War Memorial and Parliament House, while the sparkling waters of Lake Burley Griffin sit only a few hundred metres away from the property. When you are ready to relax, retreat to one of Nishi Apartments Eco-Living by Ovolo apartments' sophisticated and effortlessly cool spaces, boasting lavish facilities such as Monster Kitchen and Bar.\n\n**Your handpicked inclusions:**\n\n- Start the day with a delicious daily plated breakfast at Monster Kitchen and Bar\n- Toast to your city escape with a welcome bottle of wine on arrival\n- Make the most of your last day in Canberra with a late 12pm checkout\n\n**Want to wake up to sweeping views over Lake Burley Griffin?** Upgrade to a One Bedder Lake View apartment, an ultra-modern space complete with a furnished balcony overlooking the lake.\n\n**Travelling with family or in need of more space?** Upgrade to a Two Bedder or Two Bedder Deluxe, with two children (11 and under) staying free with daily plated breakfast included.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Nishi Apartments Eco-Living by Ovolo",
    "offer_address": "25 Edinburgh Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 270.0,
    "value": 466.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HiPRIA0",
    "hero_image": "https://images.luxuryescapes.com/9n159ntku929nue99hzr",
    "image_two": "https://images.luxuryescapes.com/6d5jnxb1e8papujp2vv4",
    "image_three": "https://images.luxuryescapes.com/du7q7b474mnr6css5paq",
    "vendor_name": "The Sebel Canberra Civic",
    "title": "Contemporary Canberra London Circuit Stay Next to Civic Square with Daily Breakfast",
    "description": "Nestled in the heart of Civic, this modern hotel places you perfectly amid the many cultural and historical landmarks, thriving bars, trendy cafes and incredible scenery that Canberra is known for. Find yourself just a short stroll from City Hill, the city's bustling shopping precinct and lush parklands, perfect for visiting with your pets - who the hotel warmly welcomes.\n\nIndulge in breakfast and barista-made coffee next door at Capital Grind before heading out to explore Canberra's renowned galleries and museums - highlights include the National Museum of Australia, the National Gallery of Australia and Old Parliament House. Walk the Lake Burley Griffin circuit to get there and take in iconic views of Anzac Parade, leading to the War Memorial.\n\nFor outdoors lovers, Mount Ainslie rewards with panoramic views of the Parliamentary Triange from its lookout, and the Australian National Botanic Gardens and National Arboretum are not to be missed. Stay out till the sun sets over the capital, then head to lively Lonsdale Street for a mix of upscale bars, music and delicious dining just a short 15-minute walk from the hotel.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "The Sebel Canberra Civic",
    "offer_address": "197 London Circuit, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 219.0,
    "value": 445.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GVwCzYAL",
    "hero_image": "https://images.luxuryescapes.com/hplxgtttio74of72kisj",
    "image_two": "https://images.luxuryescapes.com/silcaqquo9ar9919zxgn",
    "image_three": "https://images.luxuryescapes.com/hg8gjnykfe1480iig2w5p",
    "vendor_name": "Peppers Gallery Hotel Canberra",
    "title": "Elegant Central Canberra Escape with Daily Breakfast, Nightly Cocktails & Dining Credit",
    "description": "Tucked away among the NewActon precinct's stylish bars, glam restaurants and quirky entertainment venues, Canberra’s hidden gem sets the standard for pure comfort. The hotel's unique 'gallery' theme ensures a one-of-a-kind stay, with a sculpture garden that spills into the foyer and art installations that turn corridors into creative spaces.\n\nTake in the full Canberra experience with tailored culinary moments and immersive cultural experiences on your doorstep, with your hotel located near Lake Burley Griffin and within walking distance of Parliament House. Indulge in a bespoke gourmet experience at the hotel's renowned Canberra institution, the acclaimed Italian trattoria, Bicicletta.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Peppers Gallery Hotel Canberra",
    "offer_address": "15 Edinburgh Avenue, Canberra 2601, ACT",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 209.0,
    "value": 351.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VBCxAAO",
    "hero_image": "https://images.luxuryescapes.com/38xbaxrqkhl578vpb6ry",
    "image_two": "https://images.luxuryescapes.com/f8jkfjc4b69m75gz4p9k",
    "image_three": "https://images.luxuryescapes.com/3mkyanzewo5rfsn3kdbr",
    "vendor_name": "Burbury Hotel Canberra",
    "title": "Ultra-Stylish Canberra Escape",
    "description": "Understated elegance meets striking contemporary design in the nation's capital at the ultra-stylish Burbury Hotel & Apartments. More than just a place to rest your head at night, this exquisite property is the gateway to the many experiences Canberra has to offer. Let the hotel’s impressive amenities, including fine dining, casual dining, lounge bar, hair salon, health club, day spa, lap pool and hydrotherapy spa fulfil your needs onsite, then make time to visit the National Gallery of Australia, Parliament House and other highlights worthy of your attention within close walking distance.\n\nA short escape here is the ideal place to recharge and feel rejuvenated while allowing your surroundings to inspire you in a city that deserves more than just a short stopover.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Burbury Hotel Canberra",
    "offer_address": "1 Burbury Close, Barton Canberra ACT 2600 Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zIk3AAE",
    "hero_image": "https://images.luxuryescapes.com/0fe8gtdtsj76k7g36i6",
    "image_two": "https://images.luxuryescapes.com/54msbaqki7gac4sofds",
    "image_three": "https://images.luxuryescapes.com/d1egxc5ldnrzxedy8dj9",
    "vendor_name": "Hotel Realm",
    "title": "Five-Star Canberra City Break",
    "description": "Experience one-of-a-kind luxury on a stylish escape to the national capital of Australia at the five-star Hotel Realm - within walking distance of the National Gallery of Australia. Inbetween sipping fine wine and dining on delicious local produce at Canberra's many bars and restaurants, enjoy everything on offer at the hotel's multi-award-winning Realm Precinct, which features chef-hatted restaurants, casual eateries, a wholefood café, wellbeing outlets and a hair salon.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Hotel Realm",
    "offer_address": "18 National Circuit, Canberra ACT 2600",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005IgH9AAK",
    "hero_image": "https://images.luxuryescapes.com/al10tgkgray6y5ewjkq",
    "image_two": "https://images.luxuryescapes.com/5e2nrpiufs6vcornk9ot",
    "image_three": "https://images.luxuryescapes.com/bhkaafg4dw8hj5zvecdh",
    "vendor_name": "A by Adina, Canberra",
    "title": "Brand-New Canberra Apartment Escape",
    "description": "Be in the heart of Canberra’s bustling CBD with a stay at the ultra-sleek, new A by Adina Canberra apartments. Designed by award-winning architects at Bates Smart, this modern, sustainably built property features glossy, self-contained apartments - decked out with kitchenettes and coffee machines - that are the perfect retreat after a day exploring the nation’s capital. A by Adina Canberra is ideally located on the cusp of the Parliamentary Triangle, close to the city’s best dining and retail spots, with the famous Lake Burley Griffin just around the corner.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "A by Adina Canberra",
    "offer_address": "1 Constitution Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PoKqAAK",
    "hero_image": "https://images.luxuryescapes.com/omu9h9h5sgzxla6ce32e",
    "image_two": "https://images.luxuryescapes.com/gxq15qkdluoar24vq7g",
    "image_three": "https://images.luxuryescapes.com/rlmvi4pi93pdn4qbejx",
    "vendor_name": "Canberra Rex Hotel",
    "title": "Central Canberra Escape with Rooftop Bar",
    "description": "Follow in the footsteps of royalty with a landmark stay in Australia's capital at Canberra Rex Hotel. Built in 1959, the hotel has been meticulously restored to its former glory and is the epitome of elegance while still considering the modern traveller, creating a home away from home among its spacious rooms and stylish suites. Sitting pretty on Northbourne Avenue - the gateway to the city centre - the hotel offers easy access to nearby national monuments and award-winning coffee roasters. Then, return for a dip in the 20-metre indoor pool, followed by a visit to the onsite rooftop bar - The Howling Moon - where you can sip a cocktail while gazing at the city's panoramic views.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Canberra Rex Hotel",
    "offer_address": "150 Northbourne Ave, Braddon ACT 2612",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z6PUAAY",
    "hero_image": "https://images.luxuryescapes.com/4y0hkp4z3gwecl6ukouv",
    "image_two": "https://images.luxuryescapes.com/659rjis7kfyky2duteoh",
    "image_three": "https://images.luxuryescapes.com/y5o019wyadfa4x0sd3r",
    "vendor_name": "QT Canberra",
    "title": "Luxe QT Canberra Escape near the NewActon Precinct, War Memorial & Parliament House",
    "description": "The ultimate base from which to explore the culture of Australia’s capital city, QT Canberra fuses luxury service and amenities with stylish décor. Cast your vote for a luxurious stay close to the river at this iconic hotel and experience an escape that places you within walking distance of stylish bars, glam restaurants, art galleries, the War Memorial and Parliament House.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "QT Canberra",
    "offer_address": "1 London Circuit, Canberra 2601, Australian Capital Territory, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VBkAAAW",
    "hero_image": "https://images.luxuryescapes.com/hoq03hft3nkgx90zq0gla",
    "image_two": "https://images.luxuryescapes.com/bpm228nmiw89pe0co8na",
    "image_three": "https://images.luxuryescapes.com/93ik2xrq5pt8ux9wwhim",
    "vendor_name": "Little National Hotel Canberra",
    "title": "Stylish Boutique Canberra Escape near Parliament House & Lake Burley Griffin",
    "description": "Experience the stylish side of Canberra from the ultra-cool and unique Little National Hotel. Concealed in the luxe Realm Precinct - an upmarket complex of first-class eateries and lavish wellness facilities - this boutique abode boasts a prime location in the heart of Canberra's Parliamentary Triangle, just steps from major sights including Parliament House and Lake Burley Griffin.\n\nSmartly designed for the modern traveller, highly efficient and exquisitely compact, the light-filled rooms offer wall-to-wall windows, super-king beds with luxe linen, fluffy doonas and comfy pillows for the perfect night’s sleep, and ultra-modern bathrooms with a glorious rainshower and dreamy amenities. Keep on top of your fitness at the Realm Precinct's state-of-the-art gym, unwind around the fireplace at the Lounge & Library, or check out Ritual Coffee for a top brew and the award-winning Chairman & Yip for first-class dining.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Little National Hotel Canberra",
    "offer_address": "21 National Circuit, Barton ACT 2600",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 14,
    "price": 96.0,
    "value": 96.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VnClAAK",
    "hero_image": "https://images.luxuryescapes.com/redv3u9t86eaep1wo1vw",
    "image_two": "https://images.luxuryescapes.com/57uha90ongif5gu4qawb",
    "image_three": "https://images.luxuryescapes.com/owugdf2ba505orykke",
    "vendor_name": "Hotel Kurrajong Canberra",
    "title": "Canberra Art Deco Luxury",
    "description": "Discover the art, culture and heritage of Australia's capital staying at the Art Deco-style Hotel Kurrajong Canberra, ranked within the top 10% of properties on Tripadvisor. Ideally located a short stroll from Parliament House, world-class cultural and dining experiences, and wildlife-filled bushland reserves, this heritage property was once a base for some of Australia's most senior politicians.\n\nThis historic hotel, which dates back to 1926, is today a stylish base for those looking to discover the vibrant city of Canberra. The jewel in its crown is Chifley’s Bar & Grill (named after the 16th Prime Minister of Australia, Ben Chifley), which serves whiskies from around the world, and seasonal dishes inspired by the region’s wineries and producers, to the sound of soft jazz.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Hotel Kurrajong Canberra",
    "offer_address": "8 National Circuit, Barton, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 14,
    "price": 137.0,
    "value": 137.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlvcIAC",
    "hero_image": "https://images.luxuryescapes.com/wuaburjxfyei3e1do0h",
    "image_two": "https://images.luxuryescapes.com/l4wi8hbn4oxwffdshg4",
    "image_three": "https://images.luxuryescapes.com/5qzelestkkmbn37c5wq",
    "vendor_name": "Novotel Canberra",
    "title": "Stylish Central Canberra Stay with Indoor Pool",
    "description": "Engage with Australia's intimate and cultured capital city with a central stay, located just steps from the iconic Australian War Memorial and the National Gallery of Australia. Find yourself within walking distance of Canberra's vibrant dining scene, boutique shopping and picturesque Lake Burley Griffin.\n\nAfter a day of exploring, retreat to the hotel's indoor heated pool or jacuzzi, unwind at the onsite fitness centre or savour a meal at the First Edition Restaurant & Bar, where you can indulge in locally sourced dishes and a selection of drinks.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Novotel Canberra",
    "offer_address": "65 Northbourne Avenue, Canberra 2601, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 89.0,
    "value": 89.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004T8plAAC",
    "hero_image": "https://images.luxuryescapes.com/y588wn9m2hu56us1zno",
    "image_two": "https://images.luxuryescapes.com/3lw72hy0k4ebke26c3jj",
    "image_three": "https://images.luxuryescapes.com/7ikswsht0fzw9fpf04k",
    "vendor_name": "Abode Tuggeranong",
    "title": "Stylish Canberra Lakeside Apartment Escape with Complimentary Wine",
    "description": "Find yourself just a short drive from Canberra CBD and the Australian Capital Territory's most beautiful nature reserves and national parks at Abode Tuggeranong. Embrace the tranquility of Greenway, a serene neighbourhood in Canberra's Tuggeranong suburb, overlooking the sparkling waters of Lake Tuggeranong. Live like a local in one of Abode's stylish apartments, fitted with modern kitchenettes and TVs with STAYCAST streaming. There's also the convenient Abode Pantry - stocked with healthy frozen meals, drinks and more - onsite, and a foyer lined with retro-inspired bikes.\n\nYou won't need to venture far for dining options, with the restaurants of Anketell St just a short walk away. Alternatively, head to the convenient shopping centre opposite Abode and pick up some groceries to cook up in the comfort of your apartment. For high-end dining and designer shopping, it's a 20-minute drive to Canberra CBD, where you'll also find attractions including the National Gallery of Australia and Parliament House.\n\nWhen you are ready to explore further afield, head to one of the striking reserves around the area: Bullen Range Nature Reserve offers infinite opportunities for adventure, while majestic Tidbinbilla Nature Reserve is the perfect place for spotting wildlife, admiring thundering waterfalls and learning more about the culture and heritage of the Ngunnawal people - the Traditional Custodians of the Canberra region.\n\n**Luxury Escapes inclusions (select nights/packages):**\n\n- A welcome **bottle of wine** to toast to your escape\n- Complimentary in-room **bottled water** to keep hydrated during your adventures\n- Guaranteed **11am checkout** to make the most of your stay\n- Stay connected with **complimentary Wi-Fi** throughout\n- Two-hour **bike hire** per person, per stay, to help you explore the area (for stays of 2+ nights)\n- **A$15 food and drink credit** per package, per stay to use at the onsite Abode Pantry (for stays of 2+ nights)\n- An additional A$5 **(A$20 total) food and drink credit** per package, per stay (for stays of 3+ nights)\n- An additional A$5 **(A$25 total) food and drink credit** per package, per stay (for stays of 4+ nights)\n- An additional A$5 **(A$30 total) food and drink credit** per package, per stay (for stays of 5+ nights)\n\n**Travelling with family or friends?** Upgrade to a Two Bedroom Two Bathroom Apartment (81sqm) with separate lounge area and balcony for up to four guests.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Abode Tuggeranong",
    "offer_address": "150 Anketell St, Greenway ACT 2900",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 137.0,
    "value": 137.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DMdoAAG",
    "hero_image": "https://images.luxuryescapes.com/ek5rm6lm2r6sfcu12o4e",
    "image_two": "https://images.luxuryescapes.com/jtd912rs8sadx9msv6b",
    "image_three": "https://images.luxuryescapes.com/tzua7n70jk1f2enn3yl",
    "vendor_name": "Vibe Hotel Canberra",
    "title": "Sleek Canberra Airport Stay Just 10 Minutes from City Centre",
    "description": "It doesn't get more convenient than a stay at Vibe Hotel Canberra, just 350 metres from the airport and a swift 10-minute drive to the CBD. When you're not checking out what this vibrant city has to offer - including the National Gallery of Australia, the Australian War Memorial and the Old Parliament House - enjoy moments of downtime at your hotel. Order a cocktail or craft beer at Helix Bar & Dining, a fun bistro where you can catch live music as well as a delicious lunch and dinner menu.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Vibe Hotel Canberra",
    "offer_address": "1 Rogan Street, Canberra, Australian Capital Territory 2609, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 117.0,
    "value": 117.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbPZbAAN",
    "hero_image": "https://images.luxuryescapes.com/zphlmslzxmiy552m09",
    "image_two": "https://images.luxuryescapes.com/73fzutbzsalzdbr47sl8",
    "image_three": "https://images.luxuryescapes.com/enoqgu5lqeimlsg82397",
    "vendor_name": "A by Adina, Canberra",
    "title": "Canberra CBD Modern Apartment-Style Stay near Trendy Bars & Eateries",
    "description": "Immerse yourself in the wonder of Australia’s capital with a glamorous stay at A by Adina Canberra in the heart of the city. Designed by award-winning architects Bates Smart, the beautiful sculptural exterior impresses while the warm, plush interiors are ideal for relaxation after days exploring the ACT’s many museums, parks and cultural sites. Keep up your fitness regime in the hotel’s gym, or treat yourself to a series of delectable dishes and cocktails at one of the esteemed venues next door.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "A by Adina Canberra",
    "offer_address": "1 Constitution Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 126.0,
    "value": 126.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JReuVAAT",
    "hero_image": "https://images.luxuryescapes.com/llz8zlsngew96z3w5kms",
    "image_two": "https://images.luxuryescapes.com/pvtrtsovihwxfd8jfxk",
    "image_three": "https://images.luxuryescapes.com/pkok6etxc7fcpxdm3ne",
    "vendor_name": "Breakfree Capital Tower",
    "title": "Central Canberra Self-Contained Apartment Escape Near Lake Burley Griffin",
    "description": "Experience the vibrancy of Australia's capital from this perfectly positioned, self-contained apartment escape in the heart of Canberra. Overlooking Lake Burley Griffin, the hotel offers easy access to the city's premier attractions, including the National Gallery of Australia and the Parliament House.\n\nEnjoy all the comforts of home while taking in the city lights from your balcony. The hotel's indoor heated pool provides the perfect spot for relaxation. After a day of exploration, savour a meal at the nearby Kingston Foreshore, Canberra's bustling waterfront precinct filled with trendy eateries and bars.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australia",
    "location_description": "BreakFree Capital Tower Canberra",
    "offer_address": "2 Marcus Clarke Street, Canberra, ACT, Australia, 2601",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 110.0,
    "value": 110.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007ohi1AAA",
    "hero_image": "https://images.luxuryescapes.com/uu6uxgtlqpf8yqfvsn",
    "image_two": "https://images.luxuryescapes.com/7ws31p10aw3b94ugb1ol",
    "image_three": "https://images.luxuryescapes.com/2qh7cjtru0x8dtby66d",
    "vendor_name": "Adina Serviced Apartments Canberra Dickson",
    "title": "Stylish Canberra City Break in Leafy Dickson",
    "description": "Make yourself at home at the Adina Serviced Apartments Canberra Dickson, a stylish property located in verdant Dickson, just a few minutes from the city centre. Canberra’s premier retail and dining precincts are just a short amble away, with an abundance of cafés, bars and restaurants. If you're ready for some sightseeing, Parliament House, Lake Burley Griffin, the National Gallery of Australia, Mount Ainslie Lookout, the Australian War Memorial and the National Library are all nearby.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Adina Serviced Apartments Canberra Dickson",
    "offer_address": "45 Dooring St, Dickson, ACT 2602",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 100.0,
    "value": 100.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRetXAAT",
    "hero_image": "https://images.luxuryescapes.com/b8one1kyxoema2ekpr2l",
    "image_two": "https://images.luxuryescapes.com/p5on8yiml2310hzue3dr",
    "image_three": "https://images.luxuryescapes.com/s0twtwx1pdps0zgv167c",
    "vendor_name": "Mantra on Northbourne",
    "title": "Stylish Canberra Escape Moments from the CBD with Indoor Pool & Onsite Restaurant",
    "description": "Find yourself mere moments from the vibrant Canberra CBD with a stay at this sleek abode, perfectly positioned in the heart of the city. The modern hotel boasts lavish rooms as well as self-contained apartments tailored to your comforts and is within easy access of cultural landmarks, including  Parliament House, the Australian War Memorial and the National Gallery of Australia.\n\nSwim laps in the indoor heated pool, relax in the sauna and tuck into sumptuous food at the Stock Bar & Kitchen. If you wish to explore, take a short stroll to reach Braddon district, renowned for its artisan coffee shops and innovative modern Australian eateries.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australia",
    "location_description": "Mantra on Northbourne Canberra",
    "offer_address": "84 Northbourne Avenue, Canberra 2612, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 67.0,
    "value": 67.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004T9EHAA0",
    "hero_image": "https://images.luxuryescapes.com/nbgh266m6ao5htdeam3",
    "image_two": "https://images.luxuryescapes.com/3cqcnuc9gv4u14ixdgj",
    "image_three": "https://images.luxuryescapes.com/fakdr5saotx4o7ggj76",
    "vendor_name": "Abode Belconnen",
    "title": "Relaxing Canberra Apartment Stay",
    "description": "Treat yourself to a relaxing city stay at Abode Belconnen, a boutique retreat bordering the beautiful Lake Ginninderra in Canberra's north-west. Located in the picturesque suburb of Belconnen, only 20 minutes from the Australia Capital Territory's iconic attractions, this stylish apartment hotel is the perfect launchpad for exploring the very best of Canberra - including the National Gallery of Australia and Parliament House - and relaxing after adventure-filled days.\n\nGreat for long or short stays, each stylishly appointed studio or apartment features a kitchenette, laundry facilities and TV with STAYCAST streaming. For wholesome food, you needn't go far, with Westfield Belconnen less than a 15-minute walk away, and the sophisticated No.10 Restaurant + Bar and the convenient Abode Pantry - stocked with healthy frozen meals and drinks - onsite. Plus, there's a foyer lined with retro-inspired bikes - perfect for an afternoon cycling around the Lake Ginninderra circuit.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Abode Belconnen",
    "offer_address": "3 Grazier Lane, Belconnen ACT 2617 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 32,
    "price": 87.0,
    "value": 87.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JResyAAD",
    "hero_image": "https://images.luxuryescapes.com/2szdc57c4g9nf3sva8",
    "image_two": "https://images.luxuryescapes.com/f3hk7je57pqu82cfhlvm",
    "image_three": "https://images.luxuryescapes.com/odxjuqlfzt2rr5qqcmfs",
    "vendor_name": "Peppers Gallery Hotel Canberra",
    "title": "Elegant Central Canberra Escape in the Heart of New Acton with Onsite Italian Trattoria",
    "description": "Tucked away amid the New Acton precinct's stylish bars, glam restaurants and quirky entertainment venues, Canberra’s hidden gem sets the standard for pure indulgence. Peppers Gallery Hotel Canberra’s unique 'gallery' theme ensures a one-of-a-kind stay, with a sculpture garden that spills into the foyer, wall hangings and art installations that turn corridors into creative spaces.\n\nTake in the full Canberra experience with tailored culinary moments and immersive cultural experiences on your doorstep, with your hotel located near Lake Burley Griffin and within walking distance of Parliament House. Indulge in a bespoke gourmet experience at the hotel's renowned Canberra institution, the acclaimed Italian trattoria, Bicicletta.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Peppers Gallery Hotel Canberra",
    "offer_address": "15 Edinburgh Avenue, Acton, ACT, Australia, 2601",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 71.0,
    "value": 71.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004T9CGAA0",
    "hero_image": "https://images.luxuryescapes.com/gmifyq81gejzj00duf6q",
    "image_two": "https://images.luxuryescapes.com/aio72lcovojyqwqmlnkn",
    "image_three": "https://images.luxuryescapes.com/4jsdlr2oikkfvcchk8k",
    "vendor_name": "Abode Narrabundah",
    "title": "Stylish Apartment Stay in Canberra's Inner-South with Welcome Wine",
    "description": "Whisk yourself away on a stylish city stay at Abode Narrabundah - a boutique gem crowning the tranquil gardens of Canberra's inner-south - only 15 minutes from the Australian Capital Territory's iconic attractions. Located in the leafy green suburb of Narrabundah, this boutique apartment-style hotel is the perfect launchpad for exploring the very best of Canberra - including the National Gallery of Australia and Parliament House - while offering a tranquil space to retreat to after adventure-filled days.\n\nGreat for long or short stays, each stylishly appointed studio features a kitchenette and TV with STAYCAST streaming. There's also the convenient Abode Pantry onsite, stocked with healthy frozen meals, drinks and more. Exploring Canberra and its surrounds is easy thanks to complimentary private parking - or why not swap to two wheels and take an Abode bike into the city, only a 20-minute ride away? If you'd prefer to stay local, Abode Narrabundah is positioned on the perimeter of Capital Public Golf Course and close to Canberra’s inner-south dining and shopping hotspots.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Abode Narrabundah",
    "offer_address": "61 Jerrabomberra Ave Narrabundah ACT 2604 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 89.0,
    "value": 89.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CAYZAA4",
    "hero_image": "https://images.luxuryescapes.com/vf0h3nlinliqpl8niodn",
    "image_two": "https://images.luxuryescapes.com/yrab747s4obrca8vup5",
    "image_three": "https://images.luxuryescapes.com/1zp7yd9zcjyb177xxoavh",
    "vendor_name": "Nishi Apartments by Ovolo",
    "title": "Ultra-Modern Canberra Apartments by Ovolo in Creative NewActon Precinct",
    "description": "Experience a stay to remember in Canberra’s Nishi Apartments Eco-Living by Ovolo, housed in the art-inspired boutique hotel, Ovolo Nishi. This contemporary escape invites you to dive into the rich culture and vibrant food scene of the new capital of cool in one of Canberra’s most inspiring precincts: NewActon. Cycle to nearby sights (subject to availability) including the Australian War Memorial and Parliament House, and enjoy access to the vegetarian Monster Kitchen and Bar just downstairs.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Nishi Apartments Eco-Living by Ovolo",
    "offer_address": "25 Edinburgh Avenue, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 107.0,
    "value": 107.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hHO6AAM",
    "hero_image": "https://images.luxuryescapes.com/w1o5oa98n7e0uoa4jr9s",
    "image_two": "https://images.luxuryescapes.com/durkr4qb2oe26z5h5bqs",
    "image_three": "https://images.luxuryescapes.com/n3emxwuaaw4l13lan0g2",
    "vendor_name": "Ovolo Nishi",
    "title": "Top-Rated Canberra Ovolo Designer Break in the Heart of the NewActon Precinct",
    "description": "Immerse yourself in urban luxury with a boutique stay at the most stylish designer hotel in Canberra, the top-rated Ovolo Nishi. Enjoy dining at the award-winning onsite Monster Kitchen and Bar, take the hotel's complimentary bicycles for a spin to discover the surrounding delights of Australia's capital, including Parliament House, and help yourself to the complimentary lolly bar in the lobby. Plus, this uber-cool, eclectic hotel puts you within a stone's throw of Canberra's hottest spots and icons.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Ovolo Nishi",
    "offer_address": "NewActon Precinct, 25 Edinburgh Avenue, Canberra, 2601, Australian Capital Territory, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 90.0,
    "value": 90.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2xhIAC",
    "hero_image": "https://images.luxuryescapes.com/lipobfj95qbsgtw8sv8",
    "image_two": "https://images.luxuryescapes.com/lokmpigonchmf7ta564",
    "image_three": "https://images.luxuryescapes.com/qd0qyqh0pjuk7djslc9b",
    "vendor_name": "The Sebel Canberra Civic",
    "title": "Contemporary Canberra London Circuit Stay Near Australian War Memorial & City Hill",
    "description": "Nestled in the heart of Civic, this modern hotel places you perfectly amid the many cultural and historical landmarks, thriving bars, trendy cafes and incredible scenery that Canberra is known for. Find yourself just a short stroll from City Hill, the city’s bustling shopping precinct and lush parklands, perfect for visiting with your pets - who the hotel warmly welcomes.\n\nStart your day at one of the city's best cafes before exploring highlights like the National Museum of Australia, the National Gallery of Australia and Old Parliament House. Walk the Lake Burley Griffin circuit to get there and take in iconic views of ANZAC Parade, leading to the War Memorial. The perfect base for any Canberra adventure.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "The Sebel Canberra Civic",
    "offer_address": "197 London Circuit, Canberra, Australian Capital Territory 2601, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 87.0,
    "value": 87.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt5XAAR",
    "hero_image": "https://images.luxuryescapes.com/muy4jzuiqc2y6xxwq3mn",
    "image_two": "https://images.luxuryescapes.com/btm0euryqewbccjn0kco",
    "image_three": "https://images.luxuryescapes.com/7w8crxk95u5m2byf75rb",
    "vendor_name": "Crowne Plaza Canberra",
    "title": "Tranquil Canberra Escape in Heart of CBD Close to Wine Region",
    "description": "Take in the best of Australia’s tranquil capital with a stay at the contemporary Crowne Plaza Canberra, an IHG Hotel. Perfect for business travellers or a romantic city escape, the hotel creates a welcoming atmosphere with an ideal CBD location close to the museums and galleries, the bustling shopping district and an array of vibrant restaurants and bars. Take a relaxing short drive through Canberra’s iconic wine region and explore charming towns like Bungendore, Gundaroo and Murrumbateman, along with stunning local vineyards and sophisticated cellar doors. After a long day of discovery, grab a decadent dinner at the hotel’s Redsalt Restaurant, serving up modern Australian fare, before relaxing with an evening cocktail in hand.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australia",
    "location_description": "Crowne Plaza Canberra, an IHG Hotel",
    "offer_address": "1 Binara St, Canberra, ACT, 2601, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 88.0,
    "value": 88.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G5GLOAA3",
    "hero_image": "https://images.luxuryescapes.com/taxba8lufwqmmtnyva4e",
    "image_two": "https://images.luxuryescapes.com/rtbondsghnrioxk94r9q",
    "image_three": "https://images.luxuryescapes.com/k3p3pqlk5s67gvbwazx",
    "vendor_name": "Jamala Wildlife Lodge",
    "title": "Canberra Wildlife Lodge Stay with Rooms & Suites Overlooking National Zoo Animal Enclosures",
    "description": "Creature comfort takes on a new meaning with a stay alongside some of the world's most majestic animals at this five-star retreat, hidden within Canberra's National Zoo & Aquarium. Go where the wild things are and stay in safari-style accommodation, offering views over the enclosures or pristine nature. Animal welfare is one of the top priorities and animals have the option to be near the room or far away and out of sight, with the funds raised supporting the zoo's breeding programs.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Jamala Wildlife Lodge",
    "offer_address": "National Zoo & Aquarium, 999 Lady Denman Drive, Canberra, Australian Capital Territory 2611, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 929.0,
    "value": 929.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v0sVAAQ",
    "hero_image": "https://images.luxuryescapes.com/56q3ask3asfmbx23bp8v",
    "image_two": "https://images.luxuryescapes.com/bd0sa3118uv7wr2kd6dlv",
    "image_three": "https://images.luxuryescapes.com/pijfx3osmbyfxlam2tm",
    "vendor_name": "Rydges Canberra",
    "title": "Centrally Located Rydges Canberra Stay near Parliament House",
    "description": "Escape to the nation’s capital with a stylish stay at the Rydges Canberra - a charming retreat ideally located in the Parliamentary Triangle of Canberra. Sneak away for a relaxing escape in a burgeoning destination packed with upscale eateries, microbreweries, indulgent wine and cocktail bars and award-winning coffee roasters, then tap into the history of the country, with top attractions including Parliament House, the National Gallery of Australia and the National Portrait Gallery all within close reach. When you return after a day of exploring, relax at The George Bar with a signature cocktail or let yourself be taken on a culinary journey at The George Grill.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Rydges Canberra",
    "offer_address": "17 Canberra Avenue, Forrest, Canberra, Australian Capital Territory 2603, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 78.0,
    "value": 78.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007ohjnAAA",
    "hero_image": "https://images.luxuryescapes.com/1oy3m34a7oyq99xvkxd",
    "image_two": "https://images.luxuryescapes.com/mfgg91arox1wrcuplg",
    "image_three": "https://images.luxuryescapes.com/pbyqjv5n6lsl4e3cjbhr",
    "vendor_name": "Hotel Kurrajong Canberra",
    "title": "Elegant Canberra Heritage Hotel near Old Parliament House",
    "description": "First opened in 1926, Hotel Kurrajong Canberra effortlessly combines classic elegance and modern style. Featuring glamorous Art Deco décor, smooth jazz music and nostalgic ambient lighting, the hotel is the perfect place to relax and unwind as you explore Australia’s capital. Take a short 10-minute stroll to the iconic Old Parliament House, mint your own souvenir coin at the Royal Australian Mint or explore the vibrant CBD a ten-minute drive away. Head back for a decadent dinner of steaks, seafood, chicken and more at Chifley’s Bar & Grill - named after the 16th Prime Minister of Australia, Ben Chifley - or try the signature cocktail, an ode to the hotel’s rich history.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Hotel Kurrajong Canberra",
    "offer_address": "8 National Circuit, Barton, Canberra, Australian Capital Territory 2600, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 126.0,
    "value": 126.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnOvBYAV",
    "hero_image": "https://images.luxuryescapes.com/cy4gq87n97ztfhzux9r",
    "image_two": "https://images.luxuryescapes.com/tdkdgxa9lhnnrx8j5kzl",
    "image_three": "https://images.luxuryescapes.com/75shhf99ojual4q7k3a",
    "vendor_name": "The Sebel Canberra Campbell",
    "title": "Contemporary Canberra Stay near CBD & Australian War Memorial",
    "description": "Surrounded by lush parklands in Canberra's popular Campbell district, this contemporary hotel is perfectly positioned with easy access to Canberra's vibrant city centre, renowned museums and the tranquil shores of Lake Burley Griffin.\n\nStart your day at one of the city's best cafes before exploring highlights like the National Museum of Australia, the National Gallery of Australia and Old Parliament House. Walk the Lake Burley Griffin circuit to get there and take in iconic views of ANZAC Parade, leading to the War Memorial.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "The Sebel Canberra Campbell",
    "offer_address": "16 Provan Street, Campbell, Canberra, Australian Capital Territory 2612, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 98.0,
    "value": 98.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v1XxAAI",
    "hero_image": "https://images.luxuryescapes.com/7de1dxvg29uhsb3n22h",
    "image_two": "https://images.luxuryescapes.com/f33dphlw8mpt1kaoext",
    "image_three": "https://images.luxuryescapes.com/w7xxu3rrkqrr25xdiolm",
    "vendor_name": "QT Canberra",
    "title": "Stylish Canberra QT Escape in the Heart of NewActon",
    "description": "Where cultural cool meets national politics, discover your ultimate base for exploring Australia’s capital city at QT Canberra. Cast your vote for a luxurious stay close to Molonglo River and experience an escape that places you within walking distance of stylish bars, restaurants, art galleries and Parliament House. After days spent exploring, retreat to your stylish abode in the heart of NewActon and feast on innovative Italian delights at Capitol Bar & Grill, a must for dining during your stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "QT Canberra",
    "offer_address": "1 London Circuit, Canberra 2601, Australian Capital Territory, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 85.0,
    "value": 85.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2yrIAC",
    "hero_image": "https://images.luxuryescapes.com/im46o5y62pjot3g8etu",
    "image_two": "https://images.luxuryescapes.com/7q43gn78jj9p3n6qz5",
    "image_three": "https://images.luxuryescapes.com/wli35fwwifj3961rp3fm",
    "vendor_name": "Mercure Canberra Belconnen",
    "title": "Relaxing Canberra Mercure Escape Near Lake Ginninderra",
    "description": "Immerse yourself in Australia's intimate and cultured capital city with a stylish lakeside stay at a beautifully appointed property near Lake Ginninderra. Make use of the hotel's fitness centre or savour a meal at Selection Bistro, located in the adjoining Canberra Labor Club.\n\nVenture out to discover the city's iconic landmarks, including the Australian War Memorial and the National Gallery, or indulge in retail therapy at world-class shopping centres. For nature enthusiasts, scenic national parks beckon, while sports aficionados will appreciate proximity to major stadiums.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Mercure Canberra Belconnen",
    "offer_address": "59 Cameron Avenue, Belconnen 2617, Australian Capital Territory, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 76.0,
    "value": 76.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2ydIAC",
    "hero_image": "https://images.luxuryescapes.com/qz307fue8nuomy8358hi",
    "image_two": "https://images.luxuryescapes.com/68ya8q3rk4dwq6ru8r",
    "image_three": "https://images.luxuryescapes.com/w37ug7evbfw7ukrlq7pw",
    "vendor_name": "Mercure Canberra",
    "title": "Heritage-Listed Central Canberra Escape with Two Onsite Restaurants",
    "description": "Soak up Canberra’s impressive cultural experiences, top-notch restaurants and burgeoning art scene with a central city stay at this welcoming, heritage-listed hotel, located on the eastern edge of stylish Braddon. Originally opened in 1927 and listed on the Register of the National Estate, the Mercure Canberra is part of the capital's rich history.\n\nFrom your conveniently located abode, mere moments from the CBD and vibrant New Acton precinct, it's easy to explore treasures like the National Gallery of Australia, the War Memorial or Old Parliament House.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "Australian Capital Territory",
    "location_description": "Mercure Canberra",
    "offer_address": "Corner of Ainslie and Limestone Avenue, Braddon 2612, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 74.0,
    "value": 74.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004T99vAAC",
    "hero_image": "https://images.luxuryescapes.com/mqttkh555j5n8ct7vvaj",
    "image_two": "https://images.luxuryescapes.com/qz8osiyveqhehjuhb8on",
    "image_three": "https://images.luxuryescapes.com/raewo5mpwcfyheozlmf",
    "vendor_name": "Abode Kingston",
    "title": "Boutique Canberra Stay near Kingston Foreshore & Capital Hill",
    "description": "Cast your vote for a sophisticated stay on the edge of Canberra’s political stage, near eclectic cinemas, iconic monuments and the city’s vibrant dining scene, at the timelessly elegant Abode Kingston. Stamped with a Tripadvisor Travellers' Choice 2020 badge, this modern boutique hotel’s star feature is its location in one of the city’s most desirable postcodes, Kingston - a short bike ride from Capital Hill, less than a 15-minute walk from the reinvigorated Kingston Foreshore, and enviably close to the area’s café culture hub, Parliament House and the National Gallery.\n\nSo much more than your ordinary Canberra accommodation, this hotel fuses stylish décor with moody ambience and designer-cool rooms and studios. There's the convenient Abode Pantry, stocked with healthy frozen meals, drinks, midnight snacks and more onsite, and a hotel foyer lined with retro-inspired bikes along one wall. Feel like a Kingston local as you delve into this political playground of foodie delights, arts, culture and history, before returning to your ultimate city abode.\n\n**Luxury Escapes inclusions (select nights)**\n\n- A **welcome bottle of wine** to toast to your sophisticated Kingston escape\n- **Daily in-room bottled water** for the morning after a night on the town\n- **Guaranteed 11am checkout** to make the most of your stay\n- Stay connected with **complimentary Wi-Fi** throughout\n- **Two-hour bike hire** per person, per stay, to help you explore the city (for stays of 2+ nights)\n- **A$15 food and drink credit** per package, per stay to use at the onsite Abode Pantry (for stays of 2+ nights)\n- An **additional A$5 (A$20 total) food and drink credit** per package, per stay (for stays of 3+ nights)\n- An **additional A$5 (A$25 total) food and drink credit** per package, per stay (for stays of 4+ nights)\n- An **additional A$5 (A$30 total) food and drink credit** per package, per stay (for stays of 5+ nights)\n\n**Need more space?** Upgrade to the Executive Studio, offering a sofa bed for one extra guest (charges apply).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Australian Capital Territory",
    "offer_geo_area_level_2": "Canberra",
    "location_heading": "Canberra",
    "location_subheading": "ACT",
    "location_description": "Abode Kingston",
    "offer_address": "14 Kennedy Street Kingston ACT 2604 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 92.0,
    "value": 92.0
  }
]