[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LftkAAC",
    "hero_image": "https://images.luxuryescapes.com/ddvxs32e16hl4og1cxdo",
    "image_two": "https://images.luxuryescapes.com/njbgsn4uddg3e4uycsw9",
    "image_three": "https://images.luxuryescapes.com/bzgb7zl8pnlj2s9ixmd",
    "vendor_name": "Sagara Candidasa",
    "title": "Boutique Balinese Beachside Escape with Daily Dining",
    "description": "Soak up impressive ocean views and discover a more authentic side of Bali with a stay at the brand-new Sagara Candidasa. Located on Bali’s serene East Coast, just 90-minutes from the airport, this boutique hotel sets the stage for a relaxing and romantic escape from reality in one of Bali’s most beautiful locations.\n\nEmbrace the laid-back island vibes as you indulge in daily à la carte breakfast, daily afternoon tea with sweet and savoury treats, one lunch or dinner during your stay and a one-way private transfer from Bali Denpasar airport.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Karangasem",
    "location_heading": "Candidasa",
    "location_subheading": "Bali",
    "location_description": "Sagara Candidasa",
    "offer_address": "Jl. Raya Candidasa, Sengkidu, Kec. Manggis, Kabupaten Karangasem, Bali, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 309.0,
    "value": 638.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IU1cIAG",
    "hero_image": "https://images.luxuryescapes.com/6otd9rip81cg5eeytjxp",
    "image_two": "https://images.luxuryescapes.com/6oeznhutqnlsmuf6vte",
    "image_three": "https://images.luxuryescapes.com/u1xwbvukibpbfjx3dqk",
    "vendor_name": "Candi Beach Resort & Spa",
    "title": "Bali Secluded Beachfront Suites & Villas with Daily Breakfast, Daily Lunch or Dinner, Nightly Cocktails & Massages",
    "description": "Located along a stretch of breathtaking coastline overlooking turquoise waters, this sun-soaked resort is a tranquil oasis positioned on Bali's east coast.\n\nBoasting a prime location moments from the volcanic sands of the beach, here you can discover Bali as it once was, with tropical fruits, temples and sensational diving opportunities all in abundance. Return from days exploring coconut groves and hidden coves to your luxurious suite or villa or visit Ombak Bar & Lounge to spend hours watching the world go by from the comfort of a cabana bed.\n\nCandi Beach Resort & Spa is the perfect place for renewal and restoration - head to Ocean Spa for unique wellness treatments inspired by the movements of the sea tides, and enjoy the resort's included tai chi boo and yoga sessions.\n\nEmbark on a culinary journey of distinction at Basil Restaurant & Pool Bar, where the flavours of Italy meld with Balinese culinary artistry, or kick back at Biru Restaurant, offering authentic Indonesian cuisine served against a backdrop of sparkling sapphire waters.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Manggis",
    "location_heading": "Candidasa",
    "location_subheading": "Bali",
    "location_description": "Candi Beach Resort & Spa",
    "offer_address": "Mendira Beach, Sengkidu, Candidasa, Bali 80871, Indonesia",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 849.0,
    "value": 1628.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GwnG4AAJ",
    "hero_image": "https://images.luxuryescapes.com/e17vx4onyv6wsd60pmx5",
    "image_two": "https://images.luxuryescapes.com/4hpjd2iq9pys5yc4dtkk",
    "image_three": "https://images.luxuryescapes.com/8d2h22bjrpfx6icu61re",
    "vendor_name": "Candi Beach Resort & Spa",
    "title": "Bali Secluded Beachfront Suites & Villas with Daily Breakfast, Daily Lunch or Dinner & Massages",
    "description": "Located along a stretch of breathtaking coastline overlooking turquoise waters, sun-soaked Candi Beach Resort & Spa is a tranquil oasis positioned on Bali's east coast. Boasting a prime location moments from the volcanic sands of the beach, here you can discover Bali as it once was, with tropical fruits, temples and sensational diving opportunities all in abundance. Return from days exploring coconut groves and hidden coves to your luxurious suite or villa or visit Ombak Bar & Lounge to spend hours watching the world go by from the comfort of a cabana bed. \n\nCandi Beach Resort & Spa is the perfect place for renewal and restoration - head to Ocean Spa for unique wellness treatments inspired by the movements of the sea tides, and enjoy the resort's included tai chi boo and yoga sessions. Embark on a culinary journey of distinction at Basil Restaurant & Pool Bar, where the flavors of Italy meld with Balinese culinary artistry, or kick back at Biru Restaurant, offering authentic Indonesian cuisine served against a backdrop of sparkling sapphire waters.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Manggis",
    "location_heading": "Candidasa",
    "location_subheading": "Bali",
    "location_description": "Candi Beach Resort & Spa",
    "offer_address": "Mendira Beach, Sengkidu, Candidasa, Bali 80871, Indonesia",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 899.0,
    "value": 1732.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNRPQAA5",
    "hero_image": "https://images.luxuryescapes.com/oxmusprwuty0q8ps2rj",
    "image_two": "https://images.luxuryescapes.com/3jtuxjs8pk0oiwzrl4md",
    "image_three": "https://images.luxuryescapes.com/6xqwhgop0h2mpthn87bh",
    "vendor_name": "Candi Beach Resort & Spa",
    "title": "Bali Beachfront Suite & Villa Seclusion with Daily Breakfast, Daily Lunch or Dinner & 60-Minute Massage",
    "description": "Located along a stretch of breathtaking coastline overlooking the Bali Sea, sun-soaked Candi Beach Resort & Spa is a tranquil oasis positioned on Bali's east coast. Boasting a prime oceanfront location between volcanic sands and sacred Mount Agung, here you can discover Bali as it once was - with tropical fruits, porcelain-white sands and sensational diving opportunities all in abundance. Return from days exploring coconut groves and hidden coves to your luxurious suite or villa, head to Ombak Bar & Lounge for hours watching the world go by from the comfort of a cabana bed or hit up Basil Restaurant & Pool Bar for find Italian-inspired plates with a Balinese twist.\n\nIt's the perfect place for renewal and restoration - head to Ocean Spa for unique wellness treatments inspired by the movements of the sea tides, and enjoy the resort's included tai chi boo and yoga sessions. Or kick back at Biru Restaurant, offering authentic Indonesian cuisine and spectacular views over sapphire waters.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Manggis",
    "location_heading": "Candidasa",
    "location_subheading": "Bali",
    "location_description": "Candi Beach Resort & Spa",
    "offer_address": "Mendira Beach, Sengkidu, Candidasa, Bali 80871, Indonesia",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 539.0,
    "value": 1096.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GecVrAAJ",
    "hero_image": "https://images.luxuryescapes.com/jlx2ipxxwubte2h1dq64",
    "image_two": "https://images.luxuryescapes.com/xybe5qcv3vdf4loie4bdc",
    "image_three": "https://images.luxuryescapes.com/9lhswgwcljwg2bf4xirr",
    "vendor_name": "Candi Beach Resort & Spa",
    "title": "Bali Beachfront Seclusion with Daily Breakfast, Daily Lunch or Dinner & 60-Minute Massage",
    "description": "Located along a stretch of breathtaking coastline overlooking the Bali Sea, sun-soaked Candi Beach Resort & Spa is a tranquil oasis positioned on Bali's east coast. Boasting a prime location moments from the volcanic sands of the beach, here you can discover Bali as it once was - with tropical fruits, temples and sensational diving opportunities all in abundance. Return from days exploring coconut groves and hidden coves to your luxurious suite or villa, head to Ombak Bar & Lounge for hours watching the world go by from the comfort of a cabana bed. Or for Italian-inspired plates with a Balinese twist, hit up Basil Restaurant & Pool Bar.\n\nCandi Beach Resort & Spa is the perfect place for renewal and restoration - head to Ocean Spa for unique wellness treatments inspired by the movements of the sea tides, and enjoy the resort's included tai chi boo and yoga sessions. Or kick back at Biru Restaurant, offering authentic Indonesian cuisine and spectacular views over sapphire waters.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Manggis",
    "location_heading": "Candidasa",
    "location_subheading": "Bali",
    "location_description": "Candi Beach Resort & Spa",
    "offer_address": "Mendira Beach, Sengkidu, Candidasa, Bali 80871, Indonesia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 530.0,
    "value": 999.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CuUIxAAN",
    "hero_image": "https://images.luxuryescapes.com/i5a9weoz4paxqy66a9ld",
    "image_two": "https://images.luxuryescapes.com/tgiqqmbpyc2m1chaeugb",
    "image_three": "https://images.luxuryescapes.com/v1sej5ju0gfl4xl8x383",
    "vendor_name": "Candi Beach Resort & Spa",
    "title": "Secluded Bali Beachfront Pool Villas with Daily Breakfast, Daily Lunch or Dinner & 60-Minute Balinese Massage",
    "description": "Located along a stretch of breathtaking coastline overlooking the gleaming Bali Sea, the sun-soaked Candi Beach Resort & Spa is a tranquil oasis tucked away on Bali's east coast near the village of Candidasa. This charming resort enjoys a prime oceanfront location on a coconut grove between volcanic sands and Bali’s sacred Mount Agung. Tropical fruits, sugar-white sands and sensational diving opportunities come standard with this escape.\n\nMake use of your private plunge pool, soak up the ocean views and tropical sunshine or take a dip in one of the two glittering infinity pools. If you're ready to relax even further, indulge in a blissful treatment at Ocean Spa, then continue your wellness journey with included tai chi boo or yoga. Kick back at Ombak Bar & Lounge to watch the world go by from the comfy cabana beds, head to Basil Restaurant & Pool Bar for local fare, or marvel at ocean views from Biru and Ocean Terrace restaurants.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Manggis",
    "location_heading": "Candidasa",
    "location_subheading": "Bali",
    "location_description": "Candi Beach Resort & Spa",
    "offer_address": "Mendira Beach, Sengkidu, Candidasa, Bali 80871, Indonesia",
    "percentage_discount": 38.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 831.0,
    "value": 1343.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GMs8lAAD",
    "hero_image": "https://images.luxuryescapes.com/trjx07b00in3edcfo3pb",
    "image_two": "https://images.luxuryescapes.com/o3dt3xbvhowd5ww13cp",
    "image_three": "https://images.luxuryescapes.com/tzshsgec2lljkw2312o",
    "vendor_name": "Candi Beach Resort & Spa",
    "title": "Idyllic Bali Beachfront Resort with Swimming Pool, Spa & Ocean-View Restaurants",
    "description": "Escape the crowds and slip into island serenity at this beachfront resort, tucked away on Bali’s quieter east coast. Candi Beach Resort & Spa delivers palm-fringed shoreline, contemporary suites and bungalows, panoramic ocean views and distinctive dining venues, perfect for lazy days by the beach or a romantic hideaway.\n\nSet amid coconut groves and tropical gardens in Candidasa, this peaceful slice of paradise feels worlds away, yet close to Bali’s cultural heart. Dive into crystal-clear waters, dine beachfront under the stars, or hop on a scooter to explore hidden temples. With yoga classes, diving and three dreamy pools, it’s got everything for a relaxed, feel-good escape.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Manggis",
    "location_heading": "Candidasa",
    "location_subheading": "Indonesia",
    "location_description": "Candi Beach Resort & Spa",
    "offer_address": "Mendira Beach, Sengkidu, Candidasa, Karangasem, Bali 80871, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 71.0,
    "value": 71.0
  }
]