[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004iHH7AAM",
    "hero_image": "https://images.luxuryescapes.com/vchgbqein8gskzebj8z",
    "image_two": "https://images.luxuryescapes.com/bnyb5xx1d93en31m5gac",
    "image_three": "https://images.luxuryescapes.com/4uwdv5d2z7i10m4e4zsi",
    "vendor_name": "Ferntree Rainforest Hotel",
    "title": "Cape Tribulation Tree-House Rainforest Retreat with Daily Breakfast",
    "description": "Discover a tropical sanctuary in the heart of the ancient Daintree Rainforest at Ferntree Rainforest Hotel. Embraced on all sides by the lush vegetation of the mighty Daintree Rainforest, with the golden shores of Cape Tribulation within easy walking distance and the Great Barrier Reef a short boat ride away, you'll find yourself smack-bang in the thick of one of Australia’s most impressive UNESCO World Heritage-listed areas.\n\nFollow winding footpaths to tree-house-style lofts, designed to let in as much of the outside world as possible with expansive windows and private porches. After a day exploring the rainforest, sit out on your private porch or outdoor seating area and listen to the symphony of the rainforest. There’s a delicious dining option for everyone in the Cassowary Restaurant, whose Balinese-style design lends to the hotel’s tropical resort vibe. During the day, escape the heat with a dip in the gorgeous lagoon-style swimming pool or walk among leafy giants with a hike along rainforest trails.\n\nOffering equal parts adventure and relaxation, this is the ultimate base for you to explore the jewel in Tropical North Queensland’s crown.\n\n**Your handpicked inclusions:**\n\n- Start each day with à la carte breakfast served at Cassowary Restaurant\n- Indulge with 10% food discount at Cassowary Restaurant\n- Celebrate the start of your escape with a welcome bottle of sparkling wine on arrival\n\n**Travelling with family or friends?** Choose the Family Package, valid for up to two adults and two kids (11 years and under).\n\n**Luxury Garden Loft upgrade:** Want to elevate your experience? Why not upgrade to the recently renovated Luxury Garden Loft, which features top-of-the-range amenities, a stylish rainforest and reef themed interior design, plush furnishings and your own private bamboo-framed porch to enjoy the rainforest surrounds.\n\n**This deal has NO peak surcharges:** Travel any time for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Cape Tribulation",
    "location_heading": "Cape Tribulation",
    "location_subheading": "Queensland",
    "location_description": "Ferntree Rainforest Lodge",
    "offer_address": "36 Camelot Cl, Cape Tribulation QLD 4873",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 15,
    "price": 239.0,
    "value": 352.0
  }
]