[
  {
    "link": "https://luxuryescapes.com/offer/0062y000003dURAAA2",
    "hero_image": "https://images.luxuryescapes.com/p6hboh76locxz50ygqb",
    "image_two": "https://images.luxuryescapes.com/zyes54ydh9orhqbt2fh",
    "image_three": "https://images.luxuryescapes.com/4zqdxq84lqh734xswogf",
    "vendor_name": "Kingscliff Accomodation",
    "title": "Beach House Group Escape near Byron Bay for up to 14 Guests with Private Pool",
    "description": "An opulent group and family escape along the shores of Northern New South Wales, Cottonwood Beach House is, in a word, striking. Perched moments from the calm, glistening waters of pristine Casuarina Beach, and with five spacious bedrooms, you and up to 13 of your closest friends or family can call this stunning two-storey house your home away from home.\n\nWith fully equipped kitchen and dining area, private in-ground pool and bifold doors that bring the outdoors inside, this architect-designed gem will comfortably sleep up to 14 guests and has everything you need to tailor your own group getaway, including an enviable position just 20 minutes from the Gold Coast and 45 minutes from the bohemian Byron Bay.\n\nSpend your days lounging on the white sands of the beachfront, hiking through lush national parks, swimming, kayaking or doing sweet nothing, then come together for a BBQ dinner and drinks under the stars.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tweed Heads",
    "location_heading": "Casuarina",
    "location_subheading": "New South Wales",
    "location_description": "Kingscliff Accommodation - Cottonwood Beach House",
    "offer_address": "2 Cottonwood Lane, Casuarina",
    "percentage_discount": 40.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 889.0,
    "value": 1486.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Icq0mAAB",
    "hero_image": "https://images.luxuryescapes.com/4jry3yvsp66oo8i2oh1d",
    "image_two": "https://images.luxuryescapes.com/4wmsgfz9ehd9omvu9gn5",
    "image_three": "https://images.luxuryescapes.com/l2gskzthrxy7tkhpk8",
    "vendor_name": "Oaks Casuarina Santai Resort",
    "title": "Balinese-Inspired New South Wales' Tweed Coast Apartment Stay Minutes from South Kingscliff Beach",
    "description": "Recharge by the ocean with an apartment stay that brings a touch of Balinese style to the serene North Coast of New South Wales. From its idyllic setting, just 200 metres from the glistening turquoise waters of Casuarina Beach, to its fantastic Kingscliff location, cradled by the iconic Gold Coast and laidback bohemia of Byron Bay, this tropical resort will instantly transport you away from the everyday. Enjoy exceptional Asian cuisine at Spice Den, indulge in a tranquil massage or soak up the sun by the glittering outdoor pools.\n\nBreathe in the fresh sea breeze as you enjoy unrivalled access to the beach and explore the untouched beauty of the region with a nature walk from your doorstep. You'll feel right at home with modern, comfortable styling and ultra-friendly service. When it's time to explore beyond the resort, enjoy a delicious meal at one of the local cafes or restaurants, take in the coastal sights with a walk up to the Cabarita Beach headland or indulge in an afternoon at the nearby Husk Distillery.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tweed Heads",
    "location_heading": "Casuarina",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Casuarina Santai Resort",
    "offer_address": "9 Dianella Drive, Casuarina, New South Wales 2487, Australia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 6,
    "price": 299.0,
    "value": 566.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ee5ACAAZ",
    "hero_image": "https://images.luxuryescapes.com/bz3u4m1hz34ya8e3zra",
    "image_two": "https://images.luxuryescapes.com/m960doftontet02gdd",
    "image_three": "https://images.luxuryescapes.com/7efuttlcpnzgprr5llzp",
    "vendor_name": "Oaks Casuarina Santai Resort",
    "title": "Balinese-Inspired Apartment Stay on New South Wales' North Coast with Welcome Wine & Late Checkout",
    "description": "Recharge by the ocean with an apartment stay at the stylish Oaks Santai Resort Casuarina, bringing a touch of Balinese glamour to the serene North Coast of New South Wales. From its idyllic setting, just 200 metres from the glistening turquoise waters of Casuarina Beach, to its fantastic Kingscliff location, cradled by the iconic Gold Coast and laidback bohemia of Byron Bay, this tropical resort will instantly transport you away from the everyday. Savour island vibes at the sumptuous Tweed River House bistro, indulge with a tranquil massage or soak up the sun by the glittering outdoor pools.\n\nBreathe in the fresh sea breeze as you enjoy unrivalled access to the beach and explore the untouched beauty of the region with a nature walk from your doorstep. You'll feel right at home with modern, comfortable styling and ultra-friendly service. When it's time to explore beyond the resort, enjoy a lazy afternoon in a local beachside cafe, cruise along the river at Brunswick Heads or be captivated by the allure of the Surfers Paradise glitter strip, just 50 minutes away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tweed Heads",
    "location_heading": "Casuarina",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Casuarina Santai Resort",
    "offer_address": "9 Dianella Drive, Casuarina, New South Wales 2487, Australia",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 6,
    "price": 275.0,
    "value": 560.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BU6gAAG",
    "hero_image": "https://images.luxuryescapes.com/ilseo6a4l2pt18qznn1",
    "image_two": "https://images.luxuryescapes.com/r17ij4rky3ex72pumik",
    "image_three": "https://images.luxuryescapes.com/ixv9w74ebhwkndi3ievi",
    "vendor_name": "Oaks Casuarina Santai Resort",
    "title": "Balinese-Inspired Apartment Stay on New South Wales' North Coast",
    "description": "Recharge by the ocean with an apartment stay at the stylish Oaks Casuarina Santai Resort, bringing a touch of Balinese glamour to the serene Tweed region of North Coast NSW. From its idyllic setting just 200 metres from the glistening waters of Casuarina Beach to its fantastic location, cradled between the iconic Gold Coast and laidback bohemia of Byron Bay, this tropical resort will instantly transport you to an exotic faraway land.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tweed Heads",
    "location_heading": "Casuarina",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Casuarina Santai Resort",
    "offer_address": "9 Dianella Drive, Casuarina, New South Wales 2487, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 125.0,
    "value": 125.0
  }
]