[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMpjLAAT",
    "hero_image": "https://images.luxuryescapes.com/zdegwolso1ih8e41oita",
    "image_two": "https://images.luxuryescapes.com/liohf15m3q7um4lgbem",
    "image_three": "https://images.luxuryescapes.com/0l6f7ec3ncpq41p497xg",
    "vendor_name": "Island Shangri la",
    "title": "Five-Star Hong Kong Sky-High Indulgence with Eight Restaurants, Daily Breakfast, Nightly Cocktails & Club Lounge Access",
    "description": "Take a moment's pause and relax at this peaceful five-star hotel, where signature luxury and tranquil views of Hong Kong's iconic Victoria Peak and Victoria Harbour make for an idyllic escape in the heart of the seaside city. Step through the lobby doors and see the 140-year-old banyan tree taking up residence, a perfect greeting to this urban oasis.\n\nEight restaurants and bars will delight foodies with a wide array of culinary delights, from French fine dining at the Michelin-starred Restaurant Petrus to a bountiful buffet at cafe TOO. For artisanal cocktails, oysters and live jazz music, head to Lobster Bar for a lively night in.\n\nWhen you're ready to venture out, Pacific Place Mall is just a two-minute walk away and houses many internationally renowned shopping brands, a cinema and countless food options.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Central",
    "location_subheading": "Hong Kong",
    "location_description": "Island Shangri-La",
    "offer_address": "Pacific Place, Supreme Court Road, Central, Hong Kong 00000, Hong Kong",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 929.0,
    "value": 2880.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EWiSUYA1",
    "hero_image": "https://images.luxuryescapes.com/7l0k1ned7m6ny8iorw9c",
    "image_two": "https://images.luxuryescapes.com/6td4zrh7gpb4558dljjl",
    "image_three": "https://images.luxuryescapes.com/0c9o1fd1tgjx2pu60bgv",
    "vendor_name": "Island Shangri la",
    "title": "Hong Kong Sky-High Indulgence with Daily Breakfast, Nightly Free-Flow Drinks Hour & Club Access",
    "description": "Take a moment’s pause and unwind at this luxurious five-star hotel with tranquil views of Hong Kong’s breathtaking Victoria Peak and Victoria Harbour, offering an idyllic escape in the heart of the city. Step through the lobby doors to be greeted by a 140-year-old banyan tree, a perfect symbol of this urban oasis.\n\nIndulge in exquisite dining with nine restaurants and bars, including the Michelin-starred Restaurant Petrus. Guests can enjoy a refined Club Lounge breakfast and savour elegant French cuisine. For a lively evening, head to the renowned Lobster Bar and Grill, where artisanal cocktails, oysters and nightly jazz entertainment create an unforgettable atmosphere.\n\nWhen you’re ready to explore, Pacific Place mall is just a two-minute walk away, offering world-class shopping and a variety of vibrant dining options.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Central",
    "location_subheading": "Hong Kong",
    "location_description": "Island Shangri-La",
    "offer_address": "Pacific Place, Supreme Court Road, Central, Hong Kong 00000, Hong Kong",
    "percentage_discount": 74.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 899.0,
    "value": 3404.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BdkV9AAJ",
    "hero_image": "https://images.luxuryescapes.com/oxh3d5oc5tpa6kid9zmb",
    "image_two": "https://images.luxuryescapes.com/29d2a4x8flm23t0ybiz8",
    "image_three": "https://images.luxuryescapes.com/nar958oelge80r6zwd7s",
    "vendor_name": "The Landmark Mandarin Oriental",
    "title": "Hong Kong Top-Rated City Stay with Two Michelin-Starred Restaurants & Two-Storey Spa",
    "description": "For timeless elegance and gourmet wonders in the heart of Hong Kong, choose a stay at The Landmark Mandarin Oriental. Gourmands flock to this contemporary city hotel thanks to not one, but two Michelin-starred restaurants: the two-starred Amber and the three-starred Sushi Shikon. Between indulging, treat body and mind to a rejuvenating spa treatment at one of Hong Kong's premier holistic spas, The Oriental Spa. Spread across two floors, the spa is a haven offering signature treatments, a traditional Hammam, vitality pools and an amethyst crystal steam room.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Central",
    "location_subheading": "Hong Kong",
    "location_description": "The Landmark Mandarin Oriental, Hong Kong",
    "offer_address": "The Landmark, 15 Queen's Road Central, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 605.0,
    "value": 605.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HDvoAAG",
    "hero_image": "https://images.luxuryescapes.com/vwz7k3hbokme0g8jlce",
    "image_two": "https://images.luxuryescapes.com/1uxaxet7etqmza9sy6g",
    "image_three": "https://images.luxuryescapes.com/17f03sfuja87p2w4qt36",
    "vendor_name": "The Putman",
    "title": "Sky-High Hong Kong Designer Suites",
    "description": "Float among the clouds with an escape to The Putman, a sky-scraping luxury hotel designed by the late illustrious interior designer, Andrée Putman. The boutique urban retreat sits above the bustling neighbourhoods of Sheung Wan and Soho in the heart of Hong Kong, offering an oasis of calm amid the area’s ancient temples, stylish restaurants and lively nightlife.\n\nThey will be no doubting which city you’re in from your suite - floor-to-ceiling windows with spectacular views come standard. Offering a truly luxurious home-away-from-home experience, the contemporary full-floor suites feature a living room, fully equipped kitchen, master bedroom and stylish ensuite with bathtub. While your suite should have everything you need for a sensational stay, the 24-hour front desk is on hand for anything else.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Central",
    "location_subheading": "Hong Kong",
    "location_description": "The Putman",
    "offer_address": "202 Queen's Road Central, Central, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 176.0,
    "value": 176.0
  }
]