[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcUgzAAF",
    "hero_image": "https://images.luxuryescapes.com/ubbbbfctqrwaxz9f6ot",
    "image_two": "https://images.luxuryescapes.com/1vqvdxpr4dhsspcvur",
    "image_three": "https://images.luxuryescapes.com/kpfwfhkvbpxe8a8dq38",
    "vendor_name": "The Oberoi Sukhvilas Chandigarh",
    "title": "Five-Star Oberoi Chandigarh Luxury with Daily Breakfast, One Lunch or Dinner & Daily Drinks",
    "description": "Set against the backdrop of the sprawling Siswan Forest Range and the Himalayan foothills, The Oberoi Sukhvilas Chandigarh eagerly awaits your arrival to experience a stay within India's first planned city - Chandigarh - located one hour from Chandigarh International Airport (IXC) or a six-hour drive from Delhi. With a sprinkling of serenity and an infusion of iconic Oberoi hospitality, this resort is sure to satisfy all your needs for a relaxing escape. You will fall immediately in love with this luxe oasis thanks to secluded rooms fringed by greenery, the temperature-controlled pool that never fails to refresh you, and the exquisite dishes that are slow-cooked to perfection to thrill your palate. \n\nThis five-star haven is part of the renowned hotel brand that was recognised by Travel + Leisure as the Best Hotel Brand in the World in 2022, and will astound you with its stunning architecture, impeccable gardens and excellent facilities. You can completely utilise the forest that surrounds the property by participating in a variety of mindful activities including yoga and e-bike hire (additional charges apply). Then, indulge in spa treatments and be immediately placed in a state of happiness. This escape is exactly what you deserve, and there's no better place to experience the epitome of luxury.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Punjab",
    "offer_geo_area_level_2": "Kharar",
    "location_heading": "Chandigarh",
    "location_subheading": "India",
    "location_description": "The Oberoi Sukhvilas Spa Resort, New Chandigarh",
    "offer_address": "Pallanpur PO, Sialba Majri Rd, New Chandigarh, Punjab 140110, India",
    "percentage_discount": null,
    "min_duration": null,
    "max_duration": null,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id0jGAAR",
    "hero_image": "https://images.luxuryescapes.com/7x0gk1ip64gqjry6ym2",
    "image_two": "https://images.luxuryescapes.com/vwy3q8awyrmavz4ogq",
    "image_three": "https://images.luxuryescapes.com/qfqar6c0d4orlrnykk8",
    "vendor_name": "The Oberoi Sukhvilas Chandigarh",
    "title": "Five-Star Oberoi Chandigarh Retreat with Forest Views, Lavish Spa & Outdoor Pool",
    "description": "Set amidst the serene Siswan Forest Range, this five-star retreat offers a luxurious escape in one of India's most fascinating cities. Unwind at the world-class spa, featuring traditional Ayurvedic treatments, savour exquisite Indian and international cuisine at the elegant Anant Mahal restaurant or sip on a refreshing drink at Raunaq Bar. For adventurous travellers, the hotel is conveniently located near key attractions including the Rock Garden and the Capitol Complex.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Punjab",
    "offer_geo_area_level_2": "Kharar",
    "location_heading": "Chandigarh",
    "location_subheading": "India",
    "location_description": "The Oberoi Sukhvilas Spa Resort, New Chandigarh",
    "offer_address": "Pallanpur PO, Sialba Majri Rd, New Chandigarh, Punjab 140110, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 301.0,
    "value": 301.0
  }
]