[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I2uIAAS",
    "hero_image": "https://images.luxuryescapes.com/lgdzsxfpts9hztz44qh",
    "image_two": "https://images.luxuryescapes.com/mymyf3bevs3l5yppojrj",
    "image_three": "https://images.luxuryescapes.com/u9ialc4qpku4ibjbcqzr",
    "vendor_name": "Maison Doucet",
    "title": "Sophisticated France Countryside Haven with Michelin-Starred Restaurant",
    "description": "The rolling French countryside is a treasure trove of medieval architecture, sun-kissed vineyards and sensational food - enjoy the spoils of this picturesque rural region with a stay at Maison Doucet, an elegant hideaway in the charming village of Charolles. The hotel's onsite restaurant, Bistrot du Quai, has earned a Michelin star, with Chef Frédéric Doucet creating a menu full of explosive flavours and traditional dishes using fresh ingredients carefully selected from local producers. You'll also enjoy incredible facilities, including an outdoor heated swimming pool, a six-seat Jacuzzi and a blissful day spa.\n\nDuring your stay, you'll have the wonders of France's incomparable Burgundy region at your fingertips. Charolles has been coined 'the Venice of the Charolais region' thanks to its abundance of canals crisscrossing the village. Wander the footbridges, stop in at a local bistro for a bite to eat and a tipple of the finest local drop, and zip from vineyard to vineyard to see where it's all made. It would be remiss of you not to pour yourself a glass or two of chardonnay or pinot noir, the region's specialty.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Bourgogne-Franche-Comté",
    "offer_geo_area_level_2": "Charolles",
    "location_heading": "Charolles",
    "location_subheading": "France",
    "location_description": "Maison Doucet",
    "offer_address": "2 Avenue de la Libération, 71120 Charolles, France",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 217.0,
    "value": 217.0
  }
]