[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JLWeIAO",
    "hero_image": "https://images.luxuryescapes.com/g1bicu5duugwvyzsa0lt",
    "image_two": "https://images.luxuryescapes.com/irmuzz740cd3f9xaycf7",
    "image_three": "https://images.luxuryescapes.com/p6so9hhird1f77ubics",
    "vendor_name": "Meliá Chiang Mai",
    "title": "Five-Star Chiang Mai Luxury with Daily Breakfast, Nightly Cocktails & Club Upgrades Available",
    "description": "Set along the tranquil banks of the Ping River, this five-star sanctuary offers a gateway to the heart of Chiang Mai in refined luxury. Begin each day with a culinary adventure at Laan Na Kitchen, where an array of international flavours awaits.\n\nAfter immersive days exploring mountain trails, ancient temples and vibrant markets, elevate your evening with a visit to Mai The Sky Bar on the 22nd floor, where you can savour the cityscape and sunset with a crafted cocktail in hand.\n\nIndulge in the onsite sauna or relax by the sparkling pool in a private cabana. For complete rejuvenation, YHI Spa provides a haven of tranquillity with a range of treatments, from soothing massages to revitalising body scrubs - offering a perfect balance of serenity and opulence amid the vibrant pulse of travel.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Meliá Chiang Mai",
    "offer_address": "48 Charoenprathet Road, Chang Khlan, Chiang Mai 50100, Thailand",
    "percentage_discount": 75.0,
    "min_duration": 2,
    "max_duration": 13,
    "price": 309.0,
    "value": 1225.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DHUvyAAH",
    "hero_image": "https://images.luxuryescapes.com/lqc7am04kqxgdo8cky",
    "image_two": "https://images.luxuryescapes.com/1qdtpmkxkufaukahyif",
    "image_three": "https://images.luxuryescapes.com/lnuyp6nui2pepoyl5xsfw",
    "vendor_name": "Shangri-La Hotel, Chiang Mai",
    "title": "Five-Star Chiang Mai Shangri-La Escape with Massages, Daily Breakfast & Club Lounge Access",
    "description": "Experience the sprawling luxury haven of Shangri-La Chiang Mai, found within the bustling heart of this culturally rich city. Designed with inspiration from traditional Thai architecture, you can expect opulent dark wood and gold-painted Buddhist-influenced interiors, traditional Northern Thai decor, silk fabrics and wide swathes of lush greenery. Start your day with a rickshaw ride down the narrow lanes in Old Town and explore numerous Thai Buddhist temples. On your return, indulge with a treatment at Chi, The Spa, get your heart pumping in the fitness centre or take a dip in the pool. In the evening, head to the onsite Lobby Lounge to savour International and Thai specialities.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Shangri-La Chiang Mai",
    "offer_address": "89/8 Changklan Road, Muang, Chiang Mai 50100, Thailand",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 472.0,
    "value": 1048.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000criNRQAY",
    "hero_image": "https://images.luxuryescapes.com/9z8gp5noks52wpgtxfav",
    "image_two": "https://images.luxuryescapes.com/q9sscmhmbpa1x9x9ylk",
    "image_three": "https://images.luxuryescapes.com/t5ij376da6ymq9gmanam",
    "vendor_name": "Veranda High Resort Chiang Mai - MGallery by Sofitel",
    "title": "Elegant MGallery Retreat with Daily Cocktails and Dining Inclusions",
    "description": "Built around ancient Chiang Mai, immerse yourself in the lush green countryside and a sprinkling of rice paddies and tea terraces with a stay at Veranda High Resort Chiang Mai - MGallery, a tranquil five-star retreat hidden in Northern Thailand’s majestic mountain ranges. Unwind amidst breathtaking misty mountains, plunging tropical valleys and lush rice terraces with daily buffet breakfast, a daily cocktail, glass of beer or wine each, a three-course set menu dining experience, a 30-minute Thai massage each, your choice of a one-way transfer to or from Chiang Mai Airport and complimentary daily shuttles to Chiang Mai’s town centre where you can explore over 300 temples and visit vibrant local markets.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Hang Dong",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Veranda High Resort Chiang Mai - Mgallery",
    "offer_address": "192 Moo2 Banpong Hangdong, Chiang MAI, 50230, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 495.0,
    "value": 1800.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DfczYYAR",
    "hero_image": "https://images.luxuryescapes.com/g7nyceas21jffu4n67dg",
    "image_two": "https://images.luxuryescapes.com/74vyiu4ptl78hhd8wz9",
    "image_three": "https://images.luxuryescapes.com/lb58spyt2hcstztby2b",
    "vendor_name": "Aleenta Retreat Chiang Mai",
    "title": "Award-Winning Chiang Mai Wellness Sanctuary with Daily Breakfast, Daily Massages & Nightly Dinner",
    "description": "Discover serenity at this boutique wellness retreat, a member of The Leading Hotels of the World set in northern Thailand’s mountainous Chiang Mai. Breaking the circuit from everyday stresses, immerse yourself in luxury wellness dining paired with activities like yoga, meditation and sound healing, all in a tree-lined and secluded setting.\n\nA bespoke massage awaits you each day, from the expert therapists of Ayurah Spa & Wellness Centre, helping you melt into pure bliss. Aleenta's extensive program allows you to personalise your wellness journey towards your goals, from exploring diverse yoga styles to enhancing mindfulness with walks through nearby temples (charges apply).\n\nBetween sessions, unwind in your private Thai-inspired oasis or take a refreshing dip in the sparkling pool. Afterwards, return to the resort to refuel with farm-to-table dining at The Garden Restaurant, featuring locally sourced ingredients, or indulge in a handcrafted cocktail at 1892 Bar.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Aleenta Retreat Chiang Mai",
    "offer_address": "189 Suthep Alley, Tambon Su Thep, Muang, Chiang Mai 50200, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 789.0,
    "value": 1900.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gfk2bAAB",
    "hero_image": "https://images.luxuryescapes.com/a2wi9j7ksfzugy3ep83",
    "image_two": "https://images.luxuryescapes.com/rs0r1qet3pblkdnkjulg",
    "image_three": "https://images.luxuryescapes.com/482x4ijsgpihrdbeldn9",
    "vendor_name": "Shangri-La Hotel, Chiang Mai",
    "title": "Shangri-La Escape in the Heart of Chiang Mai with Daily Breakfast & Club Lounge Access",
    "description": "Nestled within the vibrant cultural heart of Chiang Mai, along the serene Mae Ping River, Shangri-La Chiang Mai offers an unparalleled five-star luxury experience with breathtaking views of the majestic northern Thailand mountain ranges. Drawing inspiration from traditional architecture, the hotel boasts opulent interiors adorned with rich dark woods, gilded Buddhist motifs, sumptuous silk fabrics and verdant expanses of tropical foliage.\n\nStart your day with a rickshaw ride down narrow lanes in the Old Town to explore numerous temples, the Night Bazaar and famous Sunday Walking Street Market. On your return, indulge with a treatment at Chi, The Spa, get your heart pumping in the fitness centre or take a dip in the free-form swimming pool, the largest in the city. Little ones aren't forgotten about, with a daily roster of child-friendly activities in the Kid's Corner, as well as an outdoor waterslide and water splash zone. In the evening, the whole family can visit Kad Kafé to savour Thai, Chinese, Japanese and Mediterranean specialties, or parents can sneak away to China Kitchen for authentic Michelin-starred Sichuan flavours.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Shangri-La Chiang Mai",
    "offer_address": "89/8 Changklan Road, Muang, Chiang Mai 50100, Thailand",
    "percentage_discount": 74.0,
    "min_duration": 2,
    "max_duration": 15,
    "price": 399.0,
    "value": 1555.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DfomAYAR",
    "hero_image": "https://images.luxuryescapes.com/b9n738eyjh94vajc6ktr",
    "image_two": "https://images.luxuryescapes.com/f1g4vjoh0ck8hgsqoazg",
    "image_three": "https://images.luxuryescapes.com/xeas0jonb9j9at81n8mb",
    "vendor_name": "Shangri-La Hotel, Chiang Mai",
    "title": "Chiang Mai Opulence near Night Bazaar with Daily Breakfast & Club Lounge Access",
    "description": "Mere moments from the Mae Ping River, this sprawling hotel offers a five-star experience paired with views of the northern Thailand mountain ranges. Drawing inspiration from traditional architecture, the hotel is adorned with rich dark woods, gilded Buddhist motifs, sumptuous silk fabrics and verdant expanses of tropical foliage.\n\nStart your day with a rickshaw ride down narrow lanes in the Old Town to explore numerous temples, the Night Bazaar and the famous Sunday Walking Street Market. On your return, indulge in a treatment at Chi, The Spa, get your heart pumping in the fitness centre or take a dip in the free-form swimming pool, the largest in the city.\n\nLittle ones aren't forgotten about, with a daily roster of child-friendly activities in the Kid's Corner, as well as an outdoor waterslide and water splash zone. In the evening, the whole family can visit Kad Kafé to savour Thai, Chinese, Japanese and Mediterranean specialities, or parents can sneak away to China Kitchen for authentic Sichuan flavours praised by the Michelin Guide.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Shangri-La Chiang Mai",
    "offer_address": "89/8 Changklan Road, Muang, Chiang Mai 50100, Thailand",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 449.0,
    "value": 1521.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JDEGIA4",
    "hero_image": "https://images.luxuryescapes.com/3kdsm1eq6df123kuumql",
    "image_two": "https://images.luxuryescapes.com/tf301mgzzo64s9sunpd",
    "image_three": "https://images.luxuryescapes.com/66v62sn2ygpuya3805v4",
    "vendor_name": "Cross Chiang Mai Riverside",
    "title": "Riverside Luxury in Chiang Mai with Daily Breakfast, Daily Choice of Lunch or Dinner & Nightly Cocktails",
    "description": "Experience the magic of a sunset from the rooftop infinity pool at this paradise retreat in Chiang Mai. Nestled along the Ping River, the hotel is surrounded by century-old tamarind trees that complement the modern elegance of its suites and facilities.\n\nFind peace with a calming spa treatment in the Cross Relaxing Room, where traditional Thai techniques are used to soothe the senses. For dining, enjoy river views from the Oxygen Dining Room’s stunning glasshouse, while savouring exquisite fine dining and expertly crafted cocktails, recommended by the MICHELIN Guide Thailand.\n\nSpend your days lounging by the pool with a tropical drink or working out in the rooftop fitness centre, equipped with state-of-the-art facilities. Venture out to discover Chiang Mai's breathtaking mountains and Buddhist temples, such as the nearby Wat Phra That Doi Kham.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Cross Chiang Mai Riverside",
    "offer_address": "369/1 Charoenraj Road, Tambon Wat Ket, Chiang Mai 50000, Thailand",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 12,
    "price": 489.0,
    "value": 1223.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LrFXAA0",
    "hero_image": "https://images.luxuryescapes.com/a718r79hstnwgy87dqs",
    "image_two": "https://images.luxuryescapes.com/m38kix4a58f5d8sl9k7",
    "image_three": "https://images.luxuryescapes.com/i1dv5u3498cjufc5y6m",
    "vendor_name": "Shangri-La Hotel, Chiang Mai",
    "title": "Chiang Mai Shangri-La Luxury with Club Access & Free-Flow Cocktails",
    "description": "Discover the ancient Thai beauty of Chiang Mai at Shangri-La Hotel, Chiang Mai - an enchanting urban sanctuary surrounded by Northern Thailand’s majestic mountain ranges. Stay in the heart of this culturally rich city and indulge with five-star service from one of the world's most iconic luxury hotel brands.\n\nYour stay includes Club Lounge benefits, with VIP perks including sumptuous daily breakfast, nightly free-flow cocktails and hors d’oeuvres, and light refreshments throughout the day. Plus, enjoy one three-course dining experience and a 60-minute massage per adult.\n\n**Travelling with family?** Up to two children (aged 11 years and under) stay free with complimentary daily kids' club.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Shangri-La Hotel, Chiang Mai July 20",
    "offer_address": "89/8 Changklan Rd, Tambon Chang Khlan, Mueang Chiang Mai District, Chiang Mai 50100, Thailand",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 397.0,
    "value": 976.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JxlOBYAZ",
    "hero_image": "https://images.luxuryescapes.com/rzyjupiq6ucp227ast5r",
    "image_two": "https://images.luxuryescapes.com/i126j0r7d9b4tuzdw58",
    "image_three": "https://images.luxuryescapes.com/329blqfou8zhdzmo1vwf",
    "vendor_name": "Meliá Chiang Mai",
    "title": "Chiang Mai Five-Star Elegance with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Set close to the tranquil banks of the Ping River, this five-star sanctuary offers a gateway to the heart of Chiang Mai. After days exploring mountain trails, ancient temples and vibrant markets, elevate your evening with a visit to Mai The Sky Bar, where you can savour the cityscape at the highest rooftop bar in the city.\n\nOne child (11 and under) stays free, so the little ones can run wild at the Kids' Club, while adults relax by the sparkling pool in a private cabana or at YHI Spa. Outside the hotel, a short walk takes you to Chiang Mai Night Bazaar, while Tha Pae Gate and Chedi Luang Temple are minutes away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Meliá Chiang Mai",
    "offer_address": "48 Charoenprathet Road, Chang Khlan, Chiang Mai 50100, Thailand",
    "percentage_discount": 76.0,
    "min_duration": 2,
    "max_duration": 22,
    "price": 279.0,
    "value": 1146.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HdVfIAK",
    "hero_image": "https://images.luxuryescapes.com/tbdugzjpdwa12izzeus",
    "image_two": "https://images.luxuryescapes.com/r7xuebx8xo79bgtjefp",
    "image_three": "https://images.luxuryescapes.com/l2jpnykihcxslgeqf3fj",
    "vendor_name": "Akyra Manor Chiang Mai",
    "title": "Boutique Chiang Mai Five-Star Escape with Daily Breakfast, Lunch or Dinner & Nightly Cocktail",
    "description": "Immerse yourself in the vibrant and chic atmosphere of Chiang Mai in North Thailand with a stay at this intimate five-star sanctuary, located in the heart of the trendy Nimmanhaemin Soi 9, also known as 'coffee road'. Experience luxury at this sophisticated hotel, featuring contemporary, design-oriented interiors and elegant rooms and suites with private courtyards.\n\nIndulge in innovative Italian and Thai cuisine at the onsite Italics restaurant, or enjoy signature cocktails and tapas at RISE Rooftop Bar. Take in the stunning city and mountain views from the iconic rooftop pool, and stay active in the well-equipped fitness center.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Akyra Manor Chiang Mai",
    "offer_address": "22/2 Nimmanhaemin Road Soi 9, Su Thep, Muang Chiang Mai District, Chiang Mai 50200, Thailand",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 379.0,
    "value": 1489.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RBEhDQAX",
    "hero_image": "https://images.luxuryescapes.com/kuvv6sral79aymdzqjh9",
    "image_two": "https://images.luxuryescapes.com/ituwakhcrdzshi4wzpst",
    "image_three": "https://images.luxuryescapes.com/if6qtggcawhwf2breqgf",
    "vendor_name": "Veranda High Resort Chiang Mai - MGallery by Sofitel",
    "title": "Five-Star Thai MGallery by Sofitel Luxury",
    "description": "Discover the ancient Thai beauty of Chiang Mai at Veranda Chiang Mai - The High Resort, a tranquil five-star retreat hidden in Northern Thailand’s majestic mountain ranges. Unwind amidst breathtaking misty mountains, plunging tropical valleys and lush rice terraces when you stay four nights. Enjoy daily buffet breakfasts, a three-course dining experience, two 30-minute massage treatments each, nightly pre-dinner cocktails, convenient airport pickup and complimentary daily shuttles to Chiang Mai’s town centre where you can explore over 300 temples and visit vibrant local markets.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Chiang Mai",
    "offer_geo_area_level_2": "Amphoe Hang Dong",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Veranda Chiang Mai - The High Resort - Mgallery by Sofitel OLD OLD OLD",
    "offer_address": "192 Moo2 Banpong Hangdong, Chiang MAI, 50230, Thailand",
    "percentage_discount": 50.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 455.0,
    "value": 918.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008J8DFAA0",
    "hero_image": "https://images.luxuryescapes.com/jr6dunn3pezmuj61b18h",
    "image_two": "https://images.luxuryescapes.com/pxp6jl0bpwmy1u7bilq",
    "image_three": "https://images.luxuryescapes.com/l8qyph815rqirgrovmpg",
    "vendor_name": "Shangri-La Hotel, Chiang Mai",
    "title": "Five-Star Chiang Mai Shangri-La Escape with Daily Breakfast, Club Lounge Access, Nightly Drinks & Two Kids Stay Free",
    "description": "Experience the sprawling luxury haven of Shangri-La Chiang Mai. Designed with inspiration from traditional Thai architecture, you can expect opulent dark wood and gold painted Buddhist-influenced interiors, traditional Northern Thai décor, silk fabrics, and wide swathes of lush greenery. Conveniently located within the bustling centre of this culturally rich city, start your day with a rickshaw ride down the narrow lanes in the Old Town and explore the numerous Thai Buddhist temples. \n\nOn your return, indulge with a luxurious treatment at the Chinese-inspired Chi, The Spa; get your heart pumping in the fitness centre that offers a range of gym classes, or take a dip in the free-form swimming pool (the largest in the city). In the evening head to Kad Kafé where you can savour Thai, Chinese, Japanese, European and Mediterranean specialties.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Shangri-La Chiang Mai",
    "offer_address": "89/8 Changklan Road, Muang, Chiang Mai 50100, Thailand",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 415.0,
    "value": 740.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C27DkAAJ",
    "hero_image": "https://images.luxuryescapes.com/qvz1chftcnt0x8h1dnac",
    "image_two": "https://images.luxuryescapes.com/3tdwg3dnpnofux3pt9i",
    "image_three": "https://images.luxuryescapes.com/lvmeriwowjgfnrn1dp1y",
    "vendor_name": "Anantara Chiang Mai Resort",
    "title": "Luxury Riverside Escape in the Heart of Chiang Mai with Daily Breakfast",
    "description": "Escape to riverside serenity at Anantara Chiang Mai Resort, a slice of serenity on the banks of the Mae Ping River. Located on the grounds of the former British Consulate, this luxurious resort combines modern luxury with traditional Thai touches and the site’s colonial-era heritage, all encompassed in a sleek, Kerry Hill-designed building. Be pampered with a massage, indulge in contemporary cuisine and enjoy key attractions - think ancient monuments, galleries and night markets - within walking distance.\n\nA traditionally Thai experience awaits you in Chiang Mai, known as the country’s cultural capital and overflowing with breathtaking temples, verdant countryside and peaceful villages. Drive into the northern hills for trekking with a local guide or hop on a rickshaw and visit the Three Kings Monument and other spectacular ancient buildings - a true taste of Thailand.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Anantara Chiang Mai Resort",
    "offer_address": "123/1 Charoen Prathet Road, Changklan, Muang, Chiang Mai 50100, Thailand",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 736.0,
    "value": 1730.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cr9JCQAY",
    "hero_image": "https://images.luxuryescapes.com/crjrcqhrtqtuf1kr0bjn",
    "image_two": "https://images.luxuryescapes.com/nbyeqz39thu1kvlw4pxk",
    "image_three": "https://images.luxuryescapes.com/w1ts1a6cnitluq8mnw46",
    "vendor_name": "Novotel Chiangmai Nimman Journeyhub",
    "title": "Grand Opening: Enjoy Rooftop City Views in the Heart of Chiang Mai",
    "description": "Soak up the laidback charm of Chiang Mai with a stay at the brand-new Novotel Chiangmai Nimman Journeyhub. Located in the heart of the city, this stylish property places you near major cultural attractions such as the Wat Chedi Luang and Wat Phra Singh temples, Doi Suthep-Pui National Park and a host of fantastic local shops and restaurants. Your package includes daily buffet breakfast, one three-course dinner, one daily cocktail per person and roundtrip private airport transfers. Plus, one child aged 11 years and under stays and eats free when dining with an adult!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Novotel Chiangmai Nimman Journeyhub",
    "offer_address": "Soi Sreesud, Mueang, Amphoe Mueang Chiang Mai, Chang Wat 50300 Chiang Mai Thailand",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 184.0,
    "value": 426.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RB7gaQAD",
    "hero_image": "https://images.luxuryescapes.com/awdm7qn7ykxocmbpdfbc",
    "image_two": "https://images.luxuryescapes.com/u0wy4bqkzrjasjguatjd",
    "image_three": "https://images.luxuryescapes.com/hygordm23cdq1x1upzfw",
    "vendor_name": "Akyra Manor Chiang Mai",
    "title": "Boutique Chiang Mai Luxury in Thailand",
    "description": "Explore northern Thailand’s enchanting ancient and cultural capital with four nights of five-star boutique luxury at Akyra Manor Chiang Mai. Includes return airport transfers, daily à la carte breakfasts, a five-course ‘Flavours of Northern Thailand’ dining experience, daily rooftop cocktails, shuttle service to the night market and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Chiang Mai",
    "offer_geo_area_level_2": "Amphoe Mueang Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Akyra Manor Chiang Mai OLD*",
    "offer_address": "22/2 Nimmana Haeminda Rd Lane 9, Tambon Su Thep, Amphoe Mueang Chiang Mai, Chang Wat Chiang Mai 50200, Thailand",
    "percentage_discount": 64.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 637.0,
    "value": 1774.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gun6IAAR",
    "hero_image": "https://images.luxuryescapes.com/rr6u6otgrlsy2c3i0u3w",
    "image_two": "https://images.luxuryescapes.com/4sih4fkky8ia5fe6zxj",
    "image_three": "https://images.luxuryescapes.com/5cgsmcfz59vnzqyoyrdi",
    "vendor_name": "Anantara Chiang Mai Resort",
    "title": "Chiang Mai Luxury Riverside Escape with Daily Breakfast, Nightly Dinner & Nightly Cocktails",
    "description": "Escape to the Thai riverside at Anantara Chiang Mai Resort, a slice of serenity on the banks of the Mae Ping River. Located on the grounds of the former British Consulate, this five-star resort combines modern luxury with traditional Thai touches and the site’s colonial-era heritage, all encompassed in a sleek, Kerry Hill-designed building. Be pampered with a massage, indulge in contemporary cuisine and enjoy key attractions - ancient monuments, galleries and night markets - within walking distance. Return to contemporary steakhouse dining at the elegant The Service 1921 Restaurant, classic cocktails at the Bond-inspired Brit Bar or fine oysters and champagne at the resort's rooftop bar, Bubbles.\n\nA traditional Thai experience awaits you in Chiang Mai, known as the country’s cultural capital and overflowing with breathtaking temples, verdant countryside and peaceful villages. Drive into the northern hills for trekking with a local guide or hop on a rickshaw and visit the Three Kings Monument and other spectacular ancient buildings for a true taste of Thailand.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Anantara Chiang Mai Resort",
    "offer_address": "123/1 Charoen Prathet Road, Changklan, Muang, Chiang Mai 50100, Thailand",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 11,
    "price": 539.0,
    "value": 1157.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPdFCQA0",
    "hero_image": "https://images.luxuryescapes.com/v4gfht8wzg27ecgowpx9",
    "image_two": "https://images.luxuryescapes.com/zdcyexd3fmqi5dkpxixw",
    "image_three": "https://images.luxuryescapes.com/vdk6l1jjkavmijm3dmms",
    "vendor_name": "Akyra Manor Chiang Mai",
    "title": "Exclusive Five-Star All-Suite Escape in Thailand's Cultural Capital",
    "description": "Immerse yourself in the ancient Thai beauty of Chiang Mai at the multi-award-winning Akyra Manor, an ultra-chic boutique hotel of just 30 suites in the heart of the city. Chiang Mai is renowned for its misty mountains, over 300 traditional temples, elephant sanctuaries and local markets. Enjoy daily breakfasts featuring cold buffet items and one hot à la carte dish each, one Thai set lunch for two, one Northern Thai set dinner for two, return airport transfers and one daily cocktail each.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Chiang Mai",
    "offer_geo_area_level_2": "Amphoe Mueang Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Akyra Manor Chiang Mai - Old",
    "offer_address": "22/2 Nimmana Haeminda Rd Lane 9, Tambon Su Thep, Amphoe Mueang Chiang Mai, Chang Wat Chiang Mai 50200, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 469.0,
    "value": 1437.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cshUoQAI",
    "hero_image": "https://images.luxuryescapes.com/v93zahqzhu3hytn9vsz",
    "image_two": "https://images.luxuryescapes.com/ck435w2q9ihunzfbck9",
    "image_three": "https://images.luxuryescapes.com/2mk49d607dek4zv2rgwa",
    "vendor_name": "Anantara Chiang Mai Resort",
    "title": "Riverside Relaxation in Thailand's Cultural Capital Chiang Mai with Fine-Dining",
    "description": "Immerse yourself in the natural beauty of Chiang Mai at Anantara Chiang Mai Resort, a peaceful riverside retreat. Spend your days exploring the surrounding Thai temples and artisan villages, then return to the resort and relax on your balcony daybed, sip cocktails at the pool or indulge in fine dining. Your package includes daily breakfast, two delicious riverside dinners, cocktails and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Anantara Chiang Mai Resort 2020",
    "offer_address": "123 123/1 Charoenprathet Rd, Muang Amphoe Mueang Chiang Mai, Chang Wat Chiang Mai 50100, Thailand",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 495.0,
    "value": 1111.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjTRAA0",
    "hero_image": "https://images.luxuryescapes.com/sdcfx2t4ghp51kot320j",
    "image_two": "https://images.luxuryescapes.com/4x5h9kn46tgg8lzjpq57",
    "image_three": "https://images.luxuryescapes.com/fd5ol7l63inxhofco99",
    "vendor_name": "Novotel Chiangmai Nimman Journeyhub",
    "title": "Grand Opening: Enjoy Rooftop City Views in the Heart of Chiang Mai",
    "description": "Soak up the laidback charm of Chiang Mai with a stay at the brand-new Novotel Chiangmai Nimman Journeyhub. Located in the heart of the city, this stylish property places you near major cultural attractions such as the Wat Chedi Luang and Wat Phra Singh temples, Doi Suthep-Pui National Park and a host of fantastic local shops and restaurants. Your package includes daily buffet breakfast, one three-course dinner, one daily cocktail per person and roundtrip private airport transfers. Plus, one child aged 11 years and under stays and eats free when dining with an adult!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Novotel Chiangmai Nimman Journeyhub",
    "offer_address": "Soi Sreesud, Mueang, Amphoe Mueang Chiang Mai, Chang Wat 50300 Chiang Mai Thailand",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 185.0,
    "value": 429.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Hwv4IAC",
    "hero_image": "https://images.luxuryescapes.com/o3w9o2ttxbnidzynfxbv",
    "image_two": "https://images.luxuryescapes.com/qukjsxrg5pfwh4hlvozm",
    "image_three": "https://images.luxuryescapes.com/3jhucui06un7s4woqd8",
    "vendor_name": "Panviman Chiang Mai Spa Resort",
    "title": "Five-Star Chiang Mai Hilltop Serenity with Daily Breakfast, Nightly Dinner, Nightly Cocktails & Massages",
    "description": "Re-centre in one of Thailand's most spiritually and historically significant destinations at this five-star wellness resort in Chiang Mai. This boutique reprieve is deeply seated in the mesmerising Mae Rim Valley, surrounded by dense rainforest and the mountainous terrain of Northern Thailand.\n\nIndulge in international cuisine at the onsite Panorama Restaurant - overlooking 12 acres of gently sloping greenery - and sip a craft cocktail on the deck. Retreat to Panviman Spa for personalised treatments and spend hours floating across two-tiered pools, or challenge your mind with a game of giant chess.\n\nWhen it comes time to part with blissful seclusion, the ancient temples, sprawling bazaars and markets of Chiang Mai are an hour's drive away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Mae Rim",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Panviman Chiang Mai Spa Resort",
    "offer_address": "197/2 Moo 1, Pong Yaeng, Mae Rim District, Chiang Mai 50180, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 389.0,
    "value": 1020.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CNUDOAA5",
    "hero_image": "https://images.luxuryescapes.com/4wo19h4froxgsh4g7x6d",
    "image_two": "https://images.luxuryescapes.com/pjgb3zygb9vzbqbstmhc",
    "image_three": "https://images.luxuryescapes.com/m3khnt5n3mwq7sff7lsm",
    "vendor_name": "InterContinental Chiang Mai Mae Ping",
    "title": "Luxury Five-Star Escape in the Heart of Chiang Mai",
    "description": "Accept an invitation to explore the old-world charm, sprawling luxury and cosmopolitan sophistication, at InterContinental Chiang Mai Mae Ping, an IHG Hotel. Immerse yourself in Lanna culture in this 'living museum' concept hotel that blends the handiwork of local artisans with signature InterContiental opulence. Centrally located within the bustling heart of the city, this hotel is perfectly placed for rickshaw rides through the Old Town and exploring the numerous Thai Buddhist temples.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "InterContinental Chiang Mai Mae Ping, An IHG Hotel",
    "offer_address": "284 Don Kaew Mae Rim District, Chiang Mai 50180, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 134.0,
    "value": 134.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnGgDYAV",
    "hero_image": "https://images.luxuryescapes.com/v367tpeey65vp9mm0yd",
    "image_two": "https://images.luxuryescapes.com/a1ncktzv8edtqpl0bs2b",
    "image_three": "https://images.luxuryescapes.com/nqj6lreiynxuzg2ojskw",
    "vendor_name": "Mövenpick Suriwongse Hotel Chiang Mai",
    "title": "Central Chiang Mai Hotel with Seven Restaurants & Bars",
    "description": "Experience the cultural charm of Thailand with a stay in the heart of Chiang Mai's bustling Old City. Step out to explore the ancient temples, bustling markets and vibrant nightlife of this captivating city, or stay in to savour authentic Thai cuisine at the hotel's seven dining outlets and bars.\n\nFor a refreshing break, take a dip in the shimmering rooftop pool, offering panoramic views of the city and surrounding mountains, or indulge in the hotel's famous chocolate hour. No matter your preference, you'll be right at the heart of the Chiang Mai action.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Mövenpick Suriwongse Chiang Mai",
    "offer_address": "110 Chang Klan Road Muang, Chiang Mai 50100, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 50.0,
    "value": 50.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnGfvYAF",
    "hero_image": "https://images.luxuryescapes.com/u3p2m9xwn39wsjw3ld7v",
    "image_two": "https://images.luxuryescapes.com/0o0c8rmwhn3coyd0e61v",
    "image_three": "https://images.luxuryescapes.com/3luyd41lbjm6bw1topq6",
    "vendor_name": "Mercure Chiang Mai",
    "title": "Chiang Mai City Centre Stay near Night Bazaar with Onsite Dining, Spa & Pool",
    "description": "Discover comfort and convenience at a perfectly located gem in the heart of Thailand’s cultural capital, just 10 minutes from the airport. A short tuk-tuk ride will take you to the ancient city walls and moat, where you can explore the historic city, home to hundreds of ornate Buddhist temples.\n\nWander to Chiang Mai’s famed Night Bazaar, just a 15-minute stroll away, or head to a nearby elephant sanctuary to get up close to these gentle giants. Back at the hotel, an indulgent spa awaits to restore your mind, body and soul.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Mercure Chiang Mai",
    "offer_address": "183 Changpuak Road, Srio Poom Maung District, Chiang Mai 50200, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 28.0,
    "value": 28.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v0flAAA",
    "hero_image": "https://images.luxuryescapes.com/a0sr02uddmjs59n6rcq",
    "image_two": "https://images.luxuryescapes.com/2jimbvbuaxm0sk4fpdh",
    "image_three": "https://images.luxuryescapes.com/gaqihre6ocmfprpuvrj",
    "vendor_name": "Anantara Chiang Mai Resort",
    "title": "Tranquil Five-Star Riverside Escape in the Heart of Chiang Mai",
    "description": "Escape to riverside tranquillity at Anantara Chiang Mai Resort, a slice of serenity on the banks of the Mae Ping River. Located on the grounds of the former British consulate, this luxurious resort combines modern luxury with traditional Thai touches and the site’s colonial-era heritage, all encompassed in a sleek, peaceful design. Be pampered at the spa, indulge in contemporary cuisine and enjoy ancient monuments, galleries and night markets all within walking distance.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Anantara Chiang Mai Resort",
    "offer_address": "123/1 Charoen Prathet Road, Changklan, Muang, Chiang Mai 50100, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 272.0,
    "value": 272.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zXGZAA2",
    "hero_image": "https://images.luxuryescapes.com/wp2neoovbq0qf7ej53z4",
    "image_two": "https://images.luxuryescapes.com/tjqokqvljpcy4ujt5zxg",
    "image_three": "https://images.luxuryescapes.com/ddxiuqqw3r22ljiyzka8",
    "vendor_name": "Shangri-La Hotel, Chiang Mai",
    "title": "Five-Star Shangri-La Escape in the Heart of Chiang Mai",
    "description": "Discover the tranquil mountain ranges of Northern Thailand with a stay at the five-star Shangri-La Chiang Mai, ranked in the top 10% of hotels worldwide by Tripadvisor.\n\nThis indulgent sanctuary has been designed with inspiration from traditional Thai architecture and features opulent dark wood and gold painted Buddhist-influenced interiors. Take a dip in the free-form swimming pool, then take the kids over to the splash zone to slip down the waterslide. There are also tennis courts, a fully-equipped fitness centre with classes, and the tranquil Chi, The Spa where you can be pampered into pure bliss. Spend days exploring this incredible ancient city starting with a rickshaw ride down the narrow lanes in the Old Town, then return to the hotel and head to the onsite Kad Kafé where you can savour Thai, Chinese, Japanese, European and Mediterranean specialties.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Shangri-La Hotel, Chiang Mai",
    "offer_address": "89/8 Changklan Rd, Tambon Chang Khlan, Mueang Chiang Mai District, Chiang Mai 50100, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 118.0,
    "value": 118.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HEvQAAW",
    "hero_image": "https://images.luxuryescapes.com/hi9nnir9akgvo0cde2b",
    "image_two": "https://images.luxuryescapes.com/qt8eztun1ych3tybpt",
    "image_three": "https://images.luxuryescapes.com/hbd1uppghdnd0yyn1wb",
    "vendor_name": "Cross Chiang Mai Riverside",
    "title": "Five-Star Chiang Mai All-Suite Riverside Retreat",
    "description": "Discover complete serenity with a stay by the banks of Thailand’s Ping River at Cross Chiang Mai Riverside. Ranked among the top 1% of hotels worldwide on Tripadvisor, the resort strikes the perfect balance between luxury, elegance and tranquility through its design and exceptional facilities. Head to the sophisticated onsite restaurant and stylish rooftop bar for an exquisite meal or handcrafted cocktail - all the while admiring glorious river views. Spend the rest of your time swimming in the rooftop pool, indulging in a luxe spa treatment and kayaking along the river.\n\nCradled by the mountains of Northern Thailand and cut in half by the Ping River, reconnecting with nature is all too easy in Chiang Mai. You’re never too far from breathtaking natural landscapes made up of lush rainforests, rolling green countryside and epic waterfalls, while still enjoying all the conveniences of a modern city.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Cross Chiang Mai Riverside",
    "offer_address": "369/1 Thanon Charoenrajd, Wat Ket, Mueang Chiang Mai District, Chiang Mai 50000, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 203.0,
    "value": 203.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003Gm43AAC",
    "hero_image": "https://images.luxuryescapes.com/nmza3k75uk468zx4wqx",
    "image_two": "https://images.luxuryescapes.com/gbakgtwxplip7s7u3sm",
    "image_three": "https://images.luxuryescapes.com/rhfx5gu94n8cwt170epf",
    "vendor_name": "Akyra Manor Chiang Mai",
    "title": "Boutique Five-Star Chiang Mai Escape",
    "description": "Discover the beauty and tradition of one of Northern Thailand’s most vibrant cities with a stay at Akyra Manor Chiang Mai. Sitting pretty on Nimmanhaemin Soi, known as ‘coffee street’ thanks to its countless trendy cafés, this contemporary sanctuary is perfectly placed to explore the Artists' Quarter, with its stylish boutiques, galleries, restaurants and bars. Wander around traditional Thai temples, such as Wat Chedi Luang, or taste your way through the night bazaars - everything is within easy reach of the hotel’s central location.\n\nThe stunning hotel celebrates its location through art installations and designer lighting, a style that extends to its Deluxe Rooms, Premier Suites and Manor Suites. Monochrome colour palettes, open-air bathrooms and sumptuously comfortable king beds feature in every room and suite, alongside five-star mod-cons designed to make your stay sensational. Dip into the city’s only rooftop pool while admiring the mist-covered hills of Northern Thailand. When you’ve dried off, stop for a cocktail or two at Rise rooftop bar or taste your way through the Italian flavours of Italics, one of Chiang Mai’s most talked-about restaurants.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chiang Mai Province",
    "offer_geo_area_level_2": "Chiang Mai",
    "location_heading": "Chiang Mai",
    "location_subheading": "Thailand",
    "location_description": "Akyra Manor Chiang Mai",
    "offer_address": "22/2 Nimmanhaemin Road Soi 9, Su Thep, Muang Chiang Mai District, Chiang Mai 50200, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 153.0,
    "value": 153.0
  }
]