[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IJcTIAW",
    "hero_image": "https://images.luxuryescapes.com/tszp0f597usdmjsb0lj",
    "image_two": "https://images.luxuryescapes.com/qnb6pj2ydj4smd31y7e",
    "image_three": "https://images.luxuryescapes.com/qll0fewbhcyrt7ed0s9f",
    "vendor_name": "Seven Spirit Bay Wilderness Lodge",
    "title": "Outback Spirit Adults-Only Arnhem Land Luxury Lodge with All-Inclusive Dining, Free-Flow Drinks & Wilderness Tours",
    "description": "Strike out to the great Australian outback and discover the untamed beauty of the Northern Territory's Cobourg Peninsula at this luxurious wilderness retreat, with only three exclusive departures on 14 August, 20 September or 24 September 2024. Accessible only by boat or aircraft, this secluded haven allows you to venture into the heart of Arnhem Land, a region rich in Aboriginal culture and untouched landscapes.\n\nReconnect with nature in the most sophisticated way at Seven Spirit Bay, where you're granted rare access to the area's rugged ranges, idyllic billabongs, and monsoonal rainforests. Scour the Cobourg Marine Park for a diverse range of large reef fish on a half-day blue-water fishing adventure, explore the pristine waters of Garig Gunak Barlu National Park on a brand-new expedition boat, or enjoy complimentary 4WD safaris and birdwatching excursions.\n\nWake up to the serene sounds of nature from your elegant villa, each boasting an ensuite bathroom and a private balcony that opens to breathtaking vistas. Indulge in gourmet dining with all-inclusive meals prepared by an in-house chef, plus unlimited beer, wine and basic spirits.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Cobourg",
    "location_heading": "Cobourg Peninsula",
    "location_subheading": "Northern Territory",
    "location_description": "Seven Spirit Bay",
    "offer_address": "Garig Gunak Barlu National Park, Cobourg Peninsula, Darwin, Northern Territory 0822, Australia",
    "percentage_discount": 24.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 3689.0,
    "value": 4869.0
  }
]