[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HX5XIAW",
    "hero_image": "https://images.luxuryescapes.com/xiq5u6sn1mp9x2n5z0dp",
    "image_two": "https://images.luxuryescapes.com/kw53nm4iv8esg3iqda8rp",
    "image_three": "https://images.luxuryescapes.com/qw0u7mmp9gft559kej7",
    "vendor_name": "Elevation Hotel and Spa",
    "title": "Luxurious Colorado Ski-In Ski-Out Escape on the Slopes of Mount Crested Butte with Daily Breakfast & Nightly Drinks",
    "description": "Snow-capped mountains transform the Colorado landscape into a winter wonderland, which is best enjoyed from this blissful year-round slope-side hotel. This luxury ski-in, ski-out destination is located at the base of Mount Crested Butte and is part of the Vail Epic Pass system within the Colorado Rockies - one of America's best ski destinations.\n\nPerfect for the adventurous snow-loving traveller, the resort features slope-side dining, a full-service spa, a heated indoor pool and three hot tubs, perfect for winters spent skiing and snowboarding on the powder-soft snow. Embrace the sun-kissed slopes and feel the exhilarating rush of fresh mountain air whip past as you glide down the peak.\n\nAs the sun sets over the serene mountain, gather around the outdoor firepit with a glass of mulled wine to warm the soul, before refuelling with a hearty meal. José Crested Butte restaurant is set at the base of the mountain and serves flavour-filled Mexican cuisine, while Billy Barr offers a cosy sanctuary filled with plush furnishings.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Colorado",
    "offer_geo_area_level_2": "Crested Butte",
    "location_heading": "Colorado",
    "location_subheading": "USA",
    "location_description": "Elevation Hotel & Spa",
    "offer_address": "500 Gothic Road, Crested Butte, Colorado 81225, United States",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 979.0,
    "value": 2260.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gxvn7AAB",
    "hero_image": "https://images.luxuryescapes.com/8wxx2168pah9z0hz8bj",
    "image_two": "https://images.luxuryescapes.com/vjneq1nc1njs7y15868c",
    "image_three": "https://images.luxuryescapes.com/a35y45c0pj3gg4vrhg",
    "vendor_name": "Aspen Meadows Resort",
    "title": "Stylish Aspen Mountain All-Suite Retreat with Outdoor Pool, Hot Tub & Restaurant",
    "description": "Let the mesmerising natural surroundings wash over you with a stay at Aspen Meadows Resort, an all-suite retreat framed by Aspen Mountain and the lush Highlands. This Bauhaus-inspired escape offers opportunities to chase the rush or relaxation - spend your day speeding down the slopes, or ease tired muscles in the heated outdoor pool and hot tub. Take advantage of bicycle rentals in the summer to explore the Rio Grande trail, or tuck into locally sourced ingredients from Colorado's Rocky Mountains at West End Social.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Colorado",
    "offer_geo_area_level_2": "Aspen",
    "location_heading": "Colorado",
    "location_subheading": "United States",
    "location_description": "Aspen Meadows Resort",
    "offer_address": "845 Meadows Rd, Aspen, CO 81611, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 435.0,
    "value": 435.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VYehAAG",
    "hero_image": "https://images.luxuryescapes.com/096sz7dqv4np316jazmk",
    "image_two": "https://images.luxuryescapes.com/ka4ign6l8kndvv2yrl4",
    "image_three": "https://images.luxuryescapes.com/bol4aa4c3ppqn4o0qbi1",
    "vendor_name": "Viceroy Snowmass",
    "title": "Colorado Award-Winning Viceroy Ski Resort in Aspen",
    "description": "Connect with the great outdoors and feel immediately uplifted and invigorated with a spectacular stay at Viceroy Snowmass, Colorado - a luxury resort at the base of one of the world’s most sought-after ski mountains, voted Best Ski Hotel in Colorado in the Travel + Leisure: World's Best Awards 2022 and Best Ski Hotel 2020 in the USA Today Readers' Choice Awards. Considered a laidback alternative to nearby, world-famous Aspen, Snowmass offers a more relaxed atmosphere for families and couples seeking a chilled-out escape. \n\nMajestic peaks and breathtaking powdery terrain frame the resort, with exceptional skiing and snowboarding trails on your doorstep. Sample the flavours of Colorado at the many dining options nearby or simply relax in the comfort of your cosy sanctuary after a full day exploring Mother Nature’s playground, with après-ski luxury including a dreamy spa, outdoor pools and sophisticated dining.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Colorado",
    "offer_geo_area_level_2": "Snowmass Village",
    "location_heading": "Colorado",
    "location_subheading": "USA",
    "location_description": "Viceroy Snowmass",
    "offer_address": "130 Wood Road, Snowmass Village, Colorado, United States, 81615",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 314.0,
    "value": 314.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IvVmIAK",
    "hero_image": "https://images.luxuryescapes.com/wj8q12fi0nnqochaizt",
    "image_two": "https://images.luxuryescapes.com/6zivyuatreggzn7oliw",
    "image_three": "https://images.luxuryescapes.com/btcj9lnwzfj3iunyu0d",
    "vendor_name": "Mountain Lodge Telluride",
    "title": "Modern Colorado Rocky Mountain Retreat with Panoramic Views & Ski-In Ski-Out Access",
    "description": "Nestled among the picturesque San Juan Mountains, renowned for its seemingly endless terrain, this luxe lodging offers prime ski access for adventurers of all levels. Located in Mountain Village above downtown Telluride, just a short gondola ride away, this upscale ski-in ski-out paradise serves as your launchpad for the ultimate outdoor adventure all year round. \n\nIn the winter months, carve your way through fresh powder before kicking off your apres-ski with a cocktail at The View Bar & Grill, or revel in glorious alpine views while relaxing in the outdoor hot tub. When you’re not on the slopes, you'll find a world of adventure awaits - from hiking or cycling along exhilarating trails, wandering through lush meadows or day tripping to Orvis Hot Springs, where you can soak up mountainside serenity.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Colorado",
    "offer_geo_area_level_2": "Telluride",
    "location_heading": "Colorado",
    "location_subheading": "United States",
    "location_description": "Mountain Lodge Telluride",
    "offer_address": "457 Mountain Village Boulevard, Telluride, CO 81435, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 243.0,
    "value": 243.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CvNb3AAF",
    "hero_image": "https://images.luxuryescapes.com/wk70udqo65tl7tu9bpuc",
    "image_two": "https://images.luxuryescapes.com/n9gg5q54rlocuhh7vnv9",
    "image_three": "https://images.luxuryescapes.com/u374fepdefkk7x73n0he",
    "vendor_name": "Elevation Hotel and Spa",
    "title": "Luxurious Colorado Ski-In Ski-Out Escape on the Slopes of Mount Crested Butte",
    "description": "Elevation Hotel & Spa offers guests a beautiful year-round mountain slope-side experience in the Colorado Rockies - one of America's best ski destinations. This luxury ski-in, ski-out destination, located at the base of Mount Crested Butte and part of the Vail Epic Pass system, features slope-side dining, a full-service spa, a heated indoor pool, and three hot tubs, perfect for  summers spent mountain biking and winters spent skiing and snowboarding.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Colorado",
    "offer_geo_area_level_2": "Crested Butte",
    "location_heading": "Colorado",
    "location_subheading": "United States",
    "location_description": "Elevation Hotel & Spa",
    "offer_address": "500 Gothic Road, Mt. Crested Butte, Colorado, 81225, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 153.0,
    "value": 153.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JG1aIAG",
    "hero_image": "https://images.luxuryescapes.com/k2mojftjdsujmwk7ors",
    "image_two": "https://images.luxuryescapes.com/bqk9hw9sp9tsfu431df",
    "image_three": "https://images.luxuryescapes.com/rjgik71yvqxhzutaiu",
    "vendor_name": "Madeline Hotel & Residences, Auberge Resorts Collection",
    "title": "Landmark Ski-In Ski-Out Colorado Luxury with Panoramic Mountain Views, Heated Pool & Onsite Spa",
    "description": "Snow-capped sophistication awaits at this ski-in ski-out alpine sanctuary in the heart of the breathtaking San Juan Mountains. Just minutes from Telluride's charming gold-mining town, surrounded by rugged forested highlands, this five-star retreat is the perfect place for both adrenaline-filled adventure and recharging in the natural world.\n\nWhen you’re not skiing the slopes, soak in the heated outdoor pool with misty steam, while enjoying panoramic mountain views. Sweat it out in the state-of-the-art fitness centre, reconnect with your body in a yoga class or relieve your muscles with a deep tissue massage at the serene day spa. In the evenings, cosy up by the crackling fireplace at the Timber Room bar, where you can enjoy expertly crafted cocktails and indulge in rustic dishes made with locally sourced produce at Black Iron Kitchen and Bar.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Colorado",
    "offer_geo_area_level_2": "Telluride",
    "location_heading": "Colorado",
    "location_subheading": "United States",
    "location_description": "Madeline Hotel & Residences",
    "offer_address": "568 Mountain Village Boulevard, Telluride, Colorado 81435, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 399.0,
    "value": 399.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JBwqZYAT",
    "hero_image": "https://images.luxuryescapes.com/n3cl8sn0zt65rojy0lb",
    "image_two": "https://images.luxuryescapes.com/741j4jgpi9cdzob88qd",
    "image_three": "https://images.luxuryescapes.com/i3r1lnqc4ur9nnul6v",
    "vendor_name": "Mollie Aspen",
    "title": "Boutique Aspen Retreat near Silver Queen Gondola with Rooftop Bar & Onsite Dining",
    "description": "Ideally located just moments from downtown Aspen, this mountain retreat offers effortless access to the area’s best attractions. A leisurely stroll brings you to the Silver Queen Gondola, while Buttermilk Mountain - ideal for snow sport beginners and families - is a picturesque drive away. Immerse yourself in Aspen’s vibrant cultural scene with visits to renowned spots including the Aspen Art Museum and Wheeler Opera House.\n\nFrom charming boutique shops and acclaimed dining to Aspen’s lively après-ski nightlife, everything you crave is right outside your doorstep. Whether you’re here to conquer the slopes or simply soak in the fresh mountain air, this hotel puts you at the heart of it all.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Colorado",
    "offer_geo_area_level_2": "Aspen",
    "location_heading": "Colorado",
    "location_subheading": "United States",
    "location_description": "MOLLIE Aspen",
    "offer_address": "111 S. Garmisch Street, Aspen, Colorado 81611, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 187.0,
    "value": 187.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DfhA2AAJ",
    "hero_image": "https://images.luxuryescapes.com/98a35ecb8a68urpvgu9l",
    "image_two": "https://images.luxuryescapes.com/6v86jdva1huiszos5ai",
    "image_three": "https://images.luxuryescapes.com/34o1t1mcq78eh9s5rw9e",
    "vendor_name": "The Sebastian- Vail",
    "title": "Luxury Slopeside Escape in Colorado's Vail Village",
    "description": "Discover luxury on the renowned slopes of the Rocky Mountains with a stay at The Sebastian - Vail, a hotel perfectly positioned in the heart of Colorado’s Vail Village. Offering a ski-in, ski-out service and après ski activities aplenty - think pool, hot tubs, Bloom Spa and some of the village’s best charcuterie at Leonora restaurant - you'll be hard-pressed to find a place that better celebrates the magic of this storied mountain.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Colorado",
    "offer_geo_area_level_2": "Vail",
    "location_heading": "Colorado",
    "location_subheading": "United States",
    "location_description": "The Sebastian - Vail",
    "offer_address": "16 Vail Road, Vail, Colorado, CO 81657, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 290.0,
    "value": 290.0
  }
]