[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvlpAAAR",
    "hero_image": "https://images.luxuryescapes.com/81t8n3uvggdbcdiced",
    "image_two": "https://images.luxuryescapes.com/t0fcumxc3is15357aqq",
    "image_three": "https://images.luxuryescapes.com/3lyd87o6pite2koaq4d",
    "vendor_name": "The Point Coolum Beach",
    "title": "Elevated Sunshine Coast Escape Moments from Coolum Beach with Guaranteed Ocean Views",
    "description": "Experience the tranquillity of the Sunshine Coast with a stay at The Point Coolum Beach, an idyllic haven between the pristine beaches and ultra-cool cafes of Coolum and the spectacular Mount Coolum National Park. This stylish retreat provides direct access to the secluded Third Bay beachfront just steps away, and connects you to the region's best attractions, including the vibrant Eumundi Markets, the gastronomic delights and boutiques of Noosa's Hastings Street and funky cafes and cuisine of Maroochydore. After a day of exploring, retreat to your private balcony or deck to soak up panoramic views of the ocean, prepare a meal in your fully equipped kitchen or take a dip in one of the two onsite heated swimming pools.\n\nFor a unique dining experience, visit the nearby Pitchfork Restaurant, renowned for its modern Australian cuisine and rustic charm. You might choose to spend a day hiking through the lush hinterland - maybe even climbing Mount Coolum - or rise bright and early and watch a spectacular sunrise over the water with a peaceful walk along the glorious coastline.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Coolum Beach",
    "location_subheading": "Queensland",
    "location_description": "The Point Coolum Beach",
    "offer_address": "1 Bay Terrace, Coolum Beach, Queensland 4573, Australia",
    "percentage_discount": 78.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 599.0,
    "value": 2766.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FxJnbYAF",
    "hero_image": "https://images.luxuryescapes.com/cphhdicbc9h812f0369u",
    "image_two": "https://images.luxuryescapes.com/sk9gye3c3f01qvkp9bn8",
    "image_three": "https://images.luxuryescapes.com/la4j4nyvcblmfpq2ocws",
    "vendor_name": "The Point Coolum Beach",
    "title": "Serene Sunshine Coast Hilltop Villa Escape Moments from Coolum Beach with Guaranteed Ocean Views",
    "description": "Experience the tranquillity of the Sunshine Coast with a stay at this elevated, oceanfront haven between the pristine beaches and ultra-cool cafes of Coolum and the spectacular Mount Coolum National Park. This stylish retreat provides direct access to the secluded Third Bay beachfront and connects you to the region’s best attractions, including the vibrant Eumundi Markets, the gastronomic delights and boutiques of Noosa’s Hastings Street and the cafes of Maroochydore.\n\nAfter a day of exploring, retreat to your private balcony or deck to soak up panoramic views of the ocean, prepare a meal in your fully equipped kitchen or take a dip in one of the two onsite swimming pools.\n\nFor a unique dining experience, visit the nearby BASK Restaurant, recognised for its excellence with two Chef Hats. You might choose to spend a day hiking through the lush hinterland or rise bright and early and watch a spectacular sunrise over the water with a peaceful walk along the coastline.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Coolum Beach",
    "location_subheading": "Queensland",
    "location_description": "The Point Coolum Beach",
    "offer_address": "1 Bay Terrace, Coolum Beach, Queensland 4573, Australia",
    "percentage_discount": 76.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 669.0,
    "value": 2766.0
  }
]