[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eMsXGQA0",
    "hero_image": "https://images.luxuryescapes.com/yg80f1ew2lcy9hg66sn",
    "image_two": "https://images.luxuryescapes.com/hrn47yse2an6dj6cvwx",
    "image_three": "https://images.luxuryescapes.com/f7pnipg6osq4rdk34157",
    "vendor_name": "Hayfield Manor",
    "title": "Award-Winning Manor Stay in the Heart of Historic Cork",
    "description": "Period-style elegance and sheer luxury await on this exceptional Ireland escape fit for a lord: venture to the cobblestoned heart of Cork for a historic stay at Hayfield Manor, built in 1815. Sitting peacefully within a lush walled garden and perched on a hill overlooking the University College Cork Campus, this countryside retreat is within walking distance of the famous English Market and historic sites including the St. Fin Barre’s Cathedral and 17th-century Elizabeth Fort. Experience a quintessential Irish escape with three-nights in a Manor King Room, daily buffet breakfast and a charcuterie board with artisanal cheeses and a bottle of wine to share.",
    "offer_country_name": "Ireland",
    "offer_country_code_alpha_2": "IE",
    "offer_geo_area_level_1": "County Cork",
    "offer_geo_area_level_2": "Cork",
    "location_heading": "Cork",
    "location_subheading": "Ireland",
    "location_description": "Hayfield Manor",
    "offer_address": "Perrott Ave, College Rd, Centre, Cork, T12 HT97, Ireland",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 743.0,
    "value": 1682.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CpXYAA0",
    "hero_image": "https://images.luxuryescapes.com/cxkj7oz77rxqedp2bl",
    "image_two": "https://images.luxuryescapes.com/f4iczg4uh68i35gn0zp",
    "image_three": "https://images.luxuryescapes.com/ig9jv06290sqffp8kf",
    "vendor_name": "Hayfield Manor",
    "title": "Five-Star Manor Stay in the Heart of Historic Cork",
    "description": "Period-style elegance and unrivalled luxury await at Hayfield Manor, an exceptional escape in the heart of Cork, Ireland. Wrapped in a historic 1815 façade and lush green vines, this manor maintains its boutique charms thanks to stylish touches throughout the property, including an original marble fireplace and Georgian-style windows illuminating the ornate artworks and antiques. The manor’s excellent facilities include Beautique Spa, Orchids fine dining restaurant and Perrots Garden Bistro. Venture a little further away to visit the Blarney Castle and Gardens, Cork City Gaol or Saint Fin Barre's Cathedral before visiting the popular English Markets.",
    "offer_country_name": "Ireland",
    "offer_country_code_alpha_2": "IE",
    "offer_geo_area_level_1": "County Cork",
    "offer_geo_area_level_2": "Cork",
    "location_heading": "Cork",
    "location_subheading": "Ireland",
    "location_description": "Hayfield Manor",
    "offer_address": "Perrott Avenue, College Road, City Centre, T12 HT97, Cork City, Ireland",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 315.0,
    "value": 315.0
  }
]