[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IQrNIAW",
    "hero_image": "https://images.luxuryescapes.com/ao08zv0zi7u8bw5pm2c",
    "image_two": "https://images.luxuryescapes.com/9lc1ukwmoa8qglw9vuch",
    "image_three": "https://images.luxuryescapes.com/2hlfhb6vqp57nl7xoo8",
    "vendor_name": "METT Hotel & Beach Resort Marbella",
    "title": "Costa del Sol Beachfront Resort with Daily Breakfast & Exclusive Beach Club",
    "description": "Experience the luxury of Spain’s Costa del Sol at this modern beachfront resort, where palm trees, golden sands, and crystal-clear waters create the perfect coastal escape. The onsite Azure Beach Club is a must-visit, offering a pool, beach, and lounge area - an ideal spot to relax, people-watch, and enjoy a spectacular sunset.\n\nIndulge in hearty Italian cuisine paired with an extensive wine list at Isola or embrace the beachfront ambience with a refreshing cocktail and Spanish tapas at El Bar De Lola, nestled under lush vines by the resort’s shimmering pool.\n\nVenture beyond the resort to explore Estepona’s charming Old Town, stroll around the stylish Puerto Banús marina or dive into Marbella’s vibrant art scene at the Museo del Grabado. After a day of exploring, unwind at the MOI Spa with a soothing massage or luxurious facial, or swim a few laps in the indoor pool after a workout at the world-class fitness centre.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "Estepona",
    "location_heading": "Costa del Sol",
    "location_subheading": "Spain",
    "location_description": "METT Hotel & Beach Resort Marbella",
    "offer_address": "Urbanización Costalita, Puente de Cancelada, Estepona, Malaga 29680, Spain",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 929.0,
    "value": 2520.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GFmG2YAL",
    "hero_image": "https://images.luxuryescapes.com/euszfpe7i9pxgi1mvhqr",
    "image_two": "https://images.luxuryescapes.com/lkg5oqaqmn8bkdnoji98",
    "image_three": "https://images.luxuryescapes.com/459f602t2l19rhrenwu2",
    "vendor_name": "Fairmont La Hacienda Costa del Sol",
    "title": "Grand Opening: Southern Spain Retreat with Ocean Views, Daily Breakfast & EUR80 Dining Credit",
    "description": "With Mediterranean Sea views and fairways at its doorstep, this lavish retreat radiates coastal elegance. Minimalist design and organic tones set a calming ambience, leading into the impressive wellness hub Spa Fairmont La Hacienda, featuring two hammams, a sauna, yoga studio and more.\n\nBoasting two pools and beach access via a shuttle service just 1km away, it’s easy to find your flow here. Enjoy seasonal Spanish fare at El Faro de la Hacienda, savour elevated local flavours at the candlelit Dalmar or unwind at Umbra with cocktails under the Spanish sun. Plus, with Estepona just 30 minutes away, you're close to a vibrant hub of shopping and fine dining.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "San Roque",
    "location_heading": "Costa del Sol",
    "location_subheading": "Spain",
    "location_description": "Fairmont La Hacienda Costa del Sol",
    "offer_address": "2 Calle Faro de Punta Mala, San Roque, Cádiz 11360, Spain",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 589.0,
    "value": 1020.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JO7a5YAD",
    "hero_image": "https://images.luxuryescapes.com/u92hikgw86vblmzn5pj",
    "image_two": "https://images.luxuryescapes.com/n5adce4zlmy9gu01ncc",
    "image_three": "https://images.luxuryescapes.com/yzcmkbhx4uhmud59ty",
    "vendor_name": "Fairmont La Hacienda Costa del Sol",
    "title": "Secluded Southern Spain Championship Golf Retreat with Daily Breakfast & Two Rounds of Golf",
    "description": "With unbeatable Mediterranean Sea views and lush fairways at its doorstep, this lavish retreat radiates coastal elegance. Minimalist design and organic tones set a calming ambience, leading into the impressive wellness hub Spa Fairmont La Hacienda, featuring two hammams, a relaxing sauna, yoga studio and much more.\n\nSet in one of the most privileged enclaves of the Costa del Sol, this exclusive golf resort is home to two world-class courses: the Heathland Course, designed by Ryder Cup player Dave Thomas, and the Links Course, known for some of the finest beach views in the region.\n\nBoasting two pools and beach access via a shuttle service just 500 metres away, it’s easy to find your flow here. Enjoy seasonal Spanish fare at El Faro la Hacienda, savour elevated local flavours at the candlelit Dalmar or unwind at Umbra with cocktails under the Spanish sun. With Estepona just a 30-minute drive away, you're close to a vibrant hub of shopping and fine dining.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "San Roque",
    "location_heading": "Costa del Sol",
    "location_subheading": "Spain",
    "location_description": "Fairmont La Hacienda Costa del Sol",
    "offer_address": "2 Calle Faro de Punta Mala, San Roque, Cádiz 11360, Spain",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 1279.0,
    "value": 2625.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbR9FAAV",
    "hero_image": "https://images.luxuryescapes.com/akv7bbb3hkjoitgky14",
    "image_two": "https://images.luxuryescapes.com/lxuxz523wf8lnexysdq7",
    "image_three": "https://images.luxuryescapes.com/jj1mtweaebyrsghhzop",
    "vendor_name": "METT Hotel & Beach Resort Marbella",
    "title": "Costa del Sol Beachfront Resort Just 20 Minutes from Marbella with Beach Club, Daily Breakfast & Nightly Cocktails",
    "description": "Discover the Mediterranean luxury of Spain’s Costa del Sol at this contemporary Marbella beachfront resort, fringed by palm trees, golden sands and inviting waters. Azure Beach Club has it all - the pool, the beach and the lounge making it the place to see and be seen - and take in a vibrant sunset while you're at it. \n\nSavour hearty Italian alongside an extensive wine collection at Isola or make the most of the stunning beachfront location with a refreshing cocktail accompanied by Spanish tapas at El Bar De Lola, located beneath verdant vines next to the crystal-clear resort pool. \n\nExplore the region's rich history in Estepona's Old Town, stroll along the stylish Puerto Banús marina, or explore the vibrant art scene at Marbella's Museo del Grabado. After exploring, retreat to the MOI Spa for a rejuvenating massage or high-end facial, or take a dip in the indoor pool after a session at the world-class fitness centre.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "Estepona",
    "location_heading": "Costa del Sol",
    "location_subheading": "Spain",
    "location_description": "METT Hotel & Beach Resort Marbella",
    "offer_address": "Urbanización Costalita, Puente de Cancelada, Estepona, Malaga 29680, Spain",
    "percentage_discount": 38.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 829.0,
    "value": 1344.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4uyqAAB",
    "hero_image": "https://images.luxuryescapes.com/8k6k66ymnlaebphai0bn",
    "image_two": "https://images.luxuryescapes.com/isef1uw4k4iih1k6kbl",
    "image_three": "https://images.luxuryescapes.com/iyn0koqw1gs9yh0769jo",
    "vendor_name": "SO/Sotogrande Spa & Golf Resort Hotel",
    "title": "Five-Star Southern Spain Escape on the Costa del Sol with Daily Breakfast & Resort Credit",
    "description": "Immerse yourself in five-star indulgence at SO/ Sotogrande Resort, a sun-kissed haven that sits high above Spain's glittering Costa del Sol. Nestled on the sought-after southern coast of Spain, with the sea to one side and rolling countryside and olive groves to the other, this award-winning resort - winner of the 'Luxury New Resort' category in The World Luxury Hotel Awards 2022 - invites you to experience the famous Mediterranean lifestyle.\n\nBoasting minimalist design with splashes of bright colour, as well as sun-soaked and generously-sized guest rooms, this comfortable retreat promises the ultimate Mediterranean experience. Take a swing at one of the surrounding world-class golf courses (including Real Club Valderrama, one of the best in the world), unwind at the tranquil Wellness Spa, or enjoy authentic Spanish tapas at one of four onsite restaurants and bars.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "San Roque",
    "location_heading": "Costa del Sol",
    "location_subheading": "Spain",
    "location_description": "SO/ Sotogrande Resort",
    "offer_address": "Avenida Almenara s/n 11310 Sotogrande (San Roque) - Cadiz, Spain",
    "percentage_discount": 30.0,
    "min_duration": 4,
    "max_duration": 12,
    "price": 769.0,
    "value": 1104.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HhZ7BYAV",
    "hero_image": "https://images.luxuryescapes.com/d44k62r1hs7wk6jimby",
    "image_two": "https://images.luxuryescapes.com/5pyg1t8mjr8q2vgd2vu",
    "image_three": "https://images.luxuryescapes.com/6059msedsompl83xsi",
    "vendor_name": "Fairmont La Hacienda Costa del Sol",
    "title": "Secluded Southern Spain Luxury with Daily Breakfast, Nightly Cocktails & Daily EUR40 Dining Credit",
    "description": "With unbeatable Mediterranean Sea views and lush fairways at its doorstep, this lavish retreat radiates coastal elegance. Minimalist design and organic tones set a calming ambience, leading into the impressive wellness hub Spa Fairmont La Hacienda, featuring two hammams, a relaxing sauna, yoga studio and so much more.\n\nBoasting two pools and beach access via a shuttle service just 500 metres away, it’s easy to find your flow here. Enjoy seasonal Spanish fare at El Faro de la Hacienda, savour elevated local flavours at the candlelit Dalmar or unwind at Umbra with cocktails under the Spanish sun. With Estepona just a 30-minute drive away, you're close to a vibrant hub of shopping and fine dining.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "San Roque",
    "location_heading": "Costa del Sol",
    "location_subheading": "Spain",
    "location_description": "Fairmont La Hacienda Costa del Sol",
    "offer_address": "2 Calle Faro de Punta Mala, San Roque, Cádiz 11360, Spain",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 889.0,
    "value": 2725.0
  }
]