[
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GNHPAA4",
    "hero_image": "https://images.luxuryescapes.com/zr3811uchexm4w37c1i",
    "image_two": "https://images.luxuryescapes.com/gohyfs65eovtxoda78xd",
    "image_three": "https://images.luxuryescapes.com/8btvkq3em3qi2whcm3h",
    "vendor_name": "The Lodge at Ashford Castle",
    "title": "Charming Ireland Lakeside Lodge Escape in County Mayo",
    "description": "Discover Ireland’s enchanting landscapes with a charming stay at The Lodge at Ashford Castle - a truly breathtaking property located within the magnificent 350-acre Ashford Castle estate, overlooking Lough Corrib lake in County Mayo. Spectacular surroundings and a rich, layered history bring this corner of Ireland to life in a way that must be experienced to be believed. Occupying space on the grounds of the 800-year-old Ashford Castle, The Lodge immediately transports you to the heart of Ireland as you bask in the shadows of this grand structure, teeming with national significance and a storied past. Each room has been uniquely crafted so no two stays are the same, and you will feel instantly welcomed by the inviting, country house atmosphere. Eye-catching artworks adorn the walls and ornate furnishings matched with modern touches contribute to unrivalled amounts of character.\n\nThe expansive grounds that surround the lodge make for the perfect spot to indulge in a range of activities. From gentle walks to a round of golf on the perfectly manicured nine-hole green, there is no shortage of ways to soak up the magnificent scenery while learning about Ireland’s west coast. Outside the estate, the varied delights of County Mayo await: take a pilgrimage to the mountain chapel of Croagh Patrick, visit the 18th-century residence and amusement park at Westport House, take in the scenery at Keem Bay or marvel at the wild beauty of Ballycroy National Park.",
    "offer_country_name": "Ireland",
    "offer_country_code_alpha_2": "IE",
    "offer_geo_area_level_1": "County Mayo",
    "offer_geo_area_level_2": "Cong",
    "location_heading": "County Mayo",
    "location_subheading": "Ireland",
    "location_description": "The Lodge at Ashford Castle",
    "offer_address": "Ashford Castle Estate, Lisloughrey, Cong, Co. Mayo, Ireland",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 225.0,
    "value": 225.0
  }
]