[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eMsEIQA0",
    "hero_image": "https://images.luxuryescapes.com/z8hdzm9m8b3s7iqcedf",
    "image_two": "https://images.luxuryescapes.com/y96nhqec83wi5o47gkri",
    "image_three": "https://images.luxuryescapes.com/n96zjrmi67bg66xfpidq",
    "vendor_name": "Great Southern Killarney",
    "title": "Elegant Countryside Escape Amid Ireland's Idyllic Scenery",
    "description": "The rugged green beauty of the Emerald Isle awaits on this exceptional boutique escape: venture to the picturesque country town of Killarney for a romantic stay at the Great Southern Killarney - the town’s premier historic hotel. Embrace the charming Irish lifestyle staying in the heart of it all, steps from gastropubs, cosy restaurants and bars, while enjoying daily breakfast and a bottle of wine with a decadent cheese and charcuterie plate on arrival.",
    "offer_country_name": "Ireland",
    "offer_country_code_alpha_2": "IE",
    "offer_geo_area_level_1": "County Kerry",
    "offer_geo_area_level_2": "Killarney",
    "location_heading": "County Kerry",
    "location_subheading": "Ireland",
    "location_description": "Great Southern Killarney",
    "offer_address": "Town Centre, Avenue, Killarney, Co. Kerry, V93 R866, Ireland",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 507.0,
    "value": 1110.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CtH0AAK",
    "hero_image": "https://images.luxuryescapes.com/tdhs1vg6bc1bin530q",
    "image_two": "https://images.luxuryescapes.com/t8mooatfefa888z02ccu",
    "image_three": "https://images.luxuryescapes.com/al2tagt3mthtp7guv7",
    "vendor_name": "Great Southern Killarney",
    "title": "Romantic Ireland Escape in Historic Killarney Country House",
    "description": "Soak up the iconic beauty of County Kerry with a stay at Great Southern Killarney, your gateway to Ireland's most enchanting town. Situated on six acres of landscaped gardens in Killarney town centre, this renowned Victorian hotel, built in 1854, has lived a varied and impressive life, throughout which it has fortunately retained its original features and heritage décor. Whether the occasion calls for luxury or intimacy, dining is an experience you'll want to share at The Garden Room, while The Lake Room and The Picture Room can be reserved for private occasions. To pass a peaceful afternoon, sip a pint or glass of wine in Brownes Bar, or join in the time-honoured tradition of afternoon tea in the Grand Lobby. \n\nYou're in the perfect position to explore the rugged green beauty of the Emerald Isle, including the Ring of Kerry, Killarney National Park, numerous boutiques, cafés, shops and art galleries and half a dozen championship golf courses.",
    "offer_country_name": "Ireland",
    "offer_country_code_alpha_2": "IE",
    "offer_geo_area_level_1": "County Kerry",
    "offer_geo_area_level_2": "Killarney",
    "location_heading": "County Kerry",
    "location_subheading": "Ireland",
    "location_description": "Great Southern Killarney",
    "offer_address": "East Avenue Road, Town Centre, Killarney, County Kerry, V93 R866, Ireland",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]