[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Df9ZLYAZ",
    "hero_image": "https://images.luxuryescapes.com/x8ho2835pwzr8m1pakv",
    "image_two": "https://images.luxuryescapes.com/kjdf7c4e3ynm0iml11qg",
    "image_three": "https://images.luxuryescapes.com/ulsdvkqjg9bq7on58xi",
    "vendor_name": "Accommodation @ Curlewis",
    "title": "Bellarine Peninsula Wine Country Escape Just Two Hours from Melbourne with Driving Range & XGolf Experience",
    "description": "Pour yourself a tall glass of romance amid the thriving Bellarine wine country and swing into the golfing spirit at this tranquil retreat. Set on one of the country’s top golf courses, this constellation of ultra-sleek suites boasts incredible views of the fairway and beyond.\n\nAfter days spent practising your swing at The Range @ Curlewis, watch the sunset with a glass of local shiraz in hand at the Spike Bar. Indulge in a memorable dining experience at the award-winning Claribeaux, which offers refined French dining and beautiful vistas from sunrise to late evening.\n\nIdeal for a gourmet weekend away, this property offers easy access to the peninsula’s best vintners and makers. Pay a visit to Leura Park Estate and Jack Rabbit Winery to admire expansive vineyards, or Flying Brick Cider Co nearby for some top-tier effervescent brews.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Curlewis",
    "location_heading": "Curlewis",
    "location_subheading": "Victoria",
    "location_description": "Accommodation @ Curlewis",
    "offer_address": "1345 Portarlington Road, Curlewis, Victoria 3222, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 249.0,
    "value": 587.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4mrtAAB",
    "hero_image": "https://images.luxuryescapes.com/5h06bf8woqvln8j515ug",
    "image_two": "https://images.luxuryescapes.com/0geqlquuoj54ry2xwj5p",
    "image_three": "https://images.luxuryescapes.com/rd38ttrh7m5i6ohgflfe",
    "vendor_name": "Accommodation @ Curlewis",
    "title": "Brand-New Bellarine Peninsula Escape with Guaranteed Upgrade, Daily Breakfast & Wine Tastings",
    "description": "Pour yourself a tall glass of romance and indulge in the tranquillity of thriving Bellarine wine country at Accommodation @ Curlewis. Set on one of the country's top golf courses, this constellation of futuristic eco-pod abodes boasts incredible views of the fairway and beyond. Watch the sun set with a glass of local syrah in hand at Spike Bar, or indulge in a memorable dining experience at the award-winning Claribeaux Restaurant, which serves up refined French dining and beautiful vistas from sunrise to late evening.\n\nIdeal for a gourmet weekend away, this property boasts a prime location amid the peninsula's best vintners and makers. Pay a visit to Leura Park Estate or Jack Rabbit Winery to admire expansive vineyards. Flying Brick Cider Co nearby produces some of the best effervescent brews, and Terindah Estate offers the unique opportunity to watch Portarlington mussels being farmed before enjoying them cooked in a broth of chardonnay and basil at The Shed.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Curlewis",
    "location_heading": "Curlewis",
    "location_subheading": "Victoria",
    "location_description": "Accommodation @ Curlewis",
    "offer_address": "1345 Portarlington Road, Curlewis, Victoria 3222 Australia",
    "percentage_discount": 25.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 269.0,
    "value": 361.0
  }
]