[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cpLYSQA2",
    "hero_image": "https://images.luxuryescapes.com/8kkkhxubioizn31g9dl8",
    "image_two": "https://images.luxuryescapes.com/de5g7iy03pdn5jrns7zg",
    "image_three": "https://images.luxuryescapes.com/rw1fq6n70fcfysn7z3el",
    "vendor_name": "Pullman Danang Beach Resort",
    "title": "Five-Star Pullman Beachfront Bliss with Daily Dining Experiences",
    "description": "Dreaming of a peaceful tropical getaway for you and your loved ones? Whether you’re seeking a relaxing couples’ escape or a fun family holiday, a stay at Pullman Danang Beach Resort will have everything you’re looking for. Located on the stunning Bac My An Beach, only a stones’ throw from the UNESCO World-Heritage Listed Hoi An Old Town, Pullman Danang offers superb dining, gorgeous views and great facilities. Enjoy daily lunch or dinner at Restaurant Epice, a nightly cocktail, a blissful 60-minute massage, daily buffet breakfast and a one-way transfer from Da Nang Airport.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Da Nang",
    "offer_geo_area_level_2": "Da Nang",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Pullman Danang Beach Resort",
    "offer_address": "101 Vo Nguyen Giap, Khue My, Ngu Hanh Son, Danang 550000, Vietnam",
    "percentage_discount": 55.0,
    "min_duration": 7,
    "max_duration": 10,
    "price": 983.0,
    "value": 2173.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DNaHpYAL",
    "hero_image": "https://images.luxuryescapes.com/pt2l0g62ay2e1b8fznn",
    "image_two": "https://images.luxuryescapes.com/dt8hnd8ishafz4gkazpn",
    "image_three": "https://images.luxuryescapes.com/o3f7l9gdlquf0ds9sgrk",
    "vendor_name": "Pullman Danang Beach Resort",
    "title": "Danang Beachfront Escape with All-Inclusive Dining, Free-Flow Drinks & Massages",
    "description": "Uncover a tropical haven where azure waves meet soft sands at Pullman Danang Beach Resort, the crown jewel of Bac My An Beach. This beachfront, all-inclusive retreat is located just 15 minutes from Da Nang International Airport and seamlessly combines coastal tranquillity with urban sophistication, offering guests easy access to UNESCO World Heritage sites and renowned golf courses.\n\nSavour fresh seafood and local flavour at the Azure Beach Lounge or indulge in international cuisines at Epice restaurant. Elegantly designed rooms and cottages, each with a private balcony offering breathtaking views, provide a sanctuary from sunrise to sunset. Rejuvenate with traditional and modern holistic treatments at Nang Spa or embark on a leisurely bike ride to explore the bustling Han Market and the historic charm of Hoi An Ancient Town. \n\nRejuvenate with Vietnamese treatments at Nang Spa or embark on a leisurely bike ride to explore the bustling Han Market and the historic charm of Hoi An Ancient Town.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Da Nang",
    "offer_geo_area_level_2": "Da Nang",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Pullman Danang Beach Resort",
    "offer_address": "101 Vo Nguyen Giap, Khue My, Ngu Hanh Son, Danang 550000, Vietnam",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 849.0,
    "value": 2497.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zXz2AAE",
    "hero_image": "https://images.luxuryescapes.com/58xqpattof7gap6lzrzh",
    "image_two": "https://images.luxuryescapes.com/idle6xemmbuzcqfmzv8l",
    "image_three": "https://images.luxuryescapes.com/lxajr7zhr5n4pxn5cypn",
    "vendor_name": "Vinpearl Luxury Da Nang",
    "title": "Vietnam Beachfront Luxury near Hoi An with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Vinpearl Luxury Da Nang manages to feel intimate and impressive all at once. With an enviable position overlooking the champagne shores of the renowned Non Nuoc Beach, renowned as one of the world's best, this resort promises a stay to remember. Superbly poised on the sparkling stretch of coast between Da Nang and the UNESCO World Heritage-listed town of Hoi An, the resort lets you find true relaxation with first-class facilities. Plunge into one of the five expansive resort pools including a grand pool, kids' pool and whirlpool, release any tension with a treatment at the serene Akoya Spa, work up a sweat at the gym or tennis court, and savour delicious fare sure to fire up your tastebuds at Gourmet Restaurant and Oriental Restaurant or rehydrate at the Writer's Bar and Pool Bar.\n\nThen, when you're ready to explore, you can tear yourself away from the resort’s serene atmosphere and get a feel for Vietnamese culture by joining a bicycle tour into the countryside, cycling past rice paddies and coastal towns. Or, head into nearby Da Nang to sample the street food, nightlife and beautiful sandy beaches, scale the Marble Mountains - where you’ll be rewarded with panoramic views across the surrounding beaches - visit the striking Golden Bridge and fall in love with the magic and night markets of Hoi An.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Da Nang",
    "offer_geo_area_level_2": "Da Nang",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Vinpearl Luxury Da Nang",
    "offer_address": "No 7 Trường Sa, Street, Ngũ Hành Sơn, Đà Nẵng 550000, Vietnam",
    "percentage_discount": 44.0,
    "min_duration": 6,
    "max_duration": 14,
    "price": 1149.0,
    "value": 2043.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eMTY1QAO",
    "hero_image": "https://images.luxuryescapes.com/sq26c164vlzeaheapc8",
    "image_two": "https://images.luxuryescapes.com/2vkk3pcp7v2xeu26hfx",
    "image_three": "https://images.luxuryescapes.com/i5iy2zfcys083t9j1sg5",
    "vendor_name": "Vinpearl Luxury Da Nang",
    "title": "Vietnam Beachfront Luxury with Dining, Cocktails and Massages",
    "description": "Relax with a blissful beachfront escape at Vinpearl Luxury Da Nang, on the spectacular stretch of coast between Da Nang and the UNESCO World Heritage-listed town of Hoi An. Take advantage of a prime position on the pristine Non Nuoc Beach, and find true relaxation at the World Travel Awards' Leading Beach Resort in Vietnam for 2017. Includes daily buffet breakfast, a choice of three lunches or dinners, three cocktails each, one 60-minute massage per person and roundtrip airport shuttle transfers.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Đà Nẵng",
    "offer_geo_area_level_2": "Ngũ Hành Sơn",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Vinpearl Luxury Da Nang NOV2019",
    "offer_address": "No 7 Truong Sa Street Hoa Hai Ward Ngu Hanh Son Dist, Đà Nẵng, Vietnam",
    "percentage_discount": 50.0,
    "min_duration": 6,
    "max_duration": 8,
    "price": 1175.0,
    "value": 2330.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbpzCAAR",
    "hero_image": "https://images.luxuryescapes.com/esn8189hglw88585ui",
    "image_two": "https://images.luxuryescapes.com/sbmqt1rex0bcise8g2p",
    "image_three": "https://images.luxuryescapes.com/7nmxevp1ipt6lxhho92b",
    "vendor_name": "Shilla Monogram Quangnam Danang",
    "title": "Beachfront Opulence near Hoi An with Daily Breakfast, Nightly Dinner & Lounge Access",
    "description": "Experience historic beauty and modern opulence at Shilla Monogram Quangnam Danang - a beachfront resort gracefully located on the golden sands between Danang and the beautifully preserved historic town of Hoi An. Enjoy state-of-the-art facilities, including a tranquil bamboo forest garden, a soothing sauna and a lavish infinity pool with endless vistas over the horizon. Sink your toes into the soft sands of Non Nuoc Beach or treat your palate to locally sourced cuisine at the resort's sleek restaurant and bistro.\n\nTake a short taxi ride to the nearby UNESCO World Heritage-listed Hoi An Ancient Town and stroll along the streets browsing shops and chatting to locals to get a taste of local life. Choose a window seat in a quaint cafe and sip on a famously sweet Vietnamese coffee which is sure to keep you buzzing for more exploring. Find a bargain at the vibrant markets, treat yourself to a tailored suit or watch the lanterns light up the historic facades as the sun sets, before heading back to the resort for a nightcap at Bar M.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Quang Nam Province",
    "offer_geo_area_level_2": "Dien Ban",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Shilla Monogram Danang",
    "offer_address": "Lac Long Quan Street, Dien Ban Dong Ward, Danang City, Vietnam",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 629.0,
    "value": 1265.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JMyTIAW",
    "hero_image": "https://images.luxuryescapes.com/fp69scifbnq6f9mw7ne",
    "image_two": "https://images.luxuryescapes.com/61ejarp4cn0fydd7azj",
    "image_three": "https://images.luxuryescapes.com/xi31syst618xmwih0r9",
    "vendor_name": "Shilla Monogram Quangnam Danang",
    "title": "Beachfront Vietnam Retreat near Hoi An with Daily Breakfast, Daily Lunch or Dinner & Return Airport Transfers",
    "description": "Experience historic beauty and modern opulence at this beachfront resort, gracefully located on the golden sands between Danang and the UNESCO World Heritage-listed Hoi An Old Town. Enjoy state-of-the-art facilities, including a tranquil bamboo forest garden, soothing sauna and sprawling infinity pool with endless vistas over the horizon.\n\nSink your toes into the soft sand of Non Nuoc Beach, where you’ll have a front-row seat to golden sunrises, or treat your palate to locally sourced cuisine at one of the resort’s sleek restaurants, Dining M or Bistro M. Moments of luxury await at the Monogram Lounge, where low-slung chairs are perfect the spot for tropical tipples and canapes.\n\nWhen you’re ready to explore further, venture into the beautifully preserved historic town of Hoi An, just a 20-minute drive away. Stroll the iconic lantern-clad streets, sip famously sweet Vietnamese coffee at a quaint cafe or treat yourself to a tailored suit, before heading back to the resort for a nightcap at Bar M.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Quang Nam Province",
    "offer_geo_area_level_2": "Dien Ban",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Shilla Monogram Danang",
    "offer_address": "Lac Long Quan Street, Dien Ban Dong Ward, Danang City, Vietnam",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 869.0,
    "value": 2129.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mt2PAAQ",
    "hero_image": "https://images.luxuryescapes.com/73r3r9v6rtqb5nuf66o",
    "image_two": "https://images.luxuryescapes.com/0lgwi5wnyn9bl99ue2m",
    "image_three": "https://images.luxuryescapes.com/ea39e7eqbjjk3j8lphb",
    "vendor_name": "Shilla Monogram Quangnam Danang",
    "title": "Vietnam Five-Star Beachfront Luxury near Hội An with Daily Breakfast & Daily Lunch or Dinner",
    "description": "Experience historic beauty and modern opulence at the ultra-luxe Shilla Monogram Quangnam Danang, a dazzling beachfront resort gracefully located on the golden sands between Danang and the beautifully preserved historic town of Hội An. Nestled among swaying palms and perfectly manicured gardens, Shilla Monogram Quangnam Danang is a modern retreat that prides itself on traditional hospitality. Enjoy state-of-the-art facilities, including a tranquil bamboo forest garden, soothing sauna and lavish infinity pool with endless horizon vistas. Let the warm sea breeze brush your cheeks from the sanctuary of a poolside cabana or treat your body and mind to a rejuvenating floating yoga class. Sink your toes into the soft sands of Ha My Beach or treat your palate to locally sourced cuisine at the resort's sleek restaurant and bistro.\n\nTake a short taxi ride to the nearby UNESCO World Heritage-listed Hội An Old Town and stroll along streets lined with colourful lanterns. Choose a window seat in a quaint café and sip a famously sweet Vietnamese coffee as you watch traditional wooden boats float peacefully along the river. Find a bargain at the vibrant markets, treat yourself to a tailored suit or watch the lanterns light up historic façades as the sun sets.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Quang Nam Province",
    "offer_geo_area_level_2": "Dien Ban",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Shilla Monogram Danang",
    "offer_address": "Lac Long Quan Street, Dien Ban Dong Ward, Danang City, Vietnam",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 535.0,
    "value": 1054.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt7vAAB",
    "hero_image": "https://images.luxuryescapes.com/u6m8vzofrshcravah7ub",
    "image_two": "https://images.luxuryescapes.com/hch7jvbb9h3qqm60wqhl",
    "image_three": "https://images.luxuryescapes.com/1rvlr655ffiqiqazmhx",
    "vendor_name": "Intercontinental Danang Sun Peninsula Resort",
    "title": "Five-Star Vietnam Beachfront Bliss near Da Nang",
    "description": "Recharge your imagination with a luxe stay at the InterContinental Danang Sun Peninsula Resort - a spectacular beachfront haven on the central coast of Vietnam. Soak up every moment of bliss from this beachfront haven wrapped by jungle greenery, and enjoy direct beach access, plunge into one of three pools, release tension at the lavish spa, enliven your senses at five restaurants and bars, or relax in your accommodation, offering striking designs calmed by fresh breezes and secluded in nature.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Da Nang",
    "offer_geo_area_level_2": "Da Nang",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "InterContinental Danang Sun Peninsula Resort",
    "offer_address": "Bai Bac, SonTra Peninsula, Danang, 550000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 367.0,
    "value": 367.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQJZuAAP",
    "hero_image": "https://images.luxuryescapes.com/pw6iz49e52ylzbl12yk",
    "image_two": "https://images.luxuryescapes.com/2i30ev1ap3ka9n2wbf",
    "image_three": "https://images.luxuryescapes.com/b6bn19ah8kvhw58qdnsh",
    "vendor_name": "Crowne Plaza Danang",
    "title": "Refined Danang Beachside Break",
    "description": "A stone's throw from Danang Beach, Crowne Plaza Danang, an IHG Hotel, offers a beachside retreat without leaving the vibrant streets of the city. Start your day by invigorating your body and mind at the fitness centre or with a treatment at the spa. Kick back with a relaxing day at the beach or refresh yourself in crystal-clear swimming pools with ocean views. Embark on a culinary adventure at the many restaurants nearby or savour Cantonese cuisine at the onsite restaurant.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Da Nang",
    "offer_geo_area_level_2": "Da Nang",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Crowne Plaza Danang, an IHG Hotel",
    "offer_address": "8 Vo Nguyen Giap Street, Khue My Ward, Danang City, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 152.0,
    "value": 152.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2w1IAC",
    "hero_image": "https://images.luxuryescapes.com/erbmey0ulpdnkswl9am",
    "image_two": "https://images.luxuryescapes.com/v18qg71tqg9pcyw5du5e",
    "image_three": "https://images.luxuryescapes.com/snlbq4pwo1vsu40suz",
    "vendor_name": "Grand Mercure  Danang",
    "title": "Stylish Danang Green Island Stay with Four Onsite Restaurants & Spa",
    "description": "Decode Vietnamese wonders with a stay at this gorgeous property, on Danang's Green Island. Locally-inspired decor and welcome traditions make you smile as you are led to your luxurious rooms. Dining is an absolute delight with a multitude of gourmet outlets onsite, including authentic Cantonese at the Golden Dragon and local classics at Veranda Vietnamese.\n\nTake a refreshing dip in the outdoor pool or maintain your fitness routine at the state-of-the-art gym. The Karma Spa is always ready to offer relaxation in the form of therapies and massages and the kids' lounge takes pride in keeping the future generation entertained with toys, movies and more.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Da Nang",
    "offer_geo_area_level_2": "Da Nang",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Grand Mercure Danang",
    "offer_address": "Lot A1 Zone of the Villas of Green Island, Hoa Cuong Bac, Hai Chau District, Danang 84511, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 52.0,
    "value": 52.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004URGWAA4",
    "hero_image": "https://images.luxuryescapes.com/ysxps05hygai11hhrv5t",
    "image_two": "https://images.luxuryescapes.com/crl6b8falp95iu60ls",
    "image_three": "https://images.luxuryescapes.com/0nc72xt35hqwx13y00n",
    "vendor_name": "Banyan Tree Lang Co",
    "title": "Vietnam Five-Star Banyan Tree Beachfront Private Pool Suites",
    "description": "Gaze across sapphire-blue waters and lush green mountains while absorbing the soothing jungle atmosphere at the five-star Banyan Tree Lang Co - a luxurious haven nestled within the Truong Son mountain range. Begin your day by plunging into your private pool before sampling delicious cuisine at the onsite restaurants and bars. Relax in your serene private paradise, hit the sleek fitness centre, or visit the expansive spa.\n\nThere’s also an array of resort activities, including watersports, yoga sessions, handicrafts and cooking classes. If you can drag yourself away from this ultra-luxe paradise, end your day with a visit to the Marble Mountains for spectacular sunset views.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Thua Thien-Hue Province",
    "offer_geo_area_level_2": "Phu Loc",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Banyan Tree Lang Co",
    "offer_address": "Cu Du Village, Loc Vinh Commune, Phú Lộc District, Thừa Thiên Huế 530000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 299.0,
    "value": 299.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcgfJAAR",
    "hero_image": "https://images.luxuryescapes.com/faoch9owkvybzk7umq2f",
    "image_two": "https://images.luxuryescapes.com/cuzk7fofwv9om6h3mmq8",
    "image_three": "https://images.luxuryescapes.com/gas1uoojveucbw0msa2",
    "vendor_name": "Shilla Monogram Quangnam Danang",
    "title": "Vietnam Five-Star Beachfront Stay near Hội An with Dreamy Infinity Pool",
    "description": "Discover a palm-fringed oasis at the luxurious Shilla Monogram Danang, a dazzling beachfront resort located on the golden sands between Danang and the historic town of Hội An, Vietnam. This elegant retreat flaunts state-of-the-art facilities like a tranquil bamboo forest garden, lavish infinity pool and floating yoga classes. Sink your toes into the soft sands of Ha My Beach or treat your tastebuds to locally sourced cuisine at the resort's restaurant and bistro.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Quang Nam Province",
    "offer_geo_area_level_2": "Dien Ban",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Shilla Monogram Danang",
    "offer_address": "Lac Long Quan Street, Dien Ban Dong Ward, Danang City, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 100.0,
    "value": 100.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlvwIAC",
    "hero_image": "https://images.luxuryescapes.com/3bdgmz4rmbs8f59ko6s",
    "image_two": "https://images.luxuryescapes.com/spm0shk7kmurq80t9uq",
    "image_three": "https://images.luxuryescapes.com/eq1y70rruxeyndl3o7h",
    "vendor_name": "Pullman Danang Beach Resort",
    "title": "Beachfront Danang Pullman Luxury with Onsite Restaurants & Spa",
    "description": "With an enviable location on the pristine white sands of Bac My An Beach, Pullman Danang Beach Resort is an oasis in Central Vietnam. Perfect for a peaceful couples’ getaway or a holiday with the kids, you’ll find there’s something for everyone at Pullman Da Nang.\n\nWith superb restaurants, a tranquil spa, an excellent pool, top-class hospitality and easy access to Hoi An’s famous Old Town, you’ll be able to relax and unwind in style during your time in Danang.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Da Nang",
    "offer_geo_area_level_2": "Da Nang",
    "location_heading": "Danang",
    "location_subheading": "Vietnam",
    "location_description": "Pullman Danang Beach Resort",
    "offer_address": "101 Vo Nguyen Giap Street, Khue My Ward, Ngu Hanh Son District, 550000 Danang, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 121.0,
    "value": 121.0
  }
]