[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004hbhjAAA",
    "hero_image": "https://images.luxuryescapes.com/wuvq0s9dsx0acnahevvd",
    "image_two": "https://images.luxuryescapes.com/avrwsk29ji2g97ufxaj",
    "image_three": "https://images.luxuryescapes.com/hdkaar0rebvik8ix51g",
    "vendor_name": "Haveli Dharampura",
    "title": "Old Delhi Heritage Mansion Stay with Room Upgrade, Decadent Dining & One Child Stays Free",
    "description": "Step back in time at Haveli Dharampura, a 19th-century refurbished haveli tucked away in the crowded lanes of Old Delhi. Representing the architectural glory of the Mughal era, this old-world mansion is now a three-storey boutique property with heart-warming accommodation, delicious dining and modern luxuries. Offering unmatched views of the iconic attractions of Old Delhi, including Jama Masjid and the Red Fort, the UNESCO-awarded Haveli Dharampura is a unique launchpad for those looking to discover the many charms of India's capital.\n\n**Your handpicked inclusions:**\n\n- Complimentary upgrade from a Jharoka Room to a Diwan-e-Khas Room\n- Begin every day with set-menu breakfast at Lakhori\n- Enjoy one set-menu dinner during your stay at Lakhori\n- Be welcomed with a refreshing drink on arrival\n- Enjoy a fun kite-flying session per stay (subject to weather conditions)\n- Make the most of your stay with a 10% discount on soft drinks and dining\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** One child (aged five years and under) stays free on existing bedding with breakfast included.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "National Capital Territory of Delhi",
    "offer_geo_area_level_2": "New Delhi",
    "location_heading": "Delhi",
    "location_subheading": "India",
    "location_description": "Haveli Dharampura",
    "offer_address": "2293, Dharampura, Gali Gulian, Jama Masjid, Chandni Chowk, Old Delhi, 110006",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 158.0,
    "value": 482.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UveVlQAJ",
    "hero_image": "https://images.luxuryescapes.com/yjjqkmiiijwkogqrlgkh",
    "image_two": "https://images.luxuryescapes.com/s7sr5y4w2nklhtux39rg",
    "image_three": "https://images.luxuryescapes.com/ukmilmrogwko89r4kjko",
    "vendor_name": "Abyss Tours",
    "title": "Four-Day Private Tour of Delhi & Agra",
    "description": "Discover the colourful markets, ancient monuments, grand palaces (including the Taj Mahal) and the bustling street food markets of India’s most vibrant cities on a four-day private tour of Delhi and Agra. Depart on any day you want and stay in five-star luxury at the Hotel Crowne Plaza Rohini (or similar) enjoying daily breakfast, one complimentary dinner, private sightseeing tours, private air-conditioned transportation, return airport transfers and more for two.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Delhi",
    "offer_geo_area_level_2": "North West Delhi",
    "location_heading": "Delhi",
    "location_subheading": "India",
    "location_description": "India Tour OLD",
    "offer_address": "Twin District Centre, Sector 10, Rohini, New Delhi, Delhi 110085, India",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 3,
    "price": 371.0,
    "value": 861.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DPgxAAG",
    "hero_image": "https://images.luxuryescapes.com/2mbfcspvnag20nhtxaw5",
    "image_two": "https://images.luxuryescapes.com/00j8rbu3bg1mp1nbndjk",
    "image_three": "https://images.luxuryescapes.com/tqrhohv3wfgnvgj5h1m7",
    "vendor_name": "The Leela Ambience Convention Hotel Delhi",
    "title": "New Delhi Five-Star Stay within One of India's Largest Convention Centres",
    "description": "Flaunting five-star elegance and a spectacular location in the heart of Delhi, The Leela Ambience Convention Hotel Delhi is the city oasis you've been searching for. Discover the colourful markets, ancient monuments and bustling culinary scene of India's vibrant capital at this sophisticated refuge, and when business calls, you'll find yourself with easy access to one of India’s largest convention facilities, Mahatma Mandir Convention and Exhibition Centre. Within the sprawling hotel, you will find a long list of stunning facilities, including exquisite onsite eateries such as Jamavar for authentic Indian fare, Le Cirque for flavoursome Italian dishes and Megu for Japanese-inspired fine dining. You'll also find a rejuvenating spa, a mesmerising infinity pool, and a state-of-the-art fitness centre.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "National Capital Territory of Delhi",
    "offer_geo_area_level_2": "New Delhi",
    "location_heading": "Delhi",
    "location_subheading": "India",
    "location_description": "The Leela Ambience Convention Hotel Delhi",
    "offer_address": "Vishwas Nagar Extension, Vishwas Nagar, Shahdara, Delhi, 110032",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 133.0,
    "value": 133.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id0hKAAR",
    "hero_image": "https://images.luxuryescapes.com/m7pri9n4m7t8bhsnj24",
    "image_two": "https://images.luxuryescapes.com/8zh36629ecgzimvwql6nl",
    "image_three": "https://images.luxuryescapes.com/sqpigqkwjjuc1pulgg0g",
    "vendor_name": "Maidens Hotel New Delhi",
    "title": "Iconic Heritage Oberoi Escape in the Heart of Delhi with Tranquil Pool & Two Onsite Restaurants",
    "description": "Experience the grandeur of colonial India and soak up the old-world European charms in this five-star heritage abode, perfectly situated in the prime centre of the capital city. Majestic to behold with a pearl-white facade, stunning architecture, jade-green blooming lawns and spacious rooms and suites, immerse yourself in the rich luxury of this century-old property, a part of the Oberoi Hotel Group. Go for a refreshing dip in the pool and sample a fusion of local and international cuisine at the two onsite restaurants. For a taste of culture and history, visit the imposing India Gate and the bustling market of Chandni Chowk.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "National Capital Territory of Delhi",
    "offer_geo_area_level_2": "New Delhi",
    "location_heading": "Delhi",
    "location_subheading": "India",
    "location_description": "Maidens Hotel",
    "offer_address": "7, Sham Nath Marg, Prema Kunj, Civil Lines, Delhi, 110054, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 83.0,
    "value": 83.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DPafAAG",
    "hero_image": "https://images.luxuryescapes.com/ushwgy66qqib2n5h0hcjk",
    "image_two": "https://images.luxuryescapes.com/fxty2035eu88blplnkl",
    "image_three": "https://images.luxuryescapes.com/1td8eb01payrat82srus",
    "vendor_name": "The Leela Palace New Delhi",
    "title": "Five-Star New Delhi City Opulence in the Diplomatic Quarter",
    "description": "Maharaja majesty awaits with a five-star stay at The Leela Palace New Delhi, an iconic symbol of ultra-opulence rising high above Chanakyapuri, the capital’s leafy diplomatic quarter. A modern-day palace brilliantly drawing on the signature style of nearby Lutyens' Delhi, the hotel also doubles as a world-class gallery, its traditional and contemporary art collection celebrated by guests and visitors alike. Dine at six world-class restaurants and bars - including Japanese fine dining at Megu and classic cocktails at The Library Bar - and savour moments spent lazing by the breathtaking rooftop infinity pool, indulging in ayurvedic treatments at The Spa or witnessing a traditional twilight ceremony in the inner courtyard.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "National Capital Territory of Delhi",
    "offer_geo_area_level_2": "New Delhi",
    "location_heading": "Delhi",
    "location_subheading": "India",
    "location_description": "The Leela Palace New Delhi",
    "offer_address": "Diplomatic Enclave, Chanakyapuri, New Delhi 110023, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 182.0,
    "value": 182.0
  }
]