[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006Q3shAAC",
    "hero_image": "https://images.luxuryescapes.com/vvtmavtm4hgfc3c8tyc3",
    "image_two": "https://images.luxuryescapes.com/b4of17k6zo7nxsrp8d",
    "image_three": "https://images.luxuryescapes.com/ucis45y6i7ydghu1dthb",
    "vendor_name": "Kandima Maldives",
    "title": "Five-Star Maldives Overwater Villa Luxury with All-Inclusive Dining, Unlimited Cocktails & Roundtrip Malé Transfers",
    "description": "Could this be the coolest resort in the Maldives? With a carnival of exciting events from live DJs to Latin nights, a stylish beach club complete with futuristic ocean cabanas, and its very own art studio, the luxuriously fun Kandima Maldives has thought of it all. Boasting a picture-perfect setting, this energetic sanctuary runs deeper than its breathtaking surface - harnessing incredible energy that embraces you from the moment you arrive. Consider this an unspoken invitation to curate your own paradise through myriad activities, exquisite dining and first-class facilities.\n\nHead to Breeze Bar, where funky tunes reverberate through one of the longest outdoor pools in the Maldives or stroll out along the Beach Club boardwalk with a cocktail in hand, then watch the sunset from a unique UFO-style cabana. Hop onboard the shuttle to Kandima's exclusive snorkelling pontoon and plunge into the azure waters to explore the impressive house reef, or simply sink your toes into three kilometres of uninhabited shoreline and watch pods of resident dolphins play in the waves. At Kandima Maldives, you'll be spoilt for choice with an array of dining delights - pamper your palate with a buffet of exceptional cuisine at the resort's two main restaurants, Flavour and Zest, or take your tastebuds on an epicurean adventure at the resort's three exclusive à la carte eateries.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Kandima Island",
    "location_heading": "Dhaalu Atoll",
    "location_subheading": "Maldives",
    "location_description": "Kandima Maldives OLD",
    "offer_address": "Kandima Dhaalu Atoll 123400 Maldives",
    "percentage_discount": 34.0,
    "min_duration": 5,
    "max_duration": 30,
    "price": 3749.0,
    "value": 5652.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GBVuAAO",
    "hero_image": "https://images.luxuryescapes.com/mi0e3mx8hzavf5yh4o0x",
    "image_two": "https://images.luxuryescapes.com/pgyhw79k4egdtjbks71g",
    "image_three": "https://images.luxuryescapes.com/l03h5kqrsq1ntl5uysj",
    "vendor_name": "Kandima Maldives",
    "title": "Five-Star Maldives Resort Luxury with Roundtrip Malé Transfers, Daily Dining & Cocktails",
    "description": "Could this be the coolest resort in the Maldives? With a carnival of exciting events from live DJs to Latin nights, a stylish beach club complete with futuristic ocean cabanas, and its very own art studio, the luxuriously fun Kandima Maldives has thought of it all. Boasting a picture-perfect setting, this energetic sanctuary runs deeper than its breathtaking surface - harnessing incredible energy that embraces you from the moment you arrive. Consider this an unspoken invitation to curate your own paradise through myriad activities, exquisite dining and first-class facilities. \n\nHead to Breeze Bar, where funky tunes reverberate through one of the longest pools in the Maldives or stroll out along the Beach Club boardwalk with a cocktail in hand, then watch the sunset from a unique UFO-style cabana. Hop onboard the shuttle to Kandima's exclusive snorkelling pontoon and plunge into the azure waters to explore the impressive house reef, or simply sink your toes into three kilometres of uninhabited shoreline and watch pods of resident dolphins play in the waves. At Kandima, you'll be spoilt for choice with an array of dining delights - pamper your palate with a buffet of exceptional cuisine at the resort's two main restaurants, Flavour and Zest, or take your tastebuds on an epicurean adventure at the resort's three exclusive à la carte eateries.\n\n**Your handpicked inclusions:**\n\n- Relax with roundtrip domestic flights and boat transfers from Malé to the resort\n- Toast your escape with a daily sunset cocktail per person at Breeze Pool Bar or Beach Club\n- Enjoy daily breakfast and dinner at Flavour or Zest, and indulge in a rotating global buffet with live cooking stations, free-flow soft drinks, tea and coffee\n- Treat yourself to a 20% dining discount at three à la carte restaurants: Azure, Smoked and Seadragon\n- Feel refreshed on arrival with a welcome fruit juice served at HQ\n- Stay entertained with Kids Club activities, fitness classes, beach games, unlimited gym and hydro pool access, and complimentary use of tennis, badminton, volleyball courts and more\n- Make lasting memories with a one-time 30-minute photoshoot from SNAP studio\n- Explore the underwater world that inhabits Kandima's impressive house reef with frequent shuttles to an exclusive snorkelling platform\n- Choose your check-in time, then check out at the same hour (e.g. 2pm check-in / 2pm checkout)\n\n**Travelling with family?** Up to two children (aged 11 years and under) stay, play and eat for free (half-board only, surcharge applies for all-inclusive) with complimentary access to Kandiland - the Maldives' largest Kids Club.\n\n**All-Inclusive Upgrade:** Enjoy daily breakfast, lunch and dinner across five restaurants (two buffet and three à la carte) as well as unlimited alcoholic and non-alcoholic drinks when you choose an all-inclusive upgrade. Plus, you'll receive complimentary access to non-motorised watersports, including kayaks, paddleboards and windsurfing equipment.\n\n**100% Refund Guarantee:** Book your escape with peace of mind thanks to our 100% Refund Guarantee, offering flexible date changes or a full refund up until 21 days before check-in. Refund is on accommodation only, excludes flights. See the Fine Print for details.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Kandima Island",
    "location_heading": "Dhaalu Atoll",
    "location_subheading": "Maldives",
    "location_description": "Kandima Maldives OLD",
    "offer_address": "Kandima Dhaalu Atoll 123400 Maldives",
    "percentage_discount": 43.0,
    "min_duration": 5,
    "max_duration": 30,
    "price": 1999.0,
    "value": 3520.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070XTVAA2",
    "hero_image": "https://images.luxuryescapes.com/6w1si2nd8n0wmxk6s3f",
    "image_two": "https://images.luxuryescapes.com/zpmza0xe8rerx2caexuh",
    "image_three": "https://images.luxuryescapes.com/7fnh9zi41ycz3kngf0dp",
    "vendor_name": "Kandima Maldives",
    "title": "Five-Star Ultra-Cool Maldives Luxury with Daily Breakfast, Daily Dinner & Roundtrip Malé Transfers",
    "description": "Could this be the coolest resort in the Maldives? With a carnival of exciting events, from live DJs to Latin nights, a stylish beach club complete with futuristic ocean cabanas, and its very own art studio, the luxuriously fun Kandima Maldives has thought of it all. Boasting a picture-perfect setting, this energetic sanctuary runs deeper than its breathtaking surface - harnessing incredible energy that embraces you from the moment you arrive. Consider this an unspoken invitation to curate your own paradise through myriad activities, exquisite dining and first-class facilities.\n\nHead to Breeze Bar, where funky tunes reverberate through one of the longest outdoor pools in the Maldives, or stroll out along the Beach Club boardwalk with a cocktail in hand, then watch the sunset from a unique UFO-style cabana. Hop onboard the shuttle to Kandima's exclusive snorkelling pontoon and plunge into the azure waters to explore the impressive house reef, or simply sink your toes into three kilometres of uninhabited shoreline and watch pods of resident dolphins play in the waves. At Kandima Maldives, you'll be spoilt for choice with an array of dining delights - pamper your palate with a buffet of exceptional cuisine at the resort's two main restaurants, Flavour and Zest, or take your tastebuds on an epicurean adventure at the resort's three exclusive à la carte eateries.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Kandima Island",
    "location_heading": "Dhaalu Atoll",
    "location_subheading": "Maldives",
    "location_description": "Kandima Maldives",
    "offer_address": "Kandima Dhaalu Atoll, 123400 Maldives",
    "percentage_discount": 27.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 1819.0,
    "value": 2506.0
  }
]