[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004hbSUAAY",
    "hero_image": "https://images.luxuryescapes.com/ie2dxk1umoxmsovb7d",
    "image_two": "https://images.luxuryescapes.com/2npwx5twtkt7d6pcxmdr",
    "image_three": "https://images.luxuryescapes.com/26bp99ayme5ndab3lxdm",
    "vendor_name": "Hideaway Beach Resort Maldives",
    "title": "Maldives Five-Star Private Island Villas with Daily Dining, Nightly Drinks, Roundtrip Domestic Flights & Speedboat Transfers",
    "description": "Escape the everyday and embrace pure paradise at Hideaway Beach Resort & Spa, located on a secluded private island in the Maldives. This is five-star bliss at its very finest - from vast villas with your own slice of private beachfront and personal butler to exquisite dining across four restaurants and bars with free-flow wine, French champagne and beer served nightly. Two beautiful infinity pools beckon, while the sparkling lagoon is never more than a few steps away. Explore the colourful underwater world that awaits with scuba diving, snorkelling and myriad excursions, from dolphin spotting to swimming with turtles and semi-submarine adventures. \n\nRetreat to Hideaway Spa for precious moments of me-time, allowing highly skilled therapists to pamper you with Ayurvedic treatments using Natura Bissé products. Whether you're honeymooning, travelling with family or simply seeking a quiet reprieve - Hideaway Beach Resort & Spa provides moments of quintessential Maldivian bliss, where days spent among nature melt into evenings of gourmet dining and complete relaxation.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Dhonakulhi",
    "location_heading": "Dhonakulhi Island",
    "location_subheading": "Maldives",
    "location_description": "Hideaway Beach Resort & Spa Sep 21",
    "offer_address": "Dhonakulhi Island Haa Alifu Atoll, 99999, Maldives",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 2699.0,
    "value": 5490.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AaYmlAAF",
    "hero_image": "https://images.luxuryescapes.com/gobwn6bhv8771imjq6nl",
    "image_two": "https://images.luxuryescapes.com/2u78rm5wfmfhhyj0fwcr",
    "image_three": "https://images.luxuryescapes.com/5w0d5tj5vcs7tc3dq",
    "vendor_name": "Hideaway Beach Resort Maldives",
    "title": "Maldives Five-Star Private Island Villas with Daily Dining, Nightly Drinks & Roundtrip Malé Transfers",
    "description": "Escape the everyday and embrace pure paradise at Hideaway Beach Resort & Spa, located on a secluded private island in the Maldives. This is five-star bliss at its very finest - from vast villas with your own slice of private beachfront, to a personal butler and five exquisite restaurants and bars serving fresh seafood, cocktails and one of the largest whisky and fine champagne collections in the Maldives. Two beautiful infinity pools beckon, while the sparkling lagoon is never more than a few steps away. Explore the colourful underwater world that awaits with scuba diving, snorkelling and myriad excursions, like dolphin spotting and swimming with turtles.\n\nRetreat to Hideaway Spa for precious moments of me-time, allowing highly skilled therapists to pamper you with Ayurvedic treatments using Natura Bissé products. Whether you're honeymooning, travelling with family or simply seeking a quiet reprieve - Hideaway Beach Resort & Spa provides moments of quintessential Maldivian bliss, where days spent among nature melt into evenings of gourmet dining and complete relaxation.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Dhonakulhi",
    "location_heading": "Dhonakulhi Island",
    "location_subheading": "Maldives",
    "location_description": "Hideaway Beach Resort & Spa",
    "offer_address": "Dhonakulhi Island, Haa Alifu Atoll, 99999, Maldives",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 30,
    "price": 3464.0,
    "value": 6692.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HrrsPYAR",
    "hero_image": "https://images.luxuryescapes.com/6lt92cg29q3ipduzbnpv",
    "image_two": "https://images.luxuryescapes.com/10469lo8vbgqvaf579",
    "image_three": "https://images.luxuryescapes.com/3k4yvszcn8haxe7qau8t",
    "vendor_name": "Hideaway Beach Resort Maldives",
    "title": "Maldives Paradise with Daily Breakfast, Nightly Dinner, Reef Excursions & Roundtrip Domestic Transfers",
    "description": "Embrace pure paradise at one of the Maldives' most spectacular private island resorts. This remote, jungle-clad island is an emerald drop in the ocean with some of the most generous overwater villas and best snorkelling in the Maldives.\n\nThis resort was declared the Maldives’ Leading Honeymoon Resort at the World Travel Awards 2024 for good reason: from the privacy of the villas to overwater dining by candlelight, the island is romance incarnate. Sunset dolphin cruises and turtle snorkelling: every experience is a once-in-a-lifetime opportunity.\n\nWant for nothing with a personal butler service, and five restaurants and bars serving fresh seafood, cocktails and one of the largest whisky and fine champagne collections in the Maldives. Spend blissful days relaxing beside the two infinity pools that melt into the horizon and paddling in the crystal-clear lagoon.\n\nThere’s plenty to do here should you choose, with a Professional Association of Diving Instructors (PADI)-certified dive centre, sports and golf centre, as well as a spa inspired by Ayurvedic techniques. Whether you're honeymooning, travelling with family or simply seeking a quiet reprieve, this exceptional hideaway will welcome you like family and leave a mark on your heart.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Dhonakulhi",
    "location_heading": "Dhonakulhi Island",
    "location_subheading": "Maldives",
    "location_description": "Hideaway Beach Resort & Spa",
    "offer_address": "Dhonakulhi Island, Haa Alifu Atoll, 99999, Maldives",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 2799.0,
    "value": 7054.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbJGdAAN",
    "hero_image": "https://images.luxuryescapes.com/ed5atjte2dcnl62stao",
    "image_two": "https://images.luxuryescapes.com/lvq0s66m73fr4pa2fwd",
    "image_three": "https://images.luxuryescapes.com/imauwv6w7o46dz09kq0g",
    "vendor_name": "Hideaway Beach Resort Maldives",
    "title": "Maldives Five-Star Private Island Villas with All-Inclusive Dining, Unlimited Free-Flow Drinks & Roundtrip Malé Transfers",
    "description": "You're invited to discover our best-ever Hideaway Beach Resort & Spa offer - escape the every day and embrace pure paradise at one of the Maldives' most spectacular private island paradises. This is five-star bliss at its very finest - from vast villas with your slice of private beachfront to a personal butler and five exquisite restaurants and bars serving fresh seafood, cocktails and one of the largest whisky and fine champagne collections in the Maldives. Two beautiful infinity pools beckon, while the sparkling lagoon is never more than a few steps away.\n\nExplore the colourful underwater world that awaits - the resort boasts a PADI-certified dive centre and a guided snorkel and dolphin cruise are both included in your package. Then, retreat to Hideaway Spa for precious moments of me-time, allowing highly skilled therapists to pamper you with Ayurvedic treatments using Natura Bissé products. Whether you're honeymooning, travelling with family or simply seeking a quiet reprieve - Hideaway Beach Resort & Spa provides moments of quintessential Maldivian bliss, where days spent among nature melt into evenings of gourmet dining and complete relaxation.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Dhonakulhi",
    "location_heading": "Dhonakulhi Island",
    "location_subheading": "Maldives",
    "location_description": "Hideaway Beach Resort & Spa",
    "offer_address": "Dhonakulhi Island, Haa Alifu Atoll, 99999, Maldives",
    "percentage_discount": 59.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 3899.0,
    "value": 9453.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IeD6pAAF",
    "hero_image": "https://images.luxuryescapes.com/3qwr53860xm4plsj3bd8",
    "image_two": "https://images.luxuryescapes.com/78r2x9nghbyllrwhon43",
    "image_three": "https://images.luxuryescapes.com/r8eh4w0125k1fq7j5p2bf",
    "vendor_name": "Hideaway Beach Resort Maldives",
    "title": "Maldives Private Island Villas with All-Inclusive Dining, Unlimited Free-Flow Drinks & Roundtrip Domestic Malé Transfers",
    "description": "Embrace pure paradise at one of the Maldives' most spectacular private island resorts. This remote, jungle-clad island is an emerald drop in the ocean, with some of the most generously spaced overwater villas and best snorkelling in the Maldives. It was declared the Maldives’ Leading Honeymoon Resort in the World Travel Awards 2023 for good reason: from the privacy of the villas, to overwater dining by candlelight, this fairy-light-lit island is romance incarnate. Sunset dolphin cruises, turtle snorkelling or a castaway picnic on a sandbank: every experience is once-in-a-lifetime.\n\nWant for nothing for personal butler service and five restaurants and bars serving fresh seafood, cocktails and one of the largest whisky and fine champagne collections in the Maldives. Spend blissful days relaxing beside the infinity pool that melts into the horizon and paddling in the crystal-clear lagoon. There’s plenty to do here should you choose, with a PADI certified dive centre, sports and golf centre and a spa inspired by Indian Ayurvedic techniques. Whether you're honeymooning, travelling with family or simply seeking a quiet reprieve, Hideaway Beach Resort & Spa will welcome you like family and leave a mark on your heart.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Dhonakulhi",
    "location_heading": "Dhonakulhi Island",
    "location_subheading": "Maldives",
    "location_description": "Hideaway Beach Resort & Spa",
    "offer_address": "Dhonakulhi Island, Haa Alifu Atoll, 99999, Maldives",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 3899.0,
    "value": 9675.0
  }
]