[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ab1MVAAZ",
    "hero_image": "https://images.luxuryescapes.com/ltprz37x0bbo5wiptzbr",
    "image_two": "https://images.luxuryescapes.com/lvocf6lammxorlu3qw9",
    "image_three": "https://images.luxuryescapes.com/yfeeqklns7oyqz8khcid",
    "vendor_name": "Dolphin Island Fiji - Private Island",
    "title": "Exclusive Fiji Private Island Retreat with All-Inclusive Dining, Free-Flow Drinks & Roundtrip Transfers",
    "description": "Intimate Fiji seclusion is taken to new heights at Dolphin Island, a one-of-a-kind private island oasis just 20-minutes from Viti Levu by boat, where you can truly escape from the world. Be it a romantic stay for two, or a secluded escape with a few of your friends or family, this beautiful island is all yours for exclusive use. Wake up each morning to the sound of palm trees rustling on the golden shores and turquoise waters, then savour authentic Fijian flavours with all-inclusive dining tailored to whatever your heart desires or take a dip in the tranquil infinity pool - the perfect spot for unlimited poolside cocktails - all while deepening your connection to nature.\n\nElevate your stay with a romantic night in the rustic candlelit hilltop bure, or rejuvenate your body with a tranquil massage and facial treatment. Glide through crystal clear waters on a kayaking, snorkelling or paddleboarding adventure or immerse yourself in Fijian culture with traditional performances and ceremonies (surcharges apply). With direct access to beautiful dive sites and secluded fishing spots, the island offers everything you could possibly want in a remote, tropical paradise.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Nananu-i-Ra",
    "location_heading": "Dolphin Island",
    "location_subheading": "Fiji",
    "location_description": "Dolphin Island",
    "offer_address": "M6WG+2X3, Ellington Wharf, Fiji",
    "percentage_discount": 19.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 11101.0,
    "value": 13759.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C3R80AAF",
    "hero_image": "https://images.luxuryescapes.com/agatmwzsduaiba3mttk",
    "image_two": "https://images.luxuryescapes.com/11hfik360c2zmzwz2784",
    "image_three": "https://images.luxuryescapes.com/mslxv5j02cml2ajvkbn",
    "vendor_name": "Dolphin Island Fiji - Private Island",
    "title": "Exclusive Five-Star Fiji Private Island Retreat with All-Inclusive Dining, Free-Flow Drinks & Roundtrip Transfers",
    "description": "Intimate Fiji seclusion is taken to new heights at Dolphin Island, a one-of-a-kind five-star private island oasis, where you can truly escape from the world. Awarded a prestigious Forbes Travel Guide Five-Star Award in 2023, this beautiful island is all yours for exclusive use - be it a romantic stay for two, or a secluded escape with a few of your friends or family. Wake up each morning to the sound of palm trees rustling on the golden shores and turquoise waters, then savour authentic Fijian flavours with all-inclusive dining tailored to whatever your heart desires or take a dip in the tranquil infinity pool - the perfect spot for unlimited poolside cocktails - all while deepening your connection to nature.\n\nElevate your stay with a romantic night in the rustic candlelit hilltop bure, or rejuvenate your body with a tranquil massage and facial treatment. Glide through crystal clear waters on a kayaking, snorkelling or paddleboarding adventure or immerse yourself in Fijian culture with traditional performances and ceremonies (surcharges apply). With direct access to beautiful dive sites and secluded fishing spots, the island offers everything you could possibly want in a remote, tropical paradise.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Nananu-i-Ra",
    "location_heading": "Dolphin Island",
    "location_subheading": "Fiji",
    "location_description": "Dolphin Island",
    "offer_address": "M6WG+2X3, Ellington Wharf, Fiji",
    "percentage_discount": 40.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 7739.0,
    "value": 12897.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMWuEAAX",
    "hero_image": "https://images.luxuryescapes.com/67lfbt4ra7cj5rugbzkg",
    "image_two": "https://images.luxuryescapes.com/3gc0c5wq4rqjqsm4v8o",
    "image_three": "https://images.luxuryescapes.com/gd8os8xekxxy2a0ml1i",
    "vendor_name": "Dolphin Island Fiji - Private Island",
    "title": "Exclusive Five-Star Fiji Private Island Retreat with All-Inclusive Dining, Free-Flow Drinks & Return Transfers",
    "description": "Intimate Fiji seclusion is taken to new heights at this one-of-a-kind five-star private island oasis, where you can truly escape from the world. Awarded a prestigious Forbes Travel Guide Five-Star Award in 2023, the beautiful Dolphin Island is all yours for exclusive use - be it a romantic stay for two, or a secluded escape with a few of your friends or family. Wake up each morning to the sound of palm trees rustling on the golden shores and turquoise waters, then savour authentic Fijian flavours with all-inclusive dining tailored to whatever your heart desires or take a dip in the tranquil infinity pool - the perfect spot for unlimited poolside cocktails - all while deepening your connection to nature.\n\nGlide through crystal clear waters on a kayaking or paddleboard adventure, or peer under the surface of the warm waters with your snorkel. With direct access to beautiful dive sites and secluded fishing spots, the island offers everything you could possibly want in a remote, tropical paradise.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Nananu-i-Ra",
    "location_heading": "Dolphin Island",
    "location_subheading": "Fiji",
    "location_description": "Dolphin Island",
    "offer_address": "M6WG+2X3, Ellington Wharf, Fiji",
    "percentage_discount": null,
    "min_duration": 3,
    "max_duration": 14,
    "price": null,
    "value": null
  }
]