[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IY2FIAW",
    "hero_image": "https://images.luxuryescapes.com/mgg310lmgw2cikuig2j",
    "image_two": "https://images.luxuryescapes.com/3i70qw563a6mkselc3c",
    "image_three": "https://images.luxuryescapes.com/q1z79h1trc8y34ysrmth",
    "vendor_name": "Torel Quinta da Vacaria",
    "title": "Grand Opening: Portugal Boutique Douro Valley Luxury with Daily Breakfast & Complimentary Minibar",
    "description": "Tucked away in the heart of Portugal's sprawling Douro Valley, this newly opened property offers a secluded retreat amidst the region's rolling vineyards and verdant landscapes. This charming hotel is a haven of tranquillity, with its stunning infinity pool overlooking the valley and a luxurious spa (one of the largest in the region) offering rejuvenating treatments.\n\nDine at the elegant 16Legoas for a taste of traditional Portuguese cuisine with an ecological consciousness, and raise a toast to your blissful escape at Barbus Bar. Venture beyond the hotel to explore the historic town of Peso da Régua, savour the region's famous port wine at local vineyards or head into Porto for some sightseeing. An eclectic blend of exclusivity, natural surroundings and impeccable hospitality await in the Douro Valley - a UNESCO World Heritage Site.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Vila Real District",
    "offer_geo_area_level_2": "Peso da Regua",
    "location_heading": "Douro Valley",
    "location_subheading": "Portugal",
    "location_description": "Torel Quinta da Vacaria",
    "offer_address": "Quinta da Vacaria 5050-364, Vilarinho dos Freires, Portugal",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 399.0,
    "value": 920.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009FBI2AAO",
    "hero_image": "https://images.luxuryescapes.com/u5ect5vjuu6tilzs6zwq",
    "image_two": "https://images.luxuryescapes.com/oz3fpsrfkjcyh8kali87",
    "image_three": "https://images.luxuryescapes.com/chv0kdtby80m3ocrw78",
    "vendor_name": "The Vintage House - Douro",
    "title": "Five-Star Portugal Escape in UNESCO World Heritage-Listed Douro Valley",
    "description": "In the heart of the UNESCO World Heritage-listed Douro Valley, you'll find the boutique Vintage House Hotel, a five-star escape on the banks of the Douro River. This renovated 19th-century manor house boasts every modern luxury, with rooms and suites offering views over the region's vineyards or the gleaming river. Explore exquisite Portuguese flavours at The Rabelo Restaurant, bathe by the glistening pool or venture out and traverse the Douro Valley's incredible terrain.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Vila Real District",
    "offer_geo_area_level_2": "Alijo",
    "location_heading": "Douro Valley",
    "location_subheading": "Portugal",
    "location_description": "Vintage House Hotel",
    "offer_address": "R. Antonio Manuel Saraiva, 5085-034 Pinhao, Portugal",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 232.0,
    "value": 232.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nju4AAA",
    "hero_image": "https://images.luxuryescapes.com/11l62j0t1pd58ghggkyh",
    "image_two": "https://images.luxuryescapes.com/yalwls2p6uu28ghmvja",
    "image_three": "https://images.luxuryescapes.com/qx3vacy3t8fyo9x2iw8",
    "vendor_name": "Six Senses Douro Valley",
    "title": "Portugal Six Senses Manor Retreat in the Heart of Douro Valley Wine Region",
    "description": "Set in the heart of the rolling, vineyard-covered hills of Portugal's world-famous wine region is Six Senses Douro Valley, a renovated 19th-century manor house on the fringes of the Douro River. With signature Six Senses luxury and wellness offerings, this hotel sets the scene for rural relaxation.\n\nExplore the exquisite flavours of the Douro Valley at four restaurants and bars, all utilising two onsite organic vegetable gardens bursting with seasonal produce. Stop for a tipple or two at the Wine Library and Terrace, where delicious Douro Valley wines are complemented by share plates of ceviche and other Portuguese classics. When you're seeking indulgence, the wellness centre is an oasis of tranquility. Visit the indoor heated swimming pool, sign up for a water therapy session, be pampered with decadent treatments and order a healthy drink at the Alchemy Bar. When you're ready to venture beyond the hotel, explore the Douro Valley's incredible terrain on foot or by bicycle or car.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Viseu District",
    "offer_geo_area_level_2": "Lamego",
    "location_heading": "Douro Valley",
    "location_subheading": "Portugal",
    "location_description": "Six Senses Douro Valley",
    "offer_address": "Quinta Vale de Abrão, 5100-758 Samodães, Portugal",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 950.0,
    "value": 950.0
  }
]