[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zhTrAAI",
    "hero_image": "https://images.luxuryescapes.com/8a8wgwtcihdy94bzxzyr",
    "image_two": "https://images.luxuryescapes.com/0hydh46qnka3daxkdzl",
    "image_three": "https://images.luxuryescapes.com/1l4q6ez9xqiyzjt7nb8i",
    "vendor_name": "PARKROYAL Collection Pickering, Singapore",
    "title": "Five-Star Singapore Garden Oasis with COLLECTION Club Access, Daily Breakfast with Free-Flow Sparkling Wine & Evening Cocktails",
    "description": "Discover a garden oasis in the heart of Singapore with a stay at the five-star PARKROYAL COLLECTION Pickering, Singapore, part of the prestigious worldwide Pan Pacific Hotel & Resorts group. Instantly recognisable for its innovative design, this inner-city Eden features four levels of lush vegetation spilling from its expansive balconies, plus waterfalls, plant terraces and reflection pools.\n\nHead to the hotel's fifth floor, where an exquisite infinity pool overlooks the silver skyscrapers of the city, while birdcage-style cabanas offer the perfect place to order a cocktail and while away an afternoon. The award-winning St. Gregory Spa invites you to relax and recharge with a signature Tui Na Massage, while Lime Restaurant serves up mouthwatering Southeast Asian and international dishes in one of the most impressive buffets across the city. There’s so much to discover in Singapore, and PARKROYAL COLLECTION Pickering, Singapore is perfectly placed for easy citywide explorations. Spend balmy nights strolling along Clarke Quay before ducking into one of the waterfront restaurants, slurp noodles in Chinatown and wander the breathtaking displays at Gardens by the Bay.",
    "offer_country_name": "Singapore",
    "offer_country_code_alpha_2": "SG",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Singapore",
    "location_heading": "Downtown Core",
    "location_subheading": "Singapore",
    "location_description": "PARKROYAL COLLECTION Pickering, Singapore",
    "offer_address": "3 Upper Pickering St, Singapore 058289",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 13,
    "price": 649.0,
    "value": 1158.0
  }
]