[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hDRNAA2",
    "hero_image": "https://images.luxuryescapes.com/oqfiour6iqpvvk0afi",
    "image_two": "https://images.luxuryescapes.com/6lb3w188h9wz52r8s35s",
    "image_three": "https://images.luxuryescapes.com/y9yp4mlmmqz82habal6e",
    "vendor_name": "Six Senses Qing Cheng Mountain",
    "title": "Dujiangyan Luxury Suites at the Gateway to Qing Cheng Mountain",
    "description": "Breathe in the natural wonder and serenity of Six Senses Qing Cheng Mountain, nestled among the lush forests and slopes of the ancient spiritual centre of China. The resort offers a rare glimpse into the region’s halcyon past. An extensive range of onsite wellness treatments, dining options and concierge-organised experiences are available, as well as unrivalled access to some of the region’s most cherished historic and cultural sites. Visit the UNESCO World Heritage-listed Dujiangyan Irrigation System and the mountain itself, which is home to 11 famous sacred Taoist temples.\n\nYou’ll be spoiled for choice, with four excellent restaurants - including traditional Thai favourites served with an incredible view at Sala Thai and authentic Sichuan and Cantonese dishes at Zi Qi Yuan Chinese Restaurant - and two bars. The resort also boasts an indoor heated pool, open year-round, and is less than a 10-minute drive from the stunning Dujiangyan Panda Valley, where visitors can see wild giant pandas and learn about the facility’s tireless efforts to preserve China’s iconic national treasures.",
    "offer_country_name": "China",
    "offer_country_code_alpha_2": "CN",
    "offer_geo_area_level_1": "Sichuan",
    "offer_geo_area_level_2": "Chengdu",
    "location_heading": "Dujiangyan",
    "location_subheading": "China",
    "location_description": "Six Senses Qing Cheng Mountain",
    "offer_address": "2 Dongruan Blvd, Dujiangyan City, Chengdu, Sichuan, China, 611844",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 256.0,
    "value": 256.0
  }
]