[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004DozNAAS",
    "hero_image": "https://images.luxuryescapes.com/lkvzdozl0jobe042yog",
    "image_two": "https://images.luxuryescapes.com/95m791oo2h44er2o5x",
    "image_three": "https://images.luxuryescapes.com/vn886vtldaf83pwaazdv",
    "vendor_name": "Fable Dunedin",
    "title": "Five-Star Victorian Heritage Stay in the Heart of Dunedin with Daily Breakfast",
    "description": "Soak up Dunedin's impressive historic architecture with a stay within a piece of its Victorian heritage at the elegant Fable Dunedin, a beautifully restored 1800s manor offering unparalleled elegance and luxury facilities in a prime location. A boutique, private haven of 50 architecturally designed rooms, the Fable Dunedin exudes signature heritage elegance inspired by Scottish settlers with traditional tartan accents.\n\nThere's something to love for everyone at this luxe hotel, from the renowned The Press Club restaurant - which pays homage to Dunedin's original 1870s haunt for editors and publishers - to the outstanding service and central location within walking distance of Dunedin's The Octagon - the focal point of the city with bars, theatres and Speight's Brewery. Fall for the historic charm of Fable Dunedin from the moment you arrive.\n\n**Your handpicked inclusions:**\n\n- Prepare for a day of indulgence with a gourmet à la carte cooked breakfast at The Press Club\n- Make the most of one NZ$25 food and drink credit per package to share\n- Toast your stay with a cocktail each served on arrival\n- Enjoy a well-deserved sleep-in or relaxed morning with a guaranteed 1pm late checkout\n\n**Suite upgrade available:** Enjoy extra space with a separate lounge area when you upgrade to a Junior Suite, featuring a luxurious ensuite with walk-in shower.\n\n**Upgrade bonus:** Upgrade to a Luxury Room or Junior Suite and receive a sparkling bottle of wine to share in-room on arrival.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Otago",
    "offer_geo_area_level_2": "Dunedin",
    "location_heading": "Dunedin",
    "location_subheading": "New Zealand",
    "location_description": "Fable Dunedin",
    "offer_address": "310 Princes St, Dunedin 9016 New Zealand",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 249.0,
    "value": 446.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zHf5AAE",
    "hero_image": "https://images.luxuryescapes.com/q3uk717dv5tisqx6srl",
    "image_two": "https://images.luxuryescapes.com/90xmu1wugpf4ov2gvh9",
    "image_three": "https://images.luxuryescapes.com/epzae1z4ftfpb5pk20r",
    "vendor_name": "Camp Estate Larnach Castle",
    "title": "South Island: Dunedin Regal Castle Escape with Four-Course Dinner, High Tea & Nightly Drinks",
    "description": "Receive the royal treatment at Camp Estate at Larnach Castle - a glamourous country manor tucked among the rolling grounds of Dunedin's iconic Larnach Castle. Wind up the driveway to this rustic abode and be welcomed by New Zealand's unrivalled hospitality before waltzing into one of just five luxurious suites, charmingly adorned in neo-classic design. Cosy up by your private fireplace and gaze out across sweeping pastoral views or join fellow guests in the lavish living room and library for complimentary pre-dinner drinks.\n\nLocated just 500 metres from the gates of Larnach Castle, the hotel places its historic majesty at your fingertips. Explore each lovingly restored room, from the grand ballroom to the chandelier-adorned dining quarters, and wander through the award-winning gardens to admire the native blooms and surrounding peninsula views. If you can draw yourself away from the spectacular scenery, head into Dunedin's vibrant town centre, just 25 minutes away.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Otago",
    "offer_geo_area_level_2": "Dunedin",
    "location_heading": "Dunedin",
    "location_subheading": "New Zealand",
    "location_description": "Camp Estate at Larnach Castle",
    "offer_address": "Larnach Castle 100 Camp Road, Larnachs Castle, Dunedin 9077, New Zealand",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 566.0,
    "value": 804.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdTHYAA3",
    "hero_image": "https://images.luxuryescapes.com/a0py39t3ed968vs0r15it",
    "image_two": "https://images.luxuryescapes.com/fbgo0nd5cnygq6msmdh7",
    "image_three": "https://images.luxuryescapes.com/05x575oxba87kv7ixx09",
    "vendor_name": "Fable Dunedin",
    "title": "Five-Star Boutique New Zealand Victorian Heritage Stay in the Heart of Dunedin",
    "description": "Soak up Dunedin's impressive historic architecture with a stay at the elegant Fable Dunedin, a beautifully restored Victorian manor offering unparalleled elegance. There's something for everyone to love at this hotel, from the renowned The Press Club restaurant - which pays homage to Dunedin's original 1870s haunt for editors and publishers - to its central location close to The Octagon and its Scottish-inspired traditional tartan accents.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Otago",
    "offer_geo_area_level_2": "Dunedin",
    "location_heading": "Dunedin",
    "location_subheading": "New Zealand",
    "location_description": "Fable Dunedin",
    "offer_address": "310 Princes Street, Central Dunedin, Dunedin 9016, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 134.0,
    "value": 134.0
  }
]