[
  {
    "link": "https://luxuryescapes.com/offer/0062800000NwYqdAAF",
    "hero_image": "https://images.luxuryescapes.com/iuuvhtv8yh9qmakwhvjt",
    "image_two": "https://images.luxuryescapes.com/azhhseitj4pmgd2mangx",
    "image_three": "https://images.luxuryescapes.com/tuk2fyeknq3l5c7epinp",
    "vendor_name": "El Questro Homestead",
    "title": "All-Inclusive Indulgence in the Kimberley",
    "description": "Discover one of the world’s last frontiers with a once-in-a-lifetime escape to the spectacular Kimberley Region in Western Australia. Spend four days/three nights in one of the finest luxury wilderness properties in the country - El Questro Homestead - and enjoy all-inclusive indulgence with fine dining, select alcohol, complimentary tours and activities, return transfers and more for two.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Durack",
    "location_heading": "Durack",
    "location_subheading": "Western Australia",
    "location_description": "El Questro Homestead",
    "offer_address": "1 Gibb River-Wyndham Rd, Durack, Western Australia 6743, Australia",
    "percentage_discount": 31.0,
    "min_duration": 3,
    "max_duration": 3,
    "price": 2899.0,
    "value": 4220.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FLJK1YAP",
    "hero_image": "https://images.luxuryescapes.com/97z538mc7o5pcnb11il8",
    "image_two": "https://images.luxuryescapes.com/5pj2iq8rzf1u8a05a397",
    "image_three": "https://images.luxuryescapes.com/ygw6edprmac17lau585b",
    "vendor_name": "El Questro Homestead",
    "title": "Adults-Only Kimberley Luxury Lodge Escape with All-Inclusive Dining, Daily Drinks, Wilderness Tours & Transfers",
    "description": "Discover one of the world’s last frontiers with a once-in-a-lifetime exclusive escape to the spectacular Kimberley Region in Western Australia. Set among 700,000 acres of dramatic landscape, El Questro Wilderness Park is the perfect setting for exploring the Kimberley country, with El Questro Homestead offering a luxury retreat in the heart of it all.\n\nIndulge in daily gourmet dining inspired by Ord River Valley produce, with breakfast served on the sweeping veranda boasting views of Chamberlain Gorge. Enjoy complimentary drinks all day long and lounge by the serene pool, before exploring all that the surrounding countryside has to offer.\n\nWith rugged gorges, crystal clear waters, breathtaking sunsets and the ancient Boab tree all on your doorstep, there is plenty to explore. For a fully immersive Kimberley experience, The Homestead offers complimentary tours and activities, all tailored to your needs and preferences to help you experience the best of El Questro.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Durack",
    "location_heading": "Durack",
    "location_subheading": "Western Australia",
    "location_description": "El Questro Homestead",
    "offer_address": "1 Gibb River-Wyndham Road, Durack, Western Australia 6743, Australia",
    "percentage_discount": 32.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 3919.0,
    "value": 5750.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id16PAAR",
    "hero_image": "https://images.luxuryescapes.com/g6axih0z8tuqsgl5qfjnf",
    "image_two": "https://images.luxuryescapes.com/sh6ypbc0cacwy871ak2n",
    "image_three": "https://images.luxuryescapes.com/4eiwgd8pjkeyf6vz3sfe",
    "vendor_name": "El Questro Homestead",
    "title": "Adults-Only Kimberley El Questro Luxury Lodge with All-Inclusive Dining, Daily Drinks, Wilderness Tours & Roundtrip Transfers",
    "description": "Discover one of the world’s last frontiers with a once-in-a-lifetime exclusive escape to the spectacular Kimberley Region in Western Australia. Set among 700,000 acres of dramatic landscape, El Questro Wilderness Park is the perfect setting for exploring the wild Kimberley country, with El Questro Homestead offering a luxury retreat in the heart of it all. Indulge in daily gourmet dining inspired by Ord River Valley produce, with breakfast served on the sweeping veranda boasting uninterrupted views of Chamberlain Gorge. Enjoy complimentary drinks all day long and take a moment to lounge by the serene pool, before exploring all that the surrounding countryside has to offer.\n\nWith rugged gorges, crystal clear waters, breathtaking sunsets and the ancient Boab tree all on your doorstep, there is plenty to explore when you're not lounging and dining at the resort. For a fully immersive Kimberley experience, the Homestead offers complimentary tours and activities, all tailored to your needs and preferences to help you experience the best of El Questro. From a scenic cruise along the Chamberlain River to a dip in Zebedee Thermal Springs, there is something for everyone, and El Questro’s enthusiastic rangers have all the knowledge and insight to make each tour a memorable one.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Durack",
    "location_heading": "Durack",
    "location_subheading": "Western Australia",
    "location_description": "El Questro Homestead",
    "offer_address": "1 Gibb River-Wyndham Rd, Durack, Western Australia 6743, Australia",
    "percentage_discount": 32.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 3899.0,
    "value": 5750.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JGvHIAW",
    "hero_image": "https://images.luxuryescapes.com/3zgyze8rhgbn6yhitbf",
    "image_two": "https://images.luxuryescapes.com/bqwsay6n28nbqpmyxam",
    "image_three": "https://images.luxuryescapes.com/r6dpm6s7crnysvr2kr8v",
    "vendor_name": "El Questro Homestead",
    "title": "Adults-Only Kimberley El Questro Luxury Lodge with All-Inclusive Dining, Daily Drinks, Wilderness Tours & Return Transfers",
    "description": "Discover one of the world’s last frontiers with a once-in-a-lifetime exclusive escape to the spectacular Kimberley Region in Western Australia. Set among 700,000 acres of dramatic landscape, El Questro Wilderness Park is the perfect setting for exploring the wild Kimberley country, with El Questro Homestead offering a luxury retreat in the heart of it all.\n\nIndulge in daily gourmet dining inspired by Ord River Valley produce, with breakfast served on the sweeping veranda boasting uninterrupted views of Chamberlain Gorge. Enjoy complimentary drinks all day long and take a moment to lounge by the serene pool, before exploring all that the surrounding countryside has to offer.\n\nWith rugged gorges, crystal clear waters, breathtaking sunsets and the ancient Boab tree all on your doorstep, there is plenty to explore when you're not lounging and dining at the resort. For a fully immersive Kimberley experience, the Homestead offers complimentary tours and activities, all tailored to your needs and preferences to help you experience the best of El Questro.\n\nFrom a scenic cruise along the Chamberlain River to a dip in Zebedee Thermal Springs, there is something for everyone, and El Questro’s enthusiastic rangers have all the knowledge and insight to make each tour a memorable one.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Durack",
    "location_heading": "Durack",
    "location_subheading": "Western Australia",
    "location_description": "El Questro Homestead",
    "offer_address": "1 Gibb River-Wyndham Rd, Durack, Western Australia 6743, Australia",
    "percentage_discount": 28.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 4249.0,
    "value": 5941.0
  }
]