[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdfuzAAB",
    "hero_image": "https://images.luxuryescapes.com/u3xs9iuulwyj3z3zcf3",
    "image_two": "https://images.luxuryescapes.com/b454snxshm0p20urfmxo",
    "image_three": "https://images.luxuryescapes.com/dgga0cxrtmdl8r9wyui",
    "vendor_name": "Kempinski Palace Engelberg",
    "title": "Swiss Alps Kempinski Belle Epoque-Inspired Luxury with Daily Breakfast & CHF150 Resort & Spa Credit",
    "description": "Cradled by the Swiss Alps and steeped in signature Kempinski opulence, this grand hotel offers old-world hospitality in the heart of one of the world's most spectacular natural playgrounds. With spellbinding Belle Epoque-era architectural flourishes and sublime mountain vistas at every turn, Kempinski Palace Engelberg is set to charm from every vantage. No matter the season, the magic of the Alps awaits: summer invites lush mountain hiking and championship golf, while winter transforms the mountain into a skiing paradise.\n\nFor a moment of indulgence, seek out Kempinski The Spa - a rooftop haven boasting an infinity pool, mountain panoramas through floor-to-ceiling windows, a Finnish sauna, ice fountain and cosy fireplace - or head to Cattani Restaurant for modern Swiss-French fare with a brasserie-style spin.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Canton of Obwalden",
    "offer_geo_area_level_2": "Engelberg",
    "location_heading": "Engelberg",
    "location_subheading": "Switzerland",
    "location_description": "Kempinski Palace Engelberg",
    "offer_address": "Dorfstrasse 40, 6390 Engelberg, Switzerland",
    "percentage_discount": 37.0,
    "min_duration": 4,
    "max_duration": 14,
    "price": 1979.0,
    "value": 3121.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007p25KAAQ",
    "hero_image": "https://images.luxuryescapes.com/l57tybstwrwgd6w4dw9j",
    "image_two": "https://images.luxuryescapes.com/1mkrjp5gfrnr7lxqdgtd",
    "image_three": "https://images.luxuryescapes.com/iyjvj2jil8t16c19xeo",
    "vendor_name": "Kempinski Palace Engelberg",
    "title": "Five-Star Kempinski Swiss Mountain Retreat with Rooftop Day Spa",
    "description": "Nestled in the shadows of the powder-white peaks of the Swiss Alps is the five-star Kempinski Palace Engelberg, a grand hotel built in 1904 with stunning Belle Époque-era architectural flourishes. Sublime mountain vistas are set to charm from every vantage. Head up to the rooftop where you'll find Kempinski The Spa, an inviting haven boasting an infinity pool, mountain panoramas from floor-to-ceiling windows, a Finnish sauna, ice fountain, and cosy fireplace.\n\nAn onsite restaurant and bar showcases the best the region has to offer, with a strong farm-to-table philosophy and upscale Swiss specialties accompanied by a smooth glass of wine or refreshing cocktail. Located in the fairytale setting of Engelberg, this mountain retreat makes for an enchanting escape all year round. In summer, go hiking through lush green mountain scenes, find an 18-hole golf course with a spectacular alpine background, or try your hand at fishing on Lake Eugeni. In winter, the mountains are covered in a blanket of gleaming white snow, a playground for avid skiers, snowboarders, and general snow bunnies.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Canton of Obwalden",
    "offer_geo_area_level_2": "Engelberg",
    "location_heading": "Engelberg",
    "location_subheading": "Switzerland",
    "location_description": "Kempinski Palace Engelberg",
    "offer_address": "Dorfstrasse 40, 6390 Engelberg, Switzerland",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 541.0,
    "value": 541.0
  }
]