[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000I7dS6YAJ",
    "hero_image": "https://images.luxuryescapes.com/4hinh53vil5qmh6me5a",
    "image_two": "https://images.luxuryescapes.com/9w242cbwwqzglw978z3o",
    "image_three": "https://images.luxuryescapes.com/y1jwdyfx98gy5g6bjtnf",
    "vendor_name": "Exclusive Sunrise Resort",
    "title": "Grand Re-Opening: Adults-Only Vanuatu Beachfront Bliss with All-Inclusive Dining & Island Excursions",
    "description": "Recently reopened, this all-inclusive boutique retreat invites you to reconnect with nature by the Pacific Ocean. Home to just nine couples at a time, each traditionally designed room and villa sits on the sandy shores of Espiritu Santo - one of Vanuatu’s most spectacular islands - just steps from the archipelago's brilliant blue waters.\n\nThe resort offers once-in-a-lifetime excursions included in your stay (subject to resort schedule) - become spellbound by the beauty of Santo's Blue Holes, visit the local market with the resort’s chef, kick back on Champagne Beach's postcard-worthy sands and more.\n\nSavour the flavours of the South Pacific with all-inclusive meals crafted by the talented chef using the freshest local ingredients. Between meals, glide across the shimmering waters on a kayak or paddleboard and snorkel along the magical underwater world just offshore.",
    "offer_country_name": "Vanuatu",
    "offer_country_code_alpha_2": "VU",
    "offer_geo_area_level_1": "Sanma",
    "offer_geo_area_level_2": "Saraotou",
    "location_heading": "Espiritu Santo",
    "location_subheading": "Vanuatu",
    "location_description": "Exclusive Sunrise Resort",
    "offer_address": "9 Barrier Beach Road, Espiritu Santo 0000, Vanuatu",
    "percentage_discount": 36.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1659.0,
    "value": 2574.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EjzwvYAB",
    "hero_image": "https://images.luxuryescapes.com/1w9iizu4topfqkjav6p",
    "image_two": "https://images.luxuryescapes.com/k05k4wfd2ih8prvjkwz",
    "image_three": "https://images.luxuryescapes.com/bdt7uqdu1adcftwnd0h6",
    "vendor_name": "Exclusive Sunrise Resort",
    "title": "Adults-Only Vanuatu Beachfront Bliss with All-Inclusive Dining, Island Excursions & Airport Transfers",
    "description": "Reconnect with nature at this all-inclusive, boutique and eco-friendly retreat on the edge of the Indian Ocean, home to just nine couples at a time. Here, each traditionally designed room and villa sits on the sandy shores of Espiritu Santo - one of Vanuatu’s most spectacular islands - just steps from the archipelago's brilliant blue waters.\n\nThe resort offers once-in-a-lifetime excursions included in your stay - become spellbound by the beauty of Santo's Blue Holes, visit the local market with the resort’s chef, kick back on Champagne Beach's post-card-worthy sands and more.\n\nSavour the flavours of the South Pacific with all-inclusive meals crafted by the talented chef using the freshest local ingredients. Between meals, glide across the shimmering waters on a kayak or paddle board and snorkel through the magical underwater world just offshore.",
    "offer_country_name": "Vanuatu",
    "offer_country_code_alpha_2": "VU",
    "offer_geo_area_level_1": "Sanma",
    "offer_geo_area_level_2": "Saraotou",
    "location_heading": "Espiritu Santo",
    "location_subheading": "Vanuatu",
    "location_description": "Exclusive Sunrise Resort",
    "offer_address": "9 Barrier Beach Road, Espiritu Santo 0000, Vanuatu",
    "percentage_discount": 39.0,
    "min_duration": 7,
    "max_duration": 7,
    "price": 2419.0,
    "value": 3981.0
  }
]