[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FjtFpYAJ",
    "hero_image": "https://images.luxuryescapes.com/4ge3vlmhps77lz979tg",
    "image_two": "https://images.luxuryescapes.com/kkbi4wsl1l9ftmm4yser",
    "image_three": "https://images.luxuryescapes.com/hwbbhamm1iwidp0gwris",
    "vendor_name": "Wharekauhau Country Estate",
    "title": "New Zealand Luxury Farm Stay near Cape Palliser with Daily Breakfast, Gourmet Dinner & Nightly Cocktails",
    "description": "Perched on the edge of Palliser Bay, this grand Edwardian-style estate is a luxuriously secluded world of its own, stretching across 3,000 acres of rolling pasture, shimmering lakes and untouched coastline. Set between the Pacific Ocean and a working farm dotted with sheep, step into a sanctuary of timeless elegance in a bespoke suite with views of the sea to escape from daily life.\n\nThe main lodge, a fusion of rustic charm and French-inspired opulence, invites guests to indulge in the ritual of cocktail hour with free-flowing drinks and canapes, then linger in the dining room over candlelit four-course dinners with farm-to-table cuisine inspired by the estate's fertile lands.\n\nBeyond the lodge's gilded interiors, days unfold at your own pace, with a number of curated experiences on offer to enrich your stay. Let life move slowly and unwind with a treatment at Hauora Spa, lounge by the indoor pool, explore the wine cellar with a guided tasting or sip in the skies on a helicopter wine flight. \n\nWhen adventure beckons, pedal your way through nearby vineyards, star gaze with a local astronomer, tour the working farm, challenge yourself with a spot of archery or take in the landscape on a thrilling quad bike tour.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Wellington Region",
    "offer_geo_area_level_2": "Ocean Beach",
    "location_heading": "Featherston",
    "location_subheading": "New Zealand",
    "location_description": "Wharekauhau Country Estate",
    "offer_address": "4132 Wharekauhau Road Palliser Bay, RD3, Featherston 5773 New Zealand",
    "percentage_discount": 28.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 2059.0,
    "value": 2850.0
  }
]