[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004LM7qAAG",
    "hero_image": "https://images.luxuryescapes.com/v3bved8j44t0ey2z7lqk",
    "image_two": "https://images.luxuryescapes.com/zayvraces6e1xzfeccgc",
    "image_three": "https://images.luxuryescapes.com/qjxdmhtsxowz51sz3ow",
    "vendor_name": "Riad Fes - Relais & Châteaux",
    "title": "Five-Star Fez Relais & Châteaux Elegance with Medina & Atlas Mountains Views",
    "description": "Step into a world where authentic Moroccan culture and contemporary luxuries collide at the five-star Riad Fès - Relais & Châteaux, a beautifully restored retreat in the heart of Fez, Morocco's oldest medina. Framed by Spanish-Moorish architecture, inspired by the city's prestigious history and draped in décor reminiscent of Arabian Nights, this palatial abode invites you to enjoy an opulent lifestyle once reserved for Fassi nobility.\n\nBoasting unrivalled vistas across the UNESCO World Heritage-listed Medina of Fez and spectacular Atlas Mountains, the intimate rooftop terrace is the ideal spot to watch the sunset, while the luxurious spa and wellness centre promises absolute rejuvenation through its effortless blend of traditional techniques and world-class technology. Choose to learn the secrets behind Moroccan flavours with an onsite cooking class or by dining at the boutique Gayza restaurant, where locally inspired dishes are individually curated to your taste. Slip into the luxurious outdoor pool, relax on the panoramic terrace or plunge into the medieval labyrinth of myriad souks and ancient sights that interlace the surrounding medina, from the ornate Blue Gate to the Palais Royal Dar El Makhzen and Marinid Tombs.",
    "offer_country_name": "Morocco",
    "offer_country_code_alpha_2": "MA",
    "offer_geo_area_level_1": "Fès-Meknès",
    "offer_geo_area_level_2": "Fes",
    "location_heading": "Fez",
    "location_subheading": "Morocco",
    "location_description": "Riad Fès - Relais & Châteaux",
    "offer_address": "5 Derb Zerbtana, Fès 30110, Morocco",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 7,
    "price": 303.0,
    "value": 303.0
  }
]