[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cs5KZQAY",
    "hero_image": "https://images.luxuryescapes.com/sttv45is7b8h3wjmxuw",
    "image_two": "https://images.luxuryescapes.com/lep2hv4ncp9lvkh477ya",
    "image_three": "https://images.luxuryescapes.com/3rigzw1fuybobnsm7oq",
    "vendor_name": "Fitzroy Island Resort",
    "title": "Stay Amid the Spectacular Great Barrier Reef with Cairns Boat Transfers Included",
    "description": "Immerse yourself in the natural beauty of the Great Barrier Reef at Fitzroy Island Resort, surrounded by the unspoiled rainforest and beaches of Tropical North Queensland. A National Park, Fitzroy Island unlocks a slice of paradise with spectacular walking trails, marine life and wildlife. Getting there is easy with return ferry transfers from Cairns included in your package. Your escape also includes daily buffet breakfast, AU$50 resort credit, a bottle of sparkling wine when dining at Zephyr Restaurant and a lazy late midday checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fitzroy Island",
    "location_heading": "Fitzroy Island",
    "location_subheading": "Queensland",
    "location_description": "Fitzroy Island Resort",
    "offer_address": "Fitzroy Island, Queensland 4870, Australia",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 245.0,
    "value": 639.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GPjCOAA1",
    "hero_image": "https://images.luxuryescapes.com/ac11zafjqn2b8sbw00h",
    "image_two": "https://images.luxuryescapes.com/jcmfrizhbhdg2wfkukje",
    "image_three": "https://images.luxuryescapes.com/xovijd28u4s9dy0yuyur",
    "vendor_name": "Fitzroy Island Resort",
    "title": "Fitzroy Island Great Barrier Reef Eco-Retreat with Daily Breakfast & Roundtrip Ferry Transfers",
    "description": "Soak up the spectacular natural beauty of Tropical North Queensland and the Great Barrier Reef with a stay at the eco-friendly Fitzroy Island Resort, just a 45-minute catamaran ferry ride from Cairns. From the rainforest to the reef, Fitzroy Island’s remarkable landscapes are begging to be explored - hike the butterfly-filled Secret Garden, snorkel with clownfish and sea turtles in the island’s vivid coral kingdoms or seek the golden sands and balmy blue waters of Nudey Beach, crowned one of Australia’s very best. The resort is also home to the Cairns Turtle Rehabilitation Centre (surcharges apply), so you can get up close and personal with the island's cutest inhabitants.\n\nReturn to the resort and embrace barefoot bliss. Start the morning with barista-poured coffee and a la carte breakfast served al fresco at Zephyr Restaurant and slip into tropical cocktails at the resort’s swim-up Pool Bar. A rotating schedule of activities means that every day on Fitzroy Island is an adventure, with activities like fish feeding from the jetty and glass bottom boat tours being perfect for adults and little ones alike.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fitzroy Island",
    "location_heading": "Fitzroy Island",
    "location_subheading": "Queensland",
    "location_description": "Fitzroy Island Resort",
    "offer_address": "Fitzroy Island, Queensland 4870, Australia",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 383.0,
    "value": 775.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HJ0s9YAD",
    "hero_image": "https://images.luxuryescapes.com/gsnrrwc8vlj3ypjoiube",
    "image_two": "https://images.luxuryescapes.com/6vkv8ng307zbxedbskcj",
    "image_three": "https://images.luxuryescapes.com/2pw8ww4h4szkhw03qd8",
    "vendor_name": "Fitzroy Island Resort",
    "title": "Fitzroy Island Oasis: Great Barrier Reef Suites & Villas with Daily Breakfast & Return Ferry Transfers",
    "description": "Soak up the spectacular natural beauty of Tropical North Queensland and the Great Barrier Reef at this eco-friendly stay, just a 45-minute catamaran ferry from Cairns. With a guaranteed upgrade to a spacious suite or villa, guests can enjoy a self-contained stay with resort-style amenities that make exploring the island a breeze. \n\nWake each morning to panoramic bay views from a spacious, upgraded suite, then enjoy barista-poured coffee and breakfast at Zephyr Restaurant before sipping on tropical cocktails at the swim-up pool bar. Hike the butterfly-filled Secret Garden, snorkel with clownfish or visit the Cairns Turtle Rehabilitation Centre within the resort (surcharges apply).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fitzroy Island",
    "location_heading": "Fitzroy Island",
    "location_subheading": "Queensland",
    "location_description": "Fitzroy Island Resort",
    "offer_address": "Fitzroy Island, Queensland 4870, Australia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 659.0,
    "value": 1198.0
  }
]