[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DIQiXAAX",
    "hero_image": "https://images.luxuryescapes.com/8c3xhsr2kdmbj1f2ncuk",
    "image_two": "https://images.luxuryescapes.com/z7fctkq0t6863tkiz21",
    "image_three": "https://images.luxuryescapes.com/n7dgiir7moj6ztuitgm",
    "vendor_name": "Banyan Tree Tamouda Bay",
    "title": "Luxury Morocco Pool Villa Resort with Daily Breakfast & EUR100 Dining Credit",
    "description": "Uncover true opulence and Moroccan charm at Banyan Tree Tamouda Bay, a luxurious beachfront resort nestled between the rugged Rif Mountains and the country's northern coastline. Just 90 minutes from Tangier Ibn Battouta Airport, this all-pool villa resort is designed with Andalusian-Moorish architectural flourishes, from the arched doorways to the stone walls, vaulted ceilings and painted tiles. Stretch out on the resort's 700-metre private beach or opt to relax by your villa's private swimming pool. Three exquisite restaurants are sure to satisfy every craving: head to Saffron for Thai with a twist, feast on authentic Moroccan cuisine at Tingitana, and dine on Mediterranean with ocean views at Azura. Retreat to the resort's two cool bars for handcrafted cocktails and light snacks, or venture into bliss at the onsite spa.",
    "offer_country_name": "Morocco",
    "offer_country_code_alpha_2": "MA",
    "offer_geo_area_level_1": "Tanger-Tetouan-Al Hoceima",
    "offer_geo_area_level_2": "Fnideq",
    "location_heading": "Fnideq",
    "location_subheading": "Morocco",
    "location_description": "Banyan Tree Tamouda Bay",
    "offer_address": "Route Nationale 13 Oued Negro, BP 526 Fnideq Tetouan 93100 Morocco",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 26,
    "price": 979.0,
    "value": 1915.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004URV2AAO",
    "hero_image": "https://images.luxuryescapes.com/d7xcqpou6w04havun9",
    "image_two": "https://images.luxuryescapes.com/bg2qlfrhys922ygj9zxf",
    "image_three": "https://images.luxuryescapes.com/z87508dbi4jgksi2tnxt",
    "vendor_name": "Banyan Tree Tamouda Bay",
    "title": "Luxury Morocco All-Pool-Villa Resort with Private Beach",
    "description": "Uncover true opulence and Moroccan charm from Banyan Tree Tamouda Bay, a luxurious beachfront resort. This all-pool-villa resort is designed with Andalusian-Moorish architectural flourishes, from the arched doorways to the stone walls, vaulted ceilings and painted tiles. Stretch out on the resort's 700-metre private beach or opt to stay poolside, by your villa's private swimming pool. Three exquisite restaurants are sure to satisfy every craving: head to Saffron for delicious Thai dishes with a twist; feast on authentic Moroccan cuisine at Tingitana; and dine seaside at Azura to enjoy refined Mediterranean gastronomy. The resort's two cool bars are perfect for enjoying handcrafted cocktails and light snacks. The onsite spa offers an unparalleled venture into bliss: opt for a luxe facial, a body scrub or go all out with a signature treatment.\n\nThe resort is located in Morocco's northern corner, in the town of Fnideq, on the Mediterranean Sea. The resort is just a 20-minute drive from the city of Tétouan, home to a UNESCO World Heritage-listed medina. The famous Blue City of Chefchaouen is under two hours' drive away, making for an unforgettable day trip. Fnideq's town centre is only eight minutes away via car and is home to shops, cafés and restaurants.",
    "offer_country_name": "Morocco",
    "offer_country_code_alpha_2": "MA",
    "offer_geo_area_level_1": "Tanger-Tetouan-Al Hoceima",
    "offer_geo_area_level_2": "Fnideq",
    "location_heading": "Fnideq",
    "location_subheading": "Morocco",
    "location_description": "Banyan Tree Tamouda Bay",
    "offer_address": "Route Nationale 13, Oued Negro, Fnideq 93100, Morocco",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 34.0,
    "value": 34.0
  }
]