[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JPYuAAO",
    "hero_image": "https://images.luxuryescapes.com/5qfqm96spar1uve96mhm",
    "image_two": "https://images.luxuryescapes.com/pc9at9ktp8zlnfjonu",
    "image_three": "https://images.luxuryescapes.com/qmrj7j659rje6q09h5f",
    "vendor_name": "Laurina Estate",
    "title": "Blissful Private Country Estate on NSW's Mid North Coast with Daily Breakfast",
    "description": "Let serenity find you at the blissfully secluded Laurina Estate, a charming adults-only country retreat in the heart of New South Wales’ Mid North Coast. Easily reachable from Port Macquarie or Newcastle in under two hours by car, this is the perfect destination for a relaxing escape filled with outdoor adventures and good wines. Enjoy exclusive access to the property, its surrounding gardens and a cosy outdoor fire pit area, ensuring an undisturbed escape from reality, where your only neighbours are alpacas and nature. The brand-new outdoor bathhouse is a glorious step away from the norm: bathe in absolute seclusion in a luxurious free-standing bathtub with uninterrupted views out onto the gardens.\n\nIf you are looking to get away from the hustle and bustle of the city to soak up the beauty of the Australian countryside, Laurina Estate is perfect for you. Surround yourself with nature, explore NSW's Great Lakes region, walk the pristine sands of Nine Mile Beach - located just a 10-minute drive from the property - and retreat to your boutique home, where a private slice of country bliss awaits.\n\n**Your handpicked inclusions:**\n\n- Wake up to delicious daily breakfast served in the privacy of your country retreat\n- Celebrate your escape with a welcome bottle of wine\n- Get to know the resident alpacas with feed provided\n- Unwind with an indulgent bath hamper featuring bath salts, chocolate and more",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Darawank",
    "location_heading": "Forster",
    "location_subheading": "New South Wales",
    "location_description": "Laurina Estate",
    "offer_address": "12 Laurina Dr Darawank, Forster, NSW 2428, Australia",
    "percentage_discount": null,
    "min_duration": 2,
    "max_duration": 5,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BdsgaAAB",
    "hero_image": "https://images.luxuryescapes.com/5pujz0f0flfx258ex9x",
    "image_two": "https://images.luxuryescapes.com/f5rj80yv4sdbvufd5fg",
    "image_three": "https://images.luxuryescapes.com/t7ubyvtcbm0ennijc8cr",
    "vendor_name": "Laurina Estate",
    "title": "Blissful Private Country Estate on NSW North Coast with Outdoor Bathhouse & Daily Breakfast",
    "description": "Let serenity find you at the blissfully secluded Laurina Estate, a charming country retreat in the heart of New South Wales’ Mid North Coast. Easily reachable from Port Macquarie or Newcastle in under two hours by car, this is the perfect destination for a relaxing escape filled with outdoor adventures and good wines. Enjoy exclusive access to the property, its surrounding gardens and a cosy outdoor fire pit area, ensuring an undisturbed escape from reality, where your only neighbours are alpacas and nature. The outdoor bathhouse is a glorious step away from the norm: bathe in absolute seclusion in a luxurious free-standing bathtub with uninterrupted views out onto the gardens.\n\nSurround yourself with nature, explore NSW's Great Lakes region, walk the pristine sands of Nine Mile Beach - located just a 10-minute drive from the property - and retreat to your boutique home, where a private slice of country bliss awaits.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Darawank",
    "location_heading": "Forster",
    "location_subheading": "New South Wales",
    "location_description": "Laurina Estate",
    "offer_address": "12 Laurina Dr Darawank, Forster, NSW 2428, Australia",
    "percentage_discount": null,
    "min_duration": 2,
    "max_duration": 5,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ebw1iAAB",
    "hero_image": "https://images.luxuryescapes.com/terok8vl551resjg4ybh",
    "image_two": "https://images.luxuryescapes.com/f02q14va5ojujoafsr",
    "image_three": "https://images.luxuryescapes.com/80xmrv7cubrth3eej8ei",
    "vendor_name": "Laurina Estate",
    "title": "Exclusive Forster Garden Estate with Outdoor Bath and Private Pool",
    "description": "Let serenity find you at Laurina Estate, a charming retreat in New South Wales’ Mid North Coast. Easily reachable from Port Macquarie or Newcastle, this is the perfect destination for an escape filled with outdoor adventures and good wines. Enjoy exclusive access to the property and its gardens, where your only neighbours are alpacas and nature. Your cosy firepit and outdoor bathhouse with free-standing tub share uninterrupted views of the absolute seclusion day or night.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Darawank",
    "location_heading": "Forster",
    "location_subheading": "New South Wales",
    "location_description": "Laurina Estate",
    "offer_address": "12 Laurina Dr Darawank, Forster, NSW 2428, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 473.0,
    "value": 473.0
  }
]