[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LnWRAA0",
    "hero_image": "https://images.luxuryescapes.com/ittuqsd4pgasx4u3psjn",
    "image_two": "https://images.luxuryescapes.com/gxaqgxyhp9uafplad06e",
    "image_three": "https://images.luxuryescapes.com/vlmdqcwq5aftcr7s8zs",
    "vendor_name": "Rainforest Retreat",
    "title": "Luxury New Zealand Tree House Escape near Franz Josef Glacier",
    "description": "Immerse yourself in the awe-inspiring mountains, glaciers and bush of New Zealand’s West Coast with a spectacular tree house experience at Rainforest Retreat. Located in the heart of the South Island’s Franz Josef Village, it’s the ideal base for those exploring New Zealand’s glacier country. Your escape includes a daily continental breakfast hamper for two, one daily drink each, NZ$50 food and drink credit per room and guaranteed 12pm checkout.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "West Coast",
    "offer_geo_area_level_2": "Franz Josef Glacier",
    "location_heading": "Franz Josef",
    "location_subheading": "New Zealand",
    "location_description": "Rainforest Retreat",
    "offer_address": "46 Cron Street, Franz Josef, Waiau 7856, New Zealand",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 292.0,
    "value": 515.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GsRJAA0",
    "hero_image": "https://images.luxuryescapes.com/mgdcjjd0hqxx7nd0l01j",
    "image_two": "https://images.luxuryescapes.com/ju3ocmwhsfgw0bvtj3bt",
    "image_three": "https://images.luxuryescapes.com/4yzt8nqig7o59y4hb8e",
    "vendor_name": "Rainforest Retreat",
    "title": "New Zealand Southern Alps Tree House Retreat with Daily Breakfast",
    "description": "Immerse yourself in the awe-inspiring mountains, glaciers and bush of the South Island's stunning West Coast with a spectacular tree house experience at Rainforest Retreat. Located in the heart of Franz Josef village, this secluded alpine retreat is the ideal base for those exploring the glacier country.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "West Coast",
    "offer_geo_area_level_2": "Franz Josef Glacier",
    "location_heading": "Franz Josef",
    "location_subheading": "New Zealand",
    "location_description": "Rainforest Retreat",
    "offer_address": "46 Cron Street, Franz Josef, Waiau 7856, New Zealand",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 9,
    "price": 289.0,
    "value": 504.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JTb8AAG",
    "hero_image": "https://images.luxuryescapes.com/nyjtj5k2zgpxaj7v6skq",
    "image_two": "https://images.luxuryescapes.com/v58xcpucs7qeek3u5e9",
    "image_three": "https://images.luxuryescapes.com/fe9qkiznkgc3ku9e4lar",
    "vendor_name": "Rainforest Retreat",
    "title": "Serene Franz Josef Rainforest Treehouse Escape with Daily Breakfast Hamper & Nightly Drinks",
    "description": "Be prepared for New Zealand to steal your heart as you experience life among the rainforest-clad foothills of the Southern Alps with a calming stay at Rainforest Retreat, nestled in the alpine village of Franz Josef. From breathtaking glaciers and peaceful lagoons to majestic mountains and pristine lakes, this secluded sanctuary is surrounded by unparalleled nature within a UNESCO World Heritage-listed area.\n\nThere is no better way to experience the flora and fauna at your doorstep than a stay within one of the retreat's self-contained havens. Feel at one with nature as you're suspended above the lush rainforest canopy, where you can breathe in the fresh alpine air from your hut's expansive deck area and quiet your mind in the rainforest shower ensuite.\n\nWhen adventure calls, take time to visit iconic sights and lesser-known gems hidden throughout New Zealand’s glacier country and along the wild West Coast. Take to the water and embark on a kayaking adventure with white herons on Ōkārito Lagoon, marvel at Lake Mapourika's shimmering surface, discover the powdered slopes of Franz Josef Glacier or Fox Glacier on a guided walk, or enjoy a change of pace with a horseback tour (surcharges apply).\n\n**Your handpicked inclusions:**\n\n- Wake to a daily continental breakfast hamper filled with locally sourced goods\n- Celebrate each day of adventure with one nightly drink per adult\n- Indulge with NZ$50 food and drinks credit per package to use at Monsoon Restaurant + Bar\n- Rest east with guaranteed 11.30am late checkout\n\n**Group Spa Upgrade:** Take in the serenity from the comfort of your private balcony and soak in the outdoor hot tub when you book the Deluxe Spa Tree House, valid for up to four guests. **Bonus Inclusion:** Upgrade to this two-bedroom, two-bathroom haven to receive NZ$75 food and drinks credit per package.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "West Coast",
    "offer_geo_area_level_2": "Franz Josef Glacier",
    "location_heading": "Franz Josef",
    "location_subheading": "New Zealand",
    "location_description": "Rainforest Retreat",
    "offer_address": "46 Cron Street, Franz Josef, Waiau 7856, New Zealand",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 299.0,
    "value": 542.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cHqB6QAK",
    "hero_image": "https://images.luxuryescapes.com/4cjkg97rxdqi4s5wgk8d",
    "image_two": "https://images.luxuryescapes.com/m46me5o5baqbede2u3b",
    "image_three": "https://images.luxuryescapes.com/dxcws2ack1v8wci1i1",
    "vendor_name": "Rainforest Retreat",
    "title": "Deluxe Tree House Escape Just Minutes From Franz Josef Glacier",
    "description": "Immerse yourself in the spectacular mountains, glaciers and bush of New Zealand’s West Coast with a premium tree house experience at Rainforest Retreat. Located in the heart of the South Island’s Franz Josef Village, it’s the ideal base for exploring New Zealand’s glacier country. Benefit from a daily continental breakfast hamper, one daily drink each and NZ$50 food and beverage credit for two.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "West Coast",
    "offer_geo_area_level_2": "Franz Josef Glacier",
    "location_heading": "Franz Josef",
    "location_subheading": "New Zealand",
    "location_description": "Rainforest Retreat",
    "offer_address": "46 Cron Street, Franz Josef, Waiau 7856, New Zealand",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 380.0,
    "value": 873.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zcBkAAI",
    "hero_image": "https://images.luxuryescapes.com/m572xvi4kbkfut29zsim",
    "image_two": "https://images.luxuryescapes.com/1h21q8apvf9ss122uvei",
    "image_three": "https://images.luxuryescapes.com/rbgsivk7a3a3yewj7u7",
    "vendor_name": "Scenic Hotel Franz Josef Glacier",
    "title": "New Zealand West Coast Scenic Escape near Franz Josef Glacier with NZ$50 Dining Credit & Daily Breakfast",
    "description": "Soak up Franz Josef's impressive, untamed natural wilderness at Scenic Hotel Franz Josef Glacier, a contemporary complex offering luxury facilities and unparalleled landscapes at your doorstep. Ideally nestled on the very edge of Westland World Heritage Park, this boutique sanctuary is the perfect launchpad for discovering the rugged natural beauty, geological treasures and gold mining history of New Zealand's renowned West Coast.\n\nThere's something for everyone at Scenic Hotel Franz Josef Glacier, including a lively bar and stylish restaurant offering seasonal dishes utilising fresh, local ingredients. The hotel sits within walking distance of nearby natural attractions and Main Street - the focal point of the small but lively village, with several bars, restaurants, and breweries. With genuine Kiwi hospitality, attentive service, and sophisticated rooms that exude comfort, it's little wonder the hotel is ranked in the top 10% of properties worldwide on Tripadvisor.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "West Coast",
    "offer_geo_area_level_2": "Franz Josef Glacier",
    "location_heading": "Franz Josef",
    "location_subheading": "New Zealand",
    "location_description": "Scenic Hotel Franz Josef Glacier",
    "offer_address": "36 Main Road, Franz Josef, 7886, New Zealand",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 16,
    "price": 283.0,
    "value": 580.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000INYl1YAH",
    "hero_image": "https://images.luxuryescapes.com/bdx98soz1ajpd6rypvk",
    "image_two": "https://images.luxuryescapes.com/bu3z7ke99wznyl0ws3m8",
    "image_three": "https://images.luxuryescapes.com/fkwyoqnbgoikn0voj1ja",
    "vendor_name": "Rainforest Retreat",
    "title": "Franz Josef Glacier Treehouse Stay with Daily NZ$50 Dining Credit & Helicopter Tour Upgrades Available",
    "description": "Experience a serene stay among the rainforest-clad foothills of New Zealand’s Southern Alps at this retreat nestled in the alpine town of Franz Josef. A stay in one of Rainforest Retreat’s self-contained havens is the perfect way to enjoy this slice of secluded paradise. Embrace nature suspended above the lush rainforest canopy and breathe fresh alpine air from your expansive deck area.\n\nWhen adventure calls, take to the water and embark on a kayaking adventure on Ōkārito Lagoon, marvel at Lake Mapourika's shimmering surface or discover the awe-inspiring Franz Josef Glacier or Fox Glacier on a helicopter tour. After a day of exploring, unwind at Monsoon Restaurant & Bar, the retreat’s lively hub, where hearty local fare, crackling fires and a well-stocked bar invite you to relax.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "West Coast",
    "offer_geo_area_level_2": "Franz Josef Glacier",
    "location_heading": "Franz Josef",
    "location_subheading": "New Zealand",
    "location_description": "Rainforest Retreat",
    "offer_address": "46 Cron Street, Franz Josef, Waiau 7856, New Zealand",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 279.0,
    "value": 560.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007ozO6AAI",
    "hero_image": "https://images.luxuryescapes.com/cku3sgfx4se9wwd52jut",
    "image_two": "https://images.luxuryescapes.com/ex1n8ygkhr6yifmtxhf",
    "image_three": "https://images.luxuryescapes.com/mqxz1u9c19rvqkzlkib",
    "vendor_name": "Rainforest Retreat",
    "title": "South Island Franz Josef Rainforest Treehouse Hideaway",
    "description": "Experience a serene stay among the rainforest-clad foothills of New Zealand’s Southern Alps at Rainforest Retreat, nestled in the alpine town of Franz Josef. This secluded sanctuary is surrounded by unparalleled nature in a region known for its breathtaking glaciers, majestic mountains and pristine lakes. A stay in one of Rainforest Retreat’s self-contained havens is the perfect way to enjoy this slice of paradise: embrace nature suspended above the lush rainforest canopy, inhale fresh alpine air from your hut's expansive deck area and quiet your mind in the rainforest shower ensuite.\n\nWhen adventure calls, you’re poised to visit iconic sights and underrated gems hidden throughout New Zealand’s glacier country and along the wild West Coast. Take to the water and embark on a kayaking adventure with white herons on Ōkārito Lagoon, marvel at Lake Mapourika's shimmering surface, discover the powdered slopes of Franz Josef Glacier or Fox Glacier on a guided walk, or enjoy a change of pace with a horseback tour (surcharges apply).",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "West Coast",
    "offer_geo_area_level_2": "Franz Josef Glacier",
    "location_heading": "Franz Josef",
    "location_subheading": "New Zealand",
    "location_description": "Rainforest Retreat",
    "offer_address": "46 Cron Street, Franz Josef, Waiau 7856, New Zealand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 15,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008fSSzAAM",
    "hero_image": "https://images.luxuryescapes.com/1o1mpzyigayjsphc3pgs",
    "image_two": "https://images.luxuryescapes.com/anu45lt2gfn8c5t7niu",
    "image_three": "https://images.luxuryescapes.com/hlgpcvdvl4it2xbjk8n",
    "vendor_name": "Rainforest Retreat",
    "title": "South Island Franz Josef Rainforest Treehouse Hideaway",
    "description": "Experience life among the rainforest-clad foothills of New Zealand’s Southern Alps with a serene stay at Rainforest Retreat, nestled in the alpine town of Franz Josef on the South Island. From breathtaking glaciers and peaceful lagoons to majestic mountains and pristine lakes, this secluded sanctuary is surrounded by unparalleled nature within a UNESCO World Heritage-listed area. A stay in one of Rainforest Retreat’s self-contained havens is the perfect way to enjoy this slice of paradise: embrace nature as you're suspended above the lush rainforest canopy, inhale fresh alpine air from your hut's expansive deck area and quiet your mind in the rainforest shower ensuite.\n\nWhen adventure calls, you’re perfectly placed to visit iconic sights and underrated gems hidden throughout New Zealand’s glacier country and along the wild West Coast. Take to the water and embark on a kayaking adventure with white herons on Ōkārito Lagoon, marvel at Lake Mapourika's shimmering surface, discover the powdered slopes of Franz Josef Glacier or Fox Glacier on a guided walk, or enjoy a change of pace with a horseback tour (surcharges apply).",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "West Coast",
    "offer_geo_area_level_2": "Franz Josef Glacier",
    "location_heading": "Franz Josef",
    "location_subheading": "New Zealand",
    "location_description": "Rainforest Retreat",
    "offer_address": "46 Cron Street, Franz Josef, Waiau 7856, New Zealand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]