[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CihC4YAJ",
    "hero_image": "https://images.luxuryescapes.com/dfr26iwi8m9ncgat54k",
    "image_two": "https://images.luxuryescapes.com/wxcnbd09rpk77op6bdbm",
    "image_three": "https://images.luxuryescapes.com/22mytj645g5xgrcyx3z8",
    "vendor_name": "Sirru Fen Fushi",
    "title": "Five-Star Maldives Private Pool Villas with Daily Breakfast, Nightly Dinner & Seaplane Transfers",
    "description": "Step into your private island retreat in the Maldives, surrounded by the serene turquoise waters of the Shaviyani Atoll. Sirru Fen Fushi - Private Lagoon Resort is your gateway to effortless island living, with 120 beach-chic villas, each complete with a private pool and direct connection to the island's beaches. Take the indulgence to new heights with the All-Inclusive Upgrade, which includes breakfast, lunch and dinner - plus unlimited daily free-flow drinks.\n\nRelax by the Maldives’ largest infinity pool, sipping cocktails and basking in the sunshine, or cool off in the crystal-clear lagoon. The house reef is a true standout, just 50 meters from the shore, it invites you to immerse yourself in the vibrant underwater world teeming with marine life. Paddle across serene waters in a canoe or embark on a sailing adventure through the dazzling blues of the atoll. As night falls, unwind with a movie at the outdoor cinema under a canopy of stars.\n\nThe dining here is not to be missed. Begin your day with an exquisite breakfast buffet of international delights or a la carte dining at the Raha Market, and return in the evening for dinner. The seasonal menu ranges from authentic Italian pizza and Shaviyani Atoll tuna to Asian, Indian and Arab Indian flavours. For a change of pace, savour Japanese delicacies at the enchanting overwater restaurant Kata or enjoy premium seafood at the beachfront Azure.\n\nAt Sirru Fen Fushi Private Lagoon Resort, sustainability takes centre stage. Explore the Coralarium, a remarkable coral regeneration project and art installation, or visit the Sustainability Lab to learn about the island’s innovative recycling initiatives.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Shaviyani Atoll",
    "offer_geo_area_level_2": "Gaakoshinbi",
    "location_heading": "Gaakoshinbi Island",
    "location_subheading": "Maldives",
    "location_description": "Sirru Fen Fushi Private Lagoon Resort",
    "offer_address": "Gaakoshinbi Island, Shaviyani Atoll 20209, Maldives",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 4109.0,
    "value": 8798.0
  }
]