[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004iOnlAAE",
    "hero_image": "https://images.luxuryescapes.com/5gtybwilyqb8sjlq4g1l",
    "image_two": "https://images.luxuryescapes.com/m7tt8n0zsr2mvcjqi2is",
    "image_three": "https://images.luxuryescapes.com/62cffex8xwzjef93nd",
    "vendor_name": "The G Hotel and Spa",
    "title": "Five-Star Luxury Spa Escape in the Heart of Galway",
    "description": "Step into five-star luxury in the heart of Ireland’s legendary Wild Atlantic Way with a stay at the glamorous the g Hotel & Spa, Galway. Drawing inspiration from the soul-stirring beauty that surrounds the region, this striking hotel was meticulously designed by world-renowned milliner Philip Treacy, with blue and green tones woven throughout the interior along with a touch of the hotel’s signature colour - pink.\n\nGalway is renowned for its fascinating attractions, including the Spanish Arch, Eyre Square and surrounding woodland. When you’re not spending time exploring the natural wonders that frame the city, spoil yourself with a revitalising treatment at Galway’s only five-star spa, ESPA at the g. Enjoy afternoon tea and incredible cocktails at the hotel's enchanting Signature Lounges or visit the stunning 2 AA Rosette-wining Restaurant for mouthwatering local delicacies.\n\n**Luxury Escapes inclusions (select packages)**\n\n- Start your day with **daily breakfast** at GEO Restaurant\n- Arrive to a **welcome gift** of handmade treats and bottled water\n- Benefit from **complimentary Wi-Fi and parking** throughout your stay\n- Savour **one three-course dinner for two** at the award-winning GEO Restaurant (for stays of 3+ nights)\n- Enjoy a **complimentary room upgrade**, subject to availability (for stays of 4+ nights, excludes The Linda Evangelista Penthouse Suite)\n- Arrive to a welcome **bottle of house red or white wine** (Luxury Room, Lake View Suite and Specialty Suite only)\n- Stay hydrated with a **bottle of San Pellegrino sparkling water** on arrival (Lake View Suite, Specialty Suite and The Linda Evangelista Penthouse Suite only)\n- Up the luxury with a **bottle of champagne** on arrival (The Linda Evangelista Penthouse Suite only)\n\n**Penthouse Suite Upgrade**: A stay like no other awaits at the hotel’s largest suite. Named by the world-famous milliner, Philip Treacy, in honour of his supermodel friend, The Linda Evangelista Penthouse Suite offers a private lake-view terrace, separative living area with dining for up to six guests, a standalone Villeroy & Boch bathtub with full lake views, guest bathroom and butler's work area.",
    "offer_country_name": "Ireland",
    "offer_country_code_alpha_2": "IE",
    "offer_geo_area_level_1": "County Galway",
    "offer_geo_area_level_2": "Galway",
    "location_heading": "Galway",
    "location_subheading": "Ireland",
    "location_description": "the g Hotel & Spa",
    "offer_address": "Wellpark, The, Old Dublin Rd, Galway, H91 V0HR, Ireland",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 213.0,
    "value": 213.0
  }
]