[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zUi7AAE",
    "hero_image": "https://images.luxuryescapes.com/bf51xvpj2rs8apxqzhp",
    "image_two": "https://images.luxuryescapes.com/xgcw5xdcs991pmdxrwwtw",
    "image_three": "https://images.luxuryescapes.com/5u3kvmqdc8shw2tl1eao",
    "vendor_name": "Club Med Finolhu Villas - Maldives",
    "title": "Award-Winning Maldives Club Med Five-Star Pool Villas with All-Inclusive Drinks, Dining & Entertainment plus Roundtrip Speedboat Transfers",
    "description": "Let the rest of the world fall away when you stay at the five-star Club Med Finolhu Villas, an eco-chic resort on its very own private island. This dreamy resort has been awarded a Tripadvisor Travellers' Choice Best of the Best 2021 award, placing it among the top 1% of hotels worldwide on the review site. At Club Med Finolhu Villas indulgence is guaranteed; all meals are included and the drinks are free flowing.\n\nDesigned to make the most of the stunning ocean surroundings, each villa boasts spectacular sea views, its own private pool and butler service. It’s all too easy to plunge straight into the crystal-clear island waters or make footprints on sugar-white shores, with direct ocean or beach access from each villa (choose an overwater villa for the ultimate Maldives experience). When you can tear yourself away from your villa, the resort boasts an exquisite restaurant and ultra-cool bar, plus more incredible options to choose from at the neighbouring Club Med Kani. Embark on a journey of the senses with a pampering treatment at Club Med Spa by Cinq Mondes, where a relaxing massage or invigorating body scrub are sure to put a spring in your step.\n\nBeyond Club Med Finolhu Villas, there are a plethora of fun-filled activities to fill your days. Discover Malé on a guided tour, get out among nature on a snorkelling expedition or glass-bottom boat tour, and get the heart racing on a parasailing or tubing adventure (surcharges may apply). After your day’s excursion, return to the serenity of your resort, where an ocean-facing cabana and ice-cold drink await.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Kaafu Atoll",
    "location_heading": "Gasfinolhu",
    "location_subheading": "Maldives",
    "location_description": "Club Med Finolhu Villas",
    "offer_address": "N 2051 Gasfinolhu, Maldives",
    "percentage_discount": 23.0,
    "min_duration": 7,
    "max_duration": 7,
    "price": 5799.0,
    "value": 7506.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007otAvAAI",
    "hero_image": "https://images.luxuryescapes.com/qr17ljhlom6o33w3h44",
    "image_two": "https://images.luxuryescapes.com/cimr9qjno03mkvgzh2u",
    "image_three": "https://images.luxuryescapes.com/8ok90zfusigsuz04jksa",
    "vendor_name": "Club Med Finolhu Villas - Maldives",
    "title": "Award-Winning Maldives Club Med Five-Star Pool Villas with All-Inclusive Drinks & Dining plus Roundtrip Speedboat Transfers",
    "description": "Let the rest of the world fall away with a romantic escape at the five-star Club Med Finolhu Villas, an eco-chic resort on a private island. This dreamy resort has been awarded a Tripadvisor Travellers' Choice Best of the Best 2021 award, placing it among the top 1% of hotels worldwide on the review site. At Club Med Finolhu Villas, indulgence is guaranteed; all meals are included and the drinks are free-flowing. Designed to make the most of the stunning ocean surroundings, villas were designed to be enjoyed with someone special; each romantic villa boasts spectacular sea views, a private pool and butler service.\n\nPlunge straight into the crystal-clear island waters or make footprints on sugar-white shores with direct ocean or beach access from each villa (choose an overwater villa for the ultimate Maldives experience). There's also an exquisite restaurant and ultra-cool bar - or have a pampering treatment at Club Med Spa by Cinq Mondes (additional charges apply). Beyond Club Med Finolhu Villas, there are a plethora of fun activities to fill your days. Discover Malé on a guided tour, get out among nature on a snorkelling expedition or glass-bottom boat tour, and get the heart racing on a parasailing or tubing adventure (surcharges may apply). After your day’s excursion, return to the serenity of your resort, where an ocean-facing cabana and ice-cold drink await.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Kaafu Atoll",
    "location_heading": "Gasfinolhu",
    "location_subheading": "Maldives",
    "location_description": "Club Med Finolhu Villas",
    "offer_address": "N 2051 Gasfinolhu, Maldives",
    "percentage_discount": 32.0,
    "min_duration": 6,
    "max_duration": 7,
    "price": 4409.0,
    "value": 6461.0
  }
]