[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4ytOAAR",
    "hero_image": "https://images.luxuryescapes.com/txd2h5cybqscaq3xkp5t",
    "image_two": "https://images.luxuryescapes.com/kms7stdpho36gi3mh2uj",
    "image_three": "https://images.luxuryescapes.com/t3segwxwztn81qy474l",
    "vendor_name": "Gaya Island Resort",
    "title": "Borneo Island Rainforest Retreat with Beachside Villas & Daily Dining",
    "description": "Discover the unspoiled tropical beauty of Borneo at Gaya Island Resort, a tranquil nature retreat within the protected Tunku Abdul Rahman Marine Park. This cluster of five islands, just a 10-minute speedboat ride off the coast of Kota Kinabalu, envelops you in the rainforest splendour Borneo is famed for. A member of the prestigious Small Luxury Hotels of the World collection, this beachfront haven offers moments of relaxation alongside immersive experiences, such as snorkelling among spectacular coral reefs and guided nature walks. \n\nSavour sumptuous and sustainable seafood dishes at Fisherman's Cove, or be captivated by sunset views over Mount Kinabalu from Pool Bar & Lounge with an ice-cold cocktail in hand. Revitalise body and mind with an invigorating treatment at Spa Village or take in breathtaking vistas of Borneo's natural splendour from the balcony of your spectacular villa. This eco-friendly resort supports coral reef restoration and turtle rescue, combining a luxury stay with a positive environmental impact.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Sabah",
    "offer_geo_area_level_2": "Gaya Island",
    "location_heading": "Gaya Island",
    "location_subheading": "Malaysia",
    "location_description": "Gaya Island Resort",
    "offer_address": "Malohom Bay, Tunku Abdul Rahman Marine Park, Kota Kinabalu, Sabah 88000, Malaysia",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 974.0,
    "value": 2096.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxF3iAAF",
    "hero_image": "https://images.luxuryescapes.com/1bek79mwyi5ji6lgee1e",
    "image_two": "https://images.luxuryescapes.com/fbet7vzfzcvh2ksvxnnn",
    "image_three": "https://images.luxuryescapes.com/zjmiozp5il9jwm3gmiwc",
    "vendor_name": "Bungaraya Island Resort",
    "title": "Boutique Borneo Island Luxury Villas with Daily Breakfast, Massages & Nightly Cocktails",
    "description": "Step to where the rainforest meets the reef and discover a new definition of secluded luxury at this boutique Borneo villa hideaway. Boasting just 48 luxe timber villas, Bungaraya Island Resort offers an invitation to explore one of the world’s most extraordinary islands. After days spent diving with sea turtles or soaring through the ancient jungle by zipline, return to cocktails by the shimmering infinity pool or traditional wellness treatments at the hilltop Echo Wellness Spa. Sample authentic Bornean-Malaysian cuisine at The Longhouse Restaurant or venture underground to savour the perfect glass at The Longhouse Wine Cellar.\n\nThe days are yours to explore. Visit the onsite PADI dive centre to discover the island's vibrant coral reefs and their resident coral fish, clownfish and even whale sharks. Or, wander lush rainforest paths, home to exotic wildlife and magnificent jungle birds alike.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Sabah",
    "offer_geo_area_level_2": "Gaya Island",
    "location_heading": "Gaya Island",
    "location_subheading": "Malaysia",
    "location_description": "Bungaraya Island Resort",
    "offer_address": "Polish Bay, Gaya Island, Tunku Abdul Rahman Park, Kota Kinabalu 88778, Sabah, Malaysia",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 599.0,
    "value": 1209.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4EtTQAV",
    "hero_image": "https://images.luxuryescapes.com/qbvenybg2yep2d78uxpp",
    "image_two": "https://images.luxuryescapes.com/lbb5z7drmfau5qrvwrur",
    "image_three": "https://images.luxuryescapes.com/yc3lvtblj0mpbwlanrl3",
    "vendor_name": "Gaya Island Resort",
    "title": "Escape to Nature with an Island Retreat in Borneo",
    "description": "Discover the unspoiled beauty of Borneo at the award-winning Gaya Island Resort, a tranquil nature retreat tucked into the protected Tunku Abdul Rahman Marine Park. This beachfront property offers moments of relaxation alongside unforgettable experiences, including guided nature walks, snorkelling and kayaking. Included in your escape is daily breakfast, nightly dinner, a 50-minute couple’s massage, return boat transfers to the island from mainland Borneo, and more.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Sabah",
    "offer_geo_area_level_2": "",
    "location_heading": "Gaya Island",
    "location_subheading": "Borneo",
    "location_description": "Gaya Island Resort - Old",
    "offer_address": "Malohom Bay, Tunku Abdul Rahman Marine Park, Kota Kinabalu, Sabah, Malaysia, 88000 Kota Kinabalu, Sabah, Malaysia",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 884.0,
    "value": 2344.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Crbc2YAB",
    "hero_image": "https://images.luxuryescapes.com/x621xlxydp9ep1h9142",
    "image_two": "https://images.luxuryescapes.com/j35o31bfqvatzrcgrpry",
    "image_three": "https://images.luxuryescapes.com/vl6sk89jmg6ak0nxe5fo",
    "vendor_name": "Gaya Island Resort",
    "title": "Tranquil Borneo Villas with All-Inclusive Dining, Free-Flow Cocktail Hour & Return Speedboat Transfers",
    "description": "Discover the unspoiled tropical beauty of Borneo's Gaya Island at this tranquil eco hotel within the protected Tunku Abdul Rahman Marine Park. This cluster of islands, just a 10-minute speedboat ride off the coast of Kota Kinabalu, envelops you in the rainforest splendour Borneo is famed for, complete with secluded villas overlooking Malohom Bay.\n\nA member of the prestigious Small Luxury Hotels of the World collection, this beachfront haven offers moments of relaxation alongside immersive experiences, such as snorkelling among spectacular coral reefs and guided nature walks.\n\nSavour sumptuous and sustainable seafood dishes at Fisherman's Cove, marvel at sunset views over Mount Kinabalu from the two-storey Omakase restaurant or cool off with a refreshing tipple by the pool. Revitalise body and mind at Spa Village or simply drink in breathtaking vistas from your dreamy villa.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Sabah",
    "offer_geo_area_level_2": "Gaya Island",
    "location_heading": "Gaya Island",
    "location_subheading": "Malaysia",
    "location_description": "Gaya Island Resort",
    "offer_address": "Malohom Bay, Tunku Abdul Rahman Marine Park, Kota Kinabalu, Sabah 88000, Malaysia",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 1109.0,
    "value": 2592.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009D674AAC",
    "hero_image": "https://images.luxuryescapes.com/egqnabs5ug5o3ncfnai7",
    "image_two": "https://images.luxuryescapes.com/x3c3odr73pyzgs5rsz",
    "image_three": "https://images.luxuryescapes.com/ep18c9aumocdz2i2f9bk",
    "vendor_name": "Bungaraya Island Resort",
    "title": "Five-Star Gaya Island Beachfront Hideaway off the Coast of Borneo",
    "description": "Located just off the coast of Borneo's Kota Kinabalu, Bungaraya Island Resort is a five-star secluded hideaway just steps from the white-sand beach of Gaya Island’s Polish Bay. Here, just 48 timber villas reflecting traditional Bornean architecture are nestled amid the lush greenery of a tropical jungle. Lounge by the sparkling infinity pool and take in views of the shimmering ocean beyond or visit the luxurious Echo Wellness Spa, where restorative treatments await. The alfresco The Longhouse Restaurant serves up traditional cuisine alongside a mix of local fare, while The Longhouse Wine Cellar is the perfect place to find your new favorite tipple.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Sabah",
    "offer_geo_area_level_2": "Gaya Island",
    "location_heading": "Gaya Island",
    "location_subheading": "Malaysia",
    "location_description": "Bungaraya Island Resort",
    "offer_address": "Polish Bay, Gaya Island, Tunku Abdul Rahman Park, Kota Kinabalu 88778, Sabah, Malaysia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 258.0,
    "value": 258.0
  }
]