[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zQT7AAM",
    "hero_image": "https://images.luxuryescapes.com/1t9hq1ipbfv2rhdboqmb",
    "image_two": "https://images.luxuryescapes.com/n2qmgbdpqsjmhx0247",
    "image_three": "https://images.luxuryescapes.com/pfhjrpgxgnectip5ttg",
    "vendor_name": "Hotel Clermont",
    "title": "Award-Winning Boutique Atlanta Escape with One of the World's Best Rooftop Bars",
    "description": "A magical combination of warm southern hospitality and first-class amenities comes together at the boutique Hotel Clermont in Atlanta, Georgia. This heritage hotel has been lovingly restored to its former 1920s glory, with added modern flourishes - including a rooftop bar voted among the top 25 in the world by Tripadvisor. Spend your time here sipping sky-high cocktails while overlooking the Poncey-Highland neighbourhood. After rooftop drinks, settle in for a mind-blowing dining experience at French-American brasserie Tiny Lou’s, relax with coffee and fresh pastries at Café Clermont or continue the fun at the plush Lobby Bar.\n\nRecognised for its blinking neon radio tower, Hotel Clermont has been an icon of this historic neighbourhood for almost a century - lending it a colourful history with its fascinating past guests, from Lady Gaga to Kid Rock. The hotel is conveniently located at the epicentre of Atlanta's Downtown, Midtown and historical Old Fourth Ward districts, which means the city’s sights, eateries and shopping can easily be explored on foot. Unmissable Atlanta attractions include the Georgia Aquarium, World of Coca-Cola and Martin Luther King, Jr. National Historical Park.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Georgia",
    "offer_geo_area_level_2": "Atlanta",
    "location_heading": "Georgia",
    "location_subheading": "USA",
    "location_description": "Hotel Clermont",
    "offer_address": "789 Ponce De Leon Ave NE, Atlanta GA 30306 United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 22,
    "price": null,
    "value": null
  }
]