[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004CPHkAAO",
    "hero_image": "https://images.luxuryescapes.com/3vxq4dlc8evoh5i3i69c",
    "image_two": "https://images.luxuryescapes.com/ias7ofimh363eaaiwmn",
    "image_three": "https://images.luxuryescapes.com/5r3lbqfwtb0p9gkraf5q",
    "vendor_name": "Pillows Grand Boutique Hotel Reylof",
    "title": "Luxe Heritage Stay in the Heart of Ghent with Daily Breakfast",
    "description": "Timeless beauty and sophisticated luxury come together in the heart of Ghent at Pillows Grand Boutique Hotel Reylof, where modern design is embedded in an elegant Louis XIV interior. Housed in a tastefully restored townhouse that once belonged to Baron Olivier Reylof, this boutique hotel seamlessly blends old-world glamour and modern touches for an unforgettable escape in this charming Belgian city. Heritage details such as majestic staircases, roaring fireplaces, high ceilings and marble floors sit side by side with contemporary art installations, a luxurious spa and a top-of-the-range gym in Baron Reylof’s former carriage house.\n\nSurrounded by some of the city’s best restaurants, cafés and sights, the hotel places you in a strategic position to explore the magic of Ghent. Top attractions within walking distance include the 10th-century Gravensteen Castle, colourful Graffiti Street, Design Museum Gent and the ornate City Hall. When you’re ready to unwind, Pillows Grand Boutique Hotel Reylof’s luxurious facilities will pamper you in every way. From the sophisticated restaurant LOF, headed by Michelin-starred Chef Ron Blaauw and serving up local specialties with a modern twist, to the cosy rooms fitted with original artworks and plush beds, you’ll have plenty of reasons to feel right at home in this elegant hotel.",
    "offer_country_name": "Belgium",
    "offer_country_code_alpha_2": "BE",
    "offer_geo_area_level_1": "Flemish Region",
    "offer_geo_area_level_2": "Ghent",
    "location_heading": "Ghent",
    "location_subheading": "Belgium",
    "location_description": "Pillows Grand Boutique Hotel Reylof",
    "offer_address": "Hoogstraat 36, 9000 Gent, Belgium",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  }
]