[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LiXIAA0",
    "hero_image": "https://images.luxuryescapes.com/n0v8iwohwc4eeyddlgg",
    "image_two": "https://images.luxuryescapes.com/ri1j9hks3qnijo2m5v1g",
    "image_three": "https://images.luxuryescapes.com/czxsdhacp5trq27ctvql",
    "vendor_name": "Villas Edenia",
    "title": "Private Pool Villa Luxury in the Glistening Gili Islands with Transfers from Bali Included",
    "description": "Experience beauty befitting of the name 'Eden' on a glittering archipelago in the heart of Indonesia, staying at Villas Edenia on Gili Trawangan - the biggest of the serene Gili Islands. Discover an oasis of relaxation in your private pool villa, on an island cradled by mesmerising lagoon waters and golden shores. Experience a quintessential luxe escape including daily breakfast, a one-time set menu lunch, one cocktail per person, per stay, return boat transfers from Bali to Trawangan Pier and complimentary daily bicycle hire so you can explore the lush forestry and nightlife of the island.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Gili Trawangan",
    "location_heading": "Gili Trawangan",
    "location_subheading": "Indonesia",
    "location_description": "Villas Edenia",
    "offer_address": "Jl. Klp. Gili Trawangan, Gili Indah, Pemenang, Kabupaten Lombok Utara, Nusa Tenggara Bar. 83352, Indonesia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 390.0,
    "value": 704.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cKVmDQAW",
    "hero_image": "https://images.luxuryescapes.com/mws0qoheeqfb66kd7bk7",
    "image_two": "https://images.luxuryescapes.com/ke9h9a3qadpe6tcwf0d",
    "image_three": "https://images.luxuryescapes.com/sxa9tz47gwr7paa0w1",
    "vendor_name": "Pondok Santi Estate",
    "title": "Tranquil Gili Island Getaway with Return Boat Transfers",
    "description": "Embark on an unforgettable escape at Pondok Santi Estate, nestled on the idyllic island of Gili Trawangan. Accessible only by boat, this tropical haven is set on an ancient coconut plantation, the perfect retreat for those seeking rest and relaxation. Treat yourself to a couples’ retreat in an elegant private bungalow and enjoy a blissful 60-minute massage, an exquisite three-course dinner, return boat transfers, daily à la carte breakfast and much more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Gili Trawangan",
    "location_heading": "Gili Trawangan",
    "location_subheading": "Indonesia",
    "location_description": "Pondok Santi Estate",
    "offer_address": "Dusun Gili Trawangan, Gili Indah, Pemenang, Kabupaten Lombok Utara, Nusa Tenggara Bar. 83352, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 465.0,
    "value": 1114.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IgArIAK",
    "hero_image": "https://images.luxuryescapes.com/lh9xwygq7mat6t72gaxs",
    "image_two": "https://images.luxuryescapes.com/ivk4xq92idlrr3hao77c",
    "image_three": "https://images.luxuryescapes.com/ly8xecx7yts4sw1boal",
    "vendor_name": "Cocana Resorts Gili Trawangan",
    "title": "Gili Trawangan Beachfront Eco Resort with Beach Club, Spa & Restaurant",
    "description": "This eco-conscious resort is a tropical oasis on the stunning Gili Trawangan Island, known for its crystal-clear waters and vibrant coral reefs. Be just moments from the beach and have the island's most expansive beach club at your fingertips at this sustainable haven.\n\nSpend your days exploring the island's pristine beaches, dining at the resort's Pacifica restaurant, or taking part in exhilarating water sports. After a day of adventure, retreat to your private bungalow, enjoy a refreshing dip in the resort's pool, or savour a cocktail at the beachfront bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Gili Trawangan",
    "location_heading": "Gili Trawangan",
    "location_subheading": "Indonesia",
    "location_description": "Cocana Resorts Gili Trawangan",
    "offer_address": "Villas Resort Gili Trawangan, Jl. Pantai Gili Trawangan, Gili Indah, Pemenang, Kab. Lombok Utara 83352, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 298.0,
    "value": 298.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HNokAAG",
    "hero_image": "https://images.luxuryescapes.com/d5wsz9jlxqq5yq9smyv",
    "image_two": "https://images.luxuryescapes.com/6gt5ha97ublavgthspj",
    "image_three": "https://images.luxuryescapes.com/t7g5mhabxnviv2ye3fm",
    "vendor_name": "Pondok Santi Estate",
    "title": "Gili Island Beachside Bungalows Just 15 Minutes from Lombok",
    "description": "Let the wonders of Gili Trawangan unfurl before you at Pondok Santi Estate, offering beachside luxury on the island’s shimmering southern coast. This luxury retreat, ranked in the top 10% of properties worldwide on Tripadvisor, is home to just 18 beautifully-appointed private bungalows nestled amid the estate’s manicured tropical gardens.\n\nSet within seven hectares of ancient coconut plantation, this tropical haven radiates peace, quiet, and tranquility, and is located just far enough from the hustle and bustle of Gili Trawangan’s main strip, but within easy reach of all that the island has to offer. Unwind beside the infinity pool, read a book in the shade of towering palm trees, indulge in a romantic feast at Santi Restaurant, or toast to your escape overlooking the ocean at Santi Beach Bar. Soak up some sun at the private beach, splash around in the turquoise waters or cycle around this gorgeous island to discover its many charms. At the end of the day, retreat to your personal sanctuary to rest, recharge and repeat it all over again.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Gili Trawangan",
    "location_heading": "Gili Trawangan",
    "location_subheading": "Indonesia",
    "location_description": "Pondok Santi Estate",
    "offer_address": "Dusun Gili Trawangan, Gili Indah, Pemenang, Kabupaten Lombok Utara, Nusa Tenggara Bar. 83352, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 160.0,
    "value": 160.0
  }
]