[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2C8uQAF",
    "hero_image": "https://images.luxuryescapes.com/ien9d4qdb2rbkns8z0vv",
    "image_two": "https://images.luxuryescapes.com/kdhjhxwn22arpzgnu8gg",
    "image_three": "https://images.luxuryescapes.com/nfzhucydpqovbcplb7ey",
    "vendor_name": "Rio boutique",
    "title": "Moroccan-Inspired Boutique Escape with Gourmet Inclusions",
    "description": "Escape to the tropical coastal state of Goa, where palm-fringed beaches meet rich culture and tantalising cuisine. Stay in boutique style at the newly-opened Rio Boutique hotel - brought to you by the group behind the award-winning Resort Rio Goa - with daily buffet breakfast, one buffet dining experience and two alcoholic beverages per person on one evening of your stay.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Verem",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Rio Boutique Goa",
    "offer_address": "Verem, Bardez, Goa 403114, India",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 148.0,
    "value": 293.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BfwTYAAZ",
    "hero_image": "https://images.luxuryescapes.com/4rpfo60ha3n8rdxdbygg",
    "image_two": "https://images.luxuryescapes.com/hpc269h73zjoh15vdc5g",
    "image_three": "https://images.luxuryescapes.com/v8dntt01fvjt3pligpyl",
    "vendor_name": "Novotel Goa Dona Sylvia Resort",
    "title": "Novotel Goa Five-Star Beachfront Villas with Daily Breakfast & Cocktails",
    "description": "It's time to take your Goa escape to new levels of luxury with a stay at Novotel Goa Dona Sylvia Resort. Perched on pristine Cavelossim Beach in South Goa, this lavish resort is embellished with exquisite villas scattered across 20 acres of lush gardens and swaying palm trees. Embrace the languid and laidback life that is so characteristic of Goa, staying in five-star luxury with panoramic views of the Arabian Sea. An hour's drive from Goa International Airport, this Portuguese-inspired retreat promises to slow down the pace to a tranquil tempo.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Cavelossim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Novotel Goa Dona Sylvia Resort",
    "offer_address": "Cavelossim Beach, Salcete, 403731 Goa, India",
    "percentage_discount": 36.0,
    "min_duration": 3,
    "max_duration": 6,
    "price": 364.0,
    "value": 567.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FLLSqAAP",
    "hero_image": "https://images.luxuryescapes.com/xzd2ai5jgmwt0h8lenaa",
    "image_two": "https://images.luxuryescapes.com/0n910743ct8o3zl5lnzk",
    "image_three": "https://images.luxuryescapes.com/8ql4rknlof317tz3ufm6",
    "vendor_name": "Azaya Beach Resort",
    "title": "Five-Star South Goa Beachfront Escape with Daily Breakfast, Drinks & Roundtrip Airport Transfers",
    "description": "Experience the epitome of tropical luxury at Azaya Beach Resort, a five-star sanctuary snuggled along the pristine sands of Benaulim Beach in South Goa. This beachfront haven, renowned for its Portuguese-inspired architecture and world-class amenities, offers an idyllic retreat and is only a 45-minute drive from Goa International Airport (GOI). Reminiscent of luxurious Maldivian resorts, the property sprawls over 10 acres and is greeted by uninterrupted Arabian Sea views and powder-soft white sands at your doorstep. Unwind in the resort's plush rooms and suites, infinity and plunge pools, feast on lip-smacking coastal delicacies and sip on great cocktails - at Azaya Beach Resort, luxury is reimagined at its finest.\n\nLocated conveniently close to some of South Goa's major attractions, Azaya Beach Resort is the perfect gateway to experience the best of Goan culture, cuisine and lifestyle. Relax in the infinity pool overlooking the sea, embark on a gastronomic journey, destress with a massage, or visit the quaint Goan local bakeries around the resort - the choice is yours! Also, if beach-hopping along the Arabian shores is on your mind, explore the nearby Varca Beach (a 10-minute drive) and Colva Beach (a 15-minute drive), or venture a little further and experience the charms of Old Goa (an hour's drive).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Benaulim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Azaya Beach Resort",
    "offer_address": "Village Calwaddo, Benaulim, Goa, India 403716",
    "percentage_discount": 38.0,
    "min_duration": 3,
    "max_duration": 6,
    "price": 395.0,
    "value": 641.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000da85bQAA",
    "hero_image": "https://images.luxuryescapes.com/ekf2ub1hspjqdv3w535",
    "image_two": "https://images.luxuryescapes.com/oymvohs7fjbmn0lglwgk",
    "image_three": "https://images.luxuryescapes.com/l1xnkmhdujb6wer7ok5b",
    "vendor_name": "Cabo Serai",
    "title": "Luxury Nature Retreat Overlooking the Arabian Sea with Daily Breakfast, Dinner and Cocktails",
    "description": "Built using native materials and techniques that sustain minimal structural impact on the site, Cabo Serai is an eco-conscious nature retreat that marries sustainability with hospitality. Perched atop a hill above the Arabian Sea, this is a hidden gem just waiting to be discovered. A perfect destination for couples, Cabo Serai offers a stunning laid-back holiday in the flourishing forests of Goa. Reserve this two or three-night experience and enjoy daily breakfast and dinner, and nightly cocktails for up to two people (one per person).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Canacona",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Cabo Serai",
    "offer_address": "Cabo De Rama Beach, Canaguinim, Goa 403703, India",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 310.0,
    "value": 509.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004SgVcAAK",
    "hero_image": "https://images.luxuryescapes.com/6t5pc2u0hflwf9amtfo",
    "image_two": "https://images.luxuryescapes.com/99ixz5p7qrdh1zj79n7v",
    "image_three": "https://images.luxuryescapes.com/u3r8tom0b9nivos9877f",
    "vendor_name": "The Acacia Morjim, Ocean Front",
    "title": "Goa Oceanfront Luxury with Daily Breakfast & Cocktails",
    "description": "Perched on a clifftop overlooking the shimmering Arabian Sea, The Acacia Ocean View Morjim is the classic Goan paradise you've been dreaming of. Enveloped within the serene environs of North Goa, this luxurious resort is located just minutes from the famed beaches of Ashwem and Morjim. Hit the pause button on everyday life and escape to the sunny sands of this oceanfront destination, where you can unwind in the stunning infinity pool with jacuzzi, enjoy pan-Asian delights at the onsite restaurant and rejuvenate in the spectacular sea-view spa.\n\nWhen you're not enjoying the resort's luxe facilities, check off your Goa bucket-list with trips to the 17th-century Aguada Fort, iconic Calangute Beach, the UNESCO-listed Basilica of Bom Jesus and spectacular seven-storey Shree Mangesh Temple.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Morjim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Acacia Ocean View Morjim",
    "offer_address": "H.No- 737, Main Morjim - Ashvem Road, Navo Waddo, Goa 403512",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 130.0,
    "value": 253.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PvgbAAC",
    "hero_image": "https://images.luxuryescapes.com/klaguo6ovp2drra1ve",
    "image_two": "https://images.luxuryescapes.com/9zd7jzcinp4h6fcyp2fg",
    "image_three": "https://images.luxuryescapes.com/q8ziqt609agrl83v692",
    "vendor_name": "Alila Diwa Goa",
    "title": "Five-Star Bali-Inspired South Goa Escape with Daily Breakfast & Nightly Drinks",
    "description": "Hidden within verdant rice paddies and surrounded by coconut groves, the Balinese-style Alila Diwa Goa is more than just your typical Goan resort. Just minutes from the beach and half an hour from the airport, Alila Diwa Goa is an oasis of calm and tranquility. Home to one of the country's most famous infinity pools, this Goan retreat lets you experience authentic tropical vibes with a dash of luxury and elegance.\n\nLocated in popular South Goa, Alila Diwa Goa, from the world-renowned Hyatt brand, is your personal invitation to enjoy a secluded vacation away from the crowds. Breathtaking views of the endless green fields and palm groves, contemporary Goan architecture, Bali-inspired decor and multiple dining options introduce you to a different side of India's favourite tropical destination. Embrace the languid and laidback pace of life in this quiet haven for a truly rejuvenating experience.\n\n**Your handpicked inclusions:**\n\n- Wake up and enjoy daily buffet breakfast at VIVO restaurant\n- Feel refreshed with one daily cocktail, beer or glass of wine per adult (one drink per adult, per day)\n- Savour one three-course or buffet dinner, once during the stay\n- Arrive in style with shared roundtrip airport transfers\n- Make the most of a 20% discount on drinks, dining and spa\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** Two children (11 and under) stay free in existing bedding with all package inclusions (except alcohol). Choose the Family Upgrade and benefit from an additional daybed in your room.\n\n**Longer stay bonus:** Stay 4+ nights and enjoy one three-course or buffet lunch, once per stay, and your choice of tea or coffee with one snack each, once per stay.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Majorda",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Alila Diwa Goa",
    "offer_address": "48/10, Adao Waddo, Majorda, Goa 403713",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 224.0,
    "value": 458.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bhT3JQAU",
    "hero_image": "https://images.luxuryescapes.com/d2fiaqkgu7ftzfpbasm",
    "image_two": "https://images.luxuryescapes.com/ljd4fnu74bohnt7v91bh",
    "image_three": "https://images.luxuryescapes.com/8v4u0v8ew9x6hhyyigd",
    "vendor_name": "The Postcard Moira",
    "title": "2019 Experience Luxury at Its Finest at The Postcard Moira with Daily Breakfast and Nightly Drinks",
    "description": "A hidden gem in the charming village of Moira, the Postcard Moira is a carefully restored 214 year old ancestral home that showcases the quintessential spirit of Goa along with the comforts of modern hospitality. Enjoy this unique experience on a two or three night getaway and explore Goa in the most intimate way possible. Includes daily breakfast, complimentary Wi-Fi, one three-course meal for dinner, a glass or wine or beer each evening, one local experience along with a one-way airport transfer.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Postcard Moira - 2019",
    "offer_address": "House no -497, Calzor, Moira, Goa 403507, India",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 411.0,
    "value": 858.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000QaYcvAAF",
    "hero_image": "https://images.luxuryescapes.com/rqces1aoxox0crfejakj",
    "image_two": "https://images.luxuryescapes.com/enynjmk8agqlfvdilodh",
    "image_three": "https://images.luxuryescapes.com/ef7aizrk6aczwrwuqqja",
    "vendor_name": "Park Regis Goa",
    "title": "Five-Star Luxury at Park Regis Goa",
    "description": "Discover a new class of luxury accommodation right in the heart of Goa. Spend four nights in a Garden View Room at Park Regis Goa and receive daily buffet breakfasts, two three-course dinners, a complimentary bottle of wine and cocktail tasting session for two adults.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Park Regis Goa 2018 OLD",
    "offer_address": "Saqwadi, Arpora, Goa 403509, India",
    "percentage_discount": 24.0,
    "min_duration": 4,
    "max_duration": 4,
    "price": 408.0,
    "value": 540.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ai44GQAQ",
    "hero_image": "https://images.luxuryescapes.com/ycuj6atntxven6rg1fku",
    "image_two": "https://images.luxuryescapes.com/jomvowmrofnoajvncpnz",
    "image_three": "https://images.luxuryescapes.com/jmdwwpr7hlsurb1xwoar",
    "vendor_name": "Beleza By The Beach",
    "title": "Relaxing Boutique Beachfront Stay",
    "description": "Escape to the white sands of South Goa with a stay at the boutique resort Beleza by the Beach, which offers direct access to the sparkling blue Arabian Sea. Nestled between the beach and lush green rice paddies, stunning views await in every direction. Included in this Escapes Club getaway is daily breakfast, one romantic three-course dinner for two, one 50-minute massage for each adult and one nightly cocktail per adult. Plus, one child (aged 11 and under) stays free with applicable package inclusions when using existing bedding.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Beleza by the Beach OLD",
    "offer_address": "Colva Beach, Thondwaddo, Betalbatim, Goa 403708, India",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 181.0,
    "value": 515.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QGrvAAG",
    "hero_image": "https://images.luxuryescapes.com/zhu3zwu0cvd7g14imxeo",
    "image_two": "https://images.luxuryescapes.com/74wvvhvesegvzuem66",
    "image_three": "https://images.luxuryescapes.com/ap3vt2bhkcitd8dx2d29",
    "vendor_name": "The Postcard Hotels and Resorts Corporate Office",
    "title": "North, South & Old Goa: The Postcard Hotels Boutique Stays with Daily Breakfast & Drinks",
    "description": "Experience the unique beauty of Goa, staying at your choice of three boutique properties by The Postcard Hotels: a collection of idyllic properties by leaders trained in the art of luxury by the renowned Oberoi brand. Curate your own Goa experience by choosing to stay at The Postcard Velha in Old Goa, The Postcard Moira in North Goa or The Postcard Cuelim in South Goa. Alternatively, extend your holiday by purchasing all three packages - the choice is yours.\n\nTransformative experiences and local community values lie at the heart of The Postcard collection. When staying at The Postcard Hotels, everything is about you; breakfast is served whenever you like, and check-in and checkout are available 24/7. Expect intimate service as you encounter UNESCO World Heritage-listed buildings, beautiful beaches and breathtaking wildlife on your travels. Renowned for its Portuguese influence, laidback vibes and natural beauty, Goa beckons you to take a break and switch off from everyday life.\n\n**Your handpicked inclusions:**\n\n- Enjoy a refreshing welcome drink on arrival\n- Dine when it suits you, with daily breakfast served any time you like\n- Indulge in authentic Goan delights with daily INR2,500 dining credit per package\n- Unwind with one daily cocktail, glass of wine or beer per adult (one drink per person, per day)\n- Travel stress-free with one-way pick-up from Goa International Airport\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** The Postcard Velha allows up to two children (12 and under) to stay free, sharing existing bedding, with all package inclusions (excludes alcohol). The Postcard Cuelim allows one child (12 and under) to stay free, sharing existing bedding, with all package inclusions (excludes alcohol).\n\n**Extended stay bonus:** Stay for four or more nights and enjoy select bonus inclusions. See individual packages for details.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Panaji",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Postcard Hotels Collection",
    "offer_address": "D-69/4/5 After Gandhi Circle, Before Church of Our Lady of Mount, Ella, Goa 403402",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 495.0,
    "value": 700.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lk30AAC",
    "hero_image": "https://images.luxuryescapes.com/28zuuj8e7sclmfbr9mn",
    "image_two": "https://images.luxuryescapes.com/cnrultccnlzdu59zzkg8",
    "image_three": "https://images.luxuryescapes.com/s0pu0pbl6mys1ceg23d",
    "vendor_name": "Andores Resort & Spa",
    "title": "Goa Boutique Luxury with Massages & Nightly Cocktails",
    "description": "Located in pristine North Goa, amid the calm coconut groves of Calangute, Andores Resort & Spa promises a relaxing Goan vacation. A luxury boutique hotel, Andores Resort & Spa offers heart-warming Goan hospitality with beautifully designed rooms, acclaimed dining and easy access to popular beaches. Currently rated the top hotel in Calangute on TripAdvisor, the resort is also home to celebrated chef Ritu Dalmia's restaurant, DIVA, the perfect spot to satisfy all your Italian cuisine cravings. Your escape includes daily breakfast, one dinner at Cinnamon Restaurant, nightly cocktails for two (one drink per person, per night) and one 60-minute massage each.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Andores Resort & Spa OLD",
    "offer_address": "Tivai Vaddo, Calangute, Goa 403516",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 265.0,
    "value": 507.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bh0EGQAY",
    "hero_image": "https://images.luxuryescapes.com/jx6sf2gxlu8dfhhzsf1v",
    "image_two": "https://images.luxuryescapes.com/e1rwa4qspijobtqt1ihs",
    "image_three": "https://images.luxuryescapes.com/qbmbeb7odpcyxwf3xua3",
    "vendor_name": "Resort Rio Goa",
    "title": "Iconic Resort Getaway in the Heart of North Goa",
    "description": "Escapes Club invites you to leave it all behind and discover the tropical coastal state of Goa, where palm-fringed beaches meet rich culture and tantalising cuisine. Stay in the five-star, award-winning Resort Rio, nestled on the banks of the Baga river in Arpora. Live the VIP life with daily buffet breakfast, one buffet dining experience, two alcoholic beverages per person on one evening of your stay, and INR1,000 spa credit to put towards revitalising treatments.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Resort Rio 2019",
    "offer_address": "Near Baga Beach, Tambudki, Arpora, Bardez, Goa 403518, India",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 246.0,
    "value": 508.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VXTNAA4",
    "hero_image": "https://images.luxuryescapes.com/jba55lr88k2ua1bdficr",
    "image_two": "https://images.luxuryescapes.com/o8oz5w69966sdt9pmh",
    "image_three": "https://images.luxuryescapes.com/k1vn6ysyeuv450piv9l",
    "vendor_name": "Hilton Goa Resort",
    "title": "Grand Opening: Riverside Hilton Goa Luxury with Private Dining & Daily Drinks",
    "description": "Set in the lush Saipem Hills of North Goa's Candolim, the brand-new Hilton Goa Resort is a world-class retreat overlooking the serene Nerul River. Just minutes from Goa's famous Calangute and Candolim beaches, this tropical paradise is perfect for families, couples and honeymooners. Four outdoor pools, a temperature-controlled whirlpool, three onsite dining options and sublime sunsets are just some of the many advantages of holidaying at this luxurious property.\n\nWhen you're not making the most of first-class Hilton facilities, check off Goa's top sights, including Dudhsagar Falls, the 17th-century Aguada Fort and lively Anjuna Beach, where watersports and sunbathing are some of the favourite pastimes.\n\n**Your handpicked inclusions**\n\n- Begin every morning with a hearty breakfast at @Saipe restaurant\n- Enjoy BBQ@YourBalcony, a private barbeque dining experience on your balcony/patio, once during your stay\n- Be welcomed with a delicious snack of butter cake and cookies on arrival\n- Every evening, between 4pm and 6pm, enjoy a cocktail at Coco (one drink per person)\n- Treat your tastebuds with a 20% discount on additional drinks and dining\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** Up to two children (aged five years and under) stay free on existing bedding, with all inclusions as per package purchased (excludes alcohol), OR up to two children (aged six to 11 years) stay free on existing bedding with breakfast only.\n\n**Deluxe River-View Upgrade**: Why miss out on stunning views of the river when you can upgrade? Treat yourself to a stay in the spectacular Deluxe River View Room, a welcoming haven with a private balcony overlooking the serene Nerul River.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Candolim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Hilton Goa Resort",
    "offer_address": "Pilerne - Candolim Rd, Saipem, Candolim, Goa 403515",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 283.0,
    "value": 654.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LhCyAAK",
    "hero_image": "https://images.luxuryescapes.com/n96n12vsuu5lmyi6cuq",
    "image_two": "https://images.luxuryescapes.com/5a72qgwud4z6wxtoobk",
    "image_three": "https://images.luxuryescapes.com/r919jk3fq8gimhcv7vdf",
    "vendor_name": "Novotel Goa Resort and Spa",
    "title": "BEST OF 2019: Novotel Escape in Sun-Kissed Goa with Dining Inclusions",
    "description": "Experience the beauty of Goa with a stylish break at Novotel Goa Resort & Spa, nestled near the coast, close to the golden sands of Candolim beach and its vibrant nightlife. Your stay includes daily buffet breakfast, two buffet or set-menu meals during your stay, one daily glass of house wine or beer per person, and 20% discount on relaxing massages and at one of Goa’s hottest clubs, Toy Beach Club.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Candolim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Novotel Goa Resort and Spa",
    "offer_address": "Pinto Waddo, Off, Candolim Rd, Bardez, Candolim, Goa 403515, India",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 309.0,
    "value": 1000.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z47QAAQ",
    "hero_image": "https://images.luxuryescapes.com/0r8b3wmok9zrhtrzkbkf",
    "image_two": "https://images.luxuryescapes.com/zyb490gaeksgqetmgky",
    "image_three": "https://images.luxuryescapes.com/jl7044ry4ncdz2c0sjt6",
    "vendor_name": "Hard Rock Hotel Goa",
    "title": "Iconic Hard Rock Escape in Goa with Daily Breakfast & Nightly Cocktails",
    "description": "Experience the world-renowned entertainment and dining synonymous with Hard Rock in India's very own tropical paradise: Goa. Set right in the heart of Calangute, close to some of Goa's most sought-after beaches, Hard Rock Hotel Goa offers rockstar-worthy accommodation together with unparalleled entertainment and dining and the longest pool in Goa. Escape the ordinary with an exciting stay, which includes daily buffet breakfast, two dinners, one nightly cocktail per adult and a 15% discount on spa treatments.\n\n**Travelling with family?** Two kids (aged 11 years and under) stay free in existing bedding with all the package inclusions.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Hard Rock Hotel Goa Old",
    "offer_address": "370/14, Bishop Alex Dias Road, Porba Vaddo, Bardez, Calangute, Goa 403516",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 217.0,
    "value": 471.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LkJSAA0",
    "hero_image": "https://images.luxuryescapes.com/3r0hsav8jo4uqr29f2",
    "image_two": "https://images.luxuryescapes.com/n0l9t40mnesp91zo7lsk",
    "image_three": "https://images.luxuryescapes.com/2k80r2kbhs4cew86saih",
    "vendor_name": "Planet Hollywood Beach Resort Goa",
    "title": "Hollywood Glamour in Goa with Nightly Cocktails & Airport Transfers",
    "description": "Located on the white sandy beach of Utorda in South Goa, Planet Hollywood oozes Hollywood glamour with its quirky movie-themed interiors. Perfect for families, couples and friends, this beachside property has something for everyone. Enjoy daily breakfast, one dinner during your stay, shared return airport transfers, nightly cocktails for two and one 30-minute massage per adult, per stay. \n\n**Travelling with family?** Two kids aged 11 years and under stay free (see Fine Print for details).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Uttorda",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Planet Hollywood Goa",
    "offer_address": "30/3, Acsona Waddo, Uttorda Beach, Utorda, Goa 403713",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 250.0,
    "value": 724.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oTmBAAU",
    "hero_image": "https://images.luxuryescapes.com/mnizd7bs3o6r5xsmqt8d",
    "image_two": "https://images.luxuryescapes.com/xwfbo2of3cfd2par74b",
    "image_three": "https://images.luxuryescapes.com/kukmx1mqlp8slwc5tmv",
    "vendor_name": "Park Regis Goa",
    "title": "Luxe North Goa Escape Near Baga & Anjuna Beach with Daily Breakfast & Nightly Drinks",
    "description": "If you love North Goa, then discover its many charms with a stay at the upscale Park Regis Goa. Located around 70 minutes from Goa International Airport (GOI) and easily accessible from both Mumbai and Bengaluru, the hotel is close to some of the region's best beaches such as Calangute, Baga and Anjuna.\n\nWith elegantly appointed rooms and suites, Park Regis Goa invites you to indulge in tropical luxury and modern comfort while its multiple dining options promise to take your taste buds on an epic culinary journey. Keep the kids busy at the kids' recreational area, unwind at the alfresco pool bar, rejuvenate at the spa, and enjoy a much-needed break from everything. It's also less than a 10-minute stroll to the famed Saturday Night Market.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Arpora",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Park Regis Goa",
    "offer_address": "Saqwadi, Arpora, Goa, India 403516",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 174.0,
    "value": 342.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002yzNOAAY",
    "hero_image": "https://images.luxuryescapes.com/x0n77zeqvpgba74h6gl",
    "image_two": "https://images.luxuryescapes.com/b9t9f5y1xa0begkz43n7",
    "image_three": "https://images.luxuryescapes.com/fd5v55wnjo2fzsx4wzg",
    "vendor_name": "Resort Rio Goa",
    "title": "Five-Star Goa Stay Overlooking Baga River with Daily Breakfast & Cocktails",
    "description": "Turn your Goa vacation into an extraordinary experience with a stay at the iconic Resort Rio. Sitting pretty on the banks of Baga River and under 10 minutes' drive from the famous Baga Beach, the opulent Resort Rio brings together the best of Goa's heritage and world-class comfort. Spread across 10 acres, this riverside paradise promises a Goan escape like no other.\n\nMake the most of your Goa stay with daily breakfast, two lunches or dinners per stay and daily cocktails (one drink per person, per day).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Arpora",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Resort Rio",
    "offer_address": "Near Baga, Beach, Tambudki, Arpora, Goa 403518",
    "percentage_discount": 47.0,
    "min_duration": 4,
    "max_duration": 4,
    "price": 249.0,
    "value": 468.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000045Z0pAAE",
    "hero_image": "https://images.luxuryescapes.com/8hyj37whlh6r1isp124o",
    "image_two": "https://images.luxuryescapes.com/k1x9twoerhehbdopa4cf",
    "image_three": "https://images.luxuryescapes.com/vnspzzih0dy30x2gf892",
    "vendor_name": "Andores Resort & Spa",
    "title": "Top-Rated Goa Boutique Luxury with Daily Breakfast & Nightly Cocktails",
    "description": "Located in pristine North Goa, amid the calm coconut groves of Calangute, Andores Resort & Spa promises a relaxing escape from reality. This luxury boutique hotel combines heart-warming Goan hospitality with beautifully designed rooms, acclaimed dining and easy access to popular beaches. Currently rated the top hotel in Calangute on Tripadvisor and stamped with a Tripadvisor Travellers' Choice Award 2021, Andores Resort & Spa is an oasis of calm, perfect for an intimate escape amid the hustle and bustle of busy Goa.\n\n**Your handpicked inclusions:**\n\n- Begin every day in this Goan paradise with buffet/set-menu breakfast for two\n- Enjoy daily cocktails for two (one drink per person) at VIDA\n- End one night with a delicious four-course dinner for two (once per stay)\n\n**Travelling with family?** One child (aged five years and under) stays free on existing bedding, with breakfast included.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Andores Resort & Spa OLD",
    "offer_address": "Tivai Vaddo, Calangute, Goa 403516",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 170.0,
    "value": 299.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dc0tRQAQ",
    "hero_image": "https://images.luxuryescapes.com/ovr55ztoghdb1j00c818",
    "image_two": "https://images.luxuryescapes.com/mgm8vu025nf6fp8djfj",
    "image_three": "https://images.luxuryescapes.com/ha9nfgdvwe1r5fddsg",
    "vendor_name": "Novotel Goa Resort and Spa",
    "title": "Novotel Escape in Sun-Kissed Goa",
    "description": "Experience the beauty of Goa with a stylish break at Novotel Goa Resort & Spa, nestled near the coast close to the golden sands of Candolim beach and its vibrant nightlife. Your stay includes daily buffet breakfast, two buffet or set menu meals during your stay, one daily glass of beer or house wine per person, and 20% discount on relaxing massages and at one of Goa’s hottest clubs, Toy Beach Club.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Candolim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Novotel Goa Resort and Spa",
    "offer_address": "Pinto Waddo, Off, Candolim Rd, Bardez, Candolim, Goa 403515, India",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 304.0,
    "value": 998.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPSOkQAO",
    "hero_image": "https://images.luxuryescapes.com/kcalfq2djbhnwqw1lctk",
    "image_two": "https://images.luxuryescapes.com/l8wfzaonafry9fajihtl",
    "image_three": "https://images.luxuryescapes.com/seajyovqzpwfar4k6dnn",
    "vendor_name": "Planet Hollywood Beach Resort Goa",
    "title": "Luxury Beachfront Escape at Planet Hollywood Goa with Indulgent Inclusions",
    "description": "Escapes Club invites you to holiday in celebrity style at the first international Planet Hollywood resort. A five-star oasis steps away from the pristine sands of Utorda Beach in South Goa, Planet Hollywood Goa is the perfect backdrop for a sun-kissed holiday. Enjoy daily breakfast, a sumptuous three-course dinner, a cocktail tasting session, an INR1000 credit to be used towards food and drinks, a 30-minute aroma oil head, neck and shoulder massage for adults and convenient return airport transfers. Bring the family along as two kids aged 11 and under stay for free, sharing existing bedding.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "South Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Planet Hollywood Goa OLD",
    "offer_address": "30/3, Acsona Waddo, Uttorda Beach, Salcette, Goa 403713, India",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 306.0,
    "value": 942.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zG2BAAU",
    "hero_image": "https://images.luxuryescapes.com/fftzm9p4k8py3xsd3s1",
    "image_two": "https://images.luxuryescapes.com/pz1lzv5c27mm6sub7p",
    "image_three": "https://images.luxuryescapes.com/tla9p3ybd4rpg54zbhflc",
    "vendor_name": "The Park Baga River",
    "title": "Adults-Only Goa Escape with Decadent Dining, Daily Breakfast & Cocktails",
    "description": "Experience a relaxing vacation by the serene Baga River in North Goa with a stay at The Park Baga River Goa. An adults-only resort, this is a paradise for honeymooners and couples looking for a romantic getaway. A luxurious offering from the renowned The Park brand, this boutique hotel is just an hour's drive from the airport and minutes away from all the major attractions of North Goa. Luxury meets boho chic at The Park Baga River, your sophisticated launchpad right on the edge of the serene Baga River. For a truly relaxing Goan holiday, look no further than this stylish resort.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Arpora",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Park Baga River",
    "offer_address": "The Park, Baga, River Goa, lane, opp. Mackies, Saturday market, Dr. Constancio Mascarenhas, River view, 403516 Goa, Goa 403516",
    "percentage_discount": 55.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 233.0,
    "value": 519.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LiUnAAK",
    "hero_image": "https://images.luxuryescapes.com/npcr4igrr85upkv2jtn",
    "image_two": "https://images.luxuryescapes.com/1e8bhy6tqaqppi9wwej",
    "image_three": "https://images.luxuryescapes.com/fp76ss7wnmim1frqn7gg",
    "vendor_name": "The O Hotel Goa",
    "title": "Glamorous Goa Escape with Direct Beach Access and In-House Casino",
    "description": "Experience a Goa escape with a twist at The O Hotel Goa, an exciting resort that dares to be different. Offering highly sought-after direct Candolim Beach access and an in-house casino within a luxurious, beach-chic setting, this is a stay to remember. Includes daily breakfast, one dinner for two per stay, one 30-minute massage per person, per stay, one nightly cocktail per person and one-time complimentary casino access.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Candolim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The O Hotel Goa",
    "offer_address": "Dando, Near Kingfisher Villa, Aguada - Siolim Rd, Candolim, Goa 403515, India",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 205.0,
    "value": 404.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oQk1AAE",
    "hero_image": "https://images.luxuryescapes.com/4wlous8nslo94dchuq5",
    "image_two": "https://images.luxuryescapes.com/alezs6a3yvem9wvuo99",
    "image_three": "https://images.luxuryescapes.com/ski9dynarhayv9u5fbik",
    "vendor_name": "Hard Rock Hotel Goa",
    "title": "Goa Five-Star Hard Rock Escape in Calangute with Daily Breakfast & Drinks & One Dinner",
    "description": "Welcome to the first and only hotel in India by the famed Hard Rock brand: Hard Rock Hotel Goa is set in the heart of Calangute, a stone's throw from the amazing beaches of North Goa, including Calangute, Baga and Candolim. Known for its world-class hospitality, luxurious accommodation and contemporary amenities, the hotel offers days filled with good food and relaxation, and entertainment-heavy nights with live performances and jam sessions in the comfort of your room.\n\nParty away at the hip and happening Tonic Poolside Bar & Grille - winner of the 'Best Bar with Music' title by Times Food & Nightlife Awards 2020. The bar offers classic cocktails, fruit-infused spirits and delectable Indian fare, with live DJs rocking the ambience. The iconic ROCK SPA® won't let you down with its soothing treatments, and neither will the longest pool in Goa, offering the best spot to relax. The property has many more feathers in its cap, like being named the Best of India Biz Awards' 'Most Happening Entertainment Niche Hotel 2021' and the 'Iconic Signature Style Luxurious Hotel 2021' by Times Group Company. It's time to experience India's favourite tropical paradise the Hard Rock way.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Hard Rock Hotel Goa OLD",
    "offer_address": "370/14, Porba Vaddo Calangute, Bardez Goa, Goa 403516 India",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 180.0,
    "value": 311.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LkJhAAK",
    "hero_image": "https://images.luxuryescapes.com/5noszin897eksoa5nv9a",
    "image_two": "https://images.luxuryescapes.com/hcky30fwymv48uh7rym",
    "image_three": "https://images.luxuryescapes.com/2z2dkr48ar8twonq1wx",
    "vendor_name": "Beleza By The Beach",
    "title": "Goa Beachfront Boutique Escape with Gourmet Dining Experience",
    "description": "Take a break from the city life and head to South Goa's serene Beleza by the Beach. Located by the pristine Colvá Beach, this boutique property is surrounded by lush green paddy fields. Enjoy a revitalising escape by waking up to the sound of the waves of the Arabian Sea and indulging in delicious cuisine while gazing upon stunning views of the paddy fields. Your escape includes daily breakfast for two, one dinner for two, one nightly cocktail per person, one pizza per room and a 30% discount on massages.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Fatona",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Beleza by the Beach",
    "offer_address": "Colva Beach, Thondwaddo, Betalbatim, Goa 403708",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 191.0,
    "value": 398.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aj7qcQAA",
    "hero_image": "https://images.luxuryescapes.com/cvhntxmqgs7aqjey3set",
    "image_two": "https://images.luxuryescapes.com/zfxpcfs8zdtfgwo73jhr",
    "image_three": "https://images.luxuryescapes.com/tt0w2kvk6hkcgpwdzlal",
    "vendor_name": "Lemon tree Amarante beach resort",
    "title": "Heritage Goa Escape with Daily Cocktails and Breakfast",
    "description": "Discover the tropical wonders of India’s favourite beach town, Goa, with Escapes Club. Experience all that Goa has on offer for with a stay at Lemon Tree Amarante Beach Resort, located steps away from the iconic Candolim Beach in North Goa. Your Escapes Club package includes daily breakfast, one daily cocktail per person and one multi-course dinner to share on one night during your stay.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Candolim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Lemon Tree Amarante Beach Resort",
    "offer_address": "Vadi, Candolim, Goa 403515, India",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 247.0,
    "value": 494.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BfwUHAAZ",
    "hero_image": "https://images.luxuryescapes.com/t6zwjzti4h766uzkete",
    "image_two": "https://images.luxuryescapes.com/ic2s6nps8b9cnr9x0ul2",
    "image_three": "https://images.luxuryescapes.com/7c4uq4d5bpsldxe83i",
    "vendor_name": "Azaya Beach Resort",
    "title": "Five-Star Goa Beachfront Luxury with Daily Breakfast, Drinks & Roundtrip Airport Transfers",
    "description": "Your next Goa escape just got an ultra-luxe upgrade: check into the five-star Azaya Beach Resort, a stunning paradise perched on the pristine white sands of Benaulim Beach. Only a 45-minute drive from Goa International Airport and an overnight drive from Bengaluru and Mumbai, this beachfront resort is a cocoon of luxury and tranquility. Spread out over 10 acres, Azaya Beach Resort showcases Goa's Portuguese past with various design influences in its architecture and is also reminiscent of luxurious Maldivian resorts with uninterrupted sea views and powder-soft white sand at your doorstep. The hotel has a unique architecture with numerous picture-perfect backdrops. The beachfront location plus easy access to the Arabian Sea and Benaulim Beach makes this the perfect South Goan paradise.\n\nLocated conveniently close to some of South Goa's major attractions, Azaya Beach Resort is a destination in itself. Choose rooms with a personal plunge pool or garden and you'll have no reason to step out of the resort at all. Multiple dining options onsite promise unparalleled gastronomic experiences, plus, if you are planning a big celebration, Azaya Beach Resort is the place for big occasions.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Benaulim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Azaya Beach Resort",
    "offer_address": "Village Calwaddo, Benaulim, Goa, India 403716",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 6,
    "price": 455.0,
    "value": 1199.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjxqAAC",
    "hero_image": "https://images.luxuryescapes.com/b4togz3dfyc4b5jc7i05",
    "image_two": "https://images.luxuryescapes.com/330uvblv2385pornsl",
    "image_three": "https://images.luxuryescapes.com/xld2ajxllxca2hxr8pp",
    "vendor_name": "The Postcard Hotels and Resorts Corporate Office",
    "title": "Luxurious Goa Escape at a Collection of Boutique Hotels with Daily Dining",
    "description": "Experience the unique beauty of Goa, travelling through the north and old town, staying at two boutique properties by The Postcard: a collection of idyllic hotels by leaders trained in the art of luxury by the renowned Oberoi brand. With transformative experiences and the local community at the heart of The Postcard collection, you can expect intimate service as you encounter UNESCO World Heritage-listed buildings, beautiful beaches and breathtaking wildlife.\n\nSpend three nights at The Postcard Moira and three nights at The Postcard Velha (with return transfers from Goa Airport and transfers between properties included), with daily all-day breakfast, three-course dinner every night at all hotels, one nightly glass of wine or beer per adult, one 60-minute spa treatment per adult, per stay in Velha, a choice of a fascinating cooking class or an authentic local guided walk in Moira per stay and a 20% discount on dining, drinks and spa treatments.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Postcard Hotels Collection OLD",
    "offer_address": "House no -497, Calzor, Moira, Goa 403507, India",
    "percentage_discount": 62.0,
    "min_duration": 6,
    "max_duration": 9,
    "price": 1244.0,
    "value": 3236.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eNBxtQAG",
    "hero_image": "https://images.luxuryescapes.com/142374hs083hzr3qvib",
    "image_two": "https://images.luxuryescapes.com/z7s1shnx6otyx6pdi0xq",
    "image_three": "https://images.luxuryescapes.com/wo19q28ugh72te52hzga",
    "vendor_name": "W Goa",
    "title": "W Glamour in North Goa with Nightly Drinks",
    "description": "Live the VIP lifestyle at the ultra-glam W Goa, one of the most sought-after resorts in North Goa, sister property to iconic W Bali and W Koh Samui. Set on the pristine shores of beautiful Vagator Beach, W Goa sets the stage for a tropical escape like no others, where you will be able to party, relax and rejuvenate your body all in one spot.\n\nYour luxe escape includes daily buffet breakfast, a nightly drink per person, a dinner once during your stay, 20% discount on food, drinks and spa treatments and complimentary Wi-Fi.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Vagator",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "W Goa",
    "offer_address": "Vagator Beach, Goa 403509, India",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 387.0,
    "value": 625.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Uvqx0QAB",
    "hero_image": "https://images.luxuryescapes.com/bcvxi8rmtgrz8yfesw7c",
    "image_two": "https://images.luxuryescapes.com/hw0m3ipl5rrkasbjbw9c",
    "image_three": "https://images.luxuryescapes.com/ewojuietptmkkyrttshn",
    "vendor_name": "Surya Kiran Heritage hotel",
    "title": "Goa: Heritage Stay in India’s Favourite Beach Town",
    "description": "Experience the tropical beauty of the golden-sand beaches, floating casinos, jungle-covered countryside, oceanfront seafood restaurants and spectacular sunsets of India's favourite beach town of Goa with three nights at Surya Kiran Heritage Hotel. Includes daily breakfast, a bottle of wine, two four-course lunches or dinners and complimentary Wi-Fi.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Panaji",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Surya Kiran Heritage Hotel",
    "offer_address": "Panaji, Goa 403001, India",
    "percentage_discount": 33.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 385.0,
    "value": 574.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cLJ9mQAG",
    "hero_image": "https://images.luxuryescapes.com/ugrbtlvnyb85c2zl47dp",
    "image_two": "https://images.luxuryescapes.com/ml20cxbg0l9vdsrjgdfc",
    "image_three": "https://images.luxuryescapes.com/kn1n3xio2lse9b1g7ajm",
    "vendor_name": "DoubleTree by Hilton Goa Panaji",
    "title": "Grand-Opening: DoubleTree by Hilton Luxury in the Heart of Goa",
    "description": "Make the newly opened DoubleTree By Hilton Goa - Panaji your base for your next Goa getaway, conveniently located within easy access of the bustling north and the tranquil south. This fantastic new property offers great views of the Mandovi River and the superior service the Hilton brand has become synonymous with. The hotel's close proximity to the shops, restaurants, nightlife spots and casinos makes the holiday experience even sweeter. Enjoy daily breakfast for two, INR2,500 meal credit per room (inc. taxes) and one nightly beer per person, plus a complimentary upgrade to a river-view room.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Panaji",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "DoubleTree By Hilton Goa - Panaji",
    "offer_address": "Kadamba Plateau, Panjim Old Goa Bypass Road Panaji, Velha Goa, Goa 403006, India",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 296.0,
    "value": 759.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bfSnlQAE",
    "hero_image": "https://images.luxuryescapes.com/gerz17j17sq8gvziuk7s",
    "image_two": "https://images.luxuryescapes.com/xecgqskntu7zar068ui2",
    "image_three": "https://images.luxuryescapes.com/jjg61p17xnmfvea1nrs6",
    "vendor_name": "The Acacia Morjim, Ocean Front",
    "title": "Grand Opening: Clifftop Retreat in Goa with Fabulous Dining Inclusions",
    "description": "Picture this: you and your better half relaxing by an infinity pool with a refreshing cocktail in hand at a beautiful clifftop resort by the Arabian Sea. Make that dream a reality with an Escapes Club getaway at the newly-opened Acacia Morjim Ocean Front Resort. This resort is ideal for anyone seeking to escape the city and unwind in total peace and quiet. Treat yourself to an amazing getaway with one luxurious 45-minute massage each, one lunch and one dinner at TOAST Restaurant, one nightly cocktail each and daily buffet breakfast.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Acacia Morjim Ocean View OLD",
    "offer_address": "H.No- 737, Main Morjim - Ashvem Road, Navo Waddo, Goa 403512, India",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 238.0,
    "value": 497.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LgrvAAC",
    "hero_image": "https://images.luxuryescapes.com/tmovjpy9qwe7ue7u6ak",
    "image_two": "https://images.luxuryescapes.com/zh3e54r40pskp735gikp",
    "image_three": "https://images.luxuryescapes.com/73uxfjrvqypyjayfxj",
    "vendor_name": "Anamiva Goa",
    "title": "Grand Opening: Experience Goa's Newest Boutique Hotel with Dining Inclusions",
    "description": "Experience the beauty of Goa, India's go-to holiday destination, with a stay at the newest property in the area: the beautiful Anamiva Goa, a boutique retreat nestled near the golden sands of Anjuna Beach and its vibrant nightlife. Escape the hustle and bustle of the city and embrace the relaxed vibes of Goa at this stylish hotel as you indulge in daily breakfast, a dinner for two and nightly cocktails.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Anjuna",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "AM Hotel Kollection - Anamiva, Goa",
    "offer_address": "Ānamiva, Goa, House #1259/2 & 1259/3, Survey Number 509/1A, Gaonwadi, Anjuna, Goa 403509, India",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 118.0,
    "value": 175.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070uuHAAQ",
    "hero_image": "https://images.luxuryescapes.com/s3fflww2pn06xkarkip7",
    "image_two": "https://images.luxuryescapes.com/a3h5ilqoxilt7ptlhf8g",
    "image_three": "https://images.luxuryescapes.com/kety4npuplfcilym6xjr",
    "vendor_name": "Fort Tiracol Heritage Hotel",
    "title": "Heritage Clifftop Goa Escape with Daily Breakfast, Nightly Dinner & Daily Drinks",
    "description": "Escape Goa's crowds with a stay at Fort Tiracol Heritage Hotel, a 17th-century former Portugese fortress situated between the serene Tiracol river and the majestic Arabian Sea.\n\nPerched on a cliff overlooking the shimmering sea at the northern tip of Goa, the hotel has just seven rooms and suites. The historic features of this once-armed Portuguese defense fort make for an entirely unique hotel experience. Just a two-hour drive from the Goa Airport and conveniently accessed from most major metro areas, this is Goa like you've never seen it before. A Baroque-style hotel, ranked within the top 10% of properties on Tripadvisor, featuring a majestic church and a famous restaurant promises a sublime stay unlike any other.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Tiracol",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Fort Tiracol Heritage Hotel",
    "offer_address": "Terekhol Village, Pernem Taluka, Tiracol, Goa 403524, India",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 215.0,
    "value": 388.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bhT9MQAU",
    "hero_image": "https://images.luxuryescapes.com/mvw99044kmht5braj9m8",
    "image_two": "https://images.luxuryescapes.com/reixq6k9kbxwv1ljg8a",
    "image_three": "https://images.luxuryescapes.com/ujuieknz66jry7gklc6",
    "vendor_name": "The Postcard Velha",
    "title": "A Private Luxury Retreat in Goa",
    "description": "Away from the hustle bustle of commercial Goa and perched atop the vast Champakali estate of, is the Postcard Velha. Located in the tranquil old Goa, the hotel offers verdant views that overlook 300 acres of virgin coconut plantations and the magnificent Mandovi River Delta. Luxuriate in this modernist colonial hideout on a two or three-night Escapes Club getaway, including a three-course dinner, daily glass of wine or beer, daily breakfast, complimentary Wi-Fi and a one-way airport transfer.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Postcard Velha 2019",
    "offer_address": "H.No.D-69/4/5 After Gandhi Circle, Before Church of Our Lady of Mount, Ella Velha, Velha Goa, Goa 403402, India",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 411.0,
    "value": 957.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlhWAAS",
    "hero_image": "https://images.luxuryescapes.com/2wg2abplek41czrl4pdf",
    "image_two": "https://images.luxuryescapes.com/v1j6b9sw4bm46m8yg94u",
    "image_three": "https://images.luxuryescapes.com/a3n9pkf46uhzyikt12",
    "vendor_name": "The Postcard Moira",
    "title": "Find Paradise at The Postcard Moira with Daily Dining & Nightly Drinks",
    "description": "A paradise nestled in the quaint village of Moira in North Goa, The Postcard Moira is where luxurious seclusion meets exotic natural beauty. This carefully restored 214-year-old ancestral home is located in one of the four heritage villages of Goa, making it one of a kind. The Postcard group of hotels is known for its special focus on the slow pace of life, which reflects in their heartwarming Portuguese architecture and attentive services. Break free from the age-old convention of set check-in and check-out times and enjoy a carefree vacation here. Includes daily breakfast and dinner, 20% discount on spa, food and beverages, complimentary Wi-Fi, a glass of wine or beer every evening and return airport transfers.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Moira",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Postcard Moira",
    "offer_address": "497, Calizor, Moira, Moira, Goa 403507",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 384.0,
    "value": 1009.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CBEaAAO",
    "hero_image": "https://images.luxuryescapes.com/vwgvenn9znkm2lmerad",
    "image_two": "https://images.luxuryescapes.com/hu6eaajnykteisulbx3b",
    "image_three": "https://images.luxuryescapes.com/y6tgiyzdiy96nrvz3m",
    "vendor_name": "Radisson Blu Resort Goa Cavelossim Beach",
    "title": "Five-Star South Goa Radisson Stay near Beachfront with Daily Breakfast",
    "description": "Explore South Goa with a stay at Radisson Blu Resort Goa Cavelossim Beach, a five-star resort with direct access to the stunning Cavelossim Beach, just 250 metres away. Located at a driving distance of about 11-12 hours from Mumbai and Bengaluru and a 45-minute drive from the Goa International Airport (GOI), this gorgeous Radisson property makes for easy-to-reach relaxation. Indulgent accommodation, charming Goan hospitality, three amazing onsite dining options, a tranquil spa and two sparkling swimming pools: turn your average Goan vacation into an extraordinary one at this beautifully designed resort, the ultimate stay for travellers searching for a perfect 'seascape'.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Cavelossim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Radisson Blu Resort Goa Cavelossim Beach",
    "offer_address": "Cavelossim Beach, Goa 403731, India",
    "percentage_discount": 33.0,
    "min_duration": 3,
    "max_duration": 6,
    "price": 319.0,
    "value": 473.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bhTMkQAM",
    "hero_image": "https://images.luxuryescapes.com/sx7ktx2p1ldhhuikq6r4",
    "image_two": "https://images.luxuryescapes.com/sjrzzrfs2ojtu7ziqf3c",
    "image_three": "https://images.luxuryescapes.com/gcbaiwguqf0lwpt3isyk",
    "vendor_name": "The Postcard Cuelim",
    "title": "2019 Discover Intimate Luxury at a Brand-New Boutique Palace",
    "description": "A new boutique collection of luxury hotels by leaders trained in the art of luxury by Oberoi hotels introduces The Postcard Cuelim - a unique, 350-year-old palace situated in the quaint neighbourhood of Cuelim in South Goa. Join Escapes Club and discover stunning architecture and historical significance as you enjoy a three-course dinner for two, daily breakfast, one daily glass of beer or wine each and a convenient airport pick-up from Goa International Airport on arrival. Plus, one child aged 11 and under can stay for free with all inclusions.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "South Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Postcard Cuelim - 2019",
    "offer_address": "Dr TB Cunha Road, Cansaulim, Goa 403712, India",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 399.0,
    "value": 957.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bhTYvQAM",
    "hero_image": "https://images.luxuryescapes.com/w4v3oknnwegccod6x5vi",
    "image_two": "https://images.luxuryescapes.com/ddgigxf2iye9qskrsqwu",
    "image_three": "https://images.luxuryescapes.com/acavcoagowa5xwnkkyka",
    "vendor_name": "The Postcard Hotels and Resorts Corporate Office",
    "title": "North, South & Old Goa: An Incredible India Experience, Staying in Stunning New Boutique Properties",
    "description": "Experience the unique beauty of Goa with Escapes Club, travelling through the north, south and old town, and staying at three The Postcard properties, a new boutique collection of hotels by leaders trained in the art of luxury by the renowned Oberoi brand. With transformative experiences and the local community at the heart of The Postcard collection, you can expect intimate service as you encounter UNESCO World Heritage-listed buildings, beautiful beaches and breathtaking wildlife on your travels. Spend two nights at The Postcard Moira, Velha and Cuelim, enjoying daily breakfast and one three-course dinner at each of the three properties. Travel with ease, with inter-hotel and airport transfers included throughout, plus one nightly glass of wine or beer, one 30-minute spa treatment per person in Velha and one fascinating nature experience in Moira.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Postcard Hotels Collection 2019",
    "offer_address": "House no -497, Calzor, Moira, Goa 403507, India",
    "percentage_discount": 58.0,
    "min_duration": 6,
    "max_duration": 9,
    "price": 1235.0,
    "value": 2975.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000db7iiQAA",
    "hero_image": "https://images.luxuryescapes.com/nn9xbmx6grlx82u349rd",
    "image_two": "https://images.luxuryescapes.com/p78ggn8n68h8plihbe",
    "image_three": "https://images.luxuryescapes.com/z4ghuopby2racqz282n",
    "vendor_name": "Fort Tiracol Heritage Hotel",
    "title": "Historic Clifftop Fortress Stay with Daily Breakfast and Dinner",
    "description": "Perched atop a cliff overlooking the Arabian Sea, Fort Tiracol Heritage Hotel offers a much-needed break, and a unique experience steeped in history. True to its name, this magnificent edifice was once a Portuguese armed fortress that has witnessed many a battle before being transformed into to an idyllic beachside resort. Embrace the charm of this heritage property and enjoy daily set menu breakfast, daily three-course dinner and a glass of wine or beer for up to two people.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Fort Tiracol Heritage Hotel OLD",
    "offer_address": "Pernem Taluka, Tiracol, 403524, India",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 188.0,
    "value": 353.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvIK5QAN",
    "hero_image": "https://images.luxuryescapes.com/a4aej4zvspjgrsbrarm9",
    "image_two": "https://images.luxuryescapes.com/z7jtezfyrohbbjvtax2f",
    "image_three": "https://images.luxuryescapes.com/efx6o8okirwiclnt5ehs",
    "vendor_name": "Alila Diwa Goa",
    "title": "Chic Design Hotel in Southern Goa",
    "description": "Escape to the beautiful beaches of Goa and treat yourself to a stylish getaway at Alila Diwa Goa. Stay five days/four nights and enjoy daily buffet breakfasts, one buffet lunch, one three-course dinner, one 45-minute massage for each adult, INR6,000 hotel credit per room, complimentary cocktail each and return airport transfers for two.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Alila Diwa Goa OLD",
    "offer_address": "48/10, Adao Waddo, Salcette, Majorda, Goa 403713, India",
    "percentage_discount": 51.0,
    "min_duration": 4,
    "max_duration": 4,
    "price": 510.0,
    "value": 1039.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LriCAAS",
    "hero_image": "https://images.luxuryescapes.com/i5gw0ok5kc7xot03tbmo",
    "image_two": "https://images.luxuryescapes.com/u1pvh2jcnpm00q4hflka",
    "image_three": "https://images.luxuryescapes.com/jyh11ws33ve13xx4it6",
    "vendor_name": "Country Inn & Suites By Radisson, Goa Candolim",
    "title": "North Goa Radisson Stay near Candolim Beach with Daily Breakfast & Cocktails",
    "description": "Experience the unique magic of North Goa with a stay at the spectacular Country Inn & Suites by Radisson, Goa Candolim. Nestled in the heart of North Goa, this tranquil resort is just minutes from scenic Candolim Beach and is bursting with old-world charm. Offering luxury synonymous with the world-renowned Radisson brand, the resort features sophisticated accommodation scattered across beautifully landscaped gardens and three amazing onsite dining options.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Candolim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Country Inn & Suites by Radisson, Goa Candolim",
    "offer_address": "Bamonvaddo, Candolim, Goa 403515",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 78.0,
    "value": 169.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PyByAAK",
    "hero_image": "https://images.luxuryescapes.com/mmfm5qfjyyk0qqr87n8",
    "image_two": "https://images.luxuryescapes.com/7gcf6v7htqltl56g305e",
    "image_three": "https://images.luxuryescapes.com/ecj5kkwkabdbq6lqcfgg",
    "vendor_name": "Azaya Beach Resort",
    "title": "Five-Star Goa Beachfront Luxury with Daily Breakfast, Dining Credit & Roundtrip Airport Transfers",
    "description": "Your next Goa escape just got an ultra-luxe upgrade: check into the five-star Azaya Beach Resort, a stunning paradise perched on the pristine white sands of Benaulim Beach. Only a 45-minute drive from Goa International Airport, this beachfront resort is a cocoon of luxury and tranquility. Spread out over 10 acres, Azaya Beach Resort proudly showcases Goa's Portuguese past in its architecture, reminiscent also of luxurious Maldivian resorts. Uninterrupted Goan shoreline views plus easy access to the Arabian Sea and Benaulim Beach make this the perfect South Goan paradise.\n\nLocated conveniently close to some of South Goa's major attractions, Azaya Beach Resort is a destination in itself. Choose rooms with a personal plunge pool or garden and you'll have no reason to step out of the resort at all. Multiple dining options onsite promise unparalleled gastronomic experiences, plus, if you are planning a big celebration, Azaya Beach Resort is the place for big occasions.\n\n**Your handpicked inclusions:**\n\n- Get welcomed on arrival with a choice of alcoholic or non-alcoholic drink\n- Every morning, fuel up with a buffet breakfast at La Concha restaurant\n- Indulge in delicious meals with INR2,000 daily dining credit per package (only applicable on food; credit does not accumulate and must be used daily)\n- Toast your escape with one daily cocktail, glass of wine or beer per adult at Lynx Bar & Lounge\n- Don't worry about a thing with private roundtrip airport transfers\n- Make the most of your stay with a 15% discount on soft drinks and dining\n- Enjoy a 10% discount on alcohol, spa and laundry services\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** Two children (five and under) stay free in existing bedding with all package inclusions (except alcohol).\n\n**Private pool upgrades available**: Enjoy the ultimate luxury when you upgrade to an Essence Plunge Pool Room or an Essence Plunge Pool XL Room with an even bigger private pool.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Benaulim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Azaya Beach Resort OLDER ONE",
    "offer_address": "336/0, Village Calwaddo, Benaulim, Goa 403716",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 6,
    "price": 391.0,
    "value": 1177.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009FJfnAAG",
    "hero_image": "https://images.luxuryescapes.com/wc5ospsi5a87731cv3xc",
    "image_two": "https://images.luxuryescapes.com/6ntk50u48dwrln9akbb",
    "image_three": "https://images.luxuryescapes.com/sytxkkki2kgk3xy9t6ua",
    "vendor_name": "Radisson Resort Goa Baga",
    "title": "Grand Opening: North Goa Radisson Stay near Baga Beach with Daily Breakfast, Dinner & Drinks",
    "description": "Radisson Hotels makes a triumphant return to North Goa with the Radisson Resort Goa Baga, a brand-new paradise offering sun, sand and relaxation just 800 metres from Baga Beach. Located an hour's drive from Dabolim Airport and 11 hours from Bengaluru and Mumbai, this resort is ideal for quick weekend escapes. With stylish rooms to unwind in, an excellent restaurant to take you on culinary adventures, a bar to toast your holiday and a gorgeous outdoor pool, this resort is suitable for business and leisure travellers alike.\n\nA super central location ensures that you're near some of North Goa's most loved tourist attractions, including the upbeat Saturday Night Market, glitzy nightclubs, and some of the best beaches in the area. Culture enthusiasts will be delighted to find World Heritage-listed architectural marvels near the resort, while travellers looking for adventure can organise a variety of outdoor activities, watersports or guided tours of the area.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Arpora",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Radisson Resort Goa Baga",
    "offer_address": "Survey No.155/1-E & F Baga, Road, Arpora, Goa 403516",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 282.0,
    "value": 512.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3aOUQAZ",
    "hero_image": "https://images.luxuryescapes.com/vcckefszb0ojb7uyslcx",
    "image_two": "https://images.luxuryescapes.com/pv7u3owzewh3fazatplr",
    "image_three": "https://images.luxuryescapes.com/whnb6hn6afqmys8yskl6",
    "vendor_name": "Resort Rio Goa",
    "title": "Spectacular Goa Escape with Gourmet Inclusions",
    "description": "Escapes Club invites you to leave it all behind and discover the tropical coastal state of Goa, where palm-fringed beaches meet rich culture and tantalising cuisine. Stay in the five-star, award-winning Resort Rio, nestled on the banks of the Baga river in Arpora. Live the VIP life with daily buffet breakfast, one buffet dining experience, two alcoholic beverages per person on one evening of your stay, and a 15-minute head and shoulder massage per person.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Resort Rio OLD",
    "offer_address": "Tambudki, 403518 Arpora, India",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 293.0,
    "value": 573.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlhgAAC",
    "hero_image": "https://images.luxuryescapes.com/fjyufjq24f3k7py5hj4",
    "image_two": "https://images.luxuryescapes.com/9ie4hkhs6ttmombdqtsd",
    "image_three": "https://images.luxuryescapes.com/gg9vfltcsfgv57omi19s",
    "vendor_name": "The Postcard Cuelim",
    "title": "Unwind in Goa’s Newest Luxury Hotel",
    "description": "The Postcard Cuelim redefines intimate luxury with its charming Portuguese setting, a special focus on a unique Goan experience and heartwarming services. Overlooking 3,500 acres of paddy fields, this 350-year-old boutique palace promises a Goan getaway like no other. The biggest catch? You have to pick your own check-in and check-out times in this unconventional hotel. Included in your Luxury Escape is daily breakfast which can be enjoyed at any time of the day, daily three-course set-menu dinner, a glass of beer/house wine every evening (one drink per person each), return airport transfers, and a 20% discount on F&B and Spa treatments. Plus, one child aged 11 and under can stay for free with all inclusions.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Consua",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Postcard Cuelim",
    "offer_address": "64 T.B Cunha Road Cuelim, Cansaulim, Goa 403712, India",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 385.0,
    "value": 1077.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RAyOJQA1",
    "hero_image": "https://images.luxuryescapes.com/unzd3hvb3cvikkjxgswi",
    "image_two": "https://images.luxuryescapes.com/fzfa4pvrokqplt3xedcp",
    "image_three": "https://images.luxuryescapes.com/bn8xu7vpjsvfbvtjydxa",
    "vendor_name": "Planet Hollywood Beach Resort Goa",
    "title": "Five-Star Beach Getaway at Planet Hollywood",
    "description": "Experience the first international Planet Hollywood hotel. Spend five days/four nights in a Superior Garden View Room at Planet Hollywood Goa and enjoy daily buffet breakfasts, nightly buffet dinners, one cocktail tasting session per stay and return airport transfers for two adults. Plus up to two kids (aged 11 and under) stay free!",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "South Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Planet Hollywood Goa 2018",
    "offer_address": "30/3, Acsona Waddo, Uttorda Beach, Salcette, Goa 403713, India",
    "percentage_discount": 68.0,
    "min_duration": 4,
    "max_duration": 4,
    "price": 406.0,
    "value": 1251.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mOmiAAE",
    "hero_image": "https://images.luxuryescapes.com/377tyk76u6x2qqafdn19",
    "image_two": "https://images.luxuryescapes.com/v7gk52ctccoqd7h2nm",
    "image_three": "https://images.luxuryescapes.com/fxutxzxih6kh37k3idl",
    "vendor_name": "Jasminn South Goa",
    "title": "South Goa Boutique Escape with Daily Breakfast & Daily Drinks",
    "description": "A beautiful property tucked away in the serene village of Betalbatim, Jasminn South Goa - AM Hotel Kollection is an idyllic escape for all kinds of travellers. A mere 30-minute drive from Dabolim International Airport (GOI) and an overnight journey from major metro cities like Bengaluru and Mumbai, this South Goa paradise offers you all the fun you'd expect from the ultimate holiday city. Winner of the Tripadvisor Travellers' Choice Award (2020, 2021), this property won't disappoint you.\n\nPart of the iconic AM Hotel Kollection, the hotel has 55 luxurious rooms that combine the charming local vibe beautifully with every essential comfort and amenity. A choice of two swimming pools to dive into, a multi-cuisine restaurant and a hospitality team that stops at nothing to make you feel at home complete the stay. Not to mention the iconic beaches of South Goa are minutes away, so surf's up, travellers!",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Fatona",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Jasminn South Goa - AM Hotel Kollection",
    "offer_address": "No.79, Nagwaddo, Fatona, Betalbatim, Goa 403713 India",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 6,
    "price": 145.0,
    "value": 370.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cpkMDQAY",
    "hero_image": "https://images.luxuryescapes.com/ys147q0udup68bems1j9",
    "image_two": "https://images.luxuryescapes.com/psx9b3fmjly2rd1g9mj8",
    "image_three": "https://images.luxuryescapes.com/b5rzrit8hjosk0iq04p",
    "vendor_name": "Maravilha",
    "title": "Grand Opening: Boutique Heritage Stay in North Goa",
    "description": "Welcome to Maravilha in Goa, an impeccably restored, 200-year-old heritage villa, now offering boutique accommodation 20 minutes’ drive from the popular beaches like Anjuna and Baga. This brand-new property makes for a stunning heritage getaway with traditional Goan hospitality and authentic Goan cuisine at the award-winning Mum's Kitchen. Includes daily breakfast, one dinner for two and two nightly glasses of wine or beer per person.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Assagao",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Maravilha",
    "offer_address": "Maravilha, H. No. 189, Near Central Bank, Mazal Waddo, Assagao, Goa 403507, India",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 267.0,
    "value": 624.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zMTEAA2",
    "hero_image": "https://images.luxuryescapes.com/pgkq90go7mx9v2ol1uzo",
    "image_two": "https://images.luxuryescapes.com/uo28ojrsuh92y2uq27g3",
    "image_three": "https://images.luxuryescapes.com/5d48694tbw692aosu478",
    "vendor_name": "Novotel Goa Dona Sylvia Resort",
    "title": "Novotel Goa Five-Star Beachfront Villas with Daily Breakfast & Drinks",
    "description": "It's time to take your Goa escape to new levels of luxury with a stay at Novotel Goa Dona Sylvia Resort.\n\nPerched on pristine Cavelossim Beach in South Goa, this lavish resort is embellished with exquisite villas scattered across 20 acres of lush gardens and swaying palm trees. Embrace the languid and laidback life that is so characteristic of Goa with five-star luxury and panoramic views of the Arabian Sea. An hour's drive from Goa International Airport, this Portuguese-inspired retreat promises to slow down your hectic pace to a tranquil tempo.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Cavelossim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Novotel Goa Dona Sylvia Resort OLDER",
    "offer_address": "Cavelossim, Goa 403731",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 176.0,
    "value": 382.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlhbAAC",
    "hero_image": "https://images.luxuryescapes.com/13oihvrsxgyl240il4f",
    "image_two": "https://images.luxuryescapes.com/jfba2jaw12zztx53gxau",
    "image_three": "https://images.luxuryescapes.com/m7pcxb9g8iqmvn7fb8u",
    "vendor_name": "The Postcard Velha",
    "title": "Secluded Luxury with Dining Inclusions & Nightly Drinks",
    "description": "Experience complete privacy in one of Old Goa’s untouched treasures, The Postcard Velha. Located smack-bang in the middle of the sprawling Champakali Estate, this stunning property overlooks 300 acres of virgin coconut plantations and the picturesque Mandovi River Delta. Enjoy a picture-perfect vacation with daily breakfast and dinner, a daily glass of wine or beer, complimentary Wi-Fi and return airport transfers.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Panaji",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Postcard Velha",
    "offer_address": "D-69/4/5 After Gandhi Circle, Before Church of Our Lady of Mount, Ella Velha, Goa Velha, Goa 403402",
    "percentage_discount": 65.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 384.0,
    "value": 1099.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004RsPfAAK",
    "hero_image": "https://images.luxuryescapes.com/qtm0in2s27kb3ul4nlw",
    "image_two": "https://images.luxuryescapes.com/flllx93f3e86wc736pu",
    "image_three": "https://images.luxuryescapes.com/0sy8jre07imka9am7q2f",
    "vendor_name": "Hard Rock Hotel Goa",
    "title": "Glamorous Hard Rock Goa Family Escape with Daily Breakfast & Cocktails",
    "description": "Get a taste of the luxury and unparalleled entertainment synonymous with the Hard Rock brand in sunny Goa. Tucked away in the north of the state, just five minutes from Calangute Beach, Hard Rock Hotel Goa is a glamorous escape, perfect for families, friends and couples. With the longest pool in Goa, exciting dining options and bespoke service, this luxurious hotel has all the ingredients for a celebrity-worthy experience. Don't leave without trying the Sound of Your Stay® program, where music lovers can enjoy free tracks, picks and wax, and create the soundtrack to their stay.\n\n**Your handpicked inclusions:**\n\n- Begin each day of your Hard Rock adventure with a delicious breakfast\n- Enjoy one dinner at multi-cuisine restaurant Sessions per stay\n- Unwind in the evening with one cocktail per adult, per night\n- Say goodbye to stress with a 15% discount on spa treatments throughout your stay\n\n**Travelling with family?** Two kids (aged eight years and under) stay free in existing bedding with all inclusions per package purchased.\n\n**This deal has NO surcharges:** Travel any time for the same great price.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Hard Rock Hotel Goa Old",
    "offer_address": "370/14, Bishop Alex Dias Road, Porba Vaddo, Bardez, Calangute, Goa 403516",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 153.0,
    "value": 289.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biK9SQAU",
    "hero_image": "https://images.luxuryescapes.com/h96gnbdvgtdbrg0otjwx",
    "image_two": "https://images.luxuryescapes.com/gfo4ko14bdqig8mhx2oa",
    "image_three": "https://images.luxuryescapes.com/akfps9nujenhqrxgsdpc",
    "vendor_name": "Country Inn & Suites By Radisson, Goa Candolim",
    "title": "Radisson Resort Getaway in the Heart of North Goa",
    "description": "Join Escapes Club on a trip to India’s favourite beach town, Goa, and discover the coastal wonders staying just a few minutes’ drive from Candolim, Calangute and Baga beaches at Country Inn & Suites By Radisson, Goa Candolim. Stay just a 15-minute walk from famous Candolim Beach and enjoy an Escapes Club package with inclusions like: daily buffet breakfast, one buffet dinner for two on one night during your stay, one daily cocktail each and one 30-minute massage each.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "North Goa",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Country Inn & Suites By Radisson, Goa Candolim OLD",
    "offer_address": "Bammon Vaddo, Candolim, Goa 403515, India",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 220.0,
    "value": 448.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008J80aAAC",
    "hero_image": "https://images.luxuryescapes.com/jacm54xksr78bg0057z",
    "image_two": "https://images.luxuryescapes.com/ijewlqo1pq184u0ldqgm",
    "image_three": "https://images.luxuryescapes.com/dqei7xpahjwj6sgvq3g",
    "vendor_name": "Hard Rock Hotel Goa",
    "title": "Goa Five-Star Hard Rock Escape in Calangute with Daily Breakfast, Daily Drinks & One Dinner",
    "description": "Welcome to the first and only hotel in India by the famed Hard Rock brand: Hard Rock Hotel Goa is set in the heart of Calangute, a stone's throw from the amazing beaches of North Goa, including Calangute, Baga and Candolim. Known for its world-class hospitality, luxurious accommodation and contemporary amenities, the hotel offers days filled with good food and relaxation, and entertainment-heavy nights with live performances and jam sessions in the comfort of your room.\n\nParty away at the hip and happening Tonic Poolside Bar & Grille - winner of the 'Best Bar with Music' title by Times Food & Nightlife Awards 2020. The bar offers classic cocktails, fruit-infused spirits and delectable Indian fare, with live DJs rocking the ambience. The iconic ROCK SPA® won't let you down with its soothing treatments, and neither will the longest pool in Goa, offering the best spot to relax. The property has many more feathers in its cap, like being named the Best of India Biz Awards' 'Most Happening Entertainment Niche Hotel 2021' and the 'Iconic Signature Style Luxurious Hotel 2021' by Times Group Company. It's time to experience India's favourite tropical paradise the Hard Rock way.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Calangute",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Hard Rock Hotel Goa",
    "offer_address": "370/14, Porba Vaddo Calangute, Bardez Goa, Goa 403516 India",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 207.0,
    "value": 305.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003ID4OAAW",
    "hero_image": "https://images.luxuryescapes.com/ejxihwz8rdosikn8v1g",
    "image_two": "https://images.luxuryescapes.com/f46j4jstt1nggxymbc",
    "image_three": "https://images.luxuryescapes.com/ng7ggahypnq41qdid",
    "vendor_name": "Radisson Blu Resort Goa Cavelossim Beach",
    "title": "Five-Star South Goa Radisson Stay near Cavelossim Beach with Daily Breakfast & Cocktails",
    "description": "Explore South Goa with a stay at Radisson Blu Resort Goa Cavelossim Beach, a five-star resort with direct access to the stunning Cavelossim Beach, just 250 metres away. Turn your average Goan vacation into an extraordinary one at this beautifully designed resort, which offers indulgent accommodation, charming Goan hospitality, three amazing onsite dining options and two sparkling swimming pools. This is the ultimate escape for travellers searching for a perfect 'seascape'.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Cavelossim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Radisson Blu Resort Goa Cavelossim Beach OLD",
    "offer_address": "Cavelossim, Beach, Mobor Beach, Goa 403001",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 166.0,
    "value": 336.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zYSQAA2",
    "hero_image": "https://images.luxuryescapes.com/45npmbftt812b10yzdzm",
    "image_two": "https://images.luxuryescapes.com/u261p71dji4d0fv637",
    "image_three": "https://images.luxuryescapes.com/sntdqkxu49nd74b5pem3",
    "vendor_name": "Mercure Goa Devaaya Retreat",
    "title": "Riverfront Goa Resort on Divar Island with Daily Breakfast, One Dinner & Drinks",
    "description": "Bored of the stereotypical Goan holiday? Look at the beachside state with a whole new perspective with a stay at Mercure Goa Devaaya Resort, a gorgeous resort nestled on the pristine Divar Island.\n\nMerely 10 minutes from the urban buzz of Panaji and less than an hour from Goa Airport, this serene resort, ranked within the top 10% of properties on Tripadvisor, overlooks the stunning Mandovi River and features Portuguese-styled villas and rooms scattered across a lush landscape of four acres. Take a break from the party life synonymous with Goa and enjoy a tranquil vacation in the most alluring setting in India's favourite tropical paradise. Plus, if you end up craving the classic Goan experiences, the resort is a few minutes drive from Old Goa's attractions and thrilling casinos.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Panaji",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Mercure Goa Devaaya Resort",
    "offer_address": "Divar Island, Goa 403403",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 103.0,
    "value": 229.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Aa7yJAAR",
    "hero_image": "https://images.luxuryescapes.com/onc8ckcvqa0ewwlt9kd4",
    "image_two": "https://images.luxuryescapes.com/qxvok2prsuvzddr90gp4",
    "image_three": "https://images.luxuryescapes.com/j821og3s1egp4p73xcga",
    "vendor_name": "The Leela Goa",
    "title": "Five-Star Goa Beachside Golf Retreat with Eight Restaurants & Bars",
    "description": "Perfectly placed between lotus-filled lagoons and the gleaming Arabian Sea, The Leela Goa offers five-star beachside luxury complemented by a powerful blend of old-world hospitality and stunning natural splendour. Built on Goa’s unique principle of ‘susegad' and the concept of slow living, the resort's dazzling collection of facilities presents the perfect opportunity to embrace a different pace. Admire the lobby’s vast collection of traditional Yali stonework, spend time by the pool, wander the serene bird sanctuary trail, tee off at the 12-hole golf course and dine across eight world-class restaurants and bars. Gourmands can savour Goan cuisine at Jamavar restaurant, while the nightly lighting of the Diya at the Susegado beach lounge is a soul-stirring spiritual experience that should not be missed.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Cavelossim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "The Leela Goa",
    "offer_address": "Mobor Beach, Salcette, Cavelossim, Goa 403731, India",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNkJ6AAL",
    "hero_image": "https://images.luxuryescapes.com/ytj37wg9dp4puusm8ku",
    "image_two": "https://images.luxuryescapes.com/te4hec2ziho23m1i9pz9",
    "image_three": "https://images.luxuryescapes.com/u6idj9zln7yzxij0rqzh",
    "vendor_name": "Holiday Inn Resort Goa",
    "title": "Relaxing Beachfront Goa Escape Overlooking the Arabian Sea",
    "description": "With magnificent views of the Arabian Sea, the Mediterrean-styled Holiday Inn Resort Goa, an IHG Hotel, boasts unique direct access to the foreshore and perfectly manicured gardens that set the scene for any serene escape. This family-friendly location hosts a selection of spacious rooms complete with quaint balconies and modern fixtures, alongside four delicious dining venues, shimmering outdoor pool and luxurious Spa Villa.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "South Goa",
    "offer_geo_area_level_2": "Cavelossim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Holiday Inn Resort Goa, an IHG Hotel",
    "offer_address": "Mobor Beach, Cavelossim, Goa, 403731, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 87.0,
    "value": 87.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HifgxYAB",
    "hero_image": "https://images.luxuryescapes.com/f3rte5fn1ia3y4rrfka4",
    "image_two": "https://images.luxuryescapes.com/w4dan01dgxaraqm34a",
    "image_three": "https://images.luxuryescapes.com/pl61sfebkkaefir573tb",
    "vendor_name": "Grand Hyatt Goa",
    "title": "Beachfront Goa Oasis near Panjim with Five Restaurants, Two Pools & Luxe Spa",
    "description": "Embrace the sun-kissed magic of Goa with a stay at this lavish Grand Hyatt sanctuary overlooking the shimmering waters of the Arabian Sea, set mere moments from Panjim. Sprawling across 28 acres of landscaped gardens, spend your days here lounging by the expansive outdoor pool, sip on cocktails at Capiz Bar, and soak up the stunning west coast ocean sunsets over Bambolim Bay.\n\nGourmands can take delight across the resort's various dining venues: from authentic Italian fare at The Verandah to Asian and Indian cuisine at The Dining Room. For some much-needed pampering, head to Shamana Spa for holistic treatments in a serene setting.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Panaji",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Grand Hyatt Goa",
    "offer_address": "Goa University, Aldeia de Goa, Bambolim, Goa 403206, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 121.0,
    "value": 121.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwIIAS",
    "hero_image": "https://images.luxuryescapes.com/r9ov71uohcjysp56ijru",
    "image_two": "https://images.luxuryescapes.com/pczafi4i3jc32yz698h",
    "image_three": "https://images.luxuryescapes.com/1esob1d9qijxp3j8x8pp",
    "vendor_name": "Novotel Candolim",
    "title": "Modern Goa Escape Minutes from Candolim Beach with Onsite Spa & Two Pools",
    "description": "Spend days in endless summer near one of Goa's most popular sandy stretches at this modern escape just minutes from the golden sands of Candolim Beach. Boasting two sparkling outdoor pools and a dreamy onsite spa, relaxation here is strongly encouraged.\n\nWhen hunger strikes, enjoy authentic Indian cuisine at SQUARE restaurant, and wind down with a refreshing drink at Bar Asia. Venture out to explore the vibrant Anjuna Flea Market just a short drive away, and discover the historic Aguada Fort, within walking distance.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Candolim",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Novotel Goa Candolim",
    "offer_address": "Anna Waddo Main Candolim Road, Candolim, Bardez, Goa 403515, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 67.0,
    "value": 67.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqWPpAAN",
    "hero_image": "https://images.luxuryescapes.com/73r1flvrknfsvkc13y7",
    "image_two": "https://images.luxuryescapes.com/xtkusvo8d7vmds8ei2i",
    "image_three": "https://images.luxuryescapes.com/avr00sc35nx68dgol89",
    "vendor_name": "Fort Tiracol Heritage Hotel",
    "title": "Heritage Clifftop Goa Escape with Arabian Sea Views",
    "description": "Embrace seaside seclusion, enveloping views and rich tradition with a stay at Fort Tiracol Heritage Hotel. Situated atop a cliff at the northern tip of Goa, between the serene Tiracol River and the majestic Arabian Sea, the hotel is set in a restored 17th-century Portuguese fortress and features a church within its walls. Take a heritage walk, watch wild dolphins play by the shore or enjoy a sumptuous meal at The Tavern: this is Goa like you've never seen it before.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Goa",
    "offer_geo_area_level_2": "Tiracol",
    "location_heading": "Goa",
    "location_subheading": "India",
    "location_description": "Fort Tiracol Heritage Hotel",
    "offer_address": "Pernem Taluka, Tiracol, Goa 403524, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 181.0,
    "value": 181.0
  }
]