[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UVnqAAG",
    "hero_image": "https://images.luxuryescapes.com/7smut95imi1hteusng",
    "image_two": "https://images.luxuryescapes.com/5eal5vnftq8dwqeolp3p",
    "image_three": "https://images.luxuryescapes.com/n0jw31p52f8fkn0rdhj",
    "vendor_name": "Journey Beyond - Cruise Whitsundays",
    "title": "Once-in-a-Lifetime Great Barrier Reefsleep Overwater Stay with All-Inclusive Dining & Drinks",
    "description": "Watch the sun melt into the glittering Coral Sea and marvel at the galaxy of stars twinkling above on this intimate (max. 28 travellers overnight), once-in-a-lifetime overwater experience in the middle of the Great Barrier Reef. Sleep under the stars on the exclusive Reefworld pontoon at Hardy Reef, be spoiled with all-inclusive drinks and dining throughout, enjoy a convenient scenic return Whitsundays cruise from Airlie Beach to the pontoon via Hamilton Island, and experience exclusive access to the reef at sunset after the day-trippers return to shore.\n\nThis unmissable two-day, one-night Reefsleep - Cruise Whitsundays experience includes an overnight stay for one in a Reefbed on the top deck, where you can marvel at the starry sky and let the gentle waves lull you to sleep. Travel solo or share the moment with someone special by purchasing a two-person shared bed package.\n\n**Your handpicked inclusions**:\n\n- One night in a Reefbed on the pontoon's top deck with breathtaking views of the star-swept skies and glittering Coral Sea\n- All-inclusive dining with two morning and afternoon teas, two lunches, one dinner and one breakfast\n- All drinks, including beer and wine, with one welcome cocktail per adult\n- Scenic return Whitsundays cruise to Hardy Reef (departing from Port of Airlie and Hamilton Island)\n- Complimentary semi-submarine guided tour\n- Complimentary access to the underwater observatory\n- Complimentary snorkelling with all gear, including wetsuits and stinger suits\n- Environmental Management Charge included\n- Souvenir pack with a complimentary drink bottle and toy turtle per person\n\n**Getting there is easy:** With a return scenic Whitsunday cruise included in your stay - departing from Port of Airlie and stopping via Hamilton Island - reaching the exclusive Reefworld pontoon at Hardy Reef is effortless. Return departures are also available from Airlie Beach, Daydream Island and Hamilton Island (see Fine Print for departure times).\n\n**Happy to share a bed?** Choose a package for two guests (aged eight years and over), sharing one bed.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Great Barrier Reef",
    "location_subheading": "Queensland",
    "location_description": "Reefsleep - Cruise Whitsundays - Feb 2021",
    "offer_address": "Port of Airlie, Shop 7/33 Port Dr, Airlie Beach QLD 4802",
    "percentage_discount": 25.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 390.0,
    "value": 518.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lo2cAAC",
    "hero_image": "https://images.luxuryescapes.com/nhk1gzhyecpde5ohljtd",
    "image_two": "https://images.luxuryescapes.com/gjd8rqyoxcqy7r8n4wu",
    "image_three": "https://images.luxuryescapes.com/2nfzsfxjzfltwxm7ysr4",
    "vendor_name": "Green Island Resort",
    "title": "Tropical Island Paradise with Great Barrier Reef & Glass-Bottom Boat Tours",
    "description": "Immerse yourself in the tropical playground of the UNESCO World Heritage-listed Great Barrier Reef at Green Island Resort, just 45 minutes off the coast of Cairns. Explore one of the world's seven natural wonders with incredible nature adventures included in your package. Take a Great Barrier Reef tour in a semi-submersible vessel with onboard lunch included, witness the ocean's wonders with a snorkelling session, take a trip on the resort's glass-bottom boat and embark on guided rainforest walks.\n\nStay in an Island Suite and enjoy daily breakfast, one nightly sunset drink per adult, A$50 dining credit per room to use at the resort's restaurant, daily fish feeding presentations, complimentary kayaking and snorkelling, scuba diving lesson discounts, return catamaran transfers from Cairns and more.\n\n**Travelling with family?** Up to two children (aged 14 years and under) stay free. Plus, kids eat free when dining with a paying adult.\n\n**This deal has no surcharges**: Travel freely, even during high season, for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Cairns Regional",
    "location_heading": "Great Barrier Reef",
    "location_subheading": "Queensland",
    "location_description": "Green Island Resort - June 2020",
    "offer_address": "Green Island, QLD",
    "percentage_discount": 58.0,
    "min_duration": 4,
    "max_duration": 8,
    "price": 899.0,
    "value": 2150.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GioKAAS",
    "hero_image": "https://images.luxuryescapes.com/lip46a6nfalpv35iacvb",
    "image_two": "https://images.luxuryescapes.com/t6kzi59nioz24mhlbuwa",
    "image_three": "https://images.luxuryescapes.com/eszx4cu2gpjt0sa9fd",
    "vendor_name": "Green Island Resort",
    "title": "Luxe Green Island Retreat with Full-Day Great Barrier Reef Adventure",
    "description": "Discover the underwater world of the Great Barrier Reef when you escape to Queensland's luxurious Green Island Resort - an idyllic hideaway draped in lush rainforest and bordered by a sun-kissed coastline. Accessible only by boat or helicopter - 45 minutes off the coast of Cairns - and the only coral cay to be surrounded by rainforest, this iconic stay invites you to explore one of UNESCO’s World Heritage-listed wonders with incredible nature adventures included in your package. Spend your days on this eco-wonder unearthing the kaleidoscopic marine life beneath the waves as you snorkel and dive through some of the world's most magical reef, explore the island and simply laze on a postcard-perfect beach.\n\n**Your handpicked inclusions**:\n\n- Wake up in paradise to an incredible daily breakfast featuring eggs, bacon, pastries and more\n- Unearth the Great Barrier Reef with a full-day cruise, snorkelling and enjoying an onboard lunch and refreshments\n- Return scheduled catamaran transfers from Cairns Reef Fleet Terminal (see the Fine Print for information)\n- A$50 dining credit per suite to use at Emeralds Restaurant & Bar\n- Cheers to your escape wne nightly sunset drink per adult\n- Complimentary glass-bottom boat tour to see the wonders of the Great Barrier Reef up close\n- Guided evening nature and rainforest walks\n- Complimentary use of snorkels, canoes, kayaks, windsurfing gear and more\n- Daily fish-feeding presentations\n- 20% discount on any introductory or certified diving experiences\n- 25% discount on a 10-minute scenic helicopter flight\n\n**Travelling with family?** Up to two children (aged 14 years and under) are included in your package. Plus, one kid eats free per paying adult. **Travelling as a couple?** Upgrade to a Reef Suite and enjoy a romantic escape for two.\n\n**This deal has NO peak surcharges:** Travel freely, even during high season, for the same great price.\n\n**Please note**: Until further notice, catamaran transfers from Cairns to Green Island are subject to change on a monthly basis. See 'Fine Print' for latest schedule.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Cairns Regional",
    "location_heading": "Great Barrier Reef",
    "location_subheading": "Queensland",
    "location_description": "Green Island Resort - Sep 2020",
    "offer_address": "Green Island, QLD",
    "percentage_discount": 62.0,
    "min_duration": 4,
    "max_duration": 10,
    "price": 959.0,
    "value": 2510.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cIf8mQAC",
    "hero_image": "https://images.luxuryescapes.com/a15a0f9igksn8dofabvpa",
    "image_two": "https://images.luxuryescapes.com/dkn6gf77rxsrufhfg0jg",
    "image_three": "https://images.luxuryescapes.com/wtxwjdf8opgnyngyqi6y",
    "vendor_name": "Lizard Island Resort",
    "title": "All-Inclusive Secluded Island Paradise on the Great Barrier Reef",
    "description": "Uncover the secluded beauty of Lizard Island Resort, located amid the natural wonder of Queensland’s Great Barrier Reef. Part of the prestigious Luxury Lodges of Australia collection, this exclusive paradise consists of just 40 suites and villas, surrounded by 24 private beaches. Indulge in all-inclusive gourmet dining, with breakfast, lunch and dinner served at the oceanfront Salt Water Restaurant or in a deluxe picnic hamper for private dining on the beach, and enjoy free-flow soft and select alcoholic beverages, including sparkling wine, fine Australian wines, international beers and spirits. Making your stay even more unforgettable is a one-hour guided snorkel tour for two, also included in this once-in-a-lifetime escape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Lizard Island",
    "location_heading": "Great Barrier Reef",
    "location_subheading": "QLD",
    "location_description": "Lizard Island Resort",
    "offer_address": "Lizard Island, Cairns QLD 4871",
    "percentage_discount": 30.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 4435.0,
    "value": 6364.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037L0qAAE",
    "hero_image": "https://images.luxuryescapes.com/7g9prouq3inbqziux7vv",
    "image_two": "https://images.luxuryescapes.com/325kjf2j5ecz4wuu14o5",
    "image_three": "https://images.luxuryescapes.com/itcffi0e4mm0k9oa0a6a",
    "vendor_name": "Journey Beyond - Cruise Whitsundays",
    "title": "Once-in-a-Lifetime Great Barrier Reefsleep Overwater Stay with All-Inclusive Dining",
    "description": "Watch the sun melt into the glittering Coral Sea and marvel at the galaxy of stars twinkling above on this intimate (max. 28 travellers overnight), once-in-a-lifetime overwater experience in the middle of the Great Barrier Reef. Sleep under the stars on the exclusive Reefworld pontoon at Hardy Reef, be spoiled with all-inclusive drinks and dining and a return Whitsundays cruise from Airlie Beach to the pontoon, and enjoy exclusive access to the reef at sunset after the day-trippers return to shore.\n\nThis unmissable two-day/one-night Reefsleep - Cruise Whitsundays experience includes an overnight stay for one in a Reefbed on the top deck, a welcome cocktail per adult, return scenic Whitsunday cruise to the mesmerising outer reef and complimentary snorkelling with all gear provided. Enjoy access to the underwater observatory, a semi-submarine guided tour, all-inclusive dining with included beer and wine, a souvenir pack and the Environmental Management Charge included.\n\n**Getting there is easy:** with a return scenic Whitsunday cruise included in your stay, departing from Port of Airlie and stopping via Hamilton Island, reaching the exclusive Reefworld pontoon at Hardy Reef is effortless.\n\n**Travelling as a couple?** Choose the package valid for two adults (aged 12 years and over), sharing one bed.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Great Barrier Reef",
    "location_subheading": "Queensland",
    "location_description": "Reefsleep - Cruise Whitsundays 2020",
    "offer_address": "Port of Airlie, Shop 7/33 Port Dr, Airlie Beach QLD 4802",
    "percentage_discount": 24.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 379.0,
    "value": 501.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CT3QAAW",
    "hero_image": "https://images.luxuryescapes.com/tv2qq18cktta6dudsvq",
    "image_two": "https://images.luxuryescapes.com/jwt4brjkh3tntczdnlt",
    "image_three": "https://images.luxuryescapes.com/l8ml415lm6qcyvypgkv7",
    "vendor_name": "Journey Beyond - Cruise Whitsundays",
    "title": "Once-in-a-Lifetime Great Barrier Reef Sleep Overwater Stay with All-Inclusive Dining & Drinks",
    "description": "Watch the sun melt into the glittering Coral Sea and marvel at the galaxy of stars twinkling above on this intimate (max. 28 travellers overnight), once-in-a-lifetime overwater experience in the middle of the Great Barrier Reef. Sleep under the stars on the exclusive Reefworld pontoon at Hardy Reef, be spoiled with all-inclusive drinks and dining throughout, enjoy a convenient scenic roundtrip Whitsundays cruise to the pontoon via Hamilton Island and Daydream Island, and experience exclusive access to the reef at sunset after the day-trippers return to shore.\n\nThis unmissable two-day, one-night Reefsleep - Cruise Whitsundays experience includes an overnight stay in a Reefbed on the top deck, where you can marvel at the starry sky and let the gentle waves lull you to sleep. Travel solo or share the moment with someone special by purchasing a two-person shared bed package.\n\n**Your handpicked inclusions**:\n\n- One night in a Reefbed on the pontoon's top deck with breathtaking views of the star-swept skies and glittering Coral Sea\n- All-inclusive dining with two morning and afternoon teas, two lunches, one dinner and one breakfast\n- All drinks, including beer and wine, with one welcome cocktail per adult\n- Scenic roundtrip Whitsundays cruise to Hardy Reef (departing from Port of Airlie, Daydream Island or Hamilton Island)\n- Marvel at the marine life on a semi-submarine guided tour\n- Enjoy access to the underwater observatory\n- Make use of complimentary snorkelling with all gear, including wetsuits and stinger suits\n- Environmental Management Charge included\n- Souvenir pack with a drink bottle and toy turtle per person\n\n**Getting there is easy:** With a roundtrip scenic Whitsundays cruise included in your stay - departing from Port of Airlie - reaching the exclusive Reefworld pontoon at Hardy Reef is effortless. Departures are also available from Daydream Island and Hamilton Island (see Fine Print for departure times).\n\n**Travelling as a couple?** Choose a package for two guests, sharing one bed.\n\n**This deal has NO peak surcharges:** Travel any time for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Great Barrier Reef",
    "location_subheading": "Queensland",
    "location_description": "Reefsleep - Cruise Whitsundays",
    "offer_address": "24 Port Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 25.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 390.0,
    "value": 518.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GTmPqYAL",
    "hero_image": "https://images.luxuryescapes.com/4yzaw79oba8kyx24fkm",
    "image_two": "https://images.luxuryescapes.com/bsc8og8yvwdi9w22yt3b",
    "image_three": "https://images.luxuryescapes.com/c2iordhlym8l4v6dls5",
    "vendor_name": "Journey Beyond - Cruise Whitsundays",
    "title": "Once-in-a-Lifetime Great Barrier Reef Overwater Adventure with All-Inclusive Dining & Free-Flow Drinks",
    "description": "Experience one of the world's most stunning natural wonders and glamp under the stars, on the waters of the Great Barrier Reef. Enjoy all-inclusive dining and drinks as you watch the sunset over the glittering Coral Sea from your overwater retreat, a once-in-a-lifetime stay. Enjoy a scenic roundtrip Whitsundays cruise to the pontoon via Hamilton Island and Daydream Island and exclusive access to the reef at sunset after the day-trippers return to shore.\n\nThis unmissable two-day, one-night adventure includes an overnight stay in a Reefbed on the top deck, where you can marvel at the galaxy of twinkling stars above and let the gentle waves lull you to sleep. Whether travelling solo or sharing the moment with someone special, this bucket-list experience is bound to leave you breathless.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Great Barrier Reef",
    "location_subheading": "Queensland",
    "location_description": "Reefsleep - Cruise Whitsundays",
    "offer_address": "24 Port Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 20.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 489.0,
    "value": 613.0
  }
]