[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP4sYAF",
    "hero_image": "https://images.luxuryescapes.com/uepdfer0q7jp9y01uab",
    "image_two": "https://images.luxuryescapes.com/740zymuh14nuxgjyep9h",
    "image_three": "https://images.luxuryescapes.com/s6vihnepwk2fl0cq40be",
    "vendor_name": "Novotel Ha Long Bay",
    "title": "Ha Long Bay Novotel Retreat with Direct Beach Access, Restaurant, Pool & Spa",
    "description": "Immerse yourself in the coastal allure of Vietnam's UNESCO World Heritage-listed Ha Long Bay with a retreat steps from the golden sands of Bai Chay Beach. Spend days swimming in the sparkling outdoor pool, pampering yourself with treatments at the spa, or unwinding in rooms with sweeping windows framing stunning vistas.\n\nDelight in authentic tastes of Vietnam at The Square Restaurant, unwind with a cocktail from the Poolside Bar, or simply relax on the pristine beach. When you're ready to explore, set off on a scenic cruise to discover the emerald waters and limestone islands of Ha Long Bay, or immerse yourself in the lively atmosphere of local markets.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Quang Ninh Province",
    "offer_geo_area_level_2": "Ha Long",
    "location_heading": "Ha Long",
    "location_subheading": "Vietnam",
    "location_description": "Novotel Ha Long Bay",
    "offer_address": "160 Ha Long Street, Bai Chay Ward, Ha Long City, Quang Ninh Province 200000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 29.0,
    "value": 29.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HuwkIAC",
    "hero_image": "https://images.luxuryescapes.com/zerbsvlchvitw58x5jt",
    "image_two": "https://images.luxuryescapes.com/imutva0dxoz968hcxvq",
    "image_three": "https://images.luxuryescapes.com/jl8as51sok9jb3xehlwb",
    "vendor_name": "Oakwood Ha Long",
    "title": "Ha Long Bay Beachfront All-Villa Escape with Two Pools, Three Restaurants & Onsite Spa",
    "description": "Take this chance to stumble across the perfect blend of luxury and tranquillity at this all-villa oasis and at the gateway to Vietnam's UNESCO World Heritage-listed Ha Long Bay. Stylish and modern to behold, the five-star resort is perched along the sandy shores and emerald waters of Bai Chay Beach and serves as an ideal base to explore the best treats of Ha Long, including Sun World Complex and the vibrant Ha Long Night Market.\n\nSpend your days luxuriating in the spacious, well-appointed villas, take a refreshing dip in the two outdoor pools and rejuvenate with treatments at Serenity Spa. When hunger strikes, discover the essence of Vietnamese culinary artistry as you feast on ocean-fresh grilled delicacies at Bay Grill & Mixology, tuck into Vietnamese dishes at The Market and sip on craft cocktails at Oakbar, while catching epic sunsets.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Quang Ninh Province",
    "offer_geo_area_level_2": "Ha Long",
    "location_heading": "Ha Long",
    "location_subheading": "Vietnam",
    "location_description": "Oakwood Ha Long",
    "offer_address": "No 09 Ha Long Street, Bai Chay, Ha Long City, Quang Ninh 200000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 117.0,
    "value": 117.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxXpOAAV",
    "hero_image": "https://images.luxuryescapes.com/8nafcsg8mtspq47x2u78",
    "image_two": "https://images.luxuryescapes.com/673galqjhsw2y23nnsu9",
    "image_three": "https://images.luxuryescapes.com/l67zxoge8ok8thtrnf6",
    "vendor_name": "Vinpearl Resort & Spa Ha Long",
    "title": "Glamorous Ha Long Bay Five-Star Private Island Paradise near Ha Long Bay",
    "description": "Experience the captivating beauty of Ha Long Bay with a stay at Vinpearl Resort & Spa Ha Long - a luxurious retreat perched on a private island in the pristine waters of this UNESCO World Heritage-listed wonder. Savour the flavours of Vietnam at Pavilion Restaurant serving the freshest seafood, or indulge in international cuisine at Bayview Restaurant. Rejuvenate at the tranquil Vincharm Spa, or take a dip in the sparkling outdoor pool against the backdrop of incredible views.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Quang Ninh Province",
    "offer_geo_area_level_2": "Ha Long",
    "location_heading": "Ha Long",
    "location_subheading": "Vietnam",
    "location_description": "Vinpearl Resort & Spa Ha Long",
    "offer_address": "Reu Island, Bai Chay Ward, Ha Long City, Quang Ninh Province",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 122.0,
    "value": 122.0
  }
]