[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FcMmkAAF",
    "hero_image": "https://images.luxuryescapes.com/bkcvs6tl4ias0ycd7xqe",
    "image_two": "https://images.luxuryescapes.com/abm18hwhmklc2ouolv7",
    "image_three": "https://images.luxuryescapes.com/2tlli3swk10fapbndqj",
    "vendor_name": "Capella Tufu Bay",
    "title": "Five-Star China Secluded Island Sanctuary with Day Spa & Four Restaurants & Bars",
    "description": "Discover Hainan Island’s best-kept secret, a haven of ultra-modern design where an appreciation for the natural world and Chinese history runs free - welcome to Capella Tufu Bay. Another sparkling beacon of beauty set in a secluded paradise, the resort claims a rightful spot within the world’s best hotel brand, Capella, as voted by Travel + Leisure Readers in the 2023 World's Best Awards. Adventure through storied surroundings and learn of the mystical Silk Road trade history, delve into the thriving green of neighbouring rainforests, or tiptoe your way to the pristine shoreline for a tranquil dip on this enchanting island.\n\nBlending sophistication and serenity, this breathtaking retreat is home to an intimate collection of world-class eateries. Indulge in Chinese fine dining at Lan Ting in traditional tea house-inspired interiors, revel in a classic marketplace atmosphere at Silk Road, and sample light snacks and creative cocktails inspired by herbs and spices at The Bar. Satisfy all of your senses with a pampering session at Auriga Wellness, or allow yourself to dive headfirst into a beautiful cultural immersion along one of China’s most pristine coastlines.",
    "offer_country_name": "China",
    "offer_country_code_alpha_2": "CN",
    "offer_geo_area_level_1": "Hainan",
    "offer_geo_area_level_2": "Lingshui",
    "location_heading": "Hainan",
    "location_subheading": "China",
    "location_description": "Capella Tufu Bay, Hainan",
    "offer_address": "Tufu Resort Area, Yingzhou Town, Lingshui, Hainan 572000, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 279.0,
    "value": 279.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib045YAB",
    "hero_image": "https://images.luxuryescapes.com/16d4uu96751512ejxpo",
    "image_two": "https://images.luxuryescapes.com/hlvhgqsb7y860o8zd6u",
    "image_three": "https://images.luxuryescapes.com/m9z3tuo8rz7jzhm4kk",
    "vendor_name": "Pullman Sanya Bay Resort Spa",
    "title": "China Oceanfront Escape Overlooking Sanya Bay with Four Pools & Spa",
    "description": "Escape to paradise at this relaxing retreat, where the turquoise waters of the South China Sea meet stylish, modern accommodations. Dive into one of four incredible pools, or head to the Thai-style Shan Spa for traditional Chinese massages to melt your stress away while gentle breezes drift through open windows.\n\nFood lovers, prepare to feast at two unique restaurants offering everything from local Cantonese cuisine to western favourites that will keep you coming back for seconds. Just steps from Sanya Bay’s pristine beach and close to downtown hotspots, you couldn't ask for a better location.",
    "offer_country_name": "China",
    "offer_country_code_alpha_2": "CN",
    "offer_geo_area_level_1": "Hainan",
    "offer_geo_area_level_2": "Sanya",
    "location_heading": "Hainan",
    "location_subheading": "China",
    "location_description": "Pullman Oceanview Sanya Bay Resort & Spa",
    "offer_address": "158 Sanyawan Road, Tianya District, Sanya, Hainan 572000, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 100.0,
    "value": 100.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009Er2YAAS",
    "hero_image": "https://images.luxuryescapes.com/so5u0b71k486xdgspo4l",
    "image_two": "https://images.luxuryescapes.com/41zvagsxcdwcn3t4kda8",
    "image_three": "https://images.luxuryescapes.com/91y8uineyn7i3ejwp3cac",
    "vendor_name": "Oakwood Apartments Sanya",
    "title": "Self-Contained Sanya Bay Apartment Stay Just Minutes from the Beachfront",
    "description": "Escape to Oakwood Apartments Sanya for a tranquil retreat within the heart of the bustling Tianya district city centre. The first international serviced apartment in Sany, designed exclusively by famed Thai interior designer Yutt (of Cancu Studios), this Hainan Island self-contained stay boasts Cafe 0 restaurant, an inviting sauna and pool and an enviable location just minutes from the serene Sanya Bay.",
    "offer_country_name": "China",
    "offer_country_code_alpha_2": "CN",
    "offer_geo_area_level_1": "Hainan",
    "offer_geo_area_level_2": "Sanya",
    "location_heading": "Hainan",
    "location_subheading": "China",
    "location_description": "Oakwood Apartments Sanya",
    "offer_address": "No.118, Huixin Road, Sanya, Hainan Province, 572000,China",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]