[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JTJ8SAAX",
    "hero_image": "https://images.luxuryescapes.com/c02kpoujixe6dyehgmj",
    "image_two": "https://images.luxuryescapes.com/b6emwy3axqbztbr7gn",
    "image_three": "https://images.luxuryescapes.com/xfincqjo10pvsbmqsp9",
    "vendor_name": "AJUL LUXURY HOTEL & SPA RESORT 5*",
    "title": "Five-Star Halkidiki All-Inclusive Seaside Opulence with Private Beach",
    "description": "Discover a Greek haven of crystalline waters and unparalleled luxury with a lavish stay along the azure coastline of the Kassandra Peninsula. With verdant green surroundings and serene beaches on your doorstep, you can unwind in pure nature and tranquility while indulging in the resort's high-end facilities. Choose to luxuriate in one of five shimmering pools or bask in the sun while sipping on a cocktail at Ananas Pool Bar, or wander down to the resort's private beach, complete with sun loungers and Enki Beach Bar, serving up sumptuous cocktails and small bites. Delight in international and local cuisine at one of three onsite restaurants and stop for a drink at Senses Main Bar before you indulge in the onsite spa to revitalise your body and mind.\n\nBeyond the resort walls, take advantage of the many activities on offer, such as snorkelling and scuba diving, or a private yoga or pilates session for those seeking zen. From tennis and volleyball courts to an open-air cinema and kids' club, there is something for the whole family to enjoy.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Central Macedonia",
    "offer_geo_area_level_2": "Kassandra",
    "location_heading": "Halkidiki",
    "location_subheading": "Greece",
    "location_description": "Ajul Luxury Hotel & Spa Resort",
    "offer_address": "Agia Paraskevi, Halkidiki, Pallini 630 85, Greece",
    "percentage_discount": 61.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 1199.0,
    "value": 3090.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FceNuAAJ",
    "hero_image": "https://images.luxuryescapes.com/3vtk7dptgj3raz9ol6j",
    "image_two": "https://images.luxuryescapes.com/btukcovozkdy43zpn3m",
    "image_three": "https://images.luxuryescapes.com/9g10stymg5kyg56902e",
    "vendor_name": "Royal Hotel and Suites Halkidiki",
    "title": "All-Inclusive Northern Greece Luxury with Free-Flow Drinks & Beach Bar",
    "description": "An all-inclusive haven awaits on Northern Greece's Kassandra peninsula with a stay at the Royal Hotel and Suites in Halkidiki - known for its picture-perfect beaches, sheltered bays and incredible forests. This dreamy resort boasts secluded luxury with delectable dining at the Restaurant Symposium, serving the freshest Mediterranean dishes in a warm and welcoming environment. Spend your days floating through the crystal-clear waters of the resort pools, enjoying the Pool Bar’s free-flow drinks and tasty treats, or venture down to the Olivo Sea Side Bar to lounge beachside with a refreshing cocktail and breathtaking ocean views.\n\nExploring the island is the best way to experience the wonder and energy of Greece, with secluded beaches just waiting to be discovered. Watch the sky come alive with picture-perfect sunsets, and live the summer lifestyle of your dreams. Wander through the charming village of Polichrono for a day of shopping, before returning to unwind in the comfort of this idyllic resort.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Central Macedonia",
    "offer_geo_area_level_2": "Kassandra",
    "location_heading": "Halkidiki",
    "location_subheading": "Greece",
    "location_description": "Royal Hotel and Suites Halkidiki",
    "offer_address": "Polychrono, Halkidiki 63085, Greece",
    "percentage_discount": 38.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 539.0,
    "value": 875.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IOlcvYAD",
    "hero_image": "https://images.luxuryescapes.com/ftpq4iwhz4vz83tcl25",
    "image_two": "https://images.luxuryescapes.com/m43bhvc64irrq9wjl15a",
    "image_three": "https://images.luxuryescapes.com/xsj2qjcbtsiot2e9pkcj",
    "vendor_name": "Domes Noruz Kassandra Halkidiki - Adults Only",
    "title": "Northern Greece Adults-Only Beachfront Bliss with Daily Breakfast, Nightly Dinner & Sunset Cocktails",
    "description": "Step into laidback luxury at this beachfront hideaway set along the sugar-fine shores of Halkidiki’s renowned Kassandra Peninsula. Just steps from the opaline waters of the Aegean Sea, this eclectic retreat blends sleek architecture, minimalist aesthetics and lush landscapes for an indulgent yet relaxed beachside escape.\n\nThe resort’s open-air design harmonises marble pools, swaying palms and curated experiences - from barefoot beach parties to serene wellness rituals. As the sun sets, the energy shifts: evenings come alive with DJ sets, inventive mixology and delicious Mediterranean dining at Gustatio, while Raw Bar provides a perch for cocktails with a view.\n\nAt SOMA Spa, ancient Greek rituals come alive through treatments designed to help you slow down after high-energy moments. Whether you're toasting with a glass of bubbly or dancing beneath the stars, every detail at Domes Noruz Kassandra helps immerse you in a lifestyle of sun and sophistication.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Central Macedonia",
    "offer_geo_area_level_2": "Kassandra",
    "location_heading": "Halkidiki",
    "location_subheading": "Greece",
    "location_description": "Domes Noruz Kassandra",
    "offer_address": "Chaniotis 630 85, Greece",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 459.0,
    "value": 1354.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GP0yUAAT",
    "hero_image": "https://images.luxuryescapes.com/60ao1ny3nnfnqxzfp76u",
    "image_two": "https://images.luxuryescapes.com/unamf2h8y2ufolskor3f",
    "image_three": "https://images.luxuryescapes.com/j6k7gk0v2a3g1mto8jc",
    "vendor_name": "Miraggio Thermal Spa Resort",
    "title": "Sun-Kissed Halkidiki Greece Oceanfront Retreat with Thermal Spa, Nine Restaurants & Private Beach Marina",
    "description": "Discover the allure and peace of Greece's idyllic Halkidiki coast with an escape to this five-star haven, boasting one of Greece's largest thermal spas, where you can indulge in rejuvenating treatments and natural mineral pools. Savour a variety of cuisines and cocktails at the resort's 14 bars and restaurants, soak up radiant sea air on the private beach or enjoy the many watersport offerings (surcharges apply) at the resort's private marina before retiring to your heavenly room or suite.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Central Macedonia",
    "offer_geo_area_level_2": "Kassandra",
    "location_heading": "Halkidiki",
    "location_subheading": "Greece",
    "location_description": "Miraggio Thermal Spa Resort",
    "offer_address": "Kanistro, Paliouri, Halkidiki 63085, Greece",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004RsMxAAK",
    "hero_image": "https://images.luxuryescapes.com/p54h5idtppyjcwjhzee",
    "image_two": "https://images.luxuryescapes.com/trwu4wzqc8ces5r9mief",
    "image_three": "https://images.luxuryescapes.com/3hmu59vs3aut6tj1z75s",
    "vendor_name": "Avaton Luxury Hotel and Villas",
    "title": "Coastal Five-Star Greece Escape by Relais & Châteaux",
    "description": "Find a slice of paradise in a secluded corner of northern Greece at the five-star Avaton Luxury Hotel & Villas - Relais & Châteaux, a coastal retreat tucked away in a beautiful beachfront location in Halkidiki. Taking you away from the hustle and bustle of more popular Greek destinations, the seaside resort of Nea Roda - reachable in 90 minutes’ drive from Thessaloniki Airport - will allow you to slow down the pace and truly relax amid the crystal-clear waters of Ierissos Bay.\n\nSurrounded by beautifully kept gardens and overlooking the blue waters of the bay, this award-winning retreat exudes luxury and elegance: from the Italian silverware to the bespoke furniture, every detail of this Relais & Châteaux property has been carefully considered. With a collection of just 36 luxury rooms, suites and villas, and five-star amenities - including a private beach with plush sunbeds, two restaurants serving innovative Greek fare, a bar where expert bartenders craft modern concoctions, and a beauty and wellness cabana - this is the ultimate sun-kissed escape in one of Greece’s best-kept secrets.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Central Macedonia",
    "offer_geo_area_level_2": "Aristotelis",
    "location_heading": "Halkidiki",
    "location_subheading": "Greece",
    "location_description": "Avaton Luxury Hotel & Villas - Relais & Châteaux",
    "offer_address": "Komitsa Beach, Chalkidiki, Nea Roda 630 75, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 7,
    "price": 249.0,
    "value": 249.0
  }
]