[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zsj7AAA",
    "hero_image": "https://images.luxuryescapes.com/ps6u8uzb3kimscvurnze",
    "image_two": "https://images.luxuryescapes.com/z5qagovmoehhhgsozgzb",
    "image_three": "https://images.luxuryescapes.com/ytwrtatqob1t9tpi4759",
    "vendor_name": "Select Braemar Lodge & Spa",
    "title": "Romantic Hanmer Springs Spa Retreat with Daily Buffet Breakfast & Dining Credit",
    "description": "Get back to nature with a romantic countryside spa retreat at Braemar Lodge & Spa in New Zealand’s gorgeous Hanmer Springs region. This indulgent escape is devoted to your utter relaxation, so sit back and let the magic take hold. The retreat features some of the largest suites in New Zealand, all with floor-to-ceiling windows showcasing incredible alpine vistas - soak in the views from your cosy spot by the fire before soaking in your private spa or jacuzzi. Exquisite meals are artfully created by a team of international chefs at onsite Altitude restaurant and indulgent spa treatments are on the menu to leave you feeling totally pampered. Pure bliss!\n\nSurrounded by sleepy farmland and pristine mountains, Hanmer Springs is the ultimate destination to recharge and get back to nature. Days are spent exploring the area, soaking in natural hot pools or enjoying some of the many outdoor activities on offer - everything from hiking to golf and swimming. Meanwhile, nights are for feasting on some of the freshest and tastiest local produce and raising a glass to an endless starry sky.\n\n**You handpicked inclusions:**\n\n- Start each day with a delicious buffet breakfast at Altitude Restaurant\n- Celebrate your escape with a welcome drink each on arrival\n- Get a real taste for the region thanks to $50 daily dining credit per room\n- Guaranteed 1pm early check-in means you can begin your relaxing retreat sooner\n\n**Deluxe Spa Suite Upgrade:** Upgrade to the Deluxe Spa Suite, a spacious suite featuring a private jacuzzi looking out to the stunning Amuri Basin, and receive the added indulgence of a bottle of sparkling wine and cheese platter served in-room on arrival.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Hanmer Springs",
    "location_heading": "Hanmer Springs",
    "location_subheading": "New Zealand",
    "location_description": "Braemar Lodge & Spa",
    "offer_address": "283 Medway Road, Hanmer Springs 7360, New Zealand",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 249.0,
    "value": 514.0
  }
]