[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ic68KAAR",
    "hero_image": "https://images.luxuryescapes.com/2it96nc1qe1sflpypcz",
    "image_two": "https://images.luxuryescapes.com/yox8rx2m2no1ku5eotev",
    "image_three": "https://images.luxuryescapes.com/mr4sazj3zj9t5x7zuqp4",
    "vendor_name": "InterContinental Hayman Great Barrier Reef",
    "title": "Australia's Most Iconic Private Island Resort: Hayman Island Luxury with Daily Breakfast, Nightly Dinner & Catamaran Transfers",
    "description": "A jewel on the shores of the sun-drenched Whitsundays, this award-winning resort boasts breathtaking natural beauty right at its doorstep. An icon of island extravagance, with direct access to the Great Barrier Reef's shimmering waters, the luxurious oasis welcomes couples and families alike. This magnificent retreat caters to those who appreciate the finer things, boasting world-class amenities and a collection of exquisite dining options. From the signature ocean-facing restaurant, Pacific, to Mediterranean-influenced Amici, there's something for every palate. Unwind at the world-class Hayman Spa & Salon, which exudes tranquility from the moment you enter, or relax by one of two iconic swimming pools.\n\nWhen adventure calls, the many sights and experiences dotted throughout the Whitsundays are waiting to welcome you. Step outside the sanctuary of InterContinental Hayman Island Resort, an IHG Hotel to find yourself in the heart of the UNESCO World Heritage-listed Great Barrier Reef. Aquamarine underwater adventures in the glistening Coral Sea and picture-perfect Whitehaven Beach are both just a short boat ride from this idyllic island paradise. Upon your return to Hayman Island, witness the mesmerising sunsets that paint the sky each evening. Whether you’re looking for out-of-this-world diving, a romantic escape or a dreamy setting for a family trip, this private island resort is where travel memories are made.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsundays",
    "location_heading": "Hayman Island",
    "location_subheading": "Queensland",
    "location_description": "InterContinental Hayman Great Barrier Reef",
    "offer_address": "Hayman Island, Whitsunday Islands, Hayman Island, Queensland 4801, Australia",
    "percentage_discount": 45.0,
    "min_duration": 4,
    "max_duration": 14,
    "price": 1829.0,
    "value": 3306.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JdsP1YAJ",
    "hero_image": "https://images.luxuryescapes.com/n3rra26xcl44biy66axs",
    "image_two": "https://images.luxuryescapes.com/25xgucpl0jgpiyfw2plvs",
    "image_three": "https://images.luxuryescapes.com/oohfvfl85ug61vhx67u",
    "vendor_name": "InterContinental Hayman Great Barrier Reef",
    "title": "Australia's Most Iconic Private Island Resort: Hayman Island Luxury with Daily Breakfast, A$400 Credit & Luxury Transfers",
    "description": "A jewel on the shores of the sun-drenched Whitsundays, this award-winning resort boasts breathtaking natural beauty on its doorstep. An icon of island luxury with direct access to the shimmering waters of the Great Barrier Reef, this magnificent resort invites you to take a dip in one of Australia’s largest swimming pools or recline in a private pool cabana overlooking azure ocean waters.\n\nCatering to those who appreciate the finer things, InterContinental Hayman Great Barrier Reef boasts five diverse dining options, ranging from the signature ocean-facing restaurant, Pacific, to Mediterranean-influenced Amici. Unwind at the world-class Hayman Spa & Salon - which exudes tranquillity from the moment you enter, or find a private spot to admire the captivating sunsets that transform the sky each evening.\n\nWhen adventure calls, step outside the resort to find yourself in the heart of the UNESCO World Heritage-listed Great Barrier Reef. Glide through the crystal-clear waters on a kayak or embark on a blue pearl hike to reach breathtaking panoramic views. Whether you're looking for a romantic escape or that dreamy setting for a family trip, this world-class resort is where core memories are made.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsundays",
    "location_heading": "Hayman Island",
    "location_subheading": "Queensland",
    "location_description": "InterContinental Hayman Great Barrier Reef",
    "offer_address": "Hayman Island, Whitsunday Islands, Hayman Island, Queensland 4801, Australia",
    "percentage_discount": 41.0,
    "min_duration": 4,
    "max_duration": 14,
    "price": 1569.0,
    "value": 2678.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JB33IAG",
    "hero_image": "https://images.luxuryescapes.com/rafdxllcxh0vppjq6dfm",
    "image_two": "https://images.luxuryescapes.com/lxhhxoud2eoknzppzh1",
    "image_three": "https://images.luxuryescapes.com/3z4oaenn9kkrhnq76r2b",
    "vendor_name": "InterContinental Hayman Great Barrier Reef",
    "title": "Australia's Most Iconic Private Island Resort: Hayman Island Luxury with Daily Breakfast, A$400 Credit & Luxury Transfers",
    "description": "A jewel on the shores of the sun-drenched Whitsundays, this award-winning resort boasts breathtaking natural beauty on its doorstep. An icon of island luxury with direct access to the shimmering waters of the Great Barrier Reef, this magnificent resort invites you to take a dip in one of Australia’s largest swimming pools or recline in a private pool cabana overlooking shimmering ocean waters.\n\nCatering to those who appreciate the finer things, InterContinental Hayman Island Resort, an IHG Hotel, boasts five diverse dining options, ranging from the signature ocean-facing restaurant, Pacific, to Mediterranean-influenced Amici. Unwind at the world-class Hayman Spa & Salon - which exudes tranquillity from the moment you enter, or find a private spot to admire the captivating sunsets that perform across the sky each evening.\n\nWhen adventure calls, step outside the resort to find yourself in the heart of the UNESCO World Heritage-listed Great Barrier Reef. Glide through the crystal-clear waters on a kayak or embark on a blue pearl hike to reach breathtaking panoramic views. Whether you're looking for a romantic escape, or dreamy setting for a family trip, this world-class resort is where core memories are made.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsundays",
    "location_heading": "Hayman Island",
    "location_subheading": "Queensland",
    "location_description": "InterContinental Hayman Great Barrier Reef",
    "offer_address": "Hayman Island, Whitsunday Islands, Hayman Island, Queensland 4801, Australia",
    "percentage_discount": 44.0,
    "min_duration": 4,
    "max_duration": 14,
    "price": 1849.0,
    "value": 3294.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BVOlAAO",
    "hero_image": "https://images.luxuryescapes.com/cba38qy4rd1z5qob2kgp",
    "image_two": "https://images.luxuryescapes.com/mbspxkg2xs55dup0yy9",
    "image_three": "https://images.luxuryescapes.com/a6n8egeb2261t6zy38id",
    "vendor_name": "InterContinental Hayman Island Resort, an IHG Hotel",
    "title": "Iconic InterContinental Hayman Island Resort with One of Australia's Largest Swimming Pools",
    "description": "Located on the shores of the sunkissed Whitsundays, InterContinental Hayman Island Resort is a jewel surrounded by breathtaking natural beauty. An icon of island luxury with direct access to the shimmering waters of the Great Barrier Reef, this magnificent resort invites you to take a dip in one of Australia's largest swimming pools or recline in a private pool cabana overlooking shimmering ocean waters. Unwind in the tranquil embrace of the onsite spa, savour gourmet delights at four distinct dining venues and be captivated by the mesmerising sunsets that paint the sky each evening.Whether you’re looking for out-of-this world diving, a romantic escape or a dreamy setting for a family trip, this world-class resort is where travel memories are made.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsundays",
    "location_heading": "Hayman Island",
    "location_subheading": "Queensland",
    "location_description": "InterContinental Hayman Great Barrier Reef",
    "offer_address": "Hayman Island, Hayman Island, AU, 4801",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 361.0,
    "value": 361.0
  }
]