[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000K4EwwYAF",
    "hero_image": "https://images.luxuryescapes.com/x7veh0vv3q9f11orhkuw",
    "image_two": "https://images.luxuryescapes.com/p7crxwph34et1y2gv2sc",
    "image_three": "https://images.luxuryescapes.com/xmacvucva0ydxwqqbpc",
    "vendor_name": "SILA Urban Living",
    "title": "Sophisticated Ho Chi Minh City Escape near Notre Dame with Daily Breakfast & Nightly Cocktails",
    "description": "Set in the vibrant heart of Ho Chi Minh City’s District 3, this sophisticated retreat places you steps from the leafy avenues of Turtle Lake and the creative energy of Le Van Tam Park. Take time to discover the city’s French colonial heritage or stroll to the buzzing cafes and boutiques along Pasteur Street.\n\nBack onsite, bask in the service and style of a luxury hotel, with the convenience and living space of a serviced apartment, paired with access to an outdoor pool and fitness centre. When it's time to indulge, head to Cocotte Bistro, serving up traditional French cuisine and tasty tipples in a modern setting. To catch some rays, opt to dine poolside or on the alfresco terrace.\n\nAfter busy days of exploring, wind down with relaxing treatments at the spa, treat yourself to a sauna and steam room session, soak in the bubbling jacuzzi or find your zen at the onsite yoga studio - everything you need is right here.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Ho Chi Minh City",
    "offer_geo_area_level_2": "Ho Chi Minh City",
    "location_heading": "Ho Chi Minh",
    "location_subheading": "Vietnam",
    "location_description": "SILA Urban Living",
    "offer_address": "21 Ngo Thoi Nhiem, Xuan Hoa Ward Hồ Chí Minh 700000, Vietnam",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 249.0,
    "value": 807.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP4wYAF",
    "hero_image": "https://images.luxuryescapes.com/5a9w80uxigfi9fdimis",
    "image_two": "https://images.luxuryescapes.com/jwesvgbf6pdtnf6umpzq",
    "image_three": "https://images.luxuryescapes.com/9uykspd6nb4coxr8ame",
    "vendor_name": "Novotel Saigon",
    "title": "Contemporary Ho Chi Minh City Centre Retreat with Rooftop Bar, Terrace Pool & Luxe Spa",
    "description": "Immerse yourself in the eclectic charms of Ho Chi Minh City during an elegant stay at this Novotel sanctuary, ideally positioned in the heart of the city in District 3. Revel in the hotel's chic aesthetics, unwind in the well-appointed rooms or if you're a wellness enthusiast, head to InBalance Spa for some much-needed pampering.\n\nVietnamese flavours feature all day at the Food Exchange, but if you're in the mood for something light, enjoy a hearty cuppa at 167 Faubourg Bar or sample tapas and crafted cocktails while soaking up the Saigon skyline at On Top Bar, perched on the 20th floor.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Ho Chi Minh City",
    "offer_geo_area_level_2": "Ho Chi Minh City",
    "location_heading": "Ho Chi Minh",
    "location_subheading": "Vietnam",
    "location_description": "Novotel Saigon Centre",
    "offer_address": "167 Hai Ba Trung, District 3, Ho Chi Minh City 700000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 90.0,
    "value": 90.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwbIAC",
    "hero_image": "https://images.luxuryescapes.com/mytglsl8ylmsdmycr73n",
    "image_two": "https://images.luxuryescapes.com/houz4z76svrgvoow455i",
    "image_three": "https://images.luxuryescapes.com/bf68thqbmj0x4ihcwd93",
    "vendor_name": "Pullman Saigon Centre",
    "title": "Ho Chi Minh Pullman Escape near Ben Thanh Market with Onsite Spa & Rooftop Pool",
    "description": "This Pullman property in vibrant Ho Chi Minh City offers a unique charm. The idea position of the hotel makes it easy for you to explore the bustling Ben Thanh Market, a short stroll away, or discover the city's rich history at the War Remnants Museum.\n\nGet a taste of world-class dining at the hotel's onsite restaurant, Mad Cow Wine & Grill, or sip a cocktail at the rooftop bar while taking in panoramic city views. Enjoy Pullman's signature hospitality with quick check-ins and excellent service, stay fit at the modern fitness center or relax with massages and therapies at the tranquil spa.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Ho Chi Minh City",
    "offer_geo_area_level_2": "Ho Chi Minh City",
    "location_heading": "Ho Chi Minh",
    "location_subheading": "Vietnam",
    "location_description": "Pullman Saigon Centre",
    "offer_address": "148 Tran Hung Dao Boulevard, District 1, Ho Chi Minh 70000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 108.0,
    "value": 108.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009FXtXAAW",
    "hero_image": "https://images.luxuryescapes.com/uawk2luo7yh35vga46l",
    "image_two": "https://images.luxuryescapes.com/s5qc6vdht4um0eh0mhyd",
    "image_three": "https://images.luxuryescapes.com/x3mbhtga0oeezzep1w6",
    "vendor_name": "Lotte Hotel Saigon",
    "title": "Riverside Ho Chi Minh Escape near Saigon Opera House & Iconic Walking Streets",
    "description": "Take in panoramic views of the Saigon River from the tranquil Lotte Hotel Saigon, a stunning five-star hotel nestled in the heart of Ho Chi Minh City. Only a short walk away from the iconic Saigon Opera House, this top-rated hotel - ranked among the top 1% of properties on Tripadvisor in their Best of the Best awards - is perfectly placed between famous walking streets and markets, providing an amazing opportunity to experience the vibrancy and the culture of the city firsthand. Though, you'll be tempted to linger at the hotel with seven restaurants and bars, including elegant Italian Trattoria Ogi and lively Legend Lounge, and the hotel's self-proclaimed widest outdoor swimming pool in Ho Chi Minh City, with a glistening waterfall. After pampering yourself with a four-hand massage at the Legend Healing Spa, sip on a signature cocktail in the lounge, accompanied by soothing piano entertainment.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Ho Chi Minh City",
    "offer_geo_area_level_2": "Ho Chi Minh City",
    "location_heading": "Ho Chi Minh",
    "location_subheading": "Vietnam",
    "location_description": "Lotte Hotel Saigon",
    "offer_address": "2A-4A Ton Duc Thang Street, District 1, Ho Chi Minh City, Vietnam",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xJyGAAU",
    "hero_image": "https://images.luxuryescapes.com/rwagvgp0t9kufqv6h8s4",
    "image_two": "https://images.luxuryescapes.com/mtekqy56bk2292ojv1uh",
    "image_three": "https://images.luxuryescapes.com/kxdpqw9secx3nztgrawh",
    "vendor_name": "SILA Urban Living",
    "title": "Designer Apartment Stay in the Heart of Ho Chi Minh City",
    "description": "More than a launchpad from which to explore some of Vietnam's top attractions, SILA Urban Living invites you to embrace Ho Chi Minh City's modern lifestyle in absolute luxury. Tucked into one of the city's most charming neighbourhoods, this modern sanctuary surpasses expectations, effortlessly merging self-contained apartments with the service and style associated with a high-end hotel experience. Indulge in some self-care at the onsite health club, complete with a 20-metre outdoor pool, before satisfying your cravings at Cocotte Bistro, one of the latest restaurants to grace the Saigon food scene.\n\nStep out of the front doors to discover a bustling streetscape lined with classic colonial architecture, upmarket boutiques and a smattering of cafés. Kickstart explorations with an iconic Vietnamese coffee, then take your pick from myriad nearby attractions including the fascinating War Remnants Museum and Archbishop’s Residence, both a five-minute stroll away.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Ho Chi Minh City",
    "offer_geo_area_level_2": "Ho Chi Minh City",
    "location_heading": "Ho Chi Minh",
    "location_subheading": "Vietnam",
    "location_description": "SILA Urban Living",
    "offer_address": "21 Ngo Thoi Nhiem, Xuan Hoa Ward Hồ Chí Minh 700000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 82.0,
    "value": 82.0
  }
]