[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007m0wHAAQ",
    "hero_image": "https://images.luxuryescapes.com/ystj4mmrxmjpfqhv13cj",
    "image_two": "https://images.luxuryescapes.com/xx2726jz2sqkvxeflpb",
    "image_three": "https://images.luxuryescapes.com/4neqw3v1rcx3rk1hco5",
    "vendor_name": "The Sands Hotel by Nightcap Plus",
    "title": "Grand Opening: Coastal Studios at the Gateway to the Mornington Peninsula with Daily Breakfast",
    "description": "Be one of the first to stay at The Sands Hotel by Nightcap Plus, a brand-new hotel superbly located at the fringes of Victoria’s breathtaking Mornington Peninsula in Carrum Downs. Perfect for couples and families, this fresh hotel is suited to every traveller. Incredible facilities include a vibrant Family Bistro serving up all-time pub favourites, a kids’ area complete with an indoor and outdoor playground, and a fully-equipped fitness centre to squeeze in a workout before hitting the pool tables and catching a game at the onsite sports bar.\n\nBeyond The Sands Hotel by Nightcap Plus, the wonders of Mornington Peninsula await exploration. Drive out to the countless soft-sand beaches for a day in the sun. Stop in at one of the many wineries including Montalto and Pt. Leo Estate, or visit bespoke distilleries, craft breweries and Victoria’s only dedicated rum distillery. Soak your muscles in the thermal hot pools of Peninsula Hot Springs, go fruit picking in Red Hill or head out on a nature walk along the coast.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Carrum Downs",
    "location_subheading": "Victoria",
    "location_description": "The Sands Hotel by Nightcap Plus",
    "offer_address": "71 Hall Rd Carrum Downs Vic 3201 Australia",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 188.0,
    "value": 346.0
  }
]