[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HImeAAG",
    "hero_image": "https://images.luxuryescapes.com/j669gvoakg6cxq5j29j",
    "image_two": "https://images.luxuryescapes.com/saniyqre9auj7v53e0d",
    "image_three": "https://images.luxuryescapes.com/p3ewj6r99sfw76i4xim1d",
    "vendor_name": "Woodlands of Marburg",
    "title": "Boutique Country Escape 45 Minutes from Brisbane with Daily Breakfast",
    "description": "Step back in time and discover Marburg's rich heritage with a well-deserved escape at Woodlands of Marburg - a laidback retreat adjacent to a two-storey, heritage-listed plantation-style mansion in the Queensland countryside, less than an hour's drive from Brisbane. Hidden amid botanical gardens and magnificent jacaranda trees and bunya pines, the Woodlands of Marburg are a quiet refuge that's perfectly placed for relaxation and discovery. Fifteen minutes west of Ipswich, Marburg is renowned for its heritage buildings, including the old German Baptist Church and iconic Marburg Hotel (circa 1879).\n\nYou'll love this property's splendid surroundings, including its renowned Tommy Smith Cafe (named after the estate's original owner), 19th-century chapel, perfectly manicured gardens and spectacular 360-degree views of the Marburg Valley. Shared facilities include an outdoor swimming pool, tennis court, games and recreation room, with ample car parking onsite. Feeling brave? Take a ghost tour of the mansion, revealing its storied history and local legends.\n\n**Your handpicked inclusions:**\n\n- Enjoy a continental breakfast box including toast, condiments, cereal, juice, tea and coffee\n- Toast your escape with a welcome bottle of red or white wine on arrival\n- Start your holiday sooner with guaranteed 1pm check-in\n- There’s no need to rush with 11am checkout on request, subject to availability",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Brisbane",
    "location_heading": "Marburg",
    "location_subheading": "Queensland",
    "location_description": "Woodlands of Marburg",
    "offer_address": "174 Seminary Rd, Marburg Queensland 4346 Australia",
    "percentage_discount": 26.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 185.0,
    "value": 250.0
  }
]