[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007nUryAAE",
    "hero_image": "https://images.luxuryescapes.com/jggdiuhx6vn4fo2xeb8gm",
    "image_two": "https://images.luxuryescapes.com/a145z8h6un0uf0k7slui",
    "image_three": "https://images.luxuryescapes.com/v4go9fkbxdzi5po5wmtq",
    "vendor_name": "Casa Grande Hotel",
    "title": "18th-Century Manor in the Heart of Spain's Wine Country",
    "description": "Step back in time to the 18th-century when you stay at Casa Grande Hotel, located in the charming village of Grañón in Spain’s La Rioja region. Guided by the vision of renowned designer Francesc Rifé, the stylish interiors seamlessly blend modern touches while showcasing the manor’s flawless foundations, including preserved stone walls filled with history. Look out over the adjacent San Juan Bautista church from the hotel’s stone balcony or retreat Casa Grande restaurant. This divine eatery features a seasonal menu adjusted daily according to what the local market has to offer, with a wine list offering extension options from La Rioja and beyond.\n\nSpeaking of wine, vino enthusiasts can't pass up a visit to La Rioja for some of the best Spanish reds in the country. Spend days hopping between vineyards, blessed by perpetually sunny skies and rich vines bursting with fruit. Crisscrossing the tiny village of Grañon is the Way of St. James, part of the Camino trail wherein pilgrims follow a trail leading to the shrine of the apostle Saint James the Great in the cathedral of Santiago de Compostela in Galicia.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "La Rioja",
    "offer_geo_area_level_2": "Grañón",
    "location_heading": "La Rioja",
    "location_subheading": "Spain",
    "location_description": "Casa Grande Hotel",
    "offer_address": "C. el Caño, 13, 26259 Grañón, La Rioja, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 180.0,
    "value": 180.0
  }
]