[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbPbcAAF",
    "hero_image": "https://images.luxuryescapes.com/nfm01n6ugk4poakhm8",
    "image_two": "https://images.luxuryescapes.com/smk14bi4jppcr4ez1p5p",
    "image_three": "https://images.luxuryescapes.com/paqephosig01cnpymjs",
    "vendor_name": "Pangkor Laut Resort",
    "title": "Malaysia Private Island Villas with Daily Breakfast, Nightly Dinner & Return Speedboat Transfers",
    "description": "Welcome to a secluded private island paradise, where vibrant rainforest meets pristine beaches and emerald waters. Experience an untouched slice of paradise at Pangkor Laut Resort where the villas are designed to harmonise with nature - whether perched atop lush hills, floating gracefully on the Straits of Malacca or nestled within the jungle canopy.\n\nRelaxation lies at the heart of the resort, with two stunning pools, a dedicated activities program to help you plan your island explorations and onsite tennis and squash courts. The award-winning Spa Village blends the healing traditions of Malay, Chinese and Indian cultures, offering a sanctuary for complete rejuvenation.\n\nDining here is equally exceptional, with six exquisite restaurants and bars offering diverse, globally inspired cuisine. From personalised Asian dishes at Uncle Lim’s Kitchen to beachfront cocktails at Chapman’s Bar and fresh seafood at Fisherman’s Cove, each venue provides a unique, unforgettable experience.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Perak",
    "offer_geo_area_level_2": "Pangkor Laut",
    "location_heading": "Pangkor Laut Island",
    "location_subheading": "Malaysia",
    "location_description": "Pangkor Laut Resort",
    "offer_address": "Pangkor Laut Island, Perak, Lumut 32200, Malaysia",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 959.0,
    "value": 3014.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPaMtQAK",
    "hero_image": "https://images.luxuryescapes.com/y1w3ds5vnrg4oi3taf93",
    "image_two": "https://images.luxuryescapes.com/cbwyqoq0cxdbpwxuu46t",
    "image_three": "https://images.luxuryescapes.com/x6vfgedkggmhwtnhfjgo",
    "vendor_name": "Pangkor Laut Resort",
    "title": "Award-Winning Indulgence on a Romantic Private Island",
    "description": "Set on a private island, and previously voted ‘Number One in the World’ by Condé Nast Traveller, Pangkor Laut Resort is nestled in the shade of forest giants as old as the land. Pristine bays shaded by lush rainforest and evening skies woven with colour are a privilege exclusive only to resort guests. Each guest villa is sumptuously appointed; signature Sea and Spa Villas stand above gently lapping waves, while the Garden Villas allow guests to contemplate verdant flora and landscaped gardens as tropical birds take flight. Enjoy daily buffet breakfast, decadent dining experiences, nightly sunset drinks at the Royal Bay Beach Club, a romantic sunset cruise with free-flow drinks and canapés, 50-minute couples spa treatment, and much more.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Negeri Perak",
    "offer_geo_area_level_2": "",
    "location_heading": "Pangkor Laut Island",
    "location_subheading": "Malaysia",
    "location_description": "Pangkor Laut Resort - OLD",
    "offer_address": "Pangkor Laut Island, 32200 Lumut, Perak, Malaysia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 875.0,
    "value": 1822.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000LcRSEAA3",
    "hero_image": "https://images.luxuryescapes.com/k7oskd6ssaff1lbrjjue",
    "image_two": "https://images.luxuryescapes.com/migb7jeyxqetoxmok1lt",
    "image_three": "https://images.luxuryescapes.com/smvo6hlpaou0cofmwymz",
    "vendor_name": "Pangkor Laut Resort",
    "title": "High-End Private Island Luxury in Malaysia",
    "description": "Escape to private island paradise and let reality slip away at the 2017 runner up of Resort Hotel of the Year at the Small Luxury Hotels of the World Awards. Five-star luxury is exceeded at Malaysia’s Pangkor Laut Resort with daily buffet breakfast, two unique dinner experiences, nightly sunset drinks for two at the Royal Bay Beach Club, a romantic sunset cruise for two with free-flow drinks and canapes, two 50-minute spa treatments to share, a jungle walk for two and much more.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Perak",
    "offer_geo_area_level_2": "Pangkor Laut",
    "location_heading": "Pangkor Laut Island",
    "location_subheading": "Malaysia",
    "location_description": "Pangkor Laut Resort - 2018*",
    "offer_address": "Pangkor Laut Island, 32200 Lumut, Perak, Malaysia",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 878.0,
    "value": 1811.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006C7PYAA0",
    "hero_image": "https://images.luxuryescapes.com/4fhy70sjr5r7peyel1j",
    "image_two": "https://images.luxuryescapes.com/g6ij8s4k99uhm29lewst",
    "image_three": "https://images.luxuryescapes.com/dly5evbzgnetdtejimkn",
    "vendor_name": "Pangkor Laut Resort",
    "title": "Jungle-Style Private Island Escape off Malaysia's West Coast",
    "description": "Transport yourself to a whole new level of luxury with a one-of-a-kind jungle stay on a private island at Pangkor Laut Resort, part of the Small Luxury Hotels of the World group located just over three hours from Kuala Lumpur. Surrounded by lush terrain, fine white sand and pristine waters, the Pangkor Laut Resort is the perfect place to find refuge from the real world and enjoy a romantic escape with someone special. With seven bars and restaurants, including a waterfront beach club, plus an array of invigorating experiences such as deep-sea fishing, jungle trekking, and a variety of cruises (surcharges may apply), there is no shortage of ways to enjoy this island paradise. If you’re opting to switch off completely, you can always indulge in a treatment at the Spa Village, a four-acre haven of serenity.\n\nEach guest villa is sumptuously appointed, with Garden Villas nestled in verdant flora, Hill Villas allowing guests to contemplate the endless ocean, and the signature Sea Villas perched above gently lapping waves.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Perak",
    "offer_geo_area_level_2": "Pangkor Laut",
    "location_heading": "Pangkor Laut Island",
    "location_subheading": "Malaysia",
    "location_description": "Pangkor Laut Resort",
    "offer_address": "Pangkor Laut Island, 32200 Lumut, Perak, Malaysia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]