[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Jf2NuYAJ",
    "hero_image": "https://images.luxuryescapes.com/di2hjl53fdqkt549zx8",
    "image_two": "https://images.luxuryescapes.com/j57m1ti5nev1v5vx3kba",
    "image_three": "https://images.luxuryescapes.com/qciqq39nfrimz40eajw",
    "vendor_name": "Hotel Don Pepe Gran Melia",
    "title": "Marbella Golden Mile Seafront Oasis with Daily Breakfast, RedLevel Lounge Access & Daily EUR50 Credit",
    "description": "Sink into Costa del Sol glamour at this landmark Meliá destination, a lavish beachfront hideaway on Marbella’s coveted Golden Mile. Steps from heavenly sands and just a short stroll to the cobbled charm of the city's Old Town, this sun-drenched Mediterranean oasis is perfectly placed for shopping, yacht-spotting in Puerto Banús and leisurely lunches under blue skies. Enjoy RedLevel Lounge access with a private concierge, exclusive breakfast and a selection of canapés served throughout the day.\n\nStart your day with ocean breezes and a poolside breakfast beneath swaying trees. With direct beach access, soak up the seaside atmosphere all day long, or opt for a trip to the spa for total relaxation. Come evening, sip sake in the ocean-facing Tahini Restaurant & Sushi Bar or go big at ERRE & Urrechu Restaurant, where fire-grilled specials, fresh ingredients and fine wine take centre stage.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "Marbella",
    "location_heading": "Marbella",
    "location_subheading": "Spain",
    "location_description": "Hotel Don Pepe Gran Meliá",
    "offer_address": "Via Hotel Don Pepe s/n, 29602 Marbella, Málaga, Spain",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 769.0,
    "value": 2360.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DXXDpYAP",
    "hero_image": "https://images.luxuryescapes.com/43mxifq0qbyh96urc24",
    "image_two": "https://images.luxuryescapes.com/vill5m18qs16nvemdvtg",
    "image_three": "https://images.luxuryescapes.com/wb2g1p6ss7olkl1moa",
    "vendor_name": "Kimpton Los Monteros Marbella",
    "title": "Grand Opening: Coastal Marbella Opulence with Daily Breakfast, Resort Credit & Free-Flow Wine Hour",
    "description": "Nestled between golden sands and the glistening ocean, this brand-new five-star hotel is your personal slice of Spanish coastal heaven. Here, Andalusian soul meets Kimpton style, with Spanish architecture and manicured grounds setting the tone for laid-back living.\n\nFrom the second you step through the door of Kimpton Los Monteros Marbella, you're part of the family. Spend lazy days around the indoor or outdoor pool, then wind down in the spa, where steam, stillness and skilled hands melt every last care away. Linger over local flavours at Jara before ascending to Escondido Rooftop to watch the sun set in technicolour.\n\nA stone’s throw from Marbella’s old town and its yacht-filled marina, Los Monteros gives you the best of both worlds - buzz when you want it, bliss when you don’t. As for paradise? Let’s just say it comes with sea views and seriously good sangria.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "Marbella",
    "location_heading": "Marbella",
    "location_subheading": "Spain",
    "location_description": "Kimpton Los Monteros Marbella",
    "offer_address": "Calle del Lince, Marbella 29603, Spain",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 689.0,
    "value": 1190.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JB8mIAG",
    "hero_image": "https://images.luxuryescapes.com/qkk4xossmq76zjfum3vj",
    "image_two": "https://images.luxuryescapes.com/sx5jkvplxrrop0o638z",
    "image_three": "https://images.luxuryescapes.com/9zk5dxkyptuh567x04iw",
    "vendor_name": "Hard Rock Hotel Marbella",
    "title": "Stylish Marbella Hard Rock Escape in Puerto Banus with Daily Breakfast & Spa Access",
    "description": "Set against the sun-drenched Costa del Sol, this hotel is a rock 'n' roll paradise that turns luxury living into an electrifying experience. Hard Rock Hotel Marbella boasts two pools, the Rock Spa for world-class treatments and pool massages, as well as six bars and restaurants and regular live music to keep your energy as high as a headline act.\n\nLocated on Marbella's Golden Mile, you're at the epicentre of glamour and Mediterranean magic. Steps away from Puerto Banus marina, you can dive into a playground of fine dining and pulsating nightlife. With the Sierra Blanca mountains as your backdrop and golden sands melting into crystal-blue waters, this is your stage to craft legendary memories.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "Marbella",
    "location_heading": "Marbella",
    "location_subheading": "Spain",
    "location_description": "Hard Rock Hotel Marbella",
    "offer_address": "Urbanizacion Nueva Andalucía, C. Las Violetas, Marbella 29660, Spain",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 379.0,
    "value": 836.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HaJ2IAK",
    "hero_image": "https://images.luxuryescapes.com/pz7z0slpmc7a39g77klk",
    "image_two": "https://images.luxuryescapes.com/rqs181v6d9ef6erk4ds",
    "image_three": "https://images.luxuryescapes.com/zqhci1k17dwippllmg9o",
    "vendor_name": "Alanda Hotel Marbella",
    "title": "Costa del Sol Marbella Escape near Beach with Daily Breakfast & EUR100 Spa Credit",
    "description": "Discover the charm of Spain’s Costa del Sol at this sophisticated retreat nestled in Marbella’s exclusive Golden Mile. Enjoy top-notch amenities, including a serene spa offering rejuvenating treatments and a soon-to-open water circuit. With the beach just minutes away and the historic Old Town within easy reach, you'll be perfectly positioned to explore this vibrant city.\n\nSavour Mediterranean cuisine at the hotel's various restaurants, and unwind at the Golden Mile Lounge Bar, where expertly crafted health drinks await in a serene setting that feels like a haven of tranquility.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "Marbella",
    "location_heading": "Marbella",
    "location_subheading": "Spain",
    "location_description": "Alanda Marbella Hotel",
    "offer_address": "Boulevard Alfonso de Hohenlohe, Marbella, Malaga 29602, Spain",
    "percentage_discount": 77.0,
    "min_duration": 3,
    "max_duration": 19,
    "price": 379.0,
    "value": 1660.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMlMTAA1",
    "hero_image": "https://images.luxuryescapes.com/fktsbmfbhee6yccuwpuwq",
    "image_two": "https://images.luxuryescapes.com/ghtc7egbgvea1obp3vr7",
    "image_three": "https://images.luxuryescapes.com/15dn0fzq6jiequju0v9",
    "vendor_name": "METT Hotel & Beach Resort Marbella",
    "title": "Costa del Sol Beachfront Glamour with Four Dining Venues & Onsite Spa",
    "description": "Nestled in the heart of the sun-kissed Costa del Sol, this luxurious resort is a dazzling gem perfectly poised between the azure Mediterranean Sea and the majestic Andalusian mountains of southern Spain. Savour the sophisticated flavours of Europe at the resort’s gourmet restaurants, or unwind with a handcrafted cocktail beside the sparkling infinity pool.\n\nDiscover the enchanting charm of Marbella’s historic Old Town, with its cobblestone streets and vibrant culture. For golf aficionados, the resort offers unrivalled access to some of the region’s most prestigious and scenic golf courses, ensuring every moment is touched with glamour and refinement.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "Estepona",
    "location_heading": "Marbella",
    "location_subheading": "Spain",
    "location_description": "METT Hotel & Beach Resort Marbella",
    "offer_address": "Urbanización Costalita, Estepona, Cancelada 29680, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 355.0,
    "value": 355.0
  }
]