[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FBWn8YAH",
    "hero_image": "https://images.luxuryescapes.com/pxjxktkq3a9j37wirp7a",
    "image_two": "https://images.luxuryescapes.com/ztd7t2q1lrekjytjalf8",
    "image_three": "https://images.luxuryescapes.com/vhdg0zq1brw8fbq8lmds",
    "vendor_name": "Shangri-La's Mactan Resort & Spa",
    "title": "Philippines Coastal Oasis on Mactan Island with Daily Breakfast & Nightly Dinner",
    "description": "Experience true coastal glam with a stay at this haven just off the island of Cebu. Sitting within a tropical paradise on Mactan Island, you can spend your days exploring 13 hectares of manicured gardens, snorkel and dive into pristine waters and come face-to-face with Cebu's magnificent whale sharks.\n\nWith a serene onsite spa, private white-sand beach and two sparkling pools, there's a spot for everyone to find their zen. Foodies will be spoiled for choice across four onsite restaurants, from Italian fare at Acqua to al-fresco grill and seafood at Cowrie Cove. For light bites and cocktails right on the beach, head to Breeze, or enjoy a live cultural show at the poolside Buko Bar.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "Central Visayas",
    "offer_geo_area_level_2": "Lapu-Lapu",
    "location_heading": "Cebu",
    "location_subheading": "Philippines",
    "location_description": "Shangri-La Mactan, Cebu",
    "offer_address": "Punta Engaño Road, Lapu-Lapu City, Cebu, 6015 Cebu, Philippines",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 27,
    "price": 629.0,
    "value": 1381.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EDEnlAAH",
    "hero_image": "https://images.luxuryescapes.com/hj6ivf3rwyvquf5ficl",
    "image_two": "https://images.luxuryescapes.com/6832pi36yq1uo77kd3z7",
    "image_three": "https://images.luxuryescapes.com/jecmqx5vz3mr3q9otugf",
    "vendor_name": "Jpark Island Resort & Waterpark",
    "title": "Fun-Filled Cebu Beachside Escape with Daily Dining & Waterpark Access",
    "description": "Splash into beachside bliss with a stay at JPark Island Resort & Waterpark, perfectly positioned in the heart of one of the Philippines’ best-loved islands. The resort boasts a spectacular, private white-sand beach and a wealth of fun-filled attractions - including six shimmering pools, a dive centre and a top-notch waterpark that sprawls across the resort’s central grounds. Plus, little ones (under 7) stay for free.\n\nThere’s no better place to discover Cebu’s countless delights - head north for sublime diving or discover the city’s brilliant collection of bars, eateries and historic Spanish landmarks. But no need to wander far when you can dine onsite across eight world-class restaurants - savour fresh-caught fish at Havana by the Sea, Seoul homestyle favourites at Maru Korean Restaurant or pastries and coffee at Jlounge.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "Central Visayas",
    "offer_geo_area_level_2": "Lapu-Lapu",
    "location_heading": "Cebu",
    "location_subheading": "Philippines",
    "location_description": "Jpark Island Resort & Waterpark",
    "offer_address": "M.L. Quezon National Highway, Maribago, Lapu-Lapu City 6015, Cebu, Philippines",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 518.0,
    "value": 1330.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zXGGAA2",
    "hero_image": "https://images.luxuryescapes.com/owtefzap3cyguysypil",
    "image_two": "https://images.luxuryescapes.com/ufvxibkqvlwu9l00cy64",
    "image_three": "https://images.luxuryescapes.com/utstzo5ybq1d5y0fmhvh",
    "vendor_name": "Shangri-La's Mactan Resort & Spa",
    "title": "Philippines Shangri-La Coastal Oasis near Cebu on Mactan Island",
    "description": "Experience one of Lapu-Lapu City's most stylish hotels with a stay at the lush five-star Shangri-La Mactan, Cebu. Nestled within a tropical paradise that spans 13 hectares of manicured gardens on the coast of Mactan Island, this beachfront paradise feels remote, yet very central. Designed with inspiration from traditional Filipino architecture, you can expect casual glamour and elements of local craftsmanship and modern technologies, traditional décor and wide swathes of lush greenery.\n\nWhile here, indulge at Chi, The Spa, with a luxurious massage or traditional well-being treatment inspired by ancient Asian practices. Or, get your heart pumping in the fitness centre then take a dip in one of the two swimming pools. Idyllic afternoons are best spent lazing on the private white-sand beach, or adrift with 160 species of aquatic life at the resort's Marine Sanctuary. Foodies are also spoiled for choice with an extraordinary variety of cuisines from every corner of the globe across five restaurants.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "Central Visayas",
    "offer_geo_area_level_2": "Lapu-Lapu",
    "location_heading": "Cebu",
    "location_subheading": "Philippines",
    "location_description": "Shangri-La Mactan, Cebu",
    "offer_address": "Punta Engano Road, Lapu-Lapu, Cebu 6015 Philippines",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 165.0,
    "value": 165.0
  }
]