[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ggi4tAAB",
    "hero_image": "https://images.luxuryescapes.com/dx57qqc83rclwny88me",
    "image_two": "https://images.luxuryescapes.com/ug3nkx36ss5bxjtkkfd",
    "image_three": "https://images.luxuryescapes.com/garywuverphqo58uv52e",
    "vendor_name": "AYANA Komodo Waecicu Beach",
    "title": "Five-Star Paradise on Indonesia’s Flores Island near Komodo National Park with Daily Breakfast & Nightly Dinner",
    "description": "Nestled in one of the most rugged and picturesque islands of the Indonesian archipelago lies AYANA Komodo Waecicu Beach. Cradled between the shimmering Flores Sea and the rugged Komodo National Park, this retreat offers a unique blend of luxury and adventure. Spend time learning the importance of marine conservation with the resort’s leading marine biologist before snorkelling through the underwater forest to see their efforts in action. Dine on the freshest ingredients at KISIK Seafood Restaurant with your feet in the sand, sip refreshing drinks at Unique Rooftop Bar or embark on a thrilling Komodo dragon-spotting adventure in the national park.\n\nFor a more tranquil experience, stroll along the pristine private beach or indulge in a rejuvenating treatment at the resort's serene spa. You’ll also have easy access to all the best activities on the island, with Komodo dragon tours, hiking and island-hopping cruises at your fingertips.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "East Nusa Tenggara",
    "offer_geo_area_level_2": "Labuan Bajo",
    "location_heading": "Flores",
    "location_subheading": "Indonesia",
    "location_description": "AYANA Komodo Waecicu Beach",
    "offer_address": "Waecicu Beach, Labuan Bajo, Flores, East Nusa Tenggara 86554, Indonesia",
    "percentage_discount": null,
    "min_duration": null,
    "max_duration": null,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cqAT2QAM",
    "hero_image": "https://images.luxuryescapes.com/l1wrizvirs3i16m3d15w",
    "image_two": "https://images.luxuryescapes.com/kw1qdbjjh9xwi6hyaiub",
    "image_three": "https://images.luxuryescapes.com/4u0brpzmwi9kn2n7gt9p",
    "vendor_name": "Sudamala Resort Seraya",
    "title": "Tropical Escape on Seraya Island, Flores with Daily Dining",
    "description": "Escape to an island paradise in Flores, Indonesia at Sudamala Resort Seraya, a secluded oasis with idyllic snorkelling spots. Surround yourself with natural beauty and enjoy full-board dining, with daily breakfast, lunch and dinner included, plus return transfers, a daily cocktail per person and unlimited use of paddleboards, canoes and snorkelling gear.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "East Nusa Tenggara",
    "offer_geo_area_level_2": "Labuan Bajo",
    "location_heading": "Flores",
    "location_subheading": "Indonesia",
    "location_description": "Sudamala Resort Seraya",
    "offer_address": "Jalan Soekarno Hatta, Labuan Bajo, Kecamatan Komodo, Flores, Komodo, Labuan Bajo, Komodo, West Manggarai, Nusa Tenggara Tim., Indonesia",
    "percentage_discount": 43.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 614.0,
    "value": 1082.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004RtZSAA0",
    "hero_image": "https://images.luxuryescapes.com/awy2cociq479n0uwlvke",
    "image_two": "https://images.luxuryescapes.com/cctkwqdc5ki5ax7e6bl",
    "image_three": "https://images.luxuryescapes.com/c8igdqyajiloh4hfvd3",
    "vendor_name": "AYANA Komodo Waecicu Beach",
    "title": "Five-Star Beachfront Luxury on Indonesia’s Flores Island near Komodo National Park",
    "description": "A perfectly balanced retreat welcomes you to the heart of Komodo National Park: AYANA Komodo Waecicu Beach. Create lasting memories in the lap of luxury with state of the art facilities and services while surrounded by unparalleled natural beauty from this renowned sanctuary on Indonesia's Flores Island.\n\nIf you long to break away from everyday life, where your thoughts can roam free while kayaking to a private island or you can mingle with new friends on the bustling 250m-long private jetty, AYANA Komodo Waecicu Beach is just the spot. You can also pamper yourself with a luxurious massage at AYANA Spa, unwind with yoga on the Yoga Deck with views out to the ocean, or take a dip in the sparkling infinity pool. You’ll also have easy access to all the best activities on the island, with Komodo Dragon tours, hiking, and island-hopping cruises at your doorstep.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "East Nusa Tenggara",
    "offer_geo_area_level_2": "Labuan Bajo",
    "location_heading": "Flores",
    "location_subheading": "Indonesia",
    "location_description": "AYANA Komodo Waecicu Beach",
    "offer_address": "Waecicu Beach, Labuan Bajo, Flores, East Nusa Tenggara 86554, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 138.0,
    "value": 138.0
  }
]