[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNEaSAAX",
    "hero_image": "https://images.luxuryescapes.com/ptbpmnzdir3g40pvzam5",
    "image_two": "https://images.luxuryescapes.com/ptjxzvro4njdx88kauc",
    "image_three": "https://images.luxuryescapes.com/eely8t046njcrsx74unb",
    "vendor_name": "Swiss-Belsuites Victoria Park, Auckland",
    "title": "Posh Central Auckland Apartments with City Views & Daily Breakfast",
    "description": "Admire Auckland's striking skyline from the heart of the city with a sophisticated stay at Swiss-Belsuites Victoria Park - the ideal launchpad to discover the charm of New Zealand's culture capital. Boasting a stylish collection of self-contained apartments, accompanied by unparalleled hospitality, this central hub features all the luxuries you'd expect from a world-class apartment hotel, including state-of-the-art kitchens and beautifully appointed living and dining areas, along with breathtaking city vistas. Swiss-Belsuites' enviable location, adjacent to the 100-year-old Victoria Park Market, means you'll be placed mere moments from iconic attractions such as SkyCity Casino and Viaduct Harbour.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Swiss-Belsuites Victoria Park",
    "offer_address": "206 Victoria Street West, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 269.0,
    "value": 721.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JSFVEAA5",
    "hero_image": "https://images.luxuryescapes.com/2xr35tx4j87wtgcn1cn7",
    "image_two": "https://images.luxuryescapes.com/qmrvfacwvgjsvk8i4a",
    "image_three": "https://images.luxuryescapes.com/8m9honjwu1z8xs7p28",
    "vendor_name": "Nesuto Stadium Hotel and Apartments",
    "title": "Modern Downtown Auckland Break with Daily Breakfast & Nightly Drinks",
    "description": "Experience the vibrancy of downtown Auckland from the comfort of this urban retreat, located in the city's bustling entertainment district. With comfortable rooms and apartments, it's the perfect respite after days of exploration.\n\nFuel up with buffet breakfast at the onsite NOOK restaurant, and enjoy a tipple come evening. Find yourself conveniently close to Spark Arena, the city's premier entertainment venue, and the thriving Britomart shopping and dining precinct.\n\nVenture further to explore the historic Auckland Art Gallery or stroll along the picturesque waterfront at Viaduct Harbour. With everything in the city at your very fingertips, balance out busy days with cosy evenings at this contemporary escape.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Nesuto Stadium Hotel and Apartments",
    "offer_address": "40 Beach Road, Auckland 1010, New Zealand",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 179.0,
    "value": 392.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcBUtAAN",
    "hero_image": "https://images.luxuryescapes.com/mbqefxs1q7gzk2emca74",
    "image_two": "https://images.luxuryescapes.com/svkcolvs1nck38rk94f",
    "image_three": "https://images.luxuryescapes.com/pkzv3qvl7m2sewodygq5",
    "vendor_name": "Waitakere Resort & Spa",
    "title": "Tranquil Rainforest Retreat 30 Minutes from Auckland with Daily Breakfast, Nightly Drinks & Resort Credit",
    "description": "Snuggled amid lush rainforests and Auckland's spectacular Waitakere Ranges, discover a world of serenity at this luxurious retreat offering breathtaking vistas of the Hauraki Gulf. A short stroll from the nearby black-sand beaches, thrilling rainforest trails and bush hikes, retreat to this family-owned opulent sanctuary, where you will awaken to the gentle rustle of forest leaves and birdsong. After a day of adventure, unwind at the onsite spa with a bespoke treatment, and dine at the sophisticated restaurant serving elevated local ingredients.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Waitakere Resort & Spa",
    "offer_address": "573 Scenic Drive, Waiatarua, Auckland 0612, New Zealand",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 209.0,
    "value": 407.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LqaqAAC",
    "hero_image": "https://images.luxuryescapes.com/3w64ufrkqw5vlxni2a8r",
    "image_two": "https://images.luxuryescapes.com/qywc9u4iabg5j1nl5lc",
    "image_three": "https://images.luxuryescapes.com/4jxmtvps14mppqo1ojq",
    "vendor_name": "Swiss-Belsuites Victoria Park, Auckland",
    "title": "Central Auckland Family Suite for up to Four Guests with Daily Breakfast",
    "description": "Perched in the heart of Auckland City, Swiss-Belsuites Victoria Park ticks all of the boxes for a city escape, with the 100-year-old Victoria Park Market, the iconic SkyCity Casino and stunning Viaduct Harbour within a short 10-minute walk. Stay in a luxuriously appointed Two-Bedroom Suite for up to four people with daily continental breakfast including one coffee per person, a bottle of wine on arrival and guaranteed 1pm late checkout.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland",
    "offer_geo_area_level_2": "",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Swiss-Belsuites Victoria Park - June 2020",
    "offer_address": "206 Victoria Street West, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 299.0,
    "value": 685.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HzY1NYAV",
    "hero_image": "https://images.luxuryescapes.com/p7614a06fbcks2ouq9q",
    "image_two": "https://images.luxuryescapes.com/vaiqkbkiy4j5mbcjcv8",
    "image_three": "https://images.luxuryescapes.com/3tpdowys72qs4c6lu1l",
    "vendor_name": "Hotel Indigo Auckland",
    "title": "Grand Opening: Midtown Auckland Elegance with Four-Course Dinner, Daily Breakfast & Valet Parking",
    "description": "Discover Auckland from a fresh perspective at this brand-new, design-led hotel in the heart of Midtown. Once home to Dexter and Crozier's 'The Motor House', this heritage-meets-modern retreat offers sweeping views of the harbour and Sky Tower, which is just steps away. Each floor doubles as a mini gallery that celebrates local artistry while the vibrant neighbourhood outside beckons with diverse cuisines and entertainment.\n\nBegin your day at Bistro Saine, where French-inspired breakfast favourites - like caramelised crepes and creamy potato gratin - set the tone for adventure. With the Auckland Art Gallery and Auckland Domain nearby, this hotel's central location places the best of the city within easy reach. With valet parking and a front desk team ready to point you toward the city's hidden gems, this is your gateway to the soul of the city.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Indigo Auckland, an IHG Hotel",
    "offer_address": "53 Saint Patricks Square, Auckland Central, Auckland 1010, New Zealand",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 249.0,
    "value": 650.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004RmjCAAS",
    "hero_image": "https://images.luxuryescapes.com/c6638axgxwdta7d1sh2c",
    "image_two": "https://images.luxuryescapes.com/s03lnkf9sez9xmb2vh4",
    "image_three": "https://images.luxuryescapes.com/92uh7nz4qwijvy1oqsnd",
    "vendor_name": "Hilton Auckland",
    "title": "Five-Star Hilton Auckland Waterfront Escape with Daily Breakfast & Nightly Cocktails",
    "description": "Immerse yourself in the heritage neighbourhoods, vibrant dining scene and spectacular maritime location of Auckland, with a glamorous stay at Hilton Auckland. Renowned for its stunning nautically-inspired architecture and excellent amenities and service typical of the world-renowned Hilton brand, it's no surprise this luxury hotel was recognised in the TripAdvisor Travellers' Choice 2020 Awards.\n\nThis luxury hotel graces the city's Princes Wharf complex, with stunning views over Waitemata Harbour. Providing easy access to high-end bars and world-class dining, and a day trip away from some of the North Island's most iconic landscapes and wine regions, Hilton Auckland makes the perfect base for a New Zealand discovery. When you're not exploring, take a dip in the hotel's pool, indulge in harbourside cocktails at the Bellini Bar or treat yourself to fresh local seafood at the water-view FISH restaurant.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Hilton Auckland",
    "offer_address": "147 Quay Street, Auckland 1010, New Zealand",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 298.0,
    "value": 959.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FjLqfAAF",
    "hero_image": "https://images.luxuryescapes.com/epkd57onctyk2jx05mr",
    "image_two": "https://images.luxuryescapes.com/tkpyzlxats92bcr0t9ge3",
    "image_three": "https://images.luxuryescapes.com/zqvs9mk5xrr22h3mk52r",
    "vendor_name": "Maison Blanc Lodge",
    "title": "Luxury Auckland Bush Lodge Retreat with Daily Private Chef Brunch, Outdoor Spa & Sauna",
    "description": "Step inside sprawling luxury and revel in the tranquil seclusion of Maison Blanc Lodge, a bush retreat in Auckland's Waitakere Ranges. Be spoilt with daily brunch, featuring an array of local ingredients prepared by a private chef, and indulge in a charcuterie board and bottle of wine on arrival. Melt into the outdoor heated pool and spa overlooking the woodlands, relax in the indoor sauna and cosy up by the showstopping fireplace. Only a short drive from the city, the lodge provides seamless access to beautiful wild beaches and some of the best hiking trails in New Zealand.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Maison Blanc Lodge",
    "offer_address": "33 Kohu Road, Titirangi, Auckland 0604, New Zealand",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 899.0,
    "value": 1570.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VoIhAAK",
    "hero_image": "https://images.luxuryescapes.com/sl77auerkit49hwbzfga",
    "image_two": "https://images.luxuryescapes.com/y7ndv8kvm8xyhi3p1m7j",
    "image_three": "https://images.luxuryescapes.com/coshasexpif3gvcj67p",
    "vendor_name": "Hotel Fitzroy by Luminous",
    "title": "Boutique Ponsonby Luxury with Daily Breakfast, Complimentary Minibar & Evening Drinks",
    "description": "Experience five-star boutique luxury at Hotel Fitzroy curated by Fable - a brand new, beautifully restored landmark just steps from Auckland's upmarket Ponsonby suburb, brimming with boutique shops and high-end restaurants. Perfectly balancing five-star features with bespoke service, every aspect of the guest experience at this 10-room retreat has been designed to elevate and redefine luxury: from the interiors that pay homage to the hotel's history to the attentive hosts on hand to curate your perfect Ponsonby escape.\n\nNewly opened in September 2020, Hotel Fitzroy is enviably located in Auckland's most sought after suburb. Foodies will love this upmarket area, renowned for its phenomenal restaurants showcasing local, authentic New Zealand produce while shopaholics can spend a day gracing the trendy boutiques that stretch the length of Ponsonby Road.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Fitzroy",
    "offer_address": "43 Richmond Road, Grey Lynn, Auckland 1021, New Zealand",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 379.0,
    "value": 773.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ClSI7YAN",
    "hero_image": "https://images.luxuryescapes.com/ifksqs8arlgt9eecf9m",
    "image_two": "https://images.luxuryescapes.com/ye5sg18qedld36vobux",
    "image_three": "https://images.luxuryescapes.com/0hqj50nhyd2klm4hzxo",
    "vendor_name": "QT Auckland",
    "title": "Auckland Harbourside Luxury with Rooftop Bar, Daily Breakfast & Nightly Drinks",
    "description": "The quintessential QT experience combines eclectic decor, world-class hospitality and luxurious living. At QT Auckland, you'll enjoy it all, along with an unbeatable harbourside location.\n\nNestled in the heart of Auckland, this hotel puts you steps away from the city’s vibrant dining, fashion and arts scene. After a day of exploring, unwind in your sophisticated accommodation or head to the Rooftop at QT, where peak drink-and-dine moments unfold against the city’s stunning skyline.\n\nFor a taste of the Mediterranean, indulge in the onsite restaurant, Esther, bringing flavours inspired by sun-soaked shores to Auckland’s Viaduct Harbour.\n\nAuckland’s unique blend of natural beauty and urban vibrancy puts the black-sand beaches of the West Coast, the lush trails of the Waitākere Ranges and the turquoise waters of the Hauraki Gulf all within easy reach of your elegant stay.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "QT Auckland",
    "offer_address": "4 Viaduct Harbour Avenue, Westhaven, Auckland 1010, New Zealand",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 369.0,
    "value": 692.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z3waAAA",
    "hero_image": "https://images.luxuryescapes.com/3on3hlfohwbs1pbjsd",
    "image_two": "https://images.luxuryescapes.com/onhcf0mw9ot9b68blap",
    "image_three": "https://images.luxuryescapes.com/kd7ogswyh8b4glpk6ua",
    "vendor_name": "QT Auckland",
    "title": "Grand Opening: Luxe QT Auckland Stay with Daily Breakfast & Nightly Drinks",
    "description": "On the shimmering shoreline of Viaduct Harbour, the brand-new QT Auckland will plunge you into nautical-inspired luxury as the city unfurls before you like a string of pearls. The waterfront and fine-dining of the nearby Wynyard Quarter beckons, while the Rooftop at QT bar, soaring above the City of Sails, is set for good times - the perfect place to clink together drinks as dusk falls over the city’s glittering lights.\n\nCome for the visual feast, the enviable location close to Queen Street’s boutiques, Commercial Bay and the heritage Britomart precinct, and the world-class dining onsite, where you’re invited to coast along the French Riviera, enjoy a pitstop in Sicily, then get lost in the magnificence of Morocco at Sean Connolly’s newest restaurant, Esther.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "QT Auckland",
    "offer_address": "4 Viaduct Harbour Avenue, Westhaven, Auckland 1010, New Zealand",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 309.0,
    "value": 624.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009Dm28AAC",
    "hero_image": "https://images.luxuryescapes.com/74l8rbznflm803gmw6ke",
    "image_two": "https://images.luxuryescapes.com/nx65yyiinmgy4tw3e4hl",
    "image_three": "https://images.luxuryescapes.com/64p85ep16jyujv6j629",
    "vendor_name": "Swiss-Belsuites Victoria Park, Auckland",
    "title": "Central Auckland Self-Contained Apartments with City Views & Daily Breakfast",
    "description": "Admire Auckland's striking skyline from the heart of the city with a sophisticated stay at Swiss-Belsuites Victoria Park - an ideal launchpad from which to discover the charms of the CBD. Boasting a stylish collection of self-contained apartments accompanied by unparalleled hospitality, this central oasis features all the luxuries you'd expect from a world-class apartment hotel, including state-of-the-art kitchens, beautifully appointed living and dining areas and breathtaking city vistas.\n\nSwiss-Belsuites' enviable location, adjacent to the 100-year-old Victoria Park Market, means you'll be placed mere moments from iconic attractions. SkyCity Casino and Viaduct Harbour are both easily reached within a 10-minute stroll, while the Wynyard Quarter and Ponsonby, one of Auckland’s coolest neighbourhoods, are practically at your doorstep. For sporting enthusiasts, travel the short journey to Eden Park, New Zealand's largest stadium and home to the All Blacks national rugby union team.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Swiss-Belsuites Victoria Park",
    "offer_address": "206 Victoria Street West, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 296.0,
    "value": 755.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IjdNIAS",
    "hero_image": "https://images.luxuryescapes.com/os0w9wqya38n1kw9vgeb",
    "image_two": "https://images.luxuryescapes.com/495tecufkm8tpirpopji",
    "image_three": "https://images.luxuryescapes.com/yjrji20vtwsc2ffd36r4",
    "vendor_name": "Hotel Grand Chancellor Auckland",
    "title": "Grand Opening: Modern Auckland Retreat with Daily Breakfast & Nightly Drinks",
    "description": "Newly opened and ready to roll, this hotel is your hub for discovering Auckland's CBD. This retreat has everything from elegantly furnished rooms to the Forester Bar & Grill, a top spot for respite, refuelling with classic favourites or easing off with an evening tipple. You're steps away from Viaduct Harbour's buzzing food scene, so grab a seat, watch the boats go by and enjoy a cocktail or two.\n\nAs an island nation, there are plenty of opportunities for exploring. Adventure lovers can kayak for an hour to Rangitoto Island, the youngest volcanic island in the Hauraki Gulf. Those who prefer a slower-paced vacation can take a leisurely 40-minute ferry to Waiheke Island, a veritable paradise for wine lovers and beachgoers alike.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Grand Chancellor Auckland",
    "offer_address": "76/80 Wellesley Street West, Auckland 1010, New Zealand",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 199.0,
    "value": 381.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GOFsmYAH",
    "hero_image": "https://images.luxuryescapes.com/kv1cg8zwi8xares09k8d",
    "image_two": "https://images.luxuryescapes.com/8botvryg9iu19bi45cj",
    "image_three": "https://images.luxuryescapes.com/0uv3c8gyxpbs0o5ad5wl",
    "vendor_name": "Hotel Fitzroy by Luminous",
    "title": "Boutique Auckland Contemporary Hideaway with Daily Breakfast & Nightly Drinks",
    "description": "Step into five-star boutique luxury at this beautifully restored landmark building in Auckland's high-end Ponsonby neighbourhood. Ranked #1 hotel in Auckland on Tripadvisor, every aspect of the guest experience at this 10-room retreat has been designed to elevate and redefine your experience.\n\nFoodies will love this upmarket area, renowned for its phenomenal restaurants showcasing local New Zealand produce, while shopaholics can spend a day gracing the boutiques that stretch the length of Ponsonby Road or take a stroll to the waterfront cafes at the Viaduct Harbour.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Fitzroy",
    "offer_address": "43 Richmond Road, Grey Lynn, Auckland 1021, New Zealand",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 13,
    "price": 359.0,
    "value": 878.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005ITBtAAO",
    "hero_image": "https://images.luxuryescapes.com/7875qhuigakv4i0iasn",
    "image_two": "https://images.luxuryescapes.com/aynkw07mk19fksy1ssue",
    "image_three": "https://images.luxuryescapes.com/cklexumjs7lne466tsbp",
    "vendor_name": "Adina Apartment Hotel Auckland Britomart",
    "title": "Auckland Stylish Harbourside Apartment Escape with Daily Breakfast",
    "description": "Discover Auckland’s sailboat-studded harbour with a stay at Adina Apartment Hotel Auckland Britomart, your stylish home away from home a stone's throw from the sparkling waterfront.\n\nRanked within the top 10% of properties on Tripadvisor, the hotel boasts an incredible location in the heart of the buzzing Britomart precinct. This CBD location is your go-to spot in Auckland for some of the best global restaurants, cool bars, and boutique shops. Grab a bite to eat at the onsite Yard Bar & Eatery before you head out for a day on the harbour, or with the ferry terminal just minutes away, go island-hopping - don't miss Waiheke Island for world-class wines. Return to your modern, self-contained space with a full kitchen and relax in the spacious living area, or if you're still feeling active, hit the state-of-the-art gym.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Adina Apartment Hotel Auckland Britomart",
    "offer_address": "2 Tapora Street, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 239.0,
    "value": 726.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LqVbAAK",
    "hero_image": "https://images.luxuryescapes.com/5770e00ihbrj55f7vnv",
    "image_two": "https://images.luxuryescapes.com/t5oml66jtz4tjv9pv1y",
    "image_three": "https://images.luxuryescapes.com/ptkmu76exrdd45qz4tq",
    "vendor_name": "Cordis Auckland, by Langham",
    "title": "Five-Star Auckland City Glamour with Daily Breakfast & NZ$50 Hotel Credit",
    "description": "Named one of the top 10 hotels in Auckland on TripAdvisor and brought to you by the iconic Langham Hospitality Group - recognised in Travel + Leisure’s 2020 ‘Top 25 Hotel Brands in the World’ -  the five-star Cordis Auckland is a glamorous city haven in the heart of Auckland. The city’s Domain park, lively Upper Queen Street and fashionably grungy Karangahape Road (K Road) are moments away, with Viaduct Harbour and the 328 metre Sky Tower less than 10 minutes' drive away.\n\nDiscover Auckland’s CBD with a sophisticated city escape that includes daily buffet breakfast, a welcome drink per adult, NZ$50 hotel credit per room, 15% off spa treatments at the top-rated Chuan Spa and a luxuriously late 2pm checkout.\n\n**Travelling with family?** One child (aged 11 years and under) stays free.\n\n**Looking for added luxury?** Upgrade to the Executive Room, featuring exclusive access to the Cordis Club Lounge with nightly drinks and canapés.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Cordis Auckland",
    "offer_address": "83 Symonds Street, Grafton, Auckland 1010, New Zealand",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 309.0,
    "value": 547.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlyhAAC",
    "hero_image": "https://images.luxuryescapes.com/wq1k69d30g0r0c28b3x8",
    "image_two": "https://images.luxuryescapes.com/hhoj5nhtzn9m0j9rjjbi",
    "image_three": "https://images.luxuryescapes.com/szcbh3f3m4pmoers6ma",
    "vendor_name": "Rydges Auckland",
    "title": "Stylish City Break in the Heart of Auckland",
    "description": "Experience Kiwi hospitality and sweeping city views at Rydges Auckland, located within walking distance of the city’s must-see attractions. Positioned only moments from the Sky Tower and Casino and just a short stroll from the vibrant bars and restaurants of Viaduct Harbour, Rydges provides a central haven for those looking to explore the very best of what the North Island has to offer.\n\nYour stay includes daily buffet breakfast, unlimited high-speed in-room and hotel Wi-Fi, a nightly turndown service with complimentary chocolates and a guaranteed 12pm late checkout.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Rydges Auckland",
    "offer_address": "59 Federal Street Auckland, CBD, 1010, New Zealand",
    "percentage_discount": 70.0,
    "min_duration": 1,
    "max_duration": 3,
    "price": 217.0,
    "value": 715.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lxa9AAC",
    "hero_image": "https://images.luxuryescapes.com/y76lzgxk7byge6a3fu85",
    "image_two": "https://images.luxuryescapes.com/42cj465dcd5upzsda7f",
    "image_three": "https://images.luxuryescapes.com/r3hko2767lteaeojjv8b",
    "vendor_name": "Fable Auckland - MGallery by Sofitel",
    "title": "Award-Winning 5-Star Boutique Luxury in the Heart of Auckland with Daily Breakfast",
    "description": "Discover Auckland with a stylish city break at one of the city's most popular hotels, the five-star, award-winning Hotel Grand Windsor - currently rated within the city's top hotels on TripAdvisor. Showcasing signature MGallery by Sofitel luxury within a heritage building, this boutique hotel boasts a prime location in the heart of Queen Street, where you'll be close to entertainment, luxury retail and world-class dining options. Your escape includes daily breakfast, a nightly drink each, NZ$50 food and drink credit, and a guaranteed 1pm late checkout to make the most of your last day.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Grand Windsor",
    "offer_address": "58/60 Queen Street, Auckland CBD, Auckland 1001, New Zealand",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 239.0,
    "value": 621.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zSngAAE",
    "hero_image": "https://images.luxuryescapes.com/0mpdkoodg7aunle0dx9d",
    "image_two": "https://images.luxuryescapes.com/gi0h4iwockgzonx1cepd",
    "image_three": "https://images.luxuryescapes.com/3tjxve50ncrqwo303up",
    "vendor_name": "The Sebel Auckland Viaduct Harbour",
    "title": "Luxe Sebel Auckland Harbour-View Suite Stay with Daily Breakfast",
    "description": "Admire grand yachts and shimmering sea vistas from your luxurious self-contained suite at The Sebel Auckland Viaduct Harbour - a glorious waterfront oasis in the heart of New Zealand's most cosmopolitan city. Boasting a private balcony with breathtaking views, your gorgeous one-bedroom suite is guaranteed to feel like a home away from home, with state-of-the-art facilities including a fully equipped kitchen and laundry. \n\nStep out onto the vibrant streets and you'll find yourself ideally situated amid the glistening Viaduct Harbour, home to top gourmet restaurants, shops, cafés and the convenient Auckland Ferry Terminal. This luxurious sanctuary is the perfect launchpad for exploring the city and the surrounding islands: try a Sky Jump from the iconic Sky Tower, browse the best of home-grown fashion at Britomart, discover New Zealand's cultural giants at the Auckland Art Gallery or enjoy a tipple or two amid the rolling vineyards of Waiheke Island, only a short ferry ride away.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "The Sebel Auckland Viaduct Harbour",
    "offer_address": "85/89 Customs Street West, Auckland Central, Auckland 1010, New Zealand",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 329.0,
    "value": 515.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlOFAA0",
    "hero_image": "https://images.luxuryescapes.com/kbqyva9f3da9feslwmxf",
    "image_two": "https://images.luxuryescapes.com/y216svwap9t5ivcy0j8",
    "image_three": "https://images.luxuryescapes.com/48reqq67te0t8yyqgtg",
    "vendor_name": "The Grand by SkyCity",
    "title": "Five-Star City Escape at Auckland’s Premier Lifestyle & Entertainment Precinct",
    "description": "Experience the best of Auckland and the Waitemata Harbour at The Grand by SkyCity, offering true five-star luxury in the heart of the city. Stay in a prime CBD location in Auckland's premier entertainment district, with award-winning restaurants and bars and the iconic Sky Tower and casino on your doorstep, plus Viaduct Harbour, Wynyard Quarter and Commerical bay with its fabulous dining options nearby.\n\nStay in a beautifully refurbished Grand Deluxe Room, or upgrade to a Harbour View room for stunning views of the Auckland Habour. Indulge in elegant sophistication with daily breakfast at Gusto restaurant, a welcome drink each, NZ$50 food and drinks credit per room to spend at a multitude of award-winning restaurants, cafés or bars, and a leisurely guaranteed 1pm checkout.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "The Grand by SkyCity",
    "offer_address": "90 Federal St, Auckland, 1010, New Zealand",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 269.0,
    "value": 812.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UIqkVQAT",
    "hero_image": "https://images.luxuryescapes.com/nfyj1ondjealcip7z27a",
    "image_two": "https://images.luxuryescapes.com/ihjkl5tqanyhuukg4zmx",
    "image_three": "https://images.luxuryescapes.com/eke8ujy52i3d2l241xao",
    "vendor_name": "Cordis Auckland, by Langham",
    "title": "Stylish Auckland Escape with Club Lounge Benefits",
    "description": "Nature and cosmopolitan city life collide in Auckland and you can experience it all at the Cordis, Auckland, a Langham property that has recently undergone a multi-million dollar refurbishment. Includes exclusive Club Lounge benefits including daily breakfast, daily afternoon tea, all-day snacks and refreshments, nightly fine local wines and canapés, and more.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland",
    "offer_geo_area_level_2": "",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Cordis Auckland old",
    "offer_address": "83 Symonds St, Grafton, Auckland 1010, New Zealand",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 510.0,
    "value": 1030.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003H1nIAAS",
    "hero_image": "https://images.luxuryescapes.com/tsnr0vlvrcempdqes0um",
    "image_two": "https://images.luxuryescapes.com/w9bjfbrbie6scsniihz",
    "image_three": "https://images.luxuryescapes.com/5rg7oxmngmlmt2f94lal",
    "vendor_name": "Hotel Fitzroy by Luminous",
    "title": "Grand Opening: Boutique Ponsonby Luxury with Daily Breakfast & Evening Drinks",
    "description": "Experience five-star boutique luxury at Hotel Fitzroy curated by Fable - a brand-new, beautifully restored landmark just steps from Auckland's upmarket Ponsonby suburb, brimming with boutique shops and high-end restaurants. Perfectly balancing five-star features with bespoke twists, every aspect of the guest experience at this 10-room retreat has been designed to elevate and redefine luxury: from the interior design intricacies that pay homage to the hotel's history to the personalised service and attentive hosts on hand to curate your perfect Ponsonby escape.\n\nComplete your stay with daily à la carte and continental in-room breakfast, a nightly hour of complimentary apéritifs and hors d'oeuvres, welcome chocolates and a bottle of New Zealand wine on arrival, and a complimentary minibar replenished daily. Begin exploring early with guaranteed 11am check-in and make the most of a leisurely last day with 2pm checkout.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland",
    "offer_geo_area_level_2": "",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Fitzroy curated by Fable - 2020",
    "offer_address": "43 Richmond Road, Auckland 1021, New Zealand",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 359.0,
    "value": 712.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bhMOYQA2",
    "hero_image": "https://images.luxuryescapes.com/hcxrkki1dhxn4nsszsku",
    "image_two": "https://images.luxuryescapes.com/lll2dgvrkuiexgvbcnmd",
    "image_three": "https://images.luxuryescapes.com/n005d4fidmrv2pahhedm",
    "vendor_name": "The Grand by SkyCity",
    "title": "High-End Getaway in the Heart of the City",
    "description": "A truly five-star experience in the heart of the city - have the best of Auckland on your doorstep and the vibrant Viaduct Harbour within easy walking distance at the elegant SKYCITY Grand Hotel. Indulge in a chic city escape with daily a la carte breakfast, daily beer or wine each, NZ$100 credit to spend at any of the 20 on-site restaurants, guaranteed 1pm check out and an exclusive Experience Passport offering you discounts on local experiences.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland",
    "offer_geo_area_level_2": "",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "SKYCITY Grand Hotel 2019",
    "offer_address": "90 Federal St, Auckland, 1010, New Zealand",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 283.0,
    "value": 644.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UJQvAAO",
    "hero_image": "https://images.luxuryescapes.com/u69pfdg6ipht8ambd5i7",
    "image_two": "https://images.luxuryescapes.com/ijjy7wqdw6183rt6lvn",
    "image_three": "https://images.luxuryescapes.com/6bbcqwvuoafcbrb4fbk",
    "vendor_name": "Cordis Auckland, by Langham",
    "title": "Five-Star Auckland City Glamour with Daily Breakfast & NZ$50 Hotel Credit",
    "description": "Named one of the top five hotels in Auckland on Tripadvisor and brought to you by the iconic Langham Hospitality Group - recognised in Travel + Leisure’s 2020 ‘Top 25 Hotel Brands in the World’ -  the five-star Cordis Auckland is a beautifully refurbished, glamorous city haven in the heart of Auckland. Complete with the bespoke touches and first-class service synonymous with the renowned Langham Group, this upscale abode puts luxurious amenities at your fingertips, from restful Dream Beds and stylish interiors - think luxe marble floors and a two-tier chandelier - to the latest high-tech connectivity, and lavish on-site facilities curated to delight the senses.\n\nIndulge at the hotel's top-rated Chuan Spa as you realign your mind, body and spirit through an extensive menu of luxe treatments, converse with chefs as they expertly craft your meal to your liking at the newly refurbished Eight Restaurant, or unwind in style with a dip in the outdoor pool or in one of Cordis’ unique herbal steam rooms. Enviably located in Auckland's lively uptown area, the city’s fashionable boutiques, galleries and museums are within easy reach; enjoy access to the hotel's free-to-use e-bikes or complimentary shuttle service to downtown and the wharf.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Cordis Auckland",
    "offer_address": "83 Symonds Street, Grafton, Auckland 1010, New Zealand",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 319.0,
    "value": 534.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VhNXAA0",
    "hero_image": "https://images.luxuryescapes.com/fya4l4xb36jlfgy1jp7",
    "image_two": "https://images.luxuryescapes.com/56sbfalslfa71e0cyv",
    "image_three": "https://images.luxuryescapes.com/y1csipdc84o65ahjwa6",
    "vendor_name": "Swiss-Belsuites Victoria Park, Auckland",
    "title": "Central Auckland Luxury Apartments with City Views & Daily À La Carte Breakfast",
    "description": "Admire Auckland's striking skyline from the heart of the city with a sophisticated stay at Swiss-Belsuites Victoria Park - an ideal launchpad from which to discover the charms of the CBD.\n\nBoasting a stylish collection of serviced apartments accompanied by unparalleled hospitality, this central oasis features all the luxuries you'd expect from a world-class apartment hotel, including state-of-the-art kitchens, beautifully appointed living and dining areas, complimentary Wi-Fi and breathtaking city vistas. Swiss-Belsuites' enviable address - adjacent to the 100-year-old Victoria Park Market - means you'll be placed mere moments from iconic attractions. SkyCity Casino and Viaduct Harbour are both easily reached within a 10-minute stroll, while the Wynyard Quarter and Ponsonby, one of Auckland’s coolest neighbourhoods, are practically at your doorstep.\n\n**Your handpicked inclusions:**\n\n- Begin each day with delicious à la carte breakfast and your choice of coffee or juice at Swiss-Café\n- Celebrate on arrival with a complimentary bottle of fine New Zealand red wine\n- Explore the city until the very last moment with guaranteed 1pm late checkout\n\n**Travelling as a family or group?** Check out the two-bedroom packages for up to four guests.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Swiss-Belsuites Victoria Park",
    "offer_address": "206 Victoria Street West, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 379.0,
    "value": 606.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CRlaAAG",
    "hero_image": "https://images.luxuryescapes.com/hp5amj7fwcrnuqaarakb",
    "image_two": "https://images.luxuryescapes.com/guqk48rjxoel0etb44w",
    "image_three": "https://images.luxuryescapes.com/5atj21vksmdlbh590tt",
    "vendor_name": "Hotel Fitzroy by Luminous",
    "title": "Boutique Five-Star Ponsonby Luxury with Daily Breakfast, Complimentary Minibar & Evening Drinks",
    "description": "Experience five-star boutique luxury at Hotel Fitzroy curated by Fable - a beautifully restored landmark building just steps from upmarket Ponsonby, brimming with boutique shops and high-end restaurants.\n\nRanked in the top 1% of properties worldwide on Tripadvisor, the hotel perfectly balances five-star features with bespoke service. Every aspect of the guest experience at this 10-room retreat has been designed to elevate and redefine luxury from the interiors that pay homage to the hotel's history to the attentive hosts on hand to curate your perfect inner-city escape.\n\nNewly opened in September 2020, foodies will love this upmarket area, renowned for its phenomenal restaurants showcasing local New Zealand produce, while shopaholics can spend a day gracing the trendy boutiques that stretch the length of Ponsonby Road or take a longer stroll down to the waterfront cafés at the sparkling Viaduct Harbour.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Fitzroy",
    "offer_address": "43 Richmond Road, Grey Lynn, Auckland 1021, New Zealand",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 371.0,
    "value": 795.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QXh1AAG",
    "hero_image": "https://images.luxuryescapes.com/42tfyj54k78vdslgmet",
    "image_two": "https://images.luxuryescapes.com/jt4ueatcyrkpjhtq97v",
    "image_three": "https://images.luxuryescapes.com/mw0tqwuarrbrwkxw0uw",
    "vendor_name": "The Sebel Auckland Viaduct Harbour",
    "title": "Stylish Sebel Suites in Auckland's Vibrant Viaduct with Daily Breakfast",
    "description": "Grand yachts and shimmering harbour vistas await at The Sebel Auckland Viaduct Harbour in the heart of New Zealand's most cosmopolitan city. Your spacious, stylish self-contained suites are guaranteed to feel like your home away from home. There’s also a 24-hour concierge and you can heat things up in the sauna or spa at the neighbouring Tepid Baths.\n\nStep out into the lively Viaduct precinct, home of the prestigious America’s Cup yacht race, where you'll find a myriad of restaurants, cafés and bars. Take a short walk to the Sky Tower, the tallest building in New Zealand, for views across the City of Sails, or browse the best of home-grown fashion in the waterfront shopping precinct of Britomart. Don’t miss Auckland Museum in the stunning tree-lined grounds of the Auckland Domain, guardian to the largest collection of Māori taonga (treasures) in the world, or take the short walk to Auckland Ferry Terminal, where within 40 minutes you can take your pick from more than 30 wineries and cellar doors on Waiheke Island.\n\n**Your handpicked inclusions:**\n\n- Indulge in a delicious daily cooked breakfast for two at Giraffe restaurant\n- Celebrate with a bottle of wine on arrival\n- Sweeten your day with complimentary handmade chocolates on arrival\n- Enjoy a leisurely, guaranteed 1pm checkout\n- Plan each day’s adventures with complimentary high-speed Wi-Fi\n\n**Harbour-View Upgrade:** Choose the Marina Deluxe One-Bedroom Suite for all the comforts of home, including a full kitchen, living area and a private balcony with sweeping harbour views.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "The Sebel Auckland Viaduct Harbour",
    "offer_address": "85/89 Customs Street West, Auckland Central, Auckland 1010, New Zealand",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 243.0,
    "value": 423.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GZiJiYAL",
    "hero_image": "https://images.luxuryescapes.com/1zo2daposa87iv53bijm",
    "image_two": "https://images.luxuryescapes.com/6tybs85v3eke00fcbchk",
    "image_three": "https://images.luxuryescapes.com/71s5x8x9y6109jtiycp",
    "vendor_name": "QT Auckland",
    "title": "Contemporary Auckland Harbourside City Break with Nightly Drinks, Daily Dining Credit & Rooftop Bar",
    "description": "Nestled in the heart of Auckland, this hotel puts you steps away from the city’s vibrant dining, fashion and arts scene. Here, you'll experience eclectic decor, world-class hospitality and decadent living, along with an unbeatable harbourside location.\n\nAfter a day of exploring, unwind in your sophisticated accommodation or head to the Rooftop at QT where peak drink-and-dine moments unfold against the city’s stunning skyline. For a taste of the Mediterranean, indulge at the onsite restaurant, Esther, bringing flavours inspired by sun-soaked shores to Auckland’s Viaduct Harbour, curated by renowned head chef Sean Connolly.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "QT Auckland",
    "offer_address": "4 Viaduct Harbour Avenue, Westhaven, Auckland 1010, New Zealand",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 13,
    "price": 289.0,
    "value": 651.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pT66AAE",
    "hero_image": "https://images.luxuryescapes.com/dnw5971a9npmi5rn4bb",
    "image_two": "https://images.luxuryescapes.com/rcf287mfj808zucqjxn",
    "image_three": "https://images.luxuryescapes.com/ijdggbqvxe46t2v8i5r",
    "vendor_name": "Fable Auckland - MGallery by Sofitel",
    "title": "Five-Star Auckland Boutique Luxury with Dining Credit & Daily Breakfast",
    "description": "Discover the sailboat-studded harbour of New Zealand’s largest city from the five-star Fable Auckland, housed in the historic Windsor House and ranked in the top 25 hotels in the South Pacific by Tripadvisor. During your stay, be sure to tantalise your tastebuds at Cooke’s Restaurant & Bar, where opulent Art Deco ambience and carefully crafted dishes go hand-in-hand. When you’re ready to work up a sweat or detoxify, the modern gym, steamy sauna and jacuzzi are readily available.\n\nBeyond the first-class hotel amenities, the sights of Auckland are right outside your door. The iconic Sky Tower is a swift 10-minute walk from Fable Auckland, while the many bars and restaurants scattered along the waterfront are even closer and offer world-class dining and unbeatable harbour views.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Fable Auckland",
    "offer_address": "58 Queen Street, Auckland CBD, Auckland 1001, New Zealand",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 13,
    "price": 297.0,
    "value": 681.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R9L6PQAV",
    "hero_image": "https://images.luxuryescapes.com/nmf7kpnmks3gmacwcim7",
    "image_two": "https://images.luxuryescapes.com/anhxanvgee43wpf0pbfj",
    "image_three": "https://images.luxuryescapes.com/g1dmddgkufzvmflnhxx4",
    "vendor_name": "Cordis Auckland, by Langham",
    "title": "Stylish Auckland Escape with Club Lounge Benefits",
    "description": "Nature and cosmopolitan city life collide in Auckland and you can experience it all at the Cordis, Auckland, a Langham property that has recently undergone a multi-million dollar refurbishment. Includes exclusive Club Lounge benefits including daily breakfasts, daily afternoon tea, all-day snacks and refreshments, nightly fine local wines and canapés, and more.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland",
    "offer_geo_area_level_2": "",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Cordis, Auckland - April 2018",
    "offer_address": "83 Symonds St, Grafton, Auckland 1010, New Zealand",
    "percentage_discount": 41.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 549.0,
    "value": 935.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IMpZNYA1",
    "hero_image": "https://images.luxuryescapes.com/d0h70tqtuc3xbzr3rrf",
    "image_two": "https://images.luxuryescapes.com/9em0lfcoxw8hshzu41q",
    "image_three": "https://images.luxuryescapes.com/jiyn8hjvn9aixgzlbe6r",
    "vendor_name": "Swiss-Belsuites Victoria Park, Auckland",
    "title": "Chic Central Auckland Self-Contained Apartments with City Views & Daily Breakfast",
    "description": "Experience a slice of Auckland's urban sophistication with an elegant stay at this luxurious all-suite abode, perfectly situated near the iconic Victoria Park and the vibrant Viaduct Harbour. Boasting a stylish collection of self-contained apartments, this centrally placed address offers all the luxuries you'd expect from a world-class apartment hotel, including state-of-the-art kitchens, living and dining spaces and breathtaking city vistas.\n\nWhen it's time to explore, you'll find yourself close by popular attractions like the Sky Tower and Queen Street's bustling shops, while Federal Street's culinary treats are within easy reach. After a day of urban explorations, return to your well-appointed suite and unwind in style.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Swiss-Belsuites Victoria Park",
    "offer_address": "206 Victoria Street West, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 249.0,
    "value": 756.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ecw8nAAB",
    "hero_image": "https://images.luxuryescapes.com/e0a0587m1dxk6wows58",
    "image_two": "https://images.luxuryescapes.com/zwcrv5ugsgzxk5hr7nzp",
    "image_three": "https://images.luxuryescapes.com/lt44ptnr06lglh91d2u",
    "vendor_name": "JW Marriott Auckland",
    "title": "Five-Star Central Auckland Grandeur with Daily Breakfast, Dining Credit & Room Upgrade (Select Packages Only)",
    "description": "Inner city elegance at its finest, JW Marriott Auckland offers a five-star luxury experience from start to finish in the heart of the thriving metropolis. Just steps away from the striking Viaduct waterfront, enjoy a convenient location amid all of Auckland’s vibrant attractions from Sky Tower to the New Zealand Maritime Museum. Admire the timeless interiors of the grand reception, and indulge in the best of New Zealand cuisine and local produce at JW Kitchen.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "JW Marriott Auckland",
    "offer_address": "22-26 Albert Street, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 32,
    "price": 346.0,
    "value": 666.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AZxIGAA1",
    "hero_image": "https://images.luxuryescapes.com/xafauzoktbxla8iyo532",
    "image_two": "https://images.luxuryescapes.com/k4j2yr8l1rd2jwrq4ime",
    "image_three": "https://images.luxuryescapes.com/v3tohxo51m0oyjy7qc9",
    "vendor_name": "Marsden Viaduct Hotel",
    "title": "Stylish Auckland Stay on Viaduct Harbour with Guaranteed Room Upgrade",
    "description": "You're invited to uncover one of Auckland’s best-kept secrets: Marsden Viaduct Hotel, superbly positioned with views of the shimmering harbour. This stylish hideaway is just a casual stroll away to the Wynard Quarter’s revitalised shopping and entertainment precinct and Viaduct Harbour’s ultra-hip eateries and laidback bars and is the perfect base for both a North Island jaunt or a relaxing city retreat - sip espresso and watch the marina gently change as the tide shifts from the hotel’s terrace.\n\nWhen you’re ready to explore, get your steps up and wander to the vibrant CBD and the brand-new Commercial District, reach new heights at the Sky Tower to absorb magnificent views, or hop on over to Waiheke Island for a tipple of wine.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Marsden Viaduct Hotel",
    "offer_address": "21 Viaduct Harbour Avenue, Auckland 1010, New Zealand",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 244.0,
    "value": 518.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GFwTAAW",
    "hero_image": "https://images.luxuryescapes.com/fcxxhz39xbuxxe14791i",
    "image_two": "https://images.luxuryescapes.com/8yohfue157v6jdpkfsvvd",
    "image_three": "https://images.luxuryescapes.com/taj4arrg7mqyrwz71nyf",
    "vendor_name": "The Hotel Britomart",
    "title": "Brand-New Auckland Harbour Eco-Luxury with Daily Breakfast & NZ$50 Dining Credit",
    "description": "Take in the magic of Auckland's glittering Waitemata Harbour from The Hotel Britomart, New Zealand's first five Green Star hotel. Sustainable eco-luxury informs every detail of this stunning five-star hotel, from the organic linens and toiletries in the rooms to the responsibly sourced materials used for the build. New to Auckland's harbourfront, The Hotel Britomart places the best of the city on your doorstep. Near designer boutiques, award-winning eateries, bars, health and beauty venues, and some of Auckland's oldest buildings and newest architecture, The Hotel Britomart is the place to be.\n\nExplore the vibrant streets of Auckland, then return to the cosy cocoon of your downtown hotel, offering fresh, sustainably sourced seafood at onsite restaurant kingi and beautifully decorated rooms with timber features and modern luxuries.\n\n**Your handpicked inclusions**\n\n- Begin each morning with breakfast at kingi restaurant\n- Immerse yourself in fresh local flavours with NZ$50 dining credit per room towards kingi\n- Enjoy a welcome drink per person on arrival (glass of house beer, wine or soft drink)\n- Savour the moment for longer with 1pm late checkout\n\n**Harbour-View Upgrade**: Wake to glittering Waitemata Harbour views when you upgrade to the Waitemata Room.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "The Hotel Britomart",
    "offer_address": "29 Galway Street, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 299.0,
    "value": 582.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP4qYAF",
    "hero_image": "https://images.luxuryescapes.com/01qrh93ev9aidius60fl",
    "image_two": "https://images.luxuryescapes.com/t0zgu86un5upgytpiu7e",
    "image_three": "https://images.luxuryescapes.com/hyy54pvzewfg7s5zrgq",
    "vendor_name": "The Sebel Auckland Viaduct Harbour",
    "title": "Elegant Auckland Waterfront Luxury with Viaduct Harbour Views",
    "description": "Experience the vibrant heart of New Zealand's largest city with a stay in this refined waterfront haven. When you're not exploring the city, retreat to your modern room or suite, savour the fresh flavours of the onsite restaurant or take in the stunning harbour views from the hotel's terrace.\n\nPerfectly positioned on the edge of the Viaduct Harbour, this stylish hotel offers easy access to the city's finest restaurants, lively bars and chic boutiques. Visit the New Zealand Maritime Museum, get your culture fix at the Auckland Art Gallery or enjoy a delicious meal in style from one of the many nearby restaurants.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "The Sebel Auckland Viaduct Harbour",
    "offer_address": "85/89 Customs Street West, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 101.0,
    "value": 101.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CP3UcAAL",
    "hero_image": "https://images.luxuryescapes.com/2d6x43kiifgi1eu4aje",
    "image_two": "https://images.luxuryescapes.com/ymya12jmgx5rjv17mcc",
    "image_three": "https://images.luxuryescapes.com/dfiftbenmdyr6uki38c",
    "vendor_name": "Voco Auckland Centre",
    "title": "Contemporary Auckland Harbourside Escape with New Zealand's Highest Rooftop Bar",
    "description": "Auckland's bustling city centre beckons visitors to explore, and where better to discover this buzzing harbour city than at voco Auckland City Centre, an IHG Hotel. During your stay, indulge in authentic Italian cuisine (woodfired pizza or bolognese, anyone?) at Mozarella & Co., and grab your coffee to go at the ground-floor cafe before heading out to explore the sights. When evening comes, ascend to the rooftop lounge, Bar Albert, for a sophisticated cocktail menu.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "voco Auckland City Centre, an IHG Hotel",
    "offer_address": "13 Wyndham Street, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 94.0,
    "value": 94.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2xxIAC",
    "hero_image": "https://images.luxuryescapes.com/1o7n3v8xhbmhogayaa36",
    "image_two": "https://images.luxuryescapes.com/8vrb3s0168lni3fuwhdh",
    "image_three": "https://images.luxuryescapes.com/oke2c7qt8ehhewzrdl2",
    "vendor_name": "Pullman Auckland Airport",
    "title": "Contemporary Pullman Auckland Airport Stay with Onsite Dining",
    "description": "Experience the convenience of a stay at Pullman Auckland Airport, a modern retreat ideally positioned just minutes from the terminals. Perfect for a seamless layover,  the hotel is just 30 minutes from the scenic sights and delightful nights of New Zealand's largest city. \n\nStop by the fitness centre for a quick workout before heading to the top floor Te Kaahu Restaurant & Bar for exquisite dining and panoramic vistas across the runway and Manukau Heads. Take advantage of the location and explore nearby attractions including Butterfly Creek, Vector Wero Whitewater Park, Rainbow's End and Villa Maria winery, or head right into Auckland, just a short drive away.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Pullman Auckland Airport",
    "offer_address": "Auckland International Airport, 37 Tom Pearce Drive, Auckland 2022, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 166.0,
    "value": 166.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BU9LAAW",
    "hero_image": "https://images.luxuryescapes.com/sr7it8xo5uig2shzo7o",
    "image_two": "https://images.luxuryescapes.com/enuw2aljldor7ukt79xh",
    "image_three": "https://images.luxuryescapes.com/opjyx9xq3qe5kbtfnc26",
    "vendor_name": "Avani Auckland Metropolis Residences",
    "title": "Auckland Self-Contained Apartment-Style Suites Opposite Albert Park",
    "description": "Auckland's sailboat-studded harbour is the perfect place to enjoy fresh sea breezes, cosmopolitan vibes and spellbinding natural scenery - best enjoyed from Avani Auckland Metropolis Residences. Walk through the wow-factor lobby, a century-old former courthouse, and discover an indoor lap pool, fitness centre and sauna. The self-contained apartment-style suites have everything you need for a comfortable stay, including fully-equipped kitchens and laundry facilities.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Avani Auckland Metropolis Residences",
    "offer_address": "40 Kitchener St, Auckland 1010 New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 92.0,
    "value": 92.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GOurIAAT",
    "hero_image": "https://images.luxuryescapes.com/0wte2h70umfg30jjmun",
    "image_two": "https://images.luxuryescapes.com/m3nknlodo6wydobsn76r",
    "image_three": "https://images.luxuryescapes.com/p7xk7fkvp7n4nl8u5wl4",
    "vendor_name": "Cordis Auckland, by Langham",
    "title": "Sophisticated Auckland Escape near The Civic District with Onsite Bar, Restaurant & High Tea Lounge",
    "description": "Experience the best of Auckland with a stay at Cordis, Auckland, a beacon of sophistication and elegance. This architectural masterpiece is ideally located near the bustling boutiques of Queen Street and the culture scene of The Civic district. Indulge in sumptuous local cuisine at Eight Restaurant, savour bespoke cocktails at Our Land Is Alive bar, or treat yourself to high tea in the stunning Chandelier Lounge. When the need to relax hits, unwind at the onsite Chuan Spa.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Cordis, Auckland",
    "offer_address": "83 Symonds Street, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 98.0,
    "value": 98.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwTIAS",
    "hero_image": "https://images.luxuryescapes.com/q1mzk22emd3r2e15411",
    "image_two": "https://images.luxuryescapes.com/5ey6214ats5npgbsjq4l",
    "image_three": "https://images.luxuryescapes.com/ey4d519609bl08z9sweo",
    "vendor_name": "Novotel Auckland Airport",
    "title": "Contemporary Novotel Stay at Auckland Airport with Onsite Dining",
    "description": "Explore the scenic sights and delightful nights of New Zealand's largest city with a stay at this stylish hotel just 30 minutes from Auckland CBD. Perfectly positioned for city exploration or connecting flights, this Novotel property seamlessly blends comfort with convenience. Relax with great views and wine and dine at the THIRTEEN50 Bistro & Bar where an epicurean adventure awaits.\n\nStop by the fitness centre for a quick workout before heading to glimpse panoramic views of the city and beyond at the Sky Tower. Take advantage of the location and explore nearby attractions including Butterfly Creek, Vector Wero Whitewater Park, Rainbows End and Villa Maria winery, or head right into the city, just a short drive away.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Novotel Auckland Airport",
    "offer_address": "35 Tom Pearce Drive, Auckland Airport, Auckland 2022, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 153.0,
    "value": 153.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v0x1AAA",
    "hero_image": "https://images.luxuryescapes.com/66y6wc2mlpk1h48y0oenl",
    "image_two": "https://images.luxuryescapes.com/fw380b7ewq2y73uzuksg",
    "image_three": "https://images.luxuryescapes.com/k2qce3u85j6mdtrlf1rh",
    "vendor_name": "QT Auckland",
    "title": "Designer QT Escape near Auckland Harbour with Rooftop Bar",
    "description": "On the shimmering shoreline of Viaduct Harbour, the vibrant QT Auckland will plunge you into nautical-inspired luxury as the city unfurls before you like a string of pearls. The fine dining of the waterfront   Wynyard Quarter beckons, while the Rooftop at QT bar, soaring above the City of Sails, is set for good times - the perfect place to clink glasses together as dusk falls over the city’s glittering lights. Come for the eclectic rooms, the enviable location, and the world-class dining onsite. Celebrated international chef Sean Connolly’s newest restaurant, Esther, invites you to coast along the French Riviera, enjoy a pitstop in Sicily, then get lost in the magnificence of Morocco.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "QT Auckland",
    "offer_address": "4 Viaduct Harbour Avenue, Westhaven, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 135.0,
    "value": 135.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DfljQAAR",
    "hero_image": "https://images.luxuryescapes.com/euq3mdsxjjwu30sqos6p",
    "image_two": "https://images.luxuryescapes.com/phiqr1kfb7g469oq99y",
    "image_three": "https://images.luxuryescapes.com/tqno8ppvtah4wzntc28",
    "vendor_name": "Holiday Inn Auckland Airport",
    "title": "Contemporary Auckland Airport Escape with Outdoor Swimming Pool",
    "description": "It's all too easy to embark on your Auckland adventure when staying at the Holiday Inn Auckland Airport, an IHG Hotel, just a breezy seven-minute drive from the city's airport. When you're not skipping over to the city centre, stay in at your inn to enjoy the outdoor swimming pool, or stretch and work your muscles at the well-equipped fitness centre. For meals, Vapor Restaurant serves up a mouthwatering array of contemporary New Zealand cuisine using fresh and local produce.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Holiday Inn Auckland Airport, an IHG Hotel",
    "offer_address": "2 Ascot Road, Mangere, Auckland 2022, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 71.0,
    "value": 71.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwVIAS",
    "hero_image": "https://images.luxuryescapes.com/586lb43a4prj7ktl8ht",
    "image_two": "https://images.luxuryescapes.com/3dbqx1bw2qsiczr3iz0e",
    "image_three": "https://images.luxuryescapes.com/1nkvpv1jhi38bojoak7e",
    "vendor_name": "The Sebel Auckland Manukau",
    "title": "Modern Auckland Escape near New Zealand's Largest Theme Park with Onsite Dining",
    "description": "Do everything or do nothing on your Auckland escape with a stay at this conveniently located escape. This modern hotel is a stone's throw from Rainbow's End, New Zealand's largest theme park, and the Southern Motorway, offering easy access to the city's bustling centre. Dine at Ora Bistro, savouring contemporary New Zealand cuisine, or enjoy a refreshing drink at the stylish lobby bar.\n\nVenture out to explore the nearby Auckland Botanic Gardens or the bustling Otara Market, a local favourite for fresh produce and Polynesian crafts.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "The Sebel Auckland Manukau",
    "offer_address": "16 Lakewood Court, Manukau, Auckland 2104, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 85.0,
    "value": 85.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2xpIAC",
    "hero_image": "https://images.luxuryescapes.com/af6k4s0morcpi3w2f9",
    "image_two": "https://images.luxuryescapes.com/h6gl283eq9rodwlqhv7",
    "image_three": "https://images.luxuryescapes.com/08nyt80g22j6sarvik68",
    "vendor_name": "Novotel Auckland Ellerslie",
    "title": "Sleek Auckland Retreat 15 Minutes from CBD with Onsite Dining & Garden Bar",
    "description": "Choose to stay in or explore Auckland with a stay at this ideally positioned hotel just 15 minutes from the city's thriving business district. Unwind in rooms with pleasing views and pleasant hues, with all modern comforts perfect for a relaxing escape. Savour mouthwatering dishes at the onsite Acacia Restaurant or enjoy an alfresco drink at the contemporary Acacia Garden Bar.\n\nJust a short stroll from the hotel, you'll find the Ellerslie Racecourse and the Auckland Botanic Gardens. Venture further afield to the bustling Viaduct Harbour for countless dining and entertainment options, or take a ferry ride to Waiheke Island for a day of wine tasting and scenic walks. Among other attractions nearby, the Auckland Zoo, Eden Park and Newmarket are worth a visit.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Novotel Auckland Ellerslie",
    "offer_address": "72-112 Green Lane East, Ellerslie, Auckland 1051, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 83.0,
    "value": 83.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwLIAS",
    "hero_image": "https://images.luxuryescapes.com/r5svxz6ixbd9qklxczin",
    "image_two": "https://images.luxuryescapes.com/5pdpnd5kje2kvhl6lmh",
    "image_three": "https://images.luxuryescapes.com/437r577h3hk6x0t3cv",
    "vendor_name": "Pullman Auckland",
    "title": "Sophisticated Pullman Auckland CBD Urban Oasis with Indoor Pool & Spa",
    "description": "Discover the  charms of Auckland from this elegant urban sanctuary, perfectly nestled between the bustling CBD and the tranquil sailboat-studded Waitematā Harbour. Exuding an upscale aura with its gilded interiors and plush furnishings, this five-star hotel boasts well-appointed rooms and residences that create the perfect home-away-from-home feeling.\n\nSpend your days taking laps in the heated indoor pool, indulge in restorative treatments at the onsite Luxe Spa & Power Fitness and relish contemporary classics made with a worldly spin, paired with signature cocktails at the Tapestry Grill & Bar. If you wish to explore the City of Sails, some of the top attractions, including the iconic Viaduct Harbour and the Sky Tower are right at your doorstep.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Pullman Auckland Hotel & Apartments",
    "offer_address": "Corner Waterloo Quadrant & Princes Street, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 97.0,
    "value": 97.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ez2mkAAB",
    "hero_image": "https://images.luxuryescapes.com/ahu1znultf9vpcn3d3e",
    "image_two": "https://images.luxuryescapes.com/qaqewfzudkqoyvz6inq3",
    "image_three": "https://images.luxuryescapes.com/pteyc9npsgv3vrz3emus",
    "vendor_name": "Waitakere Resort & Spa",
    "title": "Lush Rainforest Retreat 30 Minutes from Auckland with Wellness Spa & Onsite Restaurant",
    "description": "Discover true rainforest serenity at the Waitakere Resort & Spa, just 30 minutes from Auckland, nestled in the heart of lush mountain ranges and overlooking the Hauraki Gulf. Explore the nearby black-sand beaches, hike through the lush native bush, or indulge at the local vineyards and eateries. After a day of adventure, unwind at the onsite spa with a bespoke treatment, and dine at the sophisticated restaurant serving elevated local ingredients.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Waitakere Resort & Spa",
    "offer_address": "573 Scenic Drive, Waiatarua, Auckland 0612, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 94.0,
    "value": 94.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v1VmAAI",
    "hero_image": "https://images.luxuryescapes.com/8wf3h5tq4phyujpkdjxt",
    "image_two": "https://images.luxuryescapes.com/0awuh2xc0ghm7gftuhg",
    "image_three": "https://images.luxuryescapes.com/kkv70v3y1w91fyq50cg",
    "vendor_name": "Rydges Auckland",
    "title": "Stylish City Break in the Heart of Auckland",
    "description": "Experience top-notch Kiwi hospitality and sweeping city views at Rydges Auckland, offering cutting-edge sophistication that's masterfully crafted to stand proudly on the international stage. Savour the best New Zealand produce at The CUT Restaurant & Bar or take a short stroll to the nearby Sky Tower, SkyCity Auckland or Viaduct Harbour's world-class bars and restaurants.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Rydges Auckland",
    "offer_address": "59 Federal Street, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 81.0,
    "value": 81.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMWf0AAH",
    "hero_image": "https://images.luxuryescapes.com/t4rb2n8mlalwn0855fgi9",
    "image_two": "https://images.luxuryescapes.com/2ha4rdx5zt71a9pwwyl",
    "image_three": "https://images.luxuryescapes.com/161alzfaymbkbcud0n6",
    "vendor_name": "Hotel Fitzroy by Luminous",
    "title": "Five-Star Boutique Auckland Elegance in Restored Heritage Building near Trendy Ponsonby",
    "description": "Experience five-star boutique luxury and bespoke service in Auckland's stylish fringes at Hotel Fitzroy curated by Fable. Just steps from upmarket Ponsonby, this beautifully restored landmark 1910s building has been designed to elevate your stay, combining luxury with heritage charm and attentive hospitality. Be treated to breakfast in bed, before stepping out to explore the area renowned for its trendy restaurants and boutiques.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Fitzroy curated by Fable",
    "offer_address": "43 Richmond Road, Grey Lynn, Auckland 1021, New Zealand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DMffAAG",
    "hero_image": "https://images.luxuryescapes.com/pmyz74jnnr9qagosiv4a",
    "image_two": "https://images.luxuryescapes.com/4r072yymwhe8clnvv9go",
    "image_three": "https://images.luxuryescapes.com/ogn2hoo2la4cczhfrug",
    "vendor_name": "Adina Apartment Hotel Auckland Britomart",
    "title": "Stylish Self-Contained Auckland Stay near Viaduct Harbour",
    "description": "Located on Tapora Street, the Adina Apartment Hotel Auckland Britomart is a boutique self-catering property awash with understated luxury. After a day of exploration, a comfortable evening is assured with modern technology and spacious design, with some apartments featuring fully equipped kitchens and laundry facilities. Exploration is easy with the waterfront and the Quay Park precinct a stone's throw away, while onsite you'll find a gymnasium, parking and the relaxed Yard Bar & Eatery.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Adina Apartment Hotel Auckland Britomart",
    "offer_address": "2 Tapora Street, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 73.0,
    "value": 73.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GRjr3YAD",
    "hero_image": "https://images.luxuryescapes.com/xynrf8243xhdn0rwd9fc",
    "image_two": "https://images.luxuryescapes.com/v22amb707xdds94rmrhu",
    "image_three": "https://images.luxuryescapes.com/ivtq5b0oedob24h3fi5o",
    "vendor_name": "Sofitel Auckland Viaduct",
    "title": "Waterfront Auckland Sofitel Escape with Onsite Dining & Spa",
    "description": "Indulge in unparalleled luxury at this five-star Sofitel sanctuary, nestled in the heart of Auckland, framed by the breathtaking beauty of Waitemata Harbour. Step outside to discover the city's finest dining, shopping and waterfront experiences, all just moments away. Delight in an exquisite fusion of Latin and French flavours at the hotel's La Marée Restaurant.\n\nA short walk leads you to the Auckland Art Gallery Toi o Tāmaki, home to an impressive collection of local and international masterpieces. Continue your exploration at the historic Auckland Domain and Auckland War Memorial Museum. After a day of discovery, unwind with a rejuvenating spa treatment at Sofitel Spa.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Sofitel Auckland Viaduct Harbour",
    "offer_address": "21 Viaduct Harbour Avenue, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 178.0,
    "value": 178.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2yHIAS",
    "hero_image": "https://images.luxuryescapes.com/u7g01xsadw48uyjjne",
    "image_two": "https://images.luxuryescapes.com/xiv1evfgss12mchpj5op",
    "image_three": "https://images.luxuryescapes.com/geq9srs4vc5xkd9bh9cj",
    "vendor_name": "Mercure Auckland Queen Street",
    "title": "Modern Auckland CBD Retreat near Karangahape Road with Onsite Bar & Restaurant",
    "description": "Rising above the cityscape, this design-forward hotel captivates with its cosmopolitan atmosphere and warm Kiwi hospitality. Discover the Lone Star Queen Street restaurant, where local flavours come alive through Pacific Rim cuisine, and kickstart your mornings in the light-filled fitness centre.\n\nStep outside and feel the pulse of Auckland's spirited central hub. Dive into the lanes of Queen Street's shopping paradise, take in an exhibition at the Auckland Art Gallery Toi o Tāmaki, join locals for drinks at the top of Sky Tower, or catch a ferry to Waiheke Island's acclaimed vineyards.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Mercure Auckland Queen Street",
    "offer_address": "500 Queen Street, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 102.0,
    "value": 102.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbsTSAAZ",
    "hero_image": "https://images.luxuryescapes.com/jca9ug4e4820bhw2xyd",
    "image_two": "https://images.luxuryescapes.com/6avzhfjxbse400h01nl",
    "image_three": "https://images.luxuryescapes.com/afs9m7i20ufd8pm8djnp",
    "vendor_name": "So Auckland",
    "title": "Auckland Design Hotel near Viaduct Harbour with Rooftop Bar & Spa",
    "description": "Stay in the beating heart of New Zealand's largest city at this boundary-pushing urban retreat - boasting breathtaking views of the city skyline and Waitematā Harbour. Settle into the plush, well-appointed rooms and take advantage of the hotel's prime location in the lively downtown Britomart district.\n\nDine at the acclaimed Harbour Society restaurant or indulge in a French pastry from Javalab, savour a cocktail at the swanky HI-SO rooftop bar, dance into the night at Mixo or rejuvenate in the tranquil SO/ Spa. When you are ready to explore, the vibrant waterfront dining, coffee and nightlife scene is mere moments away.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "SO/ Auckland",
    "offer_address": "67 Customs Street East, Auckland CBD, 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 144.0,
    "value": 144.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4yUEAAZ",
    "hero_image": "https://images.luxuryescapes.com/a4cfr4w32k3kmdqfd0k",
    "image_two": "https://images.luxuryescapes.com/rrwz321t3rnovl6d0jn8",
    "image_three": "https://images.luxuryescapes.com/e0wpar8sp5dgds6qq5xt",
    "vendor_name": "Marsden Viaduct Hotel",
    "title": "World-Class Luxury in Auckland's Viaduct Harbour",
    "description": "Immerse yourself in luxury with views of the water at the Marsden Viaduct Hotel, conveniently nestled in the bustling shopping and entertainment hub of Auckland's Viaduct. Thoughtfully designed guest rooms exude timeless elegance, boasting an abundance of natural light and plush furnishings, ensuring a comfortable and indulgent stay for discerning travellers.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Marsden Viaduct Hotel",
    "offer_address": "21 Viaduct Harbour Avenue, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 159.0,
    "value": 159.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlvzIAC",
    "hero_image": "https://images.luxuryescapes.com/xjienzylb8k29x9z1y2k",
    "image_two": "https://images.luxuryescapes.com/88mgpo0pp78i4mfllpf",
    "image_three": "https://images.luxuryescapes.com/dkm5g22wtr8bul5si7l",
    "vendor_name": "Movenpick Hotel Auckland",
    "title": "Chic Swiss-Inspired Auckland Escape near Viaduct Harbour with Daily Chocolate Hour",
    "description": "Unwind in this Swiss-inspired chic hotel and expect elegance infused with modern luxury, all while savouring first-rate service in the heart of Auckland. Enjoy mouthwatering wagyu beef or seared duck breast at BODA Restaurant, or sample signature cocktails at BODA Bar, the ideal spot to end the night while city lights twinkle outside.\n\nRight in the thick of the CBD, Mövenpick Hotel Auckland has no shortage of fun. You're within arm's reach of bustling local haunts like Elliott Street serving up global eats, and hidden laneways full of character, such as Vulcan Lane, brimming with quirky cafes and historic pubs. These spots capture the heart and soul of the city, giving you a true taste of Auckland.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Mövenpick Hotel Auckland",
    "offer_address": "8 Customs Street East, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 107.0,
    "value": 107.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DMTyAAO",
    "hero_image": "https://images.luxuryescapes.com/36kmbythmtm3voqc7au8",
    "image_two": "https://images.luxuryescapes.com/htdd8fak3ei74nz1x8tj",
    "image_three": "https://images.luxuryescapes.com/97ys4kh1lditsa6nyl",
    "vendor_name": "The Hotel Britomart",
    "title": "Auckland Five-Star Eco-Luxury Overlooking Waitemata Harbour",
    "description": "Take in the magic of Auckland from The Hotel Britomart, New Zealand's first five Green Star hotel. Sustainable eco-luxury informs every detail of this stunning property, from the organic linens and toiletries in the rooms to the responsibly sourced materials used for the build. Near designer boutiques, award-winning eateries, bars, health and beauty venues, and some of Auckland's oldest buildings and newest architecture, The Hotel Britomart is the place to be.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "The Hotel Britomart",
    "offer_address": "29 Galway Street, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 139.0,
    "value": 139.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DN6woAAD",
    "hero_image": "https://images.luxuryescapes.com/m7uk96w24iniqdn9v54s",
    "image_two": "https://images.luxuryescapes.com/74cl0wfods5rgijc7xm6n",
    "image_three": "https://images.luxuryescapes.com/5xsn6pwhxo5ull7c2fa",
    "vendor_name": "Maison Blanc Lodge",
    "title": "Luxury Auckland Bush Retreat with Outdoor Spa, Sauna & Private Chef",
    "description": "Step foot inside the sprawling luxury of Maison Blanc Lodge - a bush retreat nestled in Auckland's Waitakere Ranges and not to be missed. You and your friends or family will be spoilt with daily meals prepared by a private chef, as well as an outdoor heated pool and spa overlooking the woodlands, an indoor sauna and a showstopping fireplace. Only a short drive from the city, the lodge provides seamless access to beautiful wild beaches and some of the best hiking trails in New Zealand.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Maison Blanc Lodge",
    "offer_address": "33 Kohu Road, Titirangi, Auckland 0604, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 506.0,
    "value": 506.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FjC5dAAF",
    "hero_image": "https://images.luxuryescapes.com/ou4uvchihmxd6e83eysc",
    "image_two": "https://images.luxuryescapes.com/efm7r4yuwflott4xy6ml",
    "image_three": "https://images.luxuryescapes.com/pel46ne6j5ghkxgdnn27",
    "vendor_name": "Holiday Inn Express, Auckland City Centre",
    "title": "Auckland CBD Escape with 24-Hour Dining near Viaduct Harbour",
    "description": "Experience the buzz of New Zealand's largest city with a stay at the Holiday Inn Express Auckland City Centre, an IHG Hotel. Perfectly positioned in the heart of the city, the hotel is just a short stroll from the vibrant Viaduct Harbour, filled with trendy bars and eateries. Explore the city's rich history at the nearby Auckland Museum or take a ferry to the idyllic Waiheke Island, known for its vineyards and olive groves. After a day of discovery, return to the hotel's Great Room for a refreshing drink and a light bite.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Holiday Inn Express Auckland City Centre, an IHG Hotel",
    "offer_address": "9 Wyndham Street, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 88.0,
    "value": 88.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Ilw8IAC",
    "hero_image": "https://images.luxuryescapes.com/zfh0bz62n96soh4ffdy",
    "image_two": "https://images.luxuryescapes.com/diob4e12ufrqyvauz0x",
    "image_three": "https://images.luxuryescapes.com/trsl29rpgpoxo67n10ht",
    "vendor_name": "The Sebel Quay West Auckland",
    "title": "Apartment-Style Waterfront Luxury in Auckland CBD with Panoramic Views",
    "description": "Discover Auckland's CBD with easy access to local attractions from an elegant and contemporary waterfront hotel. This stylish retreat is perfectly positioned in the heart of \"The City of Sails\", offering easy access to world-class dining, shopping and entertainment. Stay in spacious apartments with panoramic views of the city and grab a bite at Up Café with a well-stocked bar to raise your spirits.\n\nTake advantage of the location and enjoy a leisurely stroll to the nearby Viaduct Harbour. For art enthusiasts, the Auckland Art Gallery Toi o Tāmaki is a short walk away, housing an impressive collection of national and international artwork. Auckland awaits!",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "The Sebel Quay West Auckland",
    "offer_address": "8 Albert Street, Auckland CBD, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 104.0,
    "value": 104.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt6mAAB",
    "hero_image": "https://images.luxuryescapes.com/4w9vzjebtei5teejp1d",
    "image_two": "https://images.luxuryescapes.com/zb11km09epj19bmtmrkfl",
    "image_three": "https://images.luxuryescapes.com/loip6vy95fot9qinjp",
    "vendor_name": "Crowne Plaza Auckland",
    "title": "Contemporary City Break in the Heart of Auckland",
    "description": "Experience the best of Auckland with a glamorous stay at the Crowne Plaza Auckland, perfectly positioned in the city's premier entertainment district. Providing easy access to renowned bars and delicious dining, and just a short day trip away from some of the North Island's most iconic landscapes and wine regions, Crowne Plaza Auckland makes the perfect base for a New Zealand discovery. When you're not exploring, drop into the hotel's fitness centre, indulge in a wide range of New Zealand wines at the Aria Bar or treat yourself to locally sourced produce at Aria Restaurant.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "Crowne Plaza Auckland, an IHG Hotel",
    "offer_address": "128 Albert Street, Auckland, 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 81.0,
    "value": 81.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ez1F7AAJ",
    "hero_image": "https://images.luxuryescapes.com/hh7oxq8vtguxwukqpvn5",
    "image_two": "https://images.luxuryescapes.com/wk7jz809zly60ijfkp6",
    "image_three": "https://images.luxuryescapes.com/1b2l0uzox9zj6hfcq6vl",
    "vendor_name": "InterContinental Auckland",
    "title": "Luxurious InterContinental Auckland Stay Steps from the Waitemata Harbour",
    "description": "Experience the best of Auckland's waterfront from the luxurious InterContinental Auckland, an IHG Hotel. Situated in the heart of the city, this five-star hotel offers a unique vantage point to explore the iconic Waitemata Harbour. Take a stroll and explore Commercial Bay, the city's shopping and dining hub, or enjoy a delicious meal at the hotel's signature restaurant. For more of an adventure, take a short ferry ride to Waiheke Island for a day of wine tasting and breathtaking views.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Auckland Region",
    "offer_geo_area_level_2": "Auckland",
    "location_heading": "Auckland",
    "location_subheading": "New Zealand",
    "location_description": "InterContinental Auckland, an IHG Hotel",
    "offer_address": "1 Queen Street, Auckland 1010, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 164.0,
    "value": 164.0
  }
]