[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004U6TPAA0",
    "hero_image": "https://images.luxuryescapes.com/9xe5bdgj3xiob57khk6",
    "image_two": "https://images.luxuryescapes.com/k0fd9ocqb8ts9efvqhd",
    "image_three": "https://images.luxuryescapes.com/yu4wq5sueut2ddgneqj",
    "vendor_name": "Falcon Brae Villa",
    "title": "Grand Opening: Off-the-Grid South Island Luxury Suites with Nightly Four-Course Dinner",
    "description": "Connect with nature amid infinite luxury during a well-deserved escape at Falcon Brae Villa - a brand-new, five-star luxury property perched on a hilltop in Stanley Brook, New Zealand, with 360-degree views over the surrounding mountains and majestic Motueka River. Hidden amid three national parks, on a 350-acre private property in the remote Nelson Tasman region, this exciting new addition to the prestigious Stonefly Lodge estate is a quiet refuge that's perfectly placed for relaxation and discovery.\n\nYou'll love every detail of this peaceful, architect-designed retreat, including its sprawling living areas, perfectly manicured gardens, and state-of-the-art amenities. Lavish shared facilities include a sunken bar, media theatre, multiple dining areas, a Games Den (housing modern gym equipment, a pool table, table tennis, darts and board games), an outdoor pool and heated spa, with spectacular native bush walks on your doorstep. When you seek privacy, retire to your suite, complete with a personal lounge area and private balcony offering sweeping mountain and river views. This is off-the-grid luxury at its very finest.\n\n**Your handpicked inclusions:**\n\n- Prepare for a day of indulgence with daily cooked breakfast\n- End each evening with a spectacular four-course gourmet dinner\n- Toast your luxe escape with nightly pre-dinner drinks and canapés\n\n**Travelling with family or friends?** Purchase the Exclusive-Use Upgrade, affording private villa access for up to nine guests. The entirety of the villa will be reserved for you and your loved ones, including all three suites (as well as the use of Motueka Suite's Bunk Room) and all facilities, from the sunken bar to the outdoor pool, media room and Games Den, as well as a private chef and house staff.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Tasman Region",
    "offer_geo_area_level_2": "Stanley Brook",
    "location_heading": "Tasman Region",
    "location_subheading": "New Zealand",
    "location_description": "Falcon Brae Villa",
    "offer_address": "3254 Motueka Valley Highway, Stanley Brook 7096, New Zealand",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 1729.0,
    "value": 3533.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lkcXAAQ",
    "hero_image": "https://images.luxuryescapes.com/yjn7dhc1oo9f4430ezw",
    "image_two": "https://images.luxuryescapes.com/x2c6suzw4n2nmj0fu8tn",
    "image_three": "https://images.luxuryescapes.com/8zr3xiabjkf9x5e9bxvr",
    "vendor_name": "Falcon Brae Villa",
    "title": "Off-the-Grid South Island Luxury Suites with 360° Mountain & Motueka River Views",
    "description": "Connect with nature in infinite luxury on a well-deserved escape to Falcon Brae Villa - a five-star luxury property perched on a hilltop in Stanley Brook, New Zealand, with 360-degree views over the surrounding mountains and majestic Motueka River. Hidden amid three national parks, on a 350-acre private property in the remote Nelson Tasman region, this exciting new addition to the prestigious Stonefly Lodge estate is a quiet refuge that's perfectly placed for relaxation and discovery.\n\nYou'll love every detail of this peaceful, architect-designed retreat, including its sprawling living areas, perfectly manicured gardens, and state-of-the-art amenities. Lavish shared facilities include a sunken bar, media theatre, multiple dining areas, a games den (housing modern gym equipment, a pool table, table tennis, darts and board games), an outdoor pool and heated spa, with spectacular native bush walks on your doorstep. When you seek privacy, retire to your suite, complete with a personal lounge area and private balcony offering sweeping mountain and river views. This is off-the-grid luxury at its very finest.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Tasman Region",
    "offer_geo_area_level_2": "Stanley Brook",
    "location_heading": "Tasman Region",
    "location_subheading": "New Zealand",
    "location_description": "Falcon Brae Villa",
    "offer_address": "3254 Motueka Valley Highway, Stanley Brook 7096, New Zealand",
    "percentage_discount": null,
    "min_duration": 2,
    "max_duration": 31,
    "price": null,
    "value": null
  }
]