[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eK5K5QAK",
    "hero_image": "https://images.luxuryescapes.com/fjxtqyirzc815bpi9vvr",
    "image_two": "https://images.luxuryescapes.com/ded3blovvbwrdw0wbzvr9",
    "image_three": "https://images.luxuryescapes.com/e4kwnmf2jc49xmmb4iwu",
    "vendor_name": "Baur Au Lac",
    "title": "Glamorous Stay in One of Europe's Top Hotels with Gourmet Inclusions",
    "description": "Experience a truly luxurious holiday at one of the world’s best hotels, recently awarded 'Best Hotel in Europe' at the 2019 Condé Nast Traveller Readers’ Choice Awards, and embrace the classic elegance of Baur au Lac in Zürich. Located in the heart of this beautiful city, Baur au Lac has been offering guests amazing hospitality in opulent surrounds for 175 years. Whisk your loved one away for a romantic getaway and find out what old-world glamour feels like with daily breakfast, a welcome drink on arrival, a welcome gift of delicious Swiss chocolates, complimentary minibar during your stay and US$200 credit for food and drinks at the hotel's lavish dining venues.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Zürich",
    "offer_geo_area_level_2": "Zürich",
    "location_heading": "Zürich",
    "location_subheading": "Switzerland",
    "location_description": "Baur au Lac - DEC2019",
    "offer_address": "Talstrasse 1, 8001 Zürich, Switzerland",
    "percentage_discount": 40.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 1856.0,
    "value": 3097.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GIXzAAO",
    "hero_image": "https://images.luxuryescapes.com/uaofwqlcl7s8a45ruvx6",
    "image_two": "https://images.luxuryescapes.com/u6me91wakdvkl3frhvqr",
    "image_three": "https://images.luxuryescapes.com/6wvzjvh06e43fajma4r7",
    "vendor_name": "Baur Au Lac",
    "title": "Grand Five-Star Zürich Luxury",
    "description": "Indulge in extravagantly elegant five-star luxury at Baur au Lac, recognised as the #1 Hotel in the World at the Condé Nast Traveler Readers' Choice Awards 2020. The grand dame of Zürich's hospitality scene, this outstanding property has been operating since 1844 under the same family and is situated in expansive private parkland with jaw-dropping views of Lake Zürich and the surrounding Swiss Alps. Despite its serene setting, it couldn’t be closer to the action - Zürich's iconic shopping strip, Bahnhofstrasse, is just metres away, while famous Old Town landmarks require a 10-minute stroll.\n\nWith so much on offer at Baur au Lac, leaving its extensive grounds may not be necessary. The old-world grandeur of its design is visible across every floor, with Art Deco, Louis XVI and English regency touches intermingling with jewel colours and gorgeous flowers, thanks to the in-house florist. Discover the skill and sorcery of Head Chef Laurent Eperon at the two-Michelin-starred Pavillon, or visit Baur, where the classic brasserie concept is elevated to deliver a mouthwatering seasonal menu. Spend an afternoon at Le Hall for tea and macarons or, over summer, venture to Baur au Lac Terrasse for snacks and refreshing drinks. A rooftop fitness centre makes breaking a sweat seamless, with massages available to relieve sore muscles.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Canton of Zurich",
    "offer_geo_area_level_2": "Zürich",
    "location_heading": "Zürich",
    "location_subheading": "Switzerland",
    "location_description": "Baur Au Lac",
    "offer_address": "Talstrasse 1, 8001 Zürich, Switzerland",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  }
]