[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FcdLiAAJ",
    "hero_image": "https://images.luxuryescapes.com/7ib2iijif7el8qo2efh",
    "image_two": "https://images.luxuryescapes.com/brbthygbktqzue15e2hm",
    "image_three": "https://images.luxuryescapes.com/j6x79c8tgy0x13zcye",
    "vendor_name": "Barcelo Royal Margaritas Royal Level",
    "title": "Gran Canaria Sun-Soaked Escape near Playa del Ingles with Daily Breakfast & Nightly Dinner",
    "description": "Framed by the azure expanse of the Atlantic Ocean, Gran Canaria, a gem in Spain's Canary Islands, beckons with a relaxing stay at Barceló Margaritas Royal Level. Enjoy Royal Level privileges, which include access to a bespoke pool and buffet restaurant, not accessible to guests from the main resort. Staying at this modern resort promises days of sunshine by the pool, a bespoke fitness regime using the extensive open-air Margaritas CrossFit under the guidance of an experienced trainer, and the ultimate in wellness. Spend your days hopping between the two buffet restaurants, one offering al fresco dining with a gorgeous selection of international favourites, and stay hydrated at the pool bar. \n\nThe sun-kissed paradise of Gran Canaria is a symphony of contrasts, where golden beaches meet rugged mountains, and quaint villages harmonise with the vibrant and lively lifestyle of locals and travellers. The island's diverse vistas, from the stunning sand dunes of Maspalomas to the lush forests of Tamadaba, offer a haven for adventure seekers and relaxation enthusiasts alike.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Canary Islands",
    "offer_geo_area_level_2": "San Bartolome de Tirajana",
    "location_heading": "Gran Canaria",
    "location_subheading": "Canary Islands",
    "location_description": "Barceló Margaritas Royal Level",
    "offer_address": "Avda. Gran Canaria, 40, Playa del Inglés, Las Palmas 35100, Spain",
    "percentage_discount": 22.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 769.0,
    "value": 985.0
  }
]