[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008Is15AAC",
    "hero_image": "https://images.luxuryescapes.com/tcaz2cku9vjgmdcodrs",
    "image_two": "https://images.luxuryescapes.com/h8zd1fkmcv16yalnn1bc",
    "image_three": "https://images.luxuryescapes.com/mmonou3h8gswl5f2pcwl",
    "vendor_name": "Lake Nona Wave Hotel",
    "title": "Stylish Orlando Escape near Popular Theme Parks",
    "description": "Allow yourself to be swept away by the excitement of Orlando with an ultra-stylish escape at Lake Nona Wave Hotel. The sleek facade will capture your attention while the artful interior offers a stunning contrast. Here, sophisticated travellers can recharge in style while enjoying the impressive onsite amenities. The colourful HAVEN pool deck is the perfect spot to soak up the sunshine and with unbeatable fitness options including complimentary access to the 200,000sqft Lake Nona Performance Club, featuring Deepak Chopra’s Mind-Body Zone and Spa. Gourmands can take a seat at BACÁN for elevated tastes inspired by the flavours of the Americas, HAVEN Kitchen for Mediterranean style dining and Living Room Bar for expertly shaken cocktails.\n\nWithin a short walk, you can find shopping, dining and entertainment with Lake Nona Town Center, find family fun at Nona Adventure Park, flex your tennis skills at United States Tennis Association’s National Campus or venture a little further to some of Orlando’s most renowned theme parks, including Walt Disney World® Resort, Universal Orlando Resort and SeaWorld Orlando.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Florida",
    "offer_geo_area_level_2": "Orlando",
    "location_heading": "Orlando, Florida",
    "location_subheading": "USA",
    "location_description": "Lake Nona Wave Hotel",
    "offer_address": "6100 Wave Hotel Drive, Orlando, FL 32827, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 239.0,
    "value": 239.0
  }
]