[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zQS4AAM",
    "hero_image": "https://images.luxuryescapes.com/rfa9lz4zp5uf5m4vm5k",
    "image_two": "https://images.luxuryescapes.com/eos80oiipbxre289elsq",
    "image_three": "https://images.luxuryescapes.com/xy1pldfrui3n2h1mbv6",
    "vendor_name": "Casa De Campo Resort & Villas",
    "title": "Private Gated Dominican Republic Celebrity Escape with Seven Restaurants, Three Beaches & Golf Courses",
    "description": "There are some experiences in life that should not be missed and a stay at the private gated, celebrity-revered and ultra-luxurious Casa de Campo Resort & Villas is one of them. Facing the glistening azure Caribbean Sea, stretching over 7,000 acres, this five-star hotel, resort and residential community in La Romana is a tropical playground for the likes of Kim Kardashian, Jay-Z, Beyoncé and more.\n\nRanked within the top 1% of the world on Tripadvisor, awarded Dominican Republic's Leading Resort 2021 and World's Leading Luxury Sports & Villa Resort six years running by The World Travel Awards, Casa de Campo Resort & Villas is a self-contained, seaside paradise overflowing with world-class amenities. Soak up the sun from the resort's private Minitas Beach and Beach Club with chaise loungers, wine and dine across seven restaurants, enjoy a treatment in the wickedly lavish spa and practice your swing across three Pete Dye-designed championship golf courses, 13 tennis courts or three polo playing fields. If that wasn't enough, this exquisite resort boasts a movie theatre, a full-service marina, shooting range and a custom-built full-size artist's village focusing on native history and culture",
    "offer_country_name": "Dominican Republic",
    "offer_country_code_alpha_2": "DO",
    "offer_geo_area_level_1": "La Romana",
    "offer_geo_area_level_2": "La Romana",
    "location_heading": "La Romana",
    "location_subheading": "Dominican Republic",
    "location_description": "Casa De Campo Resort & Villas",
    "offer_address": "Carretera La Romana - Higuey Hwy, La Romana 22000, Dominican Republic",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 230.0,
    "value": 230.0
  }
]