[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xPaBAAU",
    "hero_image": "https://images.luxuryescapes.com/jipxvnuq95z52u6wvc",
    "image_two": "https://images.luxuryescapes.com/k04lyyrkh3xmwkcuq3u",
    "image_three": "https://images.luxuryescapes.com/ojnkkl0qc4gez7uck8xu",
    "vendor_name": "DoubleTree by Hilton Hotel Alice Springs",
    "title": "Alice Springs Newly Refurbished DoubleTree by Hilton Escape with Daily Breakfast",
    "description": "After a multimillion-dollar revamp, DoubleTree by Hilton Hotel Alice Springs awaits your arrival. Discover the very best of the Northern Territory in style with a luxe stay at this newly refurbished launchpad. Framed by the striking MacDonnell Ranges, the family-friendly DoubleTree by Hilton Hotel Alice Springs is a true outback oasis. After a long, hot day exploring the Red Centre, what could be better than returning to your hotel and slipping into the generously sized swimming pool? After a refreshing dip, enjoy a delicious bush food-inspired feast at Saltbush or tuck into Asian fusion at the award-winning Hanuman - a favourite among Alice Springs locals. Round out your day with a game of tennis on the full-size court before sipping a cool glass of wine or beer at The Deck Bar.\n\nBeautifully positioned along the banks of the Todd River, moments from the iconic Alice Springs Golf Club and the thriving town centre, the hotel is perfectly located for exploring the cultural attractions of this laidback township and its breathtaking natural surrounds. Head deep into the ranges and plunge into a desert waterhole, cuddle a joey at The Kangaroo Sanctuary or soar above the striking formations of Kings Canyon and Uluru on a once-in-a-lifetime scenic flight.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Alice Springs",
    "location_heading": "Alice Springs",
    "location_subheading": "Northern Territory",
    "location_description": "DoubleTree by Hilton Hotel Alice Springs",
    "offer_address": "82 Barrett Drive, Alice Springs, Northern Territory 0870, Australia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 365.0,
    "value": 658.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IS9TIAW",
    "hero_image": "https://images.luxuryescapes.com/r2h24gf6njzgnd16r6c",
    "image_two": "https://images.luxuryescapes.com/4k4jk7nf18uhaze8vml",
    "image_three": "https://images.luxuryescapes.com/mgtencg6o9kov8i4xsl",
    "vendor_name": "DoubleTree by Hilton Hotel Alice Springs",
    "title": "Alice Springs Eco-Friendly DoubleTree by Hilton Escape with Daily Breakfast & Heated Outdoor Pool",
    "description": "Framed by the striking MacDonnell Ranges, this family-friendly hotel is a true outback oasis. Resting along the banks of the Todd River and mere moments from the iconic Alice Springs Golf Club and other attractions, the hotel is perfectly located for exploring the cultural and natural wonders of this remote area and laidback town.\n\nEnjoy a refreshing dip in the outdoor heated pool or simply lounge in the sun before tucking into a bush food-inspired feast at Saltbush, or sumptuous Asian fusion at the award-winning Hanuman - a favourite among Alice Springs locals. Round out your day with a game of tennis on the full-size court before sipping a cool glass of wine or beer at The Deck Bar.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Alice Springs",
    "location_heading": "Alice Springs",
    "location_subheading": "Northern Territory",
    "location_description": "DoubleTree by Hilton Hotel Alice Springs",
    "offer_address": "82 Barrett Drive, Alice Springs, Northern Territory 0870, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 249.0,
    "value": 486.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2y1IAC",
    "hero_image": "https://images.luxuryescapes.com/ubsstr2obaulleuehc",
    "image_two": "https://images.luxuryescapes.com/crtvg7f49rriloihnr8q",
    "image_three": "https://images.luxuryescapes.com/thk086hj398xfp0pynsb",
    "vendor_name": "Mercure Alice Springs Resort",
    "title": "Alice Springs Red Centre Resort with Onsite Restaurant & Pool",
    "description": "Experience the charm of Australia's Red Centre with a stay at this serene property close to the town centre. Located on the banks of the Todd River, this oasis is a short stroll from the town's vibrant shopping, dining and entertainment precinct. Refurbished rooms offer all modern luxuries and a peaceful ambience to both business and leisure travellers.\n\nAfter a day exploring the MacDonnell Ranges or the historic Telegraph Station, retreat to the resort's Barra on Todd Restaurant and Bar for a taste of the Northern Territory's finest cuisine. For leisure, the resort offers a refreshing outdoor pool, a state-of-the-art fitness centre and a tranquil garden area.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Alice Springs",
    "location_heading": "Alice Springs",
    "location_subheading": "Northern Territory",
    "location_description": "Mercure Alice Springs Resort",
    "offer_address": "34 Stott Terrace, Alice Springs, Northern Territory 0870, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 74.0,
    "value": 74.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt5VAAR",
    "hero_image": "https://images.luxuryescapes.com/v48gytinep78v3ij3m",
    "image_two": "https://images.luxuryescapes.com/hpag4szxwmal6iv3v4p",
    "image_three": "https://images.luxuryescapes.com/91o6sse78dzg0yai7a1k",
    "vendor_name": "Crowne Plaza Lasseters Hotel Casino",
    "title": "Family-Friendly Alice Springs Outback Oasis near Lasseters",
    "description": "An outback oasis in the heart of Australia’s vast Red Centre, Crowne Plaza Alice Springs Lasserters, an IHG Hotel, offers family-friendly convenience under the shadow of the mighty MacDonnell Ranges. With an unrivalled location  - adjacent to the Alice Springs Convention Centre and entertainment hub Lasseters and only minutes from the CBD and airport - the region's countless treasures are within easy reach, elevated by stunning mountain views. Swim your way through Tjoritja West MacDonnell National Park's many permanent waterholes, wander through Alice Springs' world-class Indigenous museums and galleries or admire the scenery by camel or hot air balloon. Between walkabouts in the great red beyond, sip cold ones by the water at Splash Poolside Café, rebalance and revitalise with a visit to onsite spa Lavish or savour mouthwatering wagyu at Juicy Rump.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Alice Springs",
    "location_heading": "Alice Springs",
    "location_subheading": "Northern Territory",
    "location_description": "Crowne Plaza Alice Springs Lasseters, an IHG Hotel",
    "offer_address": "93 Barrett Drive, Alice Springs NT 0870 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 83.0,
    "value": 83.0
  }
]