[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006C7WtAAK",
    "hero_image": "https://images.luxuryescapes.com/j773ojv9luoi8h0p20r",
    "image_two": "https://images.luxuryescapes.com/dfhyysqtibrjc9dacqa",
    "image_three": "https://images.luxuryescapes.com/6yr6gxey1f5crfwi5j",
    "vendor_name": "Gaya Island Resort",
    "title": "Five-Star Borneo Beachfront Retreat on Gaya Island",
    "description": "Discover the unspoiled beauty of Borneo at the five-star Gaya Island Resort, a tranquil nature retreat tucked in the protected Tunku Abdul Rahman Marine Park. Ranked in the top 10% of resorts worldwide on Tripadvisor, enjoy a blissful stay among protected mangroves, sheltered coral reefs, and a pristine private beach. This beachfront property offers moments of relaxation alongside unforgettable experiences, including guided nature walks, snorkelling, and kayaking.\n\nThere are four restaurants (including Tavajun Bay, located on a private island, a short five-minute boat ride from the resort), a pool with bar and lounge, and the Spa Village, where you can indulge in relaxing treatments based on ancient healing traditions. Conservation is a top priority for the resort, which promotes sustainable seafood options and offers guests the chance to be engaged in coral reef restoration and turtle rescue. Getting to mainland Borneo is also made easy, with the resort running a complimentary, regular boat service. Visit Kinabalu Park and enjoy views of the majestic mountain, marvel at the deer caves in Gunung Mulu National Park or head to Tanjung Putting and meet some of Borneo’s famous orangutans.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Sabah",
    "offer_geo_area_level_2": "Gaya Island",
    "location_heading": "Borneo",
    "location_subheading": "Asia",
    "location_description": "Gaya Island Resort",
    "offer_address": "Malohom Bay, Tunku Abdul Rahman Marine Park, Kota Kinabalu, Sabah, Malaysia, 88000 Kota Kinabalu, Sabah, Malaysia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdRcAAAV",
    "hero_image": "https://images.luxuryescapes.com/mb3nh9oqcvei9jz0h2tt",
    "image_two": "https://images.luxuryescapes.com/l8c1fzkf2am9yjqlo9ot",
    "image_three": "https://images.luxuryescapes.com/6x5el7l2h6oa85ykt4xw6",
    "vendor_name": "Borneo Eagle Resort",
    "title": "Secluded Borneo Island Bliss with Infinity Pool & Romantic In-Villa Dining",
    "description": "Located on the pristine island of Pulau Tiga, off the west coast of Malaysia, Borneo Eagle Resort is an enchanting retreat surrounded by sparkling turquoise waters and magnificent coral reefs. Experience complete tranquility in a luxurious villa, blending seamlessly into the lush rainforest, as you discover the true meaning of island paradise. Enjoy refined Western and Asian-inspired dishes at The Eagle's Nest Restaurant or indulge in a romantic dinner on your villa's private open-air terrace.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Sabah",
    "offer_geo_area_level_2": "Tiga Island",
    "location_heading": "Borneo",
    "location_subheading": "Malaysia",
    "location_description": "Borneo Eagle Resort",
    "offer_address": "Pulau Tiga Kuala Penyu, 89740 Kota Kinabalu, Sabah, Malaysia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1687.0,
    "value": 1687.0
  }
]