[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GaWwDYAV",
    "hero_image": "https://images.luxuryescapes.com/owmywdi4pw8t9566q80q",
    "image_two": "https://images.luxuryescapes.com/9lajnmrt5efkx0aohis2",
    "image_three": "https://images.luxuryescapes.com/g186rui8u8temg8squpf",
    "vendor_name": "B Ocean Fort Lauderdale",
    "title": "Fort Lauderdale Oceanfront Escape with Private Beach Access & Daily US$50 Resort Credit",
    "description": "Step into a legacy of timeless allure at this iconic beachfront sanctuary in Fort Lauderdale. Once frequented by legends like Marilyn Monroe, this storied retreat blends historic charm with modern sophistication, perfectly positioned just moments from the airport, Port Everglades and the vibrant energy of Las Olas Boulevard.\n\nSavour coastal elegance at every turn - from private beach access and shimmering pools to gourmet dining. Unwind with a tropical cocktail at the famed Wreck Bar, where mermaids enchant guests with a one-of-a-kind underwater show through vintage porthole windows. B Ocean Resort Fort Lauderdale Beach invites you to just B - chic, inspired and always only steps from the sea.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Florida",
    "offer_geo_area_level_2": "Fort Lauderdale",
    "location_heading": "Fort Lauderdale",
    "location_subheading": "USA",
    "location_description": "B Ocean Resort Fort Lauderdale Beach",
    "offer_address": "1140 Seabreeze Boulevard, Fort Lauderdale, Florida 33316, United States",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 499.0,
    "value": 944.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oTtMAAU",
    "hero_image": "https://images.luxuryescapes.com/9118pus3ej9lvfc8u1",
    "image_two": "https://images.luxuryescapes.com/asox0zcw8b2kfa9ttnvl",
    "image_three": "https://images.luxuryescapes.com/iwi4fepplwp99jvgftp",
    "vendor_name": "Pelican Grand Beach Resort",
    "title": "Fort Lauderdale Beachfront Resort with Private Beach & Rooftop Spa",
    "description": "Located along the most desirable stretch of Fort Lauderdale Beach with its very own patch of sun-kissed shoreline, Pelican Grand Beach Resort, a Noble House Collection beachfront resort, is the ultimate oasis for an elevated retreat. The glistening ocean serves as your backdrop when you dine at OCEAN2000 restaurant, a Latin-inspired venue serving up mouthwatering dishes. For sultry island vibes, O2K Lounge is your go-to for evening cocktails, light snacks and ocean views. When you're craving fresh ice cream, head to The Emporium, an old-fashioned ice cream parlour. For the ultimate deep dive into relaxation, ascend to the rooftop where the boutique PURE Spa offers indulgent Swedish-inspired spa treatments.\n\nThe private beachfront location is perfect for enjoying some of the many water sports on offer: try your hand at paddleboarding, parasailing, snorkelling and kayaking, or simply roll out a towel and relax on the golden sands. Plus, it's also just a short drive from the resort to must-visit cafés including the French-influenced Nanou French Bakery & Café, Il Paesano Market - Italian Cafe, Deli & Wine Market and Croissan'Time French Bakery.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Florida",
    "offer_geo_area_level_2": "Fort Lauderdale",
    "location_heading": "Fort Lauderdale",
    "location_subheading": "Florida",
    "location_description": "Pelican Grand Beach Resort",
    "offer_address": "2000 N Ocean Blvd, Fort Lauderdale, FL 33305, United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oj4uAAA",
    "hero_image": "https://images.luxuryescapes.com/o9x1cy98nl6tsz3d3v5l",
    "image_two": "https://images.luxuryescapes.com/ng4hjnc17o87awvup3ni",
    "image_three": "https://images.luxuryescapes.com/isorghlzbl2s3qr44eeg",
    "vendor_name": "Sonesta Fort Lauderdale Beach",
    "title": "Beachside Bliss in the Heart of Fort Lauderdale with Onsite Restaurant & Outdoor Pool",
    "description": "Sonesta Fort Lauderdale Beach captures the vibrant spirit of Florida with its contemporary design, lively atmosphere, and breathtaking Atlantic Ocean views. Just steps from the white sandy shores of Fort Lauderdale Beach, the stylish hotel is located in the heart of the city's vibrant shopping, entertainment, dining and art precincts. Start your day with a nourishing breakfast at Steelpan Kitchen & Bar, before exploring Fort Lauderdale's best or relaxing by the sparkling outdoor pool.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Florida",
    "offer_geo_area_level_2": "Fort Lauderdale",
    "location_heading": "Fort Lauderdale",
    "location_subheading": "United States",
    "location_description": "Sonesta Fort Lauderdale Beach",
    "offer_address": "999 North Fort Lauderdale Beach Boulevard, Fort Lauderdale, Florida 33304, United Sates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 124.0,
    "value": 124.0
  }
]