[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdRccAAF",
    "hero_image": "https://images.luxuryescapes.com/huy9upksbggts8u80do",
    "image_two": "https://images.luxuryescapes.com/h1zq8uoi5gyetsk93mhr",
    "image_three": "https://images.luxuryescapes.com/lb7j85h6bf9f5a3e5u44",
    "vendor_name": "Widiane Resort",
    "title": "Atlas Mountains Luxury on Bin El Ouidane Lake with Daily Breakfast & Infinity Pool",
    "description": "Allow the magic of Morocco and the Atlas Mountains to mesmerise you with a five-star luxury stay at this lakeside oasis, perched on the hillside of Lake Bin El Ouidane. Retreat to luxuriously designed rooms and suites, or wander the spectacular mountain ranges and sparkling lakes surrounding this tranquil oasis.\n\nDelight in exquisite local cuisine at the resort's acclaimed Saffron restaurant, enjoy a cocktail with a view at Le Bistrot Du Lac and savour a sumptuous breakfast while overlooking the magnificent mountains at The Veranda.\n\nFor a touch of adventure, climb aboard a stand-up paddleboard or a kayak on the lake, or explore the surrounding peaks and valleys on a guided trek. When you're ready to unwind completely, treat yourself to a tailored treatment or private traditional hammam experience at the onsite spa.",
    "offer_country_name": "Morocco",
    "offer_country_code_alpha_2": "MA",
    "offer_geo_area_level_1": "Béni Mellal-Khénifra",
    "offer_geo_area_level_2": "Bine el Ouidane",
    "location_heading": "Atlas Mountains",
    "location_subheading": "Morocco",
    "location_description": "Widiane Resort",
    "offer_address": "Chemin Du Lac 44, Bin El Ouidane, Route de Ouaouizerte, Azilal 22200, Morocco",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 24,
    "price": 339.0,
    "value": 560.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FivzvAAB",
    "hero_image": "https://images.luxuryescapes.com/xindkx0b82azuj3woc4",
    "image_two": "https://images.luxuryescapes.com/zkg010tcgw9epngkypng",
    "image_three": "https://images.luxuryescapes.com/7tytzfoqp78wam0uuh7",
    "vendor_name": "Widiane Resort",
    "title": "Morocco: Peaceful Atlas Mountains Lakeside Escape with Daily Breakfast & Lake-View Room Upgrade",
    "description": "Allow the magic of countryside Morocco and the Atlas Mountains to mesmerise you with a relaxed stay at Widiane Resort. Retreat to luxuriously designed rooms and suites, or wander the spectacular mountain ranges and sparkling lakes surrounding this tranquil oasis. Experience authentic Moroccan culture and breathe in the serene beauty of Lake Bin El Ouidane. Delight in exquisite local cuisine at the resort's acclaimed Saffron restaurant, unwind with a private traditional hammam experience at the spa or enjoy a cocktail with a view at Le Bistrot Du Lac. For a touch of adventure, climb aboard a stand-up paddleboard or a kayak on the lake or explore the surrounding peaks and valleys on a guided trek.",
    "offer_country_name": "Morocco",
    "offer_country_code_alpha_2": "MA",
    "offer_geo_area_level_1": "Béni Mellal-Khénifra",
    "offer_geo_area_level_2": "Bine el Ouidane",
    "location_heading": "Atlas Mountains",
    "location_subheading": "Morocco",
    "location_description": "Widiane Resort",
    "offer_address": "Chemin Du Lac 44, Bin El Ouidane, Route de Ouaouizerte, Azilal 22200, Morocco",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 269.0,
    "value": 520.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gx5cbAAB",
    "hero_image": "https://images.luxuryescapes.com/wyx00thfyxvt78acizt",
    "image_two": "https://images.luxuryescapes.com/vvrhvbn388kvptg5qo",
    "image_three": "https://images.luxuryescapes.com/ae7tufsqlmewn0lkzmdu",
    "vendor_name": "Widiane Resort",
    "title": "Five-Star Atlas Mountains Escape on the Slopes of Lake Bin El Ouidane with Daily Breakfast",
    "description": "Allow the magic of countryside Morocco and the Atlas Mountains to mesmerise you with a stay at Widiane Resort. Retreat to luxuriously designed rooms and suites, or wander the spectacular mountain ranges and sparkling lakes surrounding this tranquil oasis. Experience authentic Moroccan culture and breathe in the serene beauty of Lake Bin El Ouidane. Delight in exquisite local cuisine at the resort's acclaimed Saffron restaurant, enjoy a cocktail with a view at Le Bistrot Du Lac and savour a sumptuous breakfast while overlooking the magnificent mountains at The Veranda.\n\nFor a touch of adventure, climb aboard a stand-up paddleboard or a kayak on the lake, or explore the surrounding peaks and valleys on a guided trek. When you're ready to completely unwind, treat yourself to a tailored treatment or private traditional hammam experience at the spa.",
    "offer_country_name": "Morocco",
    "offer_country_code_alpha_2": "MA",
    "offer_geo_area_level_1": "Béni Mellal-Khénifra",
    "offer_geo_area_level_2": "Bine el Ouidane",
    "location_heading": "Atlas Mountains",
    "location_subheading": "Morocco",
    "location_description": "Widiane Resort",
    "offer_address": "Chemin Du Lac 44, Bin El Ouidane, Route de Ouaouizerte, Azilal 22200, Morocco",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 239.0,
    "value": 472.0
  }
]