[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QTKXAA4",
    "hero_image": "https://images.luxuryescapes.com/ys182yy5j990jftkte9v",
    "image_two": "https://images.luxuryescapes.com/nd6smeqvnlj25qaxu4cn",
    "image_three": "https://images.luxuryescapes.com/cl9dtgs58e0t3zhk7mx",
    "vendor_name": "Tree of Life Dehradun Foothills",
    "title": "Idyllic Hillside Dehradun Boutique Escape with Decadent Dining",
    "description": "Find your sense of calm and tranquility at Tree of Life Resort, Dehradun Foothills, a gorgeous retreat perched on a hillside in Uttarakhand's charming capital. Far away from the chaos of cities and towns, this serene resort is hidden within a forest reserve, surrounded by nothing but five acres of lush greenery - yet is only an hour's drive from the popular towns of Rishikesh and Mussoorie.\n\nFresh mountain air, panoramic vistas and beautiful accommodation will immediately instil a sense of calm. Only 8km from Dehradun city centre and five hours from Delhi, this 13-room property will pamper you with calming natural views, airy and sunlit spaces, delicious Pahadi cuisine and endless opportunities for relaxation. Ideal for couples, families, solo travellers and even pet parents (the resort is pet-friendly), Tree of Life Resort, Dehradun Foothills is an idyllic boutique property waiting to be discovered.\n\n**Your handpicked inclusions:**\n\n- Kickstart your stay with a non-alcoholic welcome drink each\n- Begin every morning with set-menu breakfast at The Gharwal House\n- Enjoy one set-menu dinner, once per stay, at The Gharwal House\n- Sit down for a high tea experience, once per stay, at The Gharwal House\n- Discover the world of knitting with a special village 'Wool Walk', once per stay\n- Make the most of your stay with a 15% discount on soft drinks and dining\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** One child (10 and under) stays free in existing bedding with full package inclusions.\n\n**Longer stay bonus:** extend your stay to 4+ nights to receive a set-menu dinner twice during your stay and a second high tea experience at The Gharwal House.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Dehradun",
    "location_heading": "Dehradun",
    "location_subheading": "India",
    "location_description": "Tree of Life Resort, Dehradun Foothills",
    "offer_address": "101, Bharatwala, Bisht Gaon, Uttarakhand 248003",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 128.0,
    "value": 210.0
  }
]