[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UMXQAA4",
    "hero_image": "https://images.luxuryescapes.com/s3pq8274utp5jh1la8cn",
    "image_two": "https://images.luxuryescapes.com/qbh1hgvo9vn3bc43d8q8",
    "image_three": "https://images.luxuryescapes.com/fustol3jwl11i0zi67h",
    "vendor_name": "Marine North Berwick",
    "title": "Scotland Five-Star Sea-View Spa Luxury near North Berwick's Best Golf Courses",
    "description": "Ancient Scottish hospitality meets elegant linksland luxury at the five-star Marine North Berwick. Overlooking the tumultuous Firth of Forth and seabird-covered Bass Rock, North Berwick is home to some of Scotland's oldest golf courses and a must-visit for serious golfers. Rolling woodlands, a striking coastline and a strong commitment to tradition sum up the magic of the area, and Marine North Berwick - whose 19th-century building has weathered years of sand and storm - epitomises and preserves everything that makes Scotland’s East Lothian region so utterly remarkable.\n\nMarine North Berwick overlooks the championship West Links golf course, the crown jewel of Scottish golfing. The hotel is also conveniently located a short drive from many other extraordinary courses, such as Muirfield and Archerfield Links. The property’s onsite facilities also impress. Led by award-winning chef Chris Niven, The Lawn’s menu dazzles with sustainable, seasonal Scottish produce, while The Spa at Marine North Berwick offers unique vinotherapy treatments guaranteed to soothe your soul after a morning on the green.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "Scotland",
    "offer_geo_area_level_2": "North Berwick",
    "location_heading": "North Berwick",
    "location_subheading": "Scotland",
    "location_description": "Marine North Berwick",
    "offer_address": "18 Cromwell Road North Berwick, EH39 4LZ United Kingdom",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 212.0,
    "value": 212.0
  }
]