[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cqAEgQAM",
    "hero_image": "https://images.luxuryescapes.com/4trpfzu2xfwtn8ilno",
    "image_two": "https://images.luxuryescapes.com/hfef0t1sha8l59ysiyb",
    "image_three": "https://images.luxuryescapes.com/tyyeg8yh67iau1u0b8",
    "vendor_name": "Anchorage Beach Resort",
    "title": "A Relaxing Fijian Getaway for Couples and Families",
    "description": "Treat yourself to a peaceful Fijian getaway, where the sun is always shining and time seems to stand still. Stay at Anchorage Beach Resort, a beautiful retreat with a fantastic location on mainland Fiji, so you can explore neighbouring islands or simply relax on the resort’s private beach. Embark on a picturesque couples’ escape or bring the whole family on a fun-filled holiday and enjoy a day trip to Beachcomber Island, a delicious two-course dinner, a relaxing 30-minute massage, daily continental breakfast, return airport transfers and more. Plus up to two kids (aged 12 years and under) stay free!",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Lautoka",
    "location_heading": "Lautoka",
    "location_subheading": "Fiji",
    "location_description": "Anchorage Beach Resort",
    "offer_address": "Vuda Back Rd, Lautoka, Fiji",
    "percentage_discount": 71.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 279.0,
    "value": 963.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008h7ShAAI",
    "hero_image": "https://images.luxuryescapes.com/f01d9wlg0fd17zoph4u9",
    "image_two": "https://images.luxuryescapes.com/ws4lcu7q0wb8l296zhk8",
    "image_three": "https://images.luxuryescapes.com/vcvjypy7uibuled1alrp",
    "vendor_name": "First Landing Beach Resort and Villas",
    "title": "Fiji Beachfront Resort on Viti Levu Overlooking the Mamanuca Islands",
    "description": "The escape you've been dreaming of is waiting for you at First Landing Beach Resort and Villas, situated on the pristine white sands of Nalamu Beach. Local legend has it that the first Fijians set foot on this very beachfront where the gorgeous resort is now located around 1500 BC. Here, you'll be treated to front-row views of incredible sunsets each night along with views of the famed Mamanuca Islands, located just a short boat ride away.\n\nChoose to do as little or as much as you please throughout your stay. Take it easy and stroll along the beach, relax by the pool or catch a movie at the open-air cinema. Explore the nearby Treasure, Beachcomber and Bounty Islands just a short boat ride away. Roll up your sleeves and learn how to cook local delicacies or just sit back and enjoy delicious local fare served at the resort’s memorable Mai Kana restaurant.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Lautoka",
    "location_heading": "Lautoka",
    "location_subheading": "Fiji",
    "location_description": "First Landing Beach Resort and Villas",
    "offer_address": "Lautoka, Fiji",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 85.0,
    "value": 85.0
  }
]