[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GNYN8AAP",
    "hero_image": "https://images.luxuryescapes.com/7b8ryazif9340lh9kwa7",
    "image_two": "https://images.luxuryescapes.com/jcus8vowxmfg88ko7y03",
    "image_three": "https://images.luxuryescapes.com/zi2kjcej4ibr58jl4ozj",
    "vendor_name": "Norbu The Montanna Dharamshala IHCL SeleQtions",
    "title": "Luxe Taj Himalayan Villa Paradise with Daily Breakfast, One Lunch/Dinner & Floral Bath Experience",
    "description": "Nestled in the beauteous lap of Kangra Valley in Himachal Pradesh, the five-star Norbu The Montanna, Dharamshala - IHCL SeleQtions from Taj Hotels is a radiant jewel in the Himalayas. Spread across seven acres, the Tibetan-inspired décor and architecture of the hotel are quick to mesmerise. A scenic 10-hour drive from New Delhi and only a 30-minute drive from Gaggal Airport (DHM), the hotel redefines mountain luxury with its premium amenities and gorgeous views. Lounge by the Lhasa River-inspired artificial stream, dip in the heated outdoor pool, feast on traditional Himachali dham, taste lip-smacking global cuisine, or kick back in style in the exquisitely designed rooms and suites. Home to Dalai Lama's monastery, Dharamshala is ideal for experiencing the rich Tibetan and Himachali culture.\n\nRelax and unwind in the ethereal surroundings with a soulful yoga session, sip on fine tea blends and indulge in a Tibetan degustation experience at the property. Dotted by snow-capped peaks on the horizon, regale in the bliss of your Himalayan escape as you enthrall yourself with a visit to the nearby Kangra Fort and tea gardens and make your holiday memorable.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Dharamshala",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Norbu The Montanna Dharamshala IHCL SeleQtions",
    "offer_address": "Village Banordu, Dharamshala, Himachal Pradesh , 176053, India",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 11,
    "price": 1319.0,
    "value": 2008.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CcJHAA0",
    "hero_image": "https://images.luxuryescapes.com/5iibfmznelt5yhehla7",
    "image_two": "https://images.luxuryescapes.com/bhi1req8bv295q1lsiwp",
    "image_three": "https://images.luxuryescapes.com/4xblv0xzweb200407v1v",
    "vendor_name": "Rakkh Resort",
    "title": "Secluded Himachal Mountain Escape near Dharamshala with All-Inclusive Dining & Daily Activities",
    "description": "Perched on a hilltop, with the magnificent Dhauladhar mountains of Himachal Pradesh as a backdrop, Rakkh Resort is a unique retreat perfect for city-weary souls. Set on 4.5 acres of rolling green hills, this paradise perfectly combines adventurous experiences and transformative living. Situated close to the popular destinations of McLeod Ganj and Dharamshala, the resort makes it easy to experience the best of the region. One of the most famous resorts in the lap of the snow-clad hills near Dharamshala, the hotel is situated in the midst of the glittering Dhauladhar ranges and has stunning 180-degree views of the surrounding hills and valleys. With spectacular views of the verdant Kangra Valley, Rakkh Resort is one of the finest boutique resorts in the region and is the perfect place to recharge.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Palampur",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Rakkh Resort OLDER VERSION",
    "offer_address": "Ghamrota Village Post Office Ballah ,Tehsil Palampur, District Kangra, Jiun, Himachal Pradesh 176061",
    "percentage_discount": 20.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 306.0,
    "value": 381.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QgWzAAK",
    "hero_image": "https://images.luxuryescapes.com/q48wthjndbcrd4bl6ys",
    "image_two": "https://images.luxuryescapes.com/d5xw62156rn98q494fx",
    "image_three": "https://images.luxuryescapes.com/cdpdb19hbc1ik1a6atc",
    "vendor_name": "Royal Tulip Shimla, Kufri Hills",
    "title": "Tranquil Five-Star Hillside Hideaway near Shimla with Decadent Dining & One Child Stays Free",
    "description": "Lose yourself in the mesmerising beauty of nature at Royal Tulip Shimla, Kufri Hills, a five-star luxury resort perched on a wooded hillside of Kufri, just a 30-minute drive from Shimla. Stay in the shadow of the majestic Shivalik range in the Himalayas and breathe in the fresh mountain air at this gorgeous hilly hideaway.\n\nAn overnight drive from Delhi, the resort boasts large, open spaces, inspiring views of the mountains and valleys, and a sense of luxury synonymous with the famed Louvre Hotels Group. The resort's warm ambience flows into its hospitality and contemporary comforts, such as an indoor heated pool, kids' area, restaurants and spa. Grab your family and friends and experience the healing power of nature at this hilltop hideaway.\n\n**Your handpicked inclusions:**\n\n- Enjoy a non-alcoholic welcome drink on arrival\n- Wake up every morning with a buffet breakfast at Promenade Restaurant\n- Enjoy one buffet dinner at Promenade Restaurant, once per stay\n- Unwind with one cocktail, glass of wine or beer (one drink per adult, per stay) at Cedar Bar\n- Make the most of your stay with daily INR500 dining credit per package\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** One child (10 and under) stays free in existing bedding with all package inclusions (excludes alcohol).\n\n**Longer stay bonus:** Stay 4+ nights and enjoy two buffet dinners per stay, plus two drinks (cocktail, glass of wine or beer) per adult, per stay.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Theog",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Royal Tulip Shimla, Kufri Hills 2021",
    "offer_address": "National Highway 22, Kufri, Himachal Pradesh 171012",
    "percentage_discount": 24.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 182.0,
    "value": 239.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4wJaAAJ",
    "hero_image": "https://images.luxuryescapes.com/fkljordld07tpqjdvf9",
    "image_two": "https://images.luxuryescapes.com/j4xj01epl47klsyvwup",
    "image_three": "https://images.luxuryescapes.com/0s11hxmz699n0nl3fo79",
    "vendor_name": "Tree of Life Eila Art Hotel Naggar",
    "title": "Grand Opening: Unique Art-Inspired Naggar Stay with Daily Breakfast & Dinner",
    "description": "Rising out of the picturesque hills of Naggar in Himachal Pradesh, Tree of Life Eila Art Resort Naggar is a newly built resort calling your name. Set amid the Deodhar forests with the rippling Beas River meandering in the valley below, the resort is a cocoon of serenity. This uniquely designed resort - located conveniently between the towns of Kullu and Manali and only an hour's drive from Bhuntar Airport - will enchant you with its contemporary architecture and scenic, mountainous views at every corner. Pull yourself away from the city's limits and head to this tranquil retreat, where art, literature, cuisine and wellness converge into a unique artsy structure.\n\nRooms that draw inspiration from the local beauty will embrace you in a warm hug like Mother Nature itself. Choose from a wide range of dining options that will delight both your palate and your eyes. A spa for soothing your nerves, a yoga deck for perfecting your Surya Namaskar, a gorgeous outdoor pool, and a fascinating art gallery - considered to be one of the finest ones in town - add to the charm of this resort.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Kullu",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Tree of Life Eila Art Hotel Naggar",
    "offer_address": "Jana Road, Khasra No 2403 Opposite Forest Department Range Office, Manali Tehsil Naggar Himachal Pradesh 175130 India",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 339.0,
    "value": 594.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X9HBZQA3",
    "hero_image": "https://images.luxuryescapes.com/f59udr8dsmydn2urxbld",
    "image_two": "https://images.luxuryescapes.com/nsmhwkzo07ubjfewoy52",
    "image_three": "https://images.luxuryescapes.com/xut6smtkzdgazu4zcvu9",
    "vendor_name": "Rakkh Resort",
    "title": "Nature Escape in the Himalayas",
    "description": "Relax and rejuvenate with two nights of mountaintop tranquillity at Rakkh Resort, a boutique resort perched on a hilltop in the Himalayas. Reconnect with nature and find spirituality at this exclusive resort, while enjoying all meals (daily breakfast, lunch and dinner), a 30-minute massage or aromatherapy treatment and a paragliding discount so you can soar over the enchanting landscape.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Kangra",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Rakkh Resort OLD",
    "offer_address": "Ghamrota Village, P. O. Ballah , Tehsil Palampur, District Kangra, Himachal Pradesh, India- 176061",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 241.0,
    "value": 490.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R7iLEQAZ",
    "hero_image": "https://images.luxuryescapes.com/hsg2b2kkowdedpfdgk3g",
    "image_two": "https://images.luxuryescapes.com/xe5pornwxtiwontldenp",
    "image_three": "https://images.luxuryescapes.com/zokbiexzpgk7jiualx53",
    "vendor_name": "Rakkh Resort",
    "title": "Rakkh Resort: Tranquillity in the Himalayas, Dharamshala",
    "description": "Relax and rejuvenate with three nights of mountaintop tranquillity at Rakkh Resort in the Himalayas. Includes all meals (daily breakfasts, lunches and dinners), a 60-minute Swedish massage or aromatherapy treatment each and a paragliding discount so you can soar over the enchanting landscape.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Kangra",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Rakkh Resort 2017",
    "offer_address": "Ghamrota Village Post Office Ballah ,Tehsil Palampur, District Kangra, Jiun, Himachal Pradesh 176061, India",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 3,
    "price": 327.0,
    "value": 614.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DpnAWAAZ",
    "hero_image": "https://images.luxuryescapes.com/m5mnshr33indh5ok9td",
    "image_two": "https://images.luxuryescapes.com/qq312wb97zysn30y059",
    "image_three": "https://images.luxuryescapes.com/omyrsam2bbge0izk09vk",
    "vendor_name": "Tree of Life Eila Art Hotel Naggar",
    "title": "Artistic Naggar Mountainside Escape near Manali with Daily Breakfast & Dinner",
    "description": "From the dense deodar forests of the gorgeous Dhauladhar ranges in Himachal Pradesh, the gorgeous Tree of Life Eila Art Hotel Naggar emerges like a dream. A 40-minute drive from bustling Manali and an hour’s drive from Bhuntar Airport (KUU), this artsy retreat is shrouded in mountain mist and enveloped by tranquility. Step into this uniquely designed resort dotted with white domes and distinctive rooms, each boasting unobstructed views of the mountains. In this tranquil oasis, where the only sound is of the distant Beas, it is easy to find nirvana.\n\nWith a wide range of dining options that will woo your palate to remarkable mountain experiences - the property is known for curating aesthetic experiences. Indulge in spa sessions, flip through the pages of a classic at the library, take a dip in the inviting blue heated pool, perfect your Surya Namaskar on the yoga deck, or simply take a tour of the fascinating art gallery in the property - Tree of Life Eila Art Hotel Naggar will mesmerise you with it all.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Kullu",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Tree of Life Eila Art Hotel Naggar",
    "offer_address": "Jana Road, Khasra No 2403 Opposite Forest Department Range Office, Manali Tehsil Naggar Himachal Pradesh 175130 India",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 316.0,
    "value": 514.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQ2L4AAL",
    "hero_image": "https://images.luxuryescapes.com/qe998ctioctu02azqzo",
    "image_two": "https://images.luxuryescapes.com/834b2mt9dl3lvjgcgm2",
    "image_three": "https://images.luxuryescapes.com/1ndfzev97lr9itj8vkim",
    "vendor_name": "Rakkh Resort",
    "title": "Eco-Friendly Himachal Mountain Escape in Palampur with All-Inclusive Dining & Daily Activities",
    "description": "Perched on a hilltop, with the magnificent Dhauladhar mountains of Himachal Pradesh as a backdrop, Rakkh Resort, a Member of Radisson Individuals Retreat, is a unique retreat perfect for city-weary souls. Set on 4.5 acres of rolling green hills, this sustainable paradise perfectly combines adventurous experiences and transformative living. An overnight drive from Delhi (approximately 10 hours), the Himalayan gem is situated close to the popular destinations of McLeod Ganj and Dharamshala, making it easy to experience the best of the region. Quaint cottages overlooking the verdant valley, an infinity pool guarded by the majestic mountains and delectable cuisine that never lets you down - the mountains are indeed calling.\n\nOne of the most famous resorts in the lap of the snow-clad hills in Palampur, the hotel is situated in the midst of the glittering Dhauladhar ranges and has stunning 180-degree views of the surrounding hills and valleys. With spectacular views of the verdant Kangra Valley and the Tripadvisor Best of the Best Award 2022 for Top Small Stays - India, the resort is one of the finest boutique resorts in the region and is the perfect place to recharge. Plus, the tranquil resort is a champion of sustainability and responsible tourism through its eco-friendly architecture, plastic-free amenities, local kitchen garden that supplies all the ingredients for your meals and more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Palampur",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Rakkh Resort, a Member of Radisson Individuals Retreat",
    "offer_address": "Ghamrota Village Post Office Ballah, Tehsil Palampur, District Kangra, Jiun, Himachal Pradesh 176061",
    "percentage_discount": 21.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 332.0,
    "value": 420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DU9mAAG",
    "hero_image": "https://images.luxuryescapes.com/lk5ue5lbfbwdetk800pg",
    "image_two": "https://images.luxuryescapes.com/d8z5q4qjcr5mbkls3ucl",
    "image_three": "https://images.luxuryescapes.com/hm36mxra2aksvwufh6sl",
    "vendor_name": "Rakkh Resort",
    "title": "Secluded Himachal Mountain Escape near Dharamshala with All-Inclusive Dining & Daily Activities",
    "description": "Perched on a hilltop, with the magnificent Dhauladhar mountains of Himachal Pradesh as a backdrop, Rakkh Resort is a unique retreat perfect for city-weary souls. Set on 4.5 acres of rolling green hills, this paradise perfectly combines adventurous experiences and transformative living. An overnight drive from Delhi (approximately 10 hours), the Himalayan gem is situated close to the popular destinations of McLeod Ganj and Dharamshala, making it easy to experience the best of the region. Quaint cottages overlooking the verdant valley, an infinity pool guarded by the majestic mountains and delectable cuisine that never lets you down - the mountains are indeed calling.\n\nOne of the most famous resorts in the lap of the snow-clad hills near Dharamshala, the hotel is situated in the midst of the glittering Dhauladhar ranges and has stunning 180-degree views of the surrounding hills and valleys. With spectacular views of the verdant Kangra Valley and the Tripadvisor Best of the Best Award 2022 for Top Small Stays - India, Rakkh Resort is one of the finest boutique resorts in the region and is the perfect place to recharge.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Palampur",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Rakkh Resort, a Member of Radisson Individuals Retreat",
    "offer_address": "Ghamrota Village Post Office Ballah, Tehsil Palampur, District Kangra, Jiun, Himachal Pradesh 176061",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 344.0,
    "value": 0.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DHeFYAA1",
    "hero_image": "https://images.luxuryescapes.com/hiehbl7qlhjdzmtngq9",
    "image_two": "https://images.luxuryescapes.com/335xqxs12maytcjbxebq",
    "image_three": "https://images.luxuryescapes.com/n7lcuczvdhnh2x4cym17",
    "vendor_name": "Welcomheritage parv vilas Solan",
    "title": "Grand Opening: Tranquil Mountain Escape near Kasauli with Daily Breakfast, One Lunch/Dinner & Daily High Tea",
    "description": "Far from the heat, dust and chaos of urban cities, WelcomHeritage Parv Vilas Solan is a serene paradise tucked away in the Shivalik hills of Himachal Pradesh. Located close to the hill town of Kasauli and easily accessible from Delhi (a 6-hour drive) and Chandigarh (a 1.5-hour drive), this brand-new hotel welcomes you to breathe in the crisp mountain air, wake to panoramic views of the surrounding hills and enjoy luxurious hospitality. Dine in the open air and taste some of the most exotic delicacies slow-cooked to perfection or just head to the lavish spa for a rejuvenating massage.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Solan",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Welcomheritage Parv Vilas Solan",
    "offer_address": "Village Rihun, PO Bohali, Near Gandhigram, District Solan Himachal Pradesh 17329 India",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 248.0,
    "value": 377.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G58OrAAJ",
    "hero_image": "https://images.luxuryescapes.com/zvtjdzc52fynl7lme3j",
    "image_two": "https://images.luxuryescapes.com/d22rtoxkerllkt9el28e",
    "image_three": "https://images.luxuryescapes.com/2c9dy2tswr40a3hyaej6",
    "vendor_name": "Welcomheritage parv vilas Solan",
    "title": "Serene Mountain Escape near Kasauli with Daily Breakfast, One Lunch/Dinner & Daily High Tea",
    "description": "Far from the heat, dust and chaos of urban cities, WelcomHeritage Parv Vilas Solan is a serene paradise tucked away in the Shivalik hills of Himachal Pradesh. Located close to the hill town of Kasauli and easily accessible from New Delhi (a six-hour drive) and Chandigarh (a two-hour drive), this luxe hotel welcomes you to breathe in the crisp mountain air, wake to panoramic views of the surrounding hills and indulge in luxurious hospitality. Dine in the open air and taste some of the most exotic delicacies slow-cooked to perfection or just head to the lavish spa for a rejuvenating massage, and make your mountain escape memorable.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Solan",
    "location_heading": "Himachal Pradesh",
    "location_subheading": "India",
    "location_description": "Welcomheritage Parv Vilas Solan",
    "offer_address": "Village Rihun, PO Bohali, Near Gandhigram, District Solan Himachal Pradesh 17329 India",
    "percentage_discount": 27.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 272.0,
    "value": 373.0
  }
]