[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CNr6IAAT",
    "hero_image": "https://images.luxuryescapes.com/ydbrjw87v46p1df3yxfe",
    "image_two": "https://images.luxuryescapes.com/swni3z00ya2s22fld7s",
    "image_three": "https://images.luxuryescapes.com/icm7pq56cfd7xhr2dnd",
    "vendor_name": "InterContinental Taiyuan",
    "title": "China City Break within Taiyuan near Fenhe River with Indoor Pool",
    "description": "In the centre of the Changfeng Business District, InterContinental Taiyuan, an IHG Hotel ensures a soothing break in the bustling city, just steps from the shimmering Fenhe River. Experience traditional Shanxi cuisine at Cai Feng Lou Chinese restaurant, enjoy a refreshing cocktail in The LOONG Lounge or take a rejuvenating plunge in the indoor pool. Outside the hotel, discover Taiyuan's heritage museums and fine dining options, or enjoy a relaxing stroll through the nearby Xieyuan Garden.",
    "offer_country_name": "China",
    "offer_country_code_alpha_2": "CN",
    "offer_geo_area_level_1": "Shanxi",
    "offer_geo_area_level_2": "Taiyuan",
    "location_heading": "Taiyuan",
    "location_subheading": "China",
    "location_description": "InterContinental Taiyuan, an IHG Hotel",
    "offer_address": "No.8, Changxing South Street, Jinyuan District, Taiyuan, 030000, Mainland China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 140.0,
    "value": 140.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IazWEYAZ",
    "hero_image": "https://images.luxuryescapes.com/s4xyzr96ikkxmknj3u2i",
    "image_two": "https://images.luxuryescapes.com/b71t65jsj310yz9vkqe7",
    "image_three": "https://images.luxuryescapes.com/tvcnb7s4ydvpt05joy3r",
    "vendor_name": "Pullman Taiyuan",
    "title": "Elegant North China Pullman Escape in Taiyuan with Indoor Pool & Onsite Dining",
    "description": "Escape to a sophisticated retreat just beyond the vibrant heart of Taiyuan’s CBD. This five-star haven offers a serene change of pace while placing you within easy reach of the city’s cultural gems and natural beauty, including the iconic Twin Pagoda Temple and tranquil Jinci Park. After a day of exploration, unwind in the hotel’s serene indoor pool or fitness centre.\n\nSavour an array of culinary delights at Yan Chinese Restaurant, where authentic Cantonese and Shanxi cuisine take centre stage, or explore global flavours at UP@2ND Western Restaurant, serving everything from Asian to Western favourites. For a taste of local life, stroll to the downtown Liuxiang Street for traditional eateries, a bustling night market and charming shops. As the evening winds down, enjoy a nightcap at the elegant V Lounge Bar.",
    "offer_country_name": "China",
    "offer_country_code_alpha_2": "CN",
    "offer_geo_area_level_1": "Shanxi",
    "offer_geo_area_level_2": "Taiyuan",
    "location_heading": "Taiyuan",
    "location_subheading": "China",
    "location_description": "Pullman Taiyuan",
    "offer_address": "No 7 Jin An East Street, Xinghualing District, Shanxi Province, Taiyuan 030009, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 49.0,
    "value": 49.0
  }
]