[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005Ig8RAAS",
    "hero_image": "https://images.luxuryescapes.com/4g46hmtummzhdout82vk",
    "image_two": "https://images.luxuryescapes.com/s89e5f47kmefss3g0yzv",
    "image_three": "https://images.luxuryescapes.com/rgezuquf3spmez5eig6k",
    "vendor_name": "Riverside Oaks Golf Resort",
    "title": "Tranquil Resort Stay at One of Australia’s Top-Rated Golf Courses Less than One Hour From Sydney",
    "description": "There's no better way to challenge your golf skills and escape from the daily hustle and bustle than with a tranquil stay at Riverside Oaks Resort, one of Australia’s Top 100 Resort Golf Courses. Located under an hour’s drive from Sydney’s CBD, this golfing sanctuary is set on 587 acres of natural Australian bushland bordering the Hawkesbury River and enjoys the distinction of being Sydney’s only 36-hole golf resort with two championship golf courses, as well as being the recipient of the Australian Golf Digest Editors' Choice Award for Best Golf Resort in 2021. Sporting enthusiasts can choose from the Bungool and Gangurru Golf Courses - both have proudly hosted national tournaments such as the PGA Championships, NSW Amateur and Australian Teams championships.\n\nTee up and enjoy access to both courses, spot native wildlife alongside the green for a quintessentially Australian experience, dine at the Brassiere or Bungool Restaurant and before you know it, you’ll fall right into the swing of things.\n\n**Your handpicked inclusions:**\n\n- Start your day the right way with daily hot breakfast with juice or coffee\n- Treat yourself to a delightful dining experience with a one-time A$50 credit at the Brassiere Restaurant per room\n- Celebrate your stay with a complimentary bottle of wine on arrival\n- Enjoy a delicious cheese platter served to you in your room\n- Refine your golfing skills with A$20 credit towards one game of 18 holes per person\n\n**Want to take your game to the next level?** Serious golfers can upgrade to the Stay and Play package to enjoy one complimentary game (18 holes) for two guests including the use of a motorised cart and four small buckets of driving range balls, plus receive an additional A$10 golf credit per person, per stay (A$30 credit total) to put towards a second round of golf during your stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Cattai",
    "location_subheading": "New South Wales",
    "location_description": "Riverside Oaks Golf Resort",
    "offer_address": "74 O'Briens Rd, Cattai NSW 2756 Australia",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 191.0,
    "value": 305.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LdC0AAK",
    "hero_image": "https://images.luxuryescapes.com/cnd7atzua9qlfb0ugd8d",
    "image_two": "https://images.luxuryescapes.com/e179rjd1rbqusad9e4",
    "image_three": "https://images.luxuryescapes.com/ftncvpf9u9hxes83made",
    "vendor_name": "Sweven Estate",
    "title": "All-Inclusive NSW Country Estate Group Stay with Daily Dining, Drinks & Dune Buggy Hire",
    "description": "An all-inclusive escape awaits at the stunning Sweven Estate, one of Australia’s greatest country estates - just over an hour's drive from the cosmopolitan buzz of Sydney. Immediately feel right at home in this treehouse-style abode, built and designed in 2012 by the renowned Timothy Moon Architects. You’ll love every detail of this dazzling property, from the panoramic floor-to-ceiling windows to the open-plan living areas, cosy fireplaces and grand marble bathrooms. \n\nFramed by the twists and turns of the Hawkesbury River, Sweven Estate is surrounded by acres of manicured gardens, sheep-filled paddocks and a private beach. Accommodating private groups with exclusive estate access, this is a chance to get away from it all on your own secluded slice of land. There isn’t another soul in sight - aside from your onsite chef and concierge. Days stretch on blissfully with nothing more to do than relax. And when you’re ready to explore, there’s no shortage of things to do. Go fruit picking, visit the resident sheep and alpacas, head out on a dune buggy adventure across the property or simply enjoy a stroll across the estate’s gorgeous gardens.\n\n**Your handpicked inclusions:**\n\n- All-inclusive meals prepared by a private in-house chef: daily continental and hot breakfast, light lunch with canapés and share platters, and nightly three-course dinner with canapés\n- All-inclusive drinks including spirits, beer and wine\n- Enjoy the option to take your lunch as a picnic around the property\n- Take advantage of a private dune buggy throughout your stay to explore the estate\n- The services of an onsite concierge to assist with your every need\n- Daily light clean to keep your home-away-from-home fresh\n\n**Travelling with a bigger group?** Upgrades for groups of eight and 10 guests are available (up to 13 may stay for a surcharge; see the packages for more information).\n\n**Watersport upgrade available**: Take advantage of the estate's private beach with daily instructor-led, three-hour access to the estate's watersport facilities: go water skiing, kneeboarding, wakeboarding, slalom water skiing, and set sail on leisurely boat rides.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Cattai",
    "location_subheading": "New South Wales",
    "location_description": "Sweven Estate",
    "offer_address": "177 O'Briens Rd, Cattai NSW 2756 Australia",
    "percentage_discount": 18.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 9339.0,
    "value": 11340.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004hLlTAAU",
    "hero_image": "https://images.luxuryescapes.com/0vlpishn4nga38yl5uue9",
    "image_two": "https://images.luxuryescapes.com/v1xoggpemm440fqmh4d5h",
    "image_three": "https://images.luxuryescapes.com/oao1ruyjslbprhfx82nh",
    "vendor_name": "Sweven Estate",
    "title": "Exclusive NSW Country Estate Stay near Sydney for up to 12 Guests with Onsite Concierge",
    "description": "An exclusive group escape for up to 12 guests awaits at the stunning Sweven Estate, one of Australia’s greatest country estates - just over an hour's drive from the cosmopolitan buzz of Sydney. Immediately feel right at home in this treehouse-style abode, built and designed in 2012 by the renowned Timothy Moon Architects. You’ll love every detail of this dazzling property, from the panoramic floor-to-ceiling windows to the open-plan living areas, cosy fireplaces and grand marble bathrooms.\n\nFramed by the twists and turns of the Hawkesbury River, Sweven Estate is surrounded by acres of manicured gardens, sheep-filled paddocks and a private beach. Accommodating private groups with exclusive estate access, this is a chance to get away from it all on your own secluded slice of land. There isn’t another soul in sight - aside from your onsite chef and concierge. Days stretch on blissfully with nothing more to do than relax. And when you’re ready to explore, there’s no shortage of things to do: go fruit picking, visit the resident sheep and alpacas or simply enjoy a stroll across the estate’s gorgeous gardens.\n\n**Your handpicked inclusions:**\n\n- Rise and shine with delicious daily continental breakfast prepared by a private chef\n- The services of an onsite concierge to assist with your every need\n\n**Looking for fun group activities?** Choose one of the below upgrades, all valid for up to 12 guests.\n\n**Pinot & Picasso Upgrade:** Unleash your inner Picasso with a fun painting workshop accompanied by a wine tasting to get those creative juices flowing.\n\n**Riverside Oaks Golf Upgrade:** Practise your swing with a round of golf at Riverside Oaks Golf Resort's 36-hole course, a stone’s throw from your estate.\n\n**Private Chef Dinner Upgrade:** Sit back and relax as your own private chef cooks one epic three-course dinner with delicious canapés during your stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Cattai",
    "location_subheading": "New South Wales",
    "location_description": "Sweven Estate",
    "offer_address": "177 O'Briens Rd, Cattai NSW 2756 Australia",
    "percentage_discount": 20.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 5019.0,
    "value": 6300.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004ha3JAAQ",
    "hero_image": "https://images.luxuryescapes.com/14bun0964lfhqffuq1uq",
    "image_two": "https://images.luxuryescapes.com/zxfhecm24x37y3dme24d",
    "image_three": "https://images.luxuryescapes.com/3pn4c4tskn27ldqyxi1n",
    "vendor_name": "Riverside Oaks Golf Resort",
    "title": "Tranquil Golf Resort Stay Less than One Hour From Sydney",
    "description": "There's no better way to challenge your golf skills and escape from the daily hustle and bustle than with a tranquil stay at Riverside Oaks Resort, one of Australia’s Top 100 Resort Golf Courses. Located under an hour’s drive from Sydney’s CBD, this golfing sanctuary is set on 587 acres of natural Australian bushland bordering the Hawkesbury River and enjoys the distinction of being Sydney’s only 36-hole golf resort with two championship golf courses, and the recipient of the Australian Golf Digest Editors' Choice Award for Best Golf Resort in 2021. Sporting enthusiasts can choose from the Bungool and Gangurru Golf Courses - both have proudly hosted national tournaments such as the PGA Championships, NSW Amateur and Australian Teams championships.\n\nTee up and enjoy access to both courses, spot unique native wildlife alongside the green for a quintessentially Australian experience, dine at the Brassiere Restaurant and before you know it, you’ll fall right into the swing of things.\n\n**Your handpicked inclusions:**\n\n- Start your day the right way with daily hot breakfast including juice or coffee\n- Treat yourself to a delightful dining experience with a one-time A$50 credit at the Brassiere Restaurant per room\n- Celebrate your stay with a complimentary bottle of wine on arrival\n- Enjoy a delicious cheese platter served to you in your room\n- Refine your golfing skills with A$20 credit towards one game of 18 holes per person\n\n**Want to take your game to the next level?** Serious golfers can upgrade to the Stay and Play package to enjoy one complimentary game (18 holes) for two guests including the use of a motorised cart and four small buckets of driving range balls, plus receive an additional A$30 golf credit per person, per stay for a second round of golf during your stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Cattai",
    "location_subheading": "New South Wales",
    "location_description": "Riverside Oaks Golf Resort",
    "offer_address": "74 O'Briens Rd, Cattai NSW 2756 Australia",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 188.0,
    "value": 301.0
  }
]