[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aiLXJQA2",
    "hero_image": "https://images.luxuryescapes.com/lhpbf51rcrskpf54x17p",
    "image_two": "https://images.luxuryescapes.com/ad6qs9g6uraln2uawrbr",
    "image_three": "https://images.luxuryescapes.com/byv0y0w9xul9sbndbyfn",
    "vendor_name": "WelcomeHeritage Ayatana Coorg",
    "title": "Relaxing Retreat in the Rolling Hills of Coorg",
    "description": "Swap city life for the verdant hills of Coorg with a stay at the newly opened WelcomHeritage Ayatana, part of the renowned ITC hotels group. Let the morning mists and magic of the Western Ghats enchant you as you take in the birdsong and stunning river views. Included in your Escapes Club getaway is daily breakfast, one buffet dinner for two, one 45-minute massage each and an INR1,000 dining credit to use towards lunch or dinner. \nPlus, one child aged 11 years and under stays free with breakfast included when sharing existing bedding.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Kodagu",
    "location_heading": "Karnataka",
    "location_subheading": "India",
    "location_description": "WelcomHeritage Ayatana Coorg - 2019",
    "offer_address": "Kumaralli, Karnataka 573123, India",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 280.0,
    "value": 474.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000crENSQA2",
    "hero_image": "https://images.luxuryescapes.com/dsx4ymmg8oqtsa6005wh",
    "image_two": "https://images.luxuryescapes.com/e2mih5uwdk89k4pitn",
    "image_three": "https://images.luxuryescapes.com/jk61xmxw8x7fjt9qvx3d",
    "vendor_name": "Siri Nature Roost",
    "title": "Serene Hill Station Retreat in Chikmagalur with Daily Dining",
    "description": "Experience ultimate serenity at Siri Nature Roost, a luxury resort in the heart of Chikmagalur. Bask in the natural beauty of the area’s many coffee plantations that stretch out as far as the eye can see, and relish the majestic sight of the numerous temples around the area, which draw in devotees from across the country.\n\nEnjoy daily breakfast and dinner for two adults and one 30-minute head or foot massage each per stay.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Chikkamagaluru",
    "location_heading": "Karnataka",
    "location_subheading": "India",
    "location_description": "Siri Nature Roost OLD",
    "offer_address": "SH 57, Allampura, Karnataka 577101, India",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 215.0,
    "value": 438.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ExCc6AAF",
    "hero_image": "https://images.luxuryescapes.com/yrbzkb3gd9rqxtue3mdu",
    "image_two": "https://images.luxuryescapes.com/8kt78s7jimatpjhbxxwo",
    "image_three": "https://images.luxuryescapes.com/oy8qa4078ps4p0afjj9",
    "vendor_name": "The Estate Club Nandi Hills",
    "title": "Luxe Nandi Hills Retreat with Daily Breakfast, Daily Lunch/Dinner & Trek",
    "description": "Escape Bengaluru's crowds at the chic The Estate Club Nandi Hills, a luxe paradise cradled in nature’s lap, merely a 30-minute drive from Kempegowda International Airport Bengaluru (BLR). The property's distinctive, nature-inspired design immediately dazzles visitors as it is situated within 60 acres of expansive and luxuriant greenery. The club's calm location adjacent to Bengaluru's beloved sunrise site, Nandi Hills, makes it a ready favourite among visitors. It's ideal for those longing for a break from the bustle of the city. Immerse yourself in the seclusion and elegance of your escape as you indulge in Indian and international cuisine, cool down in the stunning pool, unwind with massages, or gather with friends around a bonfire in the evening.\n\nIf you're searching for adventure, take a 20-minute journey to the gorgeous Nandi Hills, a paradise for nature enthusiasts, and go on an energising trek through the hills. For a vineyard tour and some wine tasting, head to the well-known Grover Zampa Vineyards (a 20-minute drive). Make your escape memorable by relaxing at your own pace in the opulent resort, which perfectly balances elegance and serenity.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Chikkaballapur",
    "location_heading": "Karnataka",
    "location_subheading": "India",
    "location_description": "The Estate Club Nandi Hills",
    "offer_address": "The Estates, Madakuhosahalli Nandi Hills, Karnataka - 561205 India",
    "percentage_discount": 23.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 443.0,
    "value": 572.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlG6AAK",
    "hero_image": "https://images.luxuryescapes.com/4i2eb0e7r94g304uuw",
    "image_two": "https://images.luxuryescapes.com/uwm0toc3q8aa6mcle248",
    "image_three": "https://images.luxuryescapes.com/7v7myefdj7xoadsycuz",
    "vendor_name": "WelcomeHeritage Ayatana Coorg",
    "title": "Relaxing Retreat in the Rolling Hills of Coorg",
    "description": "Swap city life for the verdant hills of Coorg with a stay at WelcomHeritage Ayatana Coorg, part of the renowned ITC hotels group. Let the morning mists and magic of the Western Ghats enchant you as you take in the birdsong and stunning river views. Included in your Luxury Escape is daily breakfast, one three-course dinner for two per stay, one 45-minute massage per person, per stay and one daily cocktail per person.\n\nPlus, one child aged nine years and under stays free with breakfast included (when sharing existing bedding).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Somvarpet",
    "location_heading": "Karnataka",
    "location_subheading": "India",
    "location_description": "WelcomHeritage Ayatana Coorg 2020",
    "offer_address": "Kumarahalli, Karnataka 573123, India",
    "percentage_discount": 68.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 296.0,
    "value": 921.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbtUcAAJ",
    "hero_image": "https://images.luxuryescapes.com/xyb92200gzirfsaxoixp",
    "image_two": "https://images.luxuryescapes.com/szs6mjh1brpxtwoh5rb3",
    "image_three": "https://images.luxuryescapes.com/2wettg7oa38mqsvbn18",
    "vendor_name": "Niraamaya Private Residences Blue Mountain",
    "title": "Charming Chikmagalur 6-Person Villa Escape with Daily Breakfast, Daily Lunch/Dinner & a Coffee Plantation Tour",
    "description": "Cradled in the lap of a sprawling 2,000-acre coffee plantation in Chikmagalur, Niraamaya Blue Mountain Luxury Homestay Chikmagalur lies tucked in the misty slopes of the Western Ghats of Karnataka. Easily accessible by both Mangaluru International Airport (IXE) and Bengaluru, this luxe colonial bungalow was once owned by British planters. Evoking a vintage charm with its intricate wooden architecture and offering a vibrant canopy of tropical trees, this gorgeous estate villa features three plush bedrooms, three bathrooms, a living plus dining area plus 360-degree views of the mountains. Ideal for a grand escape with family or friends, bask in the serenity of uninterrupted privacy as you get to call the entire bungalow your home.\n\nAway from the hue and cry of the city, the colonial bungalow lies close to popular local tourist attractions like Bhadra Wildlife Sanctuary (an hour's drive) and Mullayanagiri Peak (a 1.5-hour drive). While at the property, be greeted by the sight of cascading waterfalls, embark on adventurous hikes or wander off on a spice and coffee trail - the options are aplenty and designed to help you relax and feel refreshed.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Tarikere",
    "location_heading": "Karnataka",
    "location_subheading": "India",
    "location_description": "Niraamaya Blue Mountain Luxury Homestay Chikmagalur",
    "offer_address": "Blue Mountain Estate (East) Tarikere Taluk, Chikkamagaluru District Santaveri Post, Karnataka 577 137 India",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 565.0,
    "value": 1081.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EyWhWAAV",
    "hero_image": "https://images.luxuryescapes.com/7cia6o622rzkx9wqvx7",
    "image_two": "https://images.luxuryescapes.com/c4wl3tnineuiby2ifx04",
    "image_three": "https://images.luxuryescapes.com/glviegjp9z44ovvavss",
    "vendor_name": "Radisson Blu Hotel, Atria Bengaluru",
    "title": "Luxe Stay in the Heart of Bengaluru with Daily Breakfast, One Lunch/Dinner & Drinks",
    "description": "Immerse yourself in the epitome of five-star luxury at Radisson Atria Bengaluru, an opulent sanctuary nestled in the heart of the vibrant Garden City. Just an hour from Kempegowda International Airport, this sumptuous retreat offers a blend of chic elegance and world-class amenities, promising an unforgettable city escape. Indulge in the lavish breakfast spread, tantalise your palate with diverse culinary delights, sip on exquisite cocktails, and surrender to tranquillity in the serene outdoor pool or the indulgent spa. From the verdant Cubbon Park to the architectural splendour of Tipu Sultan's Summer Palace and the gastronomic wonders of VV Puram Food Street, Radisson Atria Bengaluru is your golden ticket to the rich cultural mosaic of Bengaluru.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Bengaluru",
    "location_heading": "Karnataka",
    "location_subheading": "India",
    "location_description": "Radisson Atria Bengaluru",
    "offer_address": "1 Palace Road Bengaluru Karnataka 560001 India",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 170.0,
    "value": 253.0
  }
]