[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FMkhuYAD",
    "hero_image": "https://images.luxuryescapes.com/xb3a6p9n83oqkhon8xxq",
    "image_two": "https://images.luxuryescapes.com/rkofyrii947n8udpfbx",
    "image_three": "https://images.luxuryescapes.com/rhn9he2679zpb4psrsi",
    "vendor_name": "RACV Cape Schanck Resort",
    "title": "Award-Winning Mornington Peninsula Coastal Haven with Daily Breakfast, Drinks & A$100 Dining Credit",
    "description": "From championship golf to acclaimed fine dining, this five-star resort offers unparalleled experiences on the southernmost tip of one of Victoria’s most spectacular headlands. Ease into the rhythm of relaxation, moving effortlessly from the indoor pool to the tennis courts before venturing into the rugged beauty of the Mornington Peninsula, where top-tier wineries, bushwalks and hot springs await.\n\nWith A$100 drinks and dining credit included, you’ll be perfectly placed to sample your way across the resort’s multiple acclaimed dining venues. Don’t miss an evening of fine dining at Cape Restaurant, an AGFG Chef Hat winner, serving an innovative French-inspired tasting menu in an ambient, open-kitchen setting.\n\nCouples who golf together will adore RACV Cape Schanck Resort’s championship 18-hole golf course, defined by bush-lined fairways and sweeping views over the shimmering Bass Strait. Head to One Spa for treatments designed to set your worries adrift, or spend your days exploring the Mornington Peninsula’s picture-perfect towns, coves and beaches.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Cape Schanck",
    "location_subheading": "Victoria",
    "location_description": "RACV Cape Schanck Resort",
    "offer_address": "Trent Jones Drive, Cape Schanck, Victoria 3939, Australia",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 349.0,
    "value": 632.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbEldAAF",
    "hero_image": "https://images.luxuryescapes.com/rvrp4stnddprxop9og5s",
    "image_two": "https://images.luxuryescapes.com/gsdigekvkqofbmtx6n",
    "image_three": "https://images.luxuryescapes.com/wdsgi9qcql61132mf76g",
    "vendor_name": "RACV Cape Schanck Resort",
    "title": "Five-Star Mornington Peninsula Coastal Escape with Daily Breakfast, A$100 Dining Credit & Award-Winning Restaurant",
    "description": "From championship golf to acclaimed gourmet dining, RACV Cape Schanck Resort delivers extraordinary experiences on the southernmost tip of one of Victoria’s most spectacular headlands. Meticulously designed to provide a calming retreat among the Mornington Peninsula’s soul-stirringly rugged wilderness, there’s no better gateway to the region’s wineries, bushwalks and hot springs than RACV. With A$100 drinks and dining credit included, you’ll be perfectly placed to sample your way across the resort’s multiple acclaimed dining venues. Don’t miss an evening at Cape (awarded one Australian Good Food Guide Chef’s Hat in 2023), offering a French-inspired, artfully pared-back tasting menu that ranges from the sensational to the sublime.\n\nCouples who golf together will adore RACV Cape Schanck Resort’s championship 18-hole golf course which is defined by bushlined fairways and sweeping views over the shimmering Bass Strait. Alternatively, head to One Spa for quiet moments of absolute calm and treatments designed to set your worries adrift, or spend your days exploring the Mornington Peninsula's dazzling spread of picture-perfect towns, coves and beaches.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Cape Schanck",
    "location_subheading": "Victoria",
    "location_description": "RACV Cape Schanck Resort",
    "offer_address": "Trent Jones Drive, Cape Schanck, Victoria 3939, Australia",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 340.0,
    "value": 722.0
  }
]