[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gvp4KAAR",
    "hero_image": "https://images.luxuryescapes.com/qou8ug5cre0wsik53d47",
    "image_two": "https://images.luxuryescapes.com/9eqmnq01sc1kma4texu",
    "image_three": "https://images.luxuryescapes.com/k9ir4jz01vlvvkmy471g",
    "vendor_name": "Moonfleet Manor Hotel",
    "title": "Charming Dorset Georgian Manor Escape along Jurassic Coast with Daily Breakfast & Tranquil Spa",
    "description": "Step back in time and discover the timeless charm of England's UNESCO World Heritage-listed Jurassic Coast with a stay at Moonfleet Manor. The generously restored Georgian homestead overlooking shingled Chesil Beach in Dorset offers a blend of old-world elegance and modern comfort. Relish refined dishes at the onsite restaurant, find refreshment at the indoor pool and day spa or just sit back and soak up jaw-dropping vistas over the English Channel.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Weymouth",
    "location_heading": "Dorset",
    "location_subheading": "United Kingdom",
    "location_description": "Moonfleet Manor",
    "offer_address": "Fleet Road, Weymouth DT3 4ED, United Kingdom",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 185.0,
    "value": 185.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I9GcAAK",
    "hero_image": "https://images.luxuryescapes.com/0fhjk590tgt6pwsmpu0l",
    "image_two": "https://images.luxuryescapes.com/hfib0klzv5us2a9p6m2",
    "image_three": "https://images.luxuryescapes.com/ipd6quhgaxjhe0ir95c",
    "vendor_name": "Summer Lodge Country House Hotel & Restaurant",
    "title": "Quintessential English Countryside Luxury in Thomas Hardy's Dorset",
    "description": "Immerse yourself in the quintessential English countryside experience with a stay at the five-star Summer Lodge Country House Hotel & Restaurant in West Dorset, part of the prestigious Relais & Châteaux collection. This luxury hotel is nestled in the heart of Thomas Hardy country in the charming village of Evershot, which was famously featured in the English literary masterpiece, Tess of the d'Urbervilles.\n\nHere, centuries-old stone cottages, working log fireplaces, enchanting gardens and antiques come together to create the ultimate countryside escape, discreetly balanced with modern amenities like an air-conditioned gym and in-room flat-screen televisions. Be sure to sit down for an incredible meal at the farm-to-table restaurant, paired with the perfect wine as recommended by an award-winning sommelier. For an extra dose of relaxation, book in time to unwind at the day spa, take a dip in the bubbling jacuzzi and enjoy a steam in the sauna, or indulge in a friendly round of tennis on the onsite court. Come evening, head across the village to The Acorn, a 16th-century coaching inn that will welcome you with real ales and a skittle alley.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Dorchester",
    "location_heading": "Dorset",
    "location_subheading": "United Kingdom",
    "location_description": "Summer Lodge Country House Hotel & Restaurant",
    "offer_address": "9 Fore St, Evershot, Dorchester DT2 0JR, United Kingdom",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 276.0,
    "value": 276.0
  }
]