[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007odDnAAI",
    "hero_image": "https://images.luxuryescapes.com/k9m5amdb1ua2mh7sq8s",
    "image_two": "https://images.luxuryescapes.com/bsfm5kuzi9n8831eib8",
    "image_three": "https://images.luxuryescapes.com/5k10tfedwt3v2zkjc2pu",
    "vendor_name": "OBLU XPERIENCE Ailafushi",
    "title": "Grand Opening: All-Inclusive Maldives Escape on Secluded Ailafushi Island with All Meals, Daily Free-Flow Drinks & Roundtrip Malé Airport Transfers",
    "description": "Be one of the first to experience the future of laidback luxury at the brand-new, all-inclusive OBLU XPERIENCE Ailafushi, an ultra-cool escape that blends cutting-edge technology with the vibrant beach resort spirit. Only 15 minutes by boat from Malé International Airport (MLE), it’s the easiest gateway to island bliss yet, boasting perfect amenities for travellers of all types, whether they’re honeymooners, families or friends looking for their own slice of paradise.\n\nYou’ll want for nothing at OBLU XPERIENCE Ailafushi with a package that includes every breakfast, lunch and dinner at the expansive Element X restaurant, where you’ll be able to sample boundless international favourites across live cooking stations and buffet spreads. An entire island of adventure and leisure awaits - spend your days sipping cocktails and rocking out to daily live music at the super-hip X360 Bar, exploring an incredible array of watersports facilities, or taking laps of the resort’s dazzling 1000sqm infinity pool, the largest of its kind in the Maldives.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Ailafushi",
    "location_heading": "Ailafushi Island",
    "location_subheading": "Maldives",
    "location_description": "OBLU XPERIENCE Ailafushi",
    "offer_address": "Ailafushi Island, Malé Atoll, The Maldives",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 1949.0,
    "value": 3671.0
  }
]