[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvEbbAAF",
    "hero_image": "https://images.luxuryescapes.com/uagh3snlme1m9ewgc0ob",
    "image_two": "https://images.luxuryescapes.com/2i97qav95nh1whywt4zp",
    "image_three": "https://images.luxuryescapes.com/s220eqbo061rcbdvw9hl",
    "vendor_name": "Courtyard Oxford South",
    "title": "Sophisticated Retreat near Oxford with Daily Breakfast & Nightly Dinner",
    "description": "Experience the charm of the English countryside with a sophisticated escape to Oxfordshire. This elegant hotel provides modern comfort within the region's rural atmosphere, offering peace and relaxation with Oxford's many attractions at your fingertips. Beyond the dreamy spires of the university, you'll be ideally located to explore the picturesque market town of Abingdon, boasting stunning architecture, cobblestone streets and the serene beauty of the River Thames. Abingdon proudly holds the title of one of England's oldest continuously inhabited towns, adding to its age-old allure. For nature lovers, the surrounding countryside showcases rolling hills carpeted with emerald-green fields, ideal for nature walks, hikes or cycling in between exploring the charming nearby villages.\n\nFollowing a day of exploration, treat your palate at the Oxen Bar & Grill, conveniently located onsite. Equipped with a heated terrace, you can savour a cocktail in the warmth without the need to wait for summer. Delight in farm-to-plate cuisine showcasing seasonal offerings sourced locally from Oxford and the Cotswolds. When you're not out exploring or enjoying fine dining, make use of the hotel's 24-hour fitness centre before retiring to your elegant accommodations.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Abingdon",
    "location_heading": "Oxfordshire",
    "location_subheading": "UK",
    "location_description": "Courtyard by Marriott Oxford South",
    "offer_address": "6 Milton Gate, Milton, Abingdon, Oxfordshire OX14 4FP, England, UK",
    "percentage_discount": 68.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 259.0,
    "value": 801.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbOmtAAF",
    "hero_image": "https://images.luxuryescapes.com/fr4nz2zzzem1yzeuxzp",
    "image_two": "https://images.luxuryescapes.com/7yvmk43bikhtroibcilb",
    "image_three": "https://images.luxuryescapes.com/x5oic736d4qimohako",
    "vendor_name": "Courtyard Oxford South",
    "title": "Sophisticated UK Retreat 15 Minutes from Oxford with Daily Breakfast & Nightly Dinner",
    "description": "A delightful stay in the English countryside awaits at Courtyard Oxford South, located in historic Oxfordshire. This sleek hotel provides modern comfort among the region's pastoral atmosphere, offering peace and pleasantry while remaining conveniently close to Oxford's many attractions. Beyond the dreaming spires of the university, you'll be ideally placed to explore the picturesque market town of Abingdon, boasting stunning architecture, cobblestone streets, and the serene beauty of the River Thames. Abingdon proudly holds title as one of England's oldest continuously inhabited towns, adding to its age-old allure.\n\nAfter the day's adventures, indulge your taste buds at onsite Oxen Bar & Grill - with both indoor and alfresco spaces, it offers an ideal setting for dining, no matter the seaon. Lounge in the glorious summer sun while sipping a glass of wine and savouring the delicious Caesar salad. When autumn and comes and the landscape turns to radiant shades, find comfort indoors and pair a pint of cider with the delectable bao buns.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Abingdon",
    "location_heading": "Oxfordshire",
    "location_subheading": "UK",
    "location_description": "Courtyard by Marriott Oxford South",
    "offer_address": "6 Milton Gate, Milton, Abingdon, Oxfordshire OX14 4FP, England, UK",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 279.0,
    "value": 657.0
  }
]