[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R7SfJQAV",
    "hero_image": "https://images.luxuryescapes.com/aoz4ovarrtzgmks2xgsw",
    "image_two": "https://images.luxuryescapes.com/bgsbapflhizjr8cnbeny",
    "image_three": "https://images.luxuryescapes.com/damwixfw6d24eg0chndr",
    "vendor_name": "Ocean Drive Barcelona",
    "title": "Brand New Five-Star Boutique Hotel: OD Barcelona",
    "description": "Discover Eixample - regarded as one of the trendiest districts in Barcelona and home to incredible high-end shopping, art galleries and restaurants. Spend three nights at the brand-new OD Barcelona and enjoy daily buffet breakfast, a refreshing welcome drink, welcome amenity on arrival and a plate of traditional Spanish tapas to share for two. Watch the exclusive video below.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalunya",
    "offer_geo_area_level_2": "Barcelona",
    "location_heading": "Spain",
    "location_subheading": "Barcelona",
    "location_description": "OD Barcelona [215218] Hotel OD Barcelona",
    "offer_address": "Carrer d&#039;Aragó, 300, 08009 Barcelona, Spain Barcelona",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 389.0,
    "value": 1040.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GrVuAAK",
    "hero_image": "https://images.luxuryescapes.com/wwu3vki1ajqvmfk5kts",
    "image_two": "https://images.luxuryescapes.com/gcqlw2qggfcd1en8y72",
    "image_three": "https://images.luxuryescapes.com/qb67zuk174u7bxyx7bt",
    "vendor_name": "H10 villa de la reina",
    "title": "Award-Winning Boutique Luxury in the Heart of Madrid",
    "description": "Escape to the heart of Madrid with a unique stay at H10 Villa de la Reina, winner of a Tripadvisor Travellers' Choice Award 2020. This French-inspired hotel is housed in a former 20th-century bank and has been lovingly restored to become one of the city’s most majestic accommodation options. Situated on the buzzing Gran Via esplanade, it’s a short wander to some of the Spanish capital’s most iconic landmarks, including the Puerta del Sol and Prado squares and Reina Sofía museum. Explore the city’s best restaurants and bars, shop until your drop on Gran Via or spend your days getting lost within the city streets - with such a rich history, there’s something new to discover on every corner.\n\nRooms and suites at H10 Villa de la Reina are classic and contemporary, with original features sitting alongside all the mod-cons required for a relaxing stay. Start the day at Las Infantas Restaurant, where a huge selection of breakfast dishes is served (or choose the continental option for early risers instead). After a day exploring Madrid’s sights, take a break at La Villa Bar, where you can unwind with a cocktail or two. You’ll find comfort in the elegant and peaceful rooms, where soundproofing and plush bedding make for a great night’s sleep.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Community of Madrid",
    "offer_geo_area_level_2": "Madrid",
    "location_heading": "Spain",
    "location_subheading": "Madrid",
    "location_description": "H10 Villa de la Reina",
    "offer_address": "Gran Vía, 22, E-28013, Madrid Centre, Madrid",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 130.0,
    "value": 130.0
  }
]