[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Isg1VYAR",
    "hero_image": "https://images.luxuryescapes.com/yst7n8knums7pqxh4tt",
    "image_two": "https://images.luxuryescapes.com/ysiqrsz1wfcgq9ldet",
    "image_three": "https://images.luxuryescapes.com/z6jmlyuirc4j79w9o74b",
    "vendor_name": "The Royal Duchy Hotel - Falmouth",
    "title": "Cornwall Heritage Escape overlooking Falmouth Bay with Daily Breakfast & Three-Course Dinner",
    "description": "Wake to sweeping bay views and the scent of salt sea breeze at this majestic retreat, situated on the Falmouth waterfront. Overlooking the historic Pendennis Castle - one of Henry VIII’s coastal fortresses - this boutique hideaway offers quintessential Cornish charm in spades. Just minutes from the town’s quaint, cobbled streets and bustling harbour, this is the perfect base for exploring Cornwall’s idyllic coastline.\n\nWith only 45 beautifully appointed rooms, you can savour quiet moments of ‘me time’ in the indoor heated pool, cedar sauna and hot ceramic beds. Gourmands are in for a treat at the hotel’s award-winning restaurant, holder of two AA rosettes. Expect traditional British cuisine elevated with contemporary flair, where each dish is crafted to order using the finest local ingredients. As the sun sets, take a seat at the Terrace Bar and sip on a mouthwatering cocktail or Cornish craft beer while watching the waves roll in.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Falmouth",
    "location_heading": "Falmouth",
    "location_subheading": "England",
    "location_description": "The Royal Duchy Hotel",
    "offer_address": "Cliff Road, Falmouth, Cornwall, England TR11 4NX, United Kingdom",
    "percentage_discount": 65.0,
    "min_duration": 2,
    "max_duration": 24,
    "price": 339.0,
    "value": 955.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FhpD7YAJ",
    "hero_image": "https://images.luxuryescapes.com/yfcr0jo0ta8tpn0lg7uo",
    "image_two": "https://images.luxuryescapes.com/3nrekpctkssuxr0mu7k",
    "image_three": "https://images.luxuryescapes.com/q3o9s9is3n7ts255js",
    "vendor_name": "The Royal Duchy Hotel - Falmouth",
    "title": "Cornwall Heritage Retreat overlooking Falmouth Bay with Daily Breakfast & Three-Course Dinner",
    "description": "Wake up to sweeping bay views and salty sea breeze at this fairytale retreat, set on the Falmouth waterfront. Overlooking the historic Pendennis Castle - one of Henry VIII’s coastal fortresses - this boutique hideaway offers quintessential Cornish charm in spades. Just minutes from the heart of Falmouth’s quaint, cobbled streets and bustling harbour, this is the perfect base for exploring Cornwall’s stunning coastline.\n\nWith only 45 beautifully appointed rooms, you can savour quiet moments of 'me time' in the indoor heated pool, cedar sauna and hot ceramic beds. Food lovers are in for a treat at the hotel’s award-winning restaurant, holder of two AA rosettes. Expect traditional British cuisine elevated with contemporary flair, where each dish is crafted to order using the finest local ingredients.\n\nAs the sun sets, grab a seat at the Terrace Bar and sip a perfectly mixed cocktail, a Cornish craft beer, or a refreshing Seedlip mocktail while watching the waves roll in.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Falmouth",
    "location_heading": "Falmouth",
    "location_subheading": "England",
    "location_description": "The Royal Duchy Hotel",
    "offer_address": "Cliff Road, Falmouth, Cornwall, England TR11 4NX, United Kingdom",
    "percentage_discount": 66.0,
    "min_duration": 2,
    "max_duration": 24,
    "price": 329.0,
    "value": 979.0
  }
]