[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JS17vAAD",
    "hero_image": "https://images.luxuryescapes.com/7np94ode9hwo5hajpes",
    "image_two": "https://images.luxuryescapes.com/3m206dnp7cb274t0sbi9",
    "image_three": "https://images.luxuryescapes.com/4wa7z844pmgilxy49bv",
    "vendor_name": "H10 Palacio Colomera",
    "title": "Córdoba Boutique Heritage Escape on Plaza de las Tendillas with Daily Breakfast",
    "description": "Originally constructed as a private residence, this recently renovated boutique hotel housed in a heritage building is a tribute to Andalusian architecture, with its ornate facade and traditional courtyard. Just steps away in Plaza de las Tendillas, the atmosphere is charged with passion and intensity. The plaza is famous for its clock that serenades with soulful chords of flamenco guitar, a dance deeply rooted in Spanish tradition.\n\nPositioned in the centre of Córdoba’s vibrant culture and history, the H10 Palacio Colomera is framed by some of the city’s best sights, including the Mosque-Cathedral of Córdoba’s old town and Roman Temple. Take in the spectacular surroundings from the rooftop bar while enjoying typical Spanish tapas with a glass of wine, or relax by the poolside with a refreshing glass of sangria and toast to your stay under the Spanish sun.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "Córdoba",
    "location_heading": "Córdoba",
    "location_subheading": "Spain",
    "location_description": "H10 Palacio Colomera",
    "offer_address": "Plaza de las Tendillas 3, Córdoba 14002, Spain",
    "percentage_discount": 73.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 299.0,
    "value": 1093.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eK5v9QAC",
    "hero_image": "https://images.luxuryescapes.com/lg7ersoo3gx1ktmd8nwi",
    "image_two": "https://images.luxuryescapes.com/67bqribd9sgo29js50ud",
    "image_three": "https://images.luxuryescapes.com/9dsvyyfx8n4t8yzpdk8q",
    "vendor_name": "H10 Palacio Colomera",
    "title": "Historic Palatial Stay with Tapas and Guided Córdoba Tour",
    "description": "Formerly an elegant palace for the Counts of Colomera, the H10 Palacio Colomera has been beautifully repurposed into an exceptional boutique hotel that is still housed in the old 1928 Casa Colomera. Set in the Plaza de las Tendillas and framed by some of the city’s best sights, including the Mosque-Cathedral of Córdoba’s Old Town and Roman Temple, revel in the palatial atmosphere and take in the spectacular surrounds from the rooftop bar where you can enjoy Spanish tapas to share with a glass of wine each. Salud to your Spanish escape with a glass of cava each and fruit or petit fours in-room upon arrival (subject to availability), plus enjoy daily buffet breakfast and a guided tour of Córdoba.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "Córdoba",
    "location_heading": "Córdoba",
    "location_subheading": "Spain",
    "location_description": "H10 Palacio Colomera",
    "offer_address": "Plaza de las Tendillas 3, Córdoba 14002, Spain",
    "percentage_discount": 37.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 371.0,
    "value": 588.0
  }
]