[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FOx38YAD",
    "hero_image": "https://images.luxuryescapes.com/4owk21qo9ldxaqe3ex",
    "image_two": "https://images.luxuryescapes.com/l07qh45akaxtk46up89",
    "image_three": "https://images.luxuryescapes.com/w14b52hdyq2vn946usb",
    "vendor_name": "Waya Island Resort",
    "title": "Fiji Adults-Only Villas on Waya Island with All-Inclusive Dining, Nightly Cocktails & Guided Tours",
    "description": "This is your invitation to discover the Fiji of your dreams. Framed by volcanic hinterland, lush jungle and the endlessly shimmering Pacific Ocean, this boutique resort is adults-only, exceptionally intimate and comes complete with all-inclusive dining.\n\nHidden on the southern tip of the idyllic Yasawa Islands, the luxurious Waya Island Resort features modern villas for the perfect honeymoon hideaway. Join the Hill Hike for stunning views, snorkel through vibrant reefs or wander golden shores. The dining is just as good: Waya Island Resort champions home-style Fijian cooking, with produce grown from island gardens or fresh from the sea.\n\nWith a couples massage included, you’ll savour an indulgent time at the resort’s newly opened Waya Indulgence Day Spa. Ready to explore? Enjoy a guided visit to the charming Yalobi Village or snorkel the vast underwater world with the assistance of the resort’s local guides.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Waya Island",
    "location_heading": "Waya Island",
    "location_subheading": "Fiji",
    "location_description": "Waya Island Resort",
    "offer_address": "Waya Island, Yasawa Islands 0000, Fiji",
    "percentage_discount": 33.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 2369.0,
    "value": 3552.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IemIrAAJ",
    "hero_image": "https://images.luxuryescapes.com/w4vy3bg8yoke5fhpn1y",
    "image_two": "https://images.luxuryescapes.com/axpo2j89je4qsbxxxrn",
    "image_three": "https://images.luxuryescapes.com/dsionmb24c8vpkoq3ke",
    "vendor_name": "Waya Island Resort",
    "title": "Fiji Brand-New Adults-Only Villas with All-Inclusive Dining, Nightly Drinks & FJ$320 Massage Credit",
    "description": "This is your invitation to discover the Fiji of your dreams: framed by volcanic hinterland, lush jungle and the endlessly shimmering Pacific Ocean, this brand-new boutique resort is adults-only, exceptionally intimate and comes complete with all-inclusive dining.\n\nHidden on the southern tip of the idyllic Yasawa Islands, Waya Island Resort features 18 modern bures and villas, each the perfect honeymoon hideaway - and the perfect place to return after days spent trekking bird-filled rainforests, snorkelling through vibrant reefs or wandering golden shores. The dining is just as good: Waya Island Resort champions home-style Fijian cooking, with produce grown from island gardens or plucked fresh from the seas.\n\nWith FJ$320 massage credit included, you’ll be set to savour time spent at Waya Island Resort’s open-air massage pavilion. Ready to explore? The island offers countless moments of discovery. Enjoy a guided visit to the charming Yalobi Village, embark on a hand-line fishing expedition - and relax as the resort’s chefs prepare your catch that very evening - or seek out vast underwater worlds with the assistance of the resort’s expert guides.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Waya Island",
    "location_heading": "Waya Island",
    "location_subheading": "Fiji",
    "location_description": "Waya Island Resort",
    "offer_address": "Waya Island, Yasawa Islands 0000, Fiji",
    "percentage_discount": 27.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 2439.0,
    "value": 3353.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EKIWzYAP",
    "hero_image": "https://images.luxuryescapes.com/f1s2h3j1vlhxjx70jtfv",
    "image_two": "https://images.luxuryescapes.com/2whwnxdyw8jcu0s815b7",
    "image_three": "https://images.luxuryescapes.com/t0o53czliegm4lf3gx6",
    "vendor_name": "Waya Island Resort",
    "title": "Fiji Waya Island Adults-Only Resort with All-Inclusive Dining",
    "description": "Discover the Fiji of your dreams: framed by volcanic hinterland, lush jungle and the endlessly shimmering Pacific Ocean, this boutique resort is an adults-only oasis in an exceptionally intimate and unspoiled sanctuary. \n\nWaya Island Resort champions home-style Fijian cooking, with produce grown from island gardens or plucked fresh from the seas. Enjoy a guided visit to the charming Yalobi Village, embark on a hand-line fishing expedition - and relax at the spa as the resort’s chefs prepare your catch that very evening - or seek out vast underwater worlds with the assistance of the resort’s expert guides.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Waya Island",
    "location_heading": "Waya Island",
    "location_subheading": "Fiji",
    "location_description": "Waya Island Resort",
    "offer_address": "Waya Island, Yasawa Islands 0000, Fiji",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 995.0,
    "value": 995.0
  }
]