[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HPl5AAG",
    "hero_image": "https://images.luxuryescapes.com/xkaiqjvc2b09q3p2uet3",
    "image_two": "https://images.luxuryescapes.com/tbnklufjmo6ml7aom0soh",
    "image_three": "https://images.luxuryescapes.com/u5msv3nnm9qb7oziym1v",
    "vendor_name": "Villa Howden",
    "title": "Tasmania French-Inspired Boutique Suites Just 20 Minutes from Hobart with Daily Breakfast",
    "description": "Whisk yourself away to the charming Villa Howden, on the breathtaking fringes of Tasmania's Huon Valley, and experience a slice of French-inspired paradise just 20 minutes from Hobart. Designed to reignite romance, Villa Howden features an intimate collection of 10 elegantly furnished suites, each opening out to private balconies and serene views. Elevate your stay with an in-room massage, plunge into the indoor swimming pool or spoil yourselves at the onsite restaurant, which showcases locally sourced Tasmanian delicacies.\n\nPerched on the tranquil shores of North West Bay and surrounded by scenic private grounds, this European-style country house is perfectly positioned for enjoying natural beauty and city sights. Within 30 minutes you could be in the depths of South West Tasmania's striking mountainscapes, shopping in Salamanca Market or pondering MONA's evocative artworks, and in less than 20 minutes, you could be on the ferry to Bruny Island, where fresh oysters and unparalleled landscapes await.\n\n**Your handpicked inclusions:**\n\n- Start each day with breakfast served in the beautiful surroundings of Bruni’s Restaurant\n- Celebrate on arrival with a refreshing glass of wine or beer at the bar\n- Indulge in a welcome basket of fresh Tasmanian produce, including cheese, biscuits, fruit and more\n- Enjoy the comforts of your room a little longer with guaranteed 11am checkout\n\n**Water Villa Upgrade:** Wake up to dazzling views when you upgrade to a Water View Villa Suite, with French doors opening onto a spacious private balcony with panoramic views over North West Bay and the villa’s manicured gardens. **Bonus:** pop a complimentary bottle of sparkling wine when you upgrade.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Hobart",
    "location_heading": "Huon Valley",
    "location_subheading": "Tasmania",
    "location_description": "Villa Howden",
    "offer_address": "77 Howden Rd, Howden, Tasmania 7054, Australia",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 287.0,
    "value": 460.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009F7jnAAC",
    "hero_image": "https://images.luxuryescapes.com/irgcc2ftwmwpdkf5vnw7",
    "image_two": "https://images.luxuryescapes.com/1ia5d5o887gdmkh3b8yo",
    "image_three": "https://images.luxuryescapes.com/2b0v4kdlujl473jq3nlj",
    "vendor_name": "Villa Howden",
    "title": "Five-Star French-Inspired Tasmania Villa Retreat Just 20 Minutes from Hobart with Daily Breakfast",
    "description": "Whisk yourself away to the five-star Villa Howden and experience a slice of boutique French-inspired paradise just 20 minutes from Hobart. Designed with pure romance in mind, this intimate collection of 10 elegantly furnished suites, each endowed with serene views, is nestled in the breathtaking fringes of the Huon Valley. Elevate your stay with an in-room massage, plunge into the indoor swimming pool or take high tea at the onsite restaurant, which showcases locally sourced Tasmanian delicacies.\n\nPerched on the tranquil shores of North West Bay and surrounded by scenic private grounds, this European-style country house is perfectly positioned for savouring the region's natural beauty. Experience some of the country's best hiking trails through South West Tasmania's striking mountainscapes, shop 'til you drop at Salamanca Market, ponder MONA's evocative collection of art or board a ferry to Bruny Island, where fresh oysters and spectacular scenery await. Wherever you land, you'll be warmly met with Tasmania's very best.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Hobart",
    "location_heading": "Huon Valley",
    "location_subheading": "Tasmania",
    "location_description": "Villa Howden",
    "offer_address": "77 Howden Rd, Howden, Tasmania 7054, Australia",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 324.0,
    "value": 483.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EWhnlAAD",
    "hero_image": "https://images.luxuryescapes.com/e0ugrqtdoksl0jveg4f",
    "image_two": "https://images.luxuryescapes.com/ft1kymb9evx8ozhbmbzx",
    "image_three": "https://images.luxuryescapes.com/pmw2ukfl5tvnt4475le",
    "vendor_name": "Villa Howden",
    "title": "French-Inspired Five-Star Tasmania Villa Retreat Just 20 Minutes from Hobart with Daily Breakfast",
    "description": "Whisk yourself away to Villa Howden and experience a five-star slice of French-inspired, boutique paradise just 20 minutes outside Hobart. Designed with romance in mind, this intimate collection of 10 elegantly furnished suites, each endowed with serene views, is nestled in the breathtaking fringes of the Huon Valley. Elevate your stay with an in-room massage, plunge into the indoor swimming pool or take high tea at the onsite restaurant, which showcases locally sourced delicacies. When you're ready to explore, Tasmania's very best awaits - hike through South West Tasmania's striking mountainscapes, shop till you drop at Salamanca Market, ponder MONA's evocative collection of art or board a ferry to Bruny Island, where fresh oysters and spectacular scenery await.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Hobart",
    "location_heading": "Huon Valley",
    "location_subheading": "Tasmania",
    "location_description": "Villa Howden",
    "offer_address": "77 Howden Rd, Howden, Tasmania 7054, Australia",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 265.0,
    "value": 449.0
  }
]