[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HtxKIAS",
    "hero_image": "https://images.luxuryescapes.com/bksageugwd0n3cjsg33v",
    "image_two": "https://images.luxuryescapes.com/bnkqd2pmhhyyr118lw39",
    "image_three": "https://images.luxuryescapes.com/o1799zx93iv6lm4v233n",
    "vendor_name": "JA Manafaru Maldives",
    "title": "Five-Star Maldives Private Island Paradise with All-Inclusive Dining, Free-Flow Drinks & Return International Flights",
    "description": "Located among lush tropical greenery on Manafaru, a secluded private island in the Haa Alifu Atoll, this luxurious five-star retreat in the Maldives' northernmost point is an ideal sanctuary for honeymooners and families alike.\n\nCombining world-class luxury with a relaxed beachside atmosphere, guests are treated to stunning vistas of the shimmering Indian Ocean from every turn. The surroundings boast porcelain-white sands, crystalline lagoons and a vibrant house reef teeming with marine life, perfect for unparalleled snorkelling and diving experiences.\n\nJA Manafaru features seven distinct dining venues offering a whirlwind culinary journey: savour Maldivian and international favourites at Kakuni, indulge in the finest seafood at Ocean Grill or enjoy Italian cuisine at Andiamo Bistro and Poolside. Notably, The Cellar stands as the Maldives' first and deepest subterranean wine cave, housing over 8,000 bottles and providing exquisite tastings and unforgettable dining encounters.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Manafaru Island",
    "location_heading": "Haa Alifu Atoll",
    "location_subheading": "Maldives",
    "location_description": "JA Manafaru",
    "offer_address": "Haa Alifu Atoll, Upper North Province, Maldives",
    "percentage_discount": 62.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 4269.0,
    "value": 11158.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DPApaAAH",
    "hero_image": "https://images.luxuryescapes.com/mmfihudbfsy8nun4ha3m",
    "image_two": "https://images.luxuryescapes.com/v47yzdswko4czbotnw0o",
    "image_three": "https://images.luxuryescapes.com/tlkwh8rfczte1xtqgpo",
    "vendor_name": "JA Manafaru Maldives",
    "title": "Maldives Five-Star Private Island Paradise with All-Inclusive Dining, Free-Flow Drinks & Roundtrip Transfers",
    "description": "You'll feel like you've stepped into a private island fantasy at the idyllic, five-star JA Manafaru, where your every desire is catered to. Nestled in dense tropical foliage on the private island of Manafaru in the Haa Alif Atoll, a blissfully secluded and pristine spot at the Maldives' northernmost point, JA Manafaru is perfect for honeymooners and families alike. Here, world-class luxury meets laidback beachside ambience - with breathtaking views of the shimmering Indian Ocean always on the horizon, it's an escape that's impossible to forget. Porcelain-white sands and crystalline lagoons are always within easy reach and the house reef is abundant with a thousand colours of marine life, making for superb snorkelling and diving. \n\nThe Calm Spa Sanctuary is an oasis of tranquillity - book a luxe treatment during your stay and allow ancient Ayurvedic therapies to rejuvenate your body and mind. If you're feeling adventurous, cycle across the island on one of several bike tracks, or enjoy a tennis match or a fun-filled round of futsal. The resort offers a culinary journey within seven unique venues, while The Cellar, the Maldives' first and deepest subterranean wine cave, houses over 8,000 bottles and offers delicious tastings and unforgettable dining experiences.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Manafaru Island",
    "location_heading": "Haa Alifu Atoll",
    "location_subheading": "Maldives",
    "location_description": "JA Manafaru",
    "offer_address": "Haa Alifu Atoll, Upper North Province, Maldives",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 4339.0,
    "value": 9316.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcbiVAAR",
    "hero_image": "https://images.luxuryescapes.com/1k7ig30x7ehzpxy7uu4s",
    "image_two": "https://images.luxuryescapes.com/lcvvtr9dzlnkfd3qkxt6",
    "image_three": "https://images.luxuryescapes.com/njbok1gshh7niyq7dz1s",
    "vendor_name": "JA Manafaru Maldives",
    "title": "Maldives Five-Star Private Island Paradise with All-Inclusive Dining, Free-Flow Drinks & Roundtrip Transfers",
    "description": "You'll feel like you've stepped into a private-island fantasy at the idyllic, five-star JA Manafaru, where your every desire is catered to. Nestled in dense tropical foliage on the private island of Manafaru in the Haa Alif Atoll, a blissfully secluded and pristine spot at the Maldives' northernmost point, JA Manafaru is perfect for honeymooners and families alike. Here, world-class luxury meets laidback beachside ambience - with breathtaking views of the shimmering Indian Ocean always on the horizon, it's an escape that's impossible to forget.\n\nPorcelain-white sands and crystalline lagoons are always within easy reach and the house reef is abundant with a thousand colours of marine life, making for superb snorkelling and diving. The Calm Spa Sanctuary is an oasis of tranquillity - book a luxe treatment during your stay and allow ancient Ayurvedic therapies to rejuvenate your body and mind. If you're feeling adventurous, cycle across the island on one of several bike tracks, or enjoy a tennis match or a fun-filled round of futsal. The resort offers a culinary journey within seven unique venues, while The Cellar, the Maldives' first and deepest subterranean wine cave, houses over 8,000 bottles and offers delicious tastings and unforgettable dining experiences.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Manafaru Island",
    "location_heading": "Haa Alifu Atoll",
    "location_subheading": "Maldives",
    "location_description": "JA Manafaru",
    "offer_address": "Haa Alifu Atoll, Upper North Province, Maldives",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 15,
    "price": 4689.0,
    "value": 9648.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JS48DAAT",
    "hero_image": "https://images.luxuryescapes.com/jiyjsiv4bh2o6x6xmx2j",
    "image_two": "https://images.luxuryescapes.com/99ydih2069xf61ya59",
    "image_three": "https://images.luxuryescapes.com/rwfrpl9e2mzqbf4acqdo",
    "vendor_name": "JA Manafaru Maldives",
    "title": "Five-Star Maldives Private Island Paradise with All-Inclusive Dining, Free-Flow Drinks & Roundtrip Transfers",
    "description": "Step into a private island fantasy at this idyllic five-star hideaway, where your every desire is catered to. Nestled in dense tropical foliage on the private island of Manafaru in the Haa Alifu Atoll, a blissfully secluded and pristine spot at the Maldives' northernmost point, JA Manafaru is perfect for honeymooners and families alike.\n\nHere, world-class luxury meets laidback beachside ambience - with breathtaking views of the shimmering Indian Ocean always on the horizon, it's an escape that's impossible to forget. Porcelain-white sands and crystalline lagoons are always within easy reach and the house reef is abundant with a thousand colours of marine life, making for superb snorkelling and diving.\n\nThe resort offers a culinary journey within seven unique venues - indulge in Maldivian and international favourites at Kakuni, feast upon the archipelago's finest at Ocean Grill or enjoy Italian delights at Andiamo Bistro & Pool. The resort is also home to The Cellar, the Maldives' first and deepest subterranean wine cave, housing over 8,000 bottles and offers delicious tastings and unforgettable dining experiences.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Manafaru Island",
    "location_heading": "Haa Alifu Atoll",
    "location_subheading": "Maldives",
    "location_description": "JA Manafaru",
    "offer_address": "Haa Alifu Atoll, Upper North Province, Maldives",
    "percentage_discount": 65.0,
    "min_duration": 5,
    "max_duration": 16,
    "price": 4269.0,
    "value": 12145.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ERvN7YAL",
    "hero_image": "https://images.luxuryescapes.com/94f5kf2zp80auqmzvkh",
    "image_two": "https://images.luxuryescapes.com/9rtf310mb834vhr780xi",
    "image_three": "https://images.luxuryescapes.com/flns5k3mnj2uz1yhw2ud",
    "vendor_name": "JA Manafaru Maldives",
    "title": "Maldives Private Island Paradise with All-Inclusive Dining, Free-Flow Drinks & Roundtrip Transfers",
    "description": "Step into a private island fantasy at this idyllic five-star hideaway, where your every desire is catered to. Nestled in dense tropical foliage on the private island of Manafaru in the Haa Alifu Atoll, a blissfully secluded and pristine spot at the Maldives' northernmost point, JA Manafaru is perfect for honeymooners and families alike.\n\nHere, world-class luxury meets laidback beachside ambience - with breathtaking views of the shimmering Indian Ocean always on the horizon, it's an escape that's impossible to forget. Porcelain-white sands and crystalline lagoons are always within easy reach and the house reef is abundant with every colour of marine life, making for superb snorkelling and diving.\n\nThe resort offers a culinary journey with seven unique venues - indulge in Maldivian and international favourites at Kakuni, feast upon the archipelago's finest at Ocean Grill, or enjoy Italian delights at Andiamo Bistro and Pool. The resort is also home to The Cellar, the Maldives' first and deepest subterranean wine cave, which houses over 8,000 bottles and offers delicious tastings and unforgettable dining experiences.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Manafaru Island",
    "location_heading": "Haa Alifu Atoll",
    "location_subheading": "Maldives",
    "location_description": "JA Manafaru",
    "offer_address": "Haa Alifu Atoll, Upper North Province, Maldives",
    "percentage_discount": 51.0,
    "min_duration": null,
    "max_duration": null,
    "price": 10331.0,
    "value": 21103.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000717yoAAA",
    "hero_image": "https://images.luxuryescapes.com/hc6n87plv62bfd3xjr7jf",
    "image_two": "https://images.luxuryescapes.com/kteyxaatp9vacapa3j9v",
    "image_three": "https://images.luxuryescapes.com/n93ux5h754mfdk311h7d",
    "vendor_name": "JA Manafaru Maldives",
    "title": "Ultimate Maldives Two-Bedroom Overwater Paradise with All-Inclusive Dining, Free-Flow Drinks & Roundtrip Flights from Malé",
    "description": "Step into paradise at the idyllic JA Manafaru, where tropical island bliss and an incredible all-inclusive concept come together to form the Maldives escape you’ve been dreaming of. Ranked within the top 10% of properties on Tripadvisor, the five-star resort is a haven of world-class luxury with a relaxed, beachside ambience.\n\nNestled on the private island of Manafaru in the Haa Alif Atoll - a blissfully secluded and pristine spot at the northernmost point of the Maldives - JA Manafaru is perfect for honeymooners and families alike. The powdery white sand and crystalline lagoon are always within easy reach and the house reef is abundant with colourful marine life, making for excellent snorkelling and diving. The Calm Spa Sanctuary is an oasis of tranquility - book a luxe treatment during your stay and allow the centuries-old Ayurvedic therapies to restore body and mind. When you’re feeling active, cycle across the island on one of several bike tracks, enjoy a tennis match on the court or a fun-filled round of futsal. Throughout it all, seven exceptional onsite restaurants provide bespoke à la carte dining experiences, while The Cellar, the Maldives' first and deepest subterranean wine cave, houses more than 8,000 bottles of wine and offers up delicious wine tastings.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Manafaru Island",
    "location_heading": "Haa Alifu Atoll",
    "location_subheading": "Maldives",
    "location_description": "JA Manafaru",
    "offer_address": "Haa Alifu Atoll, Upper North Province, Maldives",
    "percentage_discount": 24.0,
    "min_duration": 5,
    "max_duration": 15,
    "price": 31699.0,
    "value": 41544.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JzfiAAC",
    "hero_image": "https://images.luxuryescapes.com/bqctpydaozqxgo0e7lb",
    "image_two": "https://images.luxuryescapes.com/oylxo03zmnfwvzg9gb6",
    "image_three": "https://images.luxuryescapes.com/lkya7qvh5irabutqy8ds",
    "vendor_name": "JA Manafaru Maldives",
    "title": "Maldives Five-Star Private Island Paradise with All-Inclusive Dining, Free-Flow Drinks & Roundtrip Transfers",
    "description": "Step into paradise at the idyllic JA Manafaru, where tropical island bliss and an incredible all-inclusive concept come together to form the escape you’ve been dreaming of. Originally built as a Waldorf Astoria property, this star-studded resort has seen the likes of celebrities like rockstar Noel Gallagher, footballer Luís Figo and Bollywood actress Dia Mirza retreat to this haven of world-class luxury and relaxed beachside ambience. Nestled on the private island of Manafaru in the Haa Alif Atoll - a blissfully secluded and pristine spot at the northernmost point of the Maldives - JA Manafaru is perfect for honeymooners and families alike.\n\nThe powdery white sand and crystalline lagoon are always within easy reach and the house reef is abundant with colourful marine life, making for excellent snorkelling and diving. The Calm Spa Sanctuary is an oasis of tranquility - book a luxe treatment during your stay and allow the centuries-old Ayurvedic therapies to restore body and mind. When you’re feeling active, cycle across the island on one of several bike tracks, enjoy a tennis match on the court or a fun-filled round of futsal. Throughout it all, seven exceptional onsite restaurants provide bespoke à la carte dining experiences, while The Cellar, the Maldives' first and deepest subterranean wine cave, which houses over 8,000 bottles of wine and offers up delicious wine tastings and perfectly paired meals.\n\n**Your handpicked inclusions:**\n\n- Celebrate your escape with a welcome bottle of house sparkling and sweet homemade macaroons\n- Wake up to daily breakfast at Kakuni restaurant\n- Indulge with daily three-course à la carte lunch at Kakuni or Andiamo Bistro and Pool\n- Keep the decadence going with daily afternoon tea at White Orchid Lounge\n- Catch the sunset with nightly sundowners and canapés at White Orchid Lounge\n- Round off each day with nightly three-course à la carte dinner at Kakuni, White Orchid Lounge, Andiamo Bistro and Pool or Ocean Grill\n- Free-flow drinks between 11am and 11pm, including beer, spirits, new and old-world wines, fruit juices, soft drinks, JA-branded still water, house cocktails and mocktails\n- Enjoy the use of a personal villa bar, replenished once daily with wine, beer, soft drinks and snacks\n- Roundtrip transfers: complimentary domestic flights between the resort and Malé\n\n**Overwater villa upgrades available**: The quintessential Maldives experience awaits when you upgrade to a Sunrise or Sunset Overwater Villa, suspended above the crystal-clear ocean.\n\n**Travelling with family?** One child (11 and under) stays free with all meals or upgrade to the Deluxe Beach Family Villa and two children (11 and under) stay free with all meals.\n\n**Getting here** **is easy:** connecting flights depart regularly from Dubai, Doha and Singapore, with direct flights available from London, New Delhi, Singapore and more. The Maldives is currently open to visitors, and a negative PCR test is required on arrival (current as of 29/11/2021). [See here](https://www.skyscanner.com/travel-restrictions) for the most up-to-date information on entry requirements.  \n\n**Book with 100% Confidence:** Right up until 15 days before check-in you can enjoy unlimited, free date changes, or cancel and get a 100% credit to use at Luxury Escapes for any other Limited Time Lux Exclusive accommodation, tour or cruise offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Manafaru Island",
    "location_heading": "Haa Alifu Atoll",
    "location_subheading": "Maldives",
    "location_description": "JA Manafaru",
    "offer_address": "Haa Alifu Atoll, Upper North Province, Maldives",
    "percentage_discount": 68.0,
    "min_duration": 5,
    "max_duration": 30,
    "price": 4409.0,
    "value": 13761.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070SNYAA2",
    "hero_image": "https://images.luxuryescapes.com/590actfi9yrc2b3nls7",
    "image_two": "https://images.luxuryescapes.com/lkoaj3k79ry0cll1yuun",
    "image_three": "https://images.luxuryescapes.com/ongngyllk7l8jb1t0ug",
    "vendor_name": "JA Manafaru Maldives",
    "title": "Maldives Five-Star Private Island Paradise with All-Inclusive Dining, Free-Flow Drinks & Roundtrip Transfers",
    "description": "Step into paradise at the idyllic JA Manafaru, where tropical island bliss and an incredible all-inclusive concept come together to form the Maldives escape you’ve been dreaming of. This star-studded resort has seen the likes of rockstar Noel Gallagher, footballer Luís Figo and Bollywood actress Dia Mirza retreat to its haven of world-class luxury and relaxed beachside ambience. Nestled on the private island of Manafaru in the Haa Alif Atoll - a blissfully secluded and pristine spot at the northernmost point of the Maldives - JA Manafaru is perfect for honeymooners and families alike.\n\nThe powdery white sand and crystalline lagoon are always within easy reach and the house reef is abundant with colourful marine life, making for excellent snorkelling and diving. The Calm Spa Sanctuary is an oasis of tranquility - book a luxe treatment during your stay and allow the centuries-old Ayurvedic therapies to restore body and mind. When you’re feeling active, cycle across the island on one of several bike tracks, enjoy a tennis match on the court or a fun-filled round of futsal. Throughout it all, seven exceptional onsite restaurants provide bespoke à la carte dining experiences, while The Cellar, the Maldives' first and deepest subterranean wine cave, houses over 8,000 bottles of wine and offers up delicious wine tastings and perfectly paired meals.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Haa Alifu Atoll",
    "offer_geo_area_level_2": "Manafaru Island",
    "location_heading": "Haa Alifu Atoll",
    "location_subheading": "Maldives",
    "location_description": "JA Manafaru",
    "offer_address": "Haa Alifu Atoll, Upper North Province, Maldives",
    "percentage_discount": 32.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 4699.0,
    "value": 6904.0
  }
]