[
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GLLiAAO",
    "hero_image": "https://images.luxuryescapes.com/ot5hmc71cczfumzoyha",
    "image_two": "https://images.luxuryescapes.com/e0l5ndsxg6pgjfzacpkm",
    "image_three": "https://images.luxuryescapes.com/6fbfrtfajwu5qgdumr4",
    "vendor_name": "Half Moon Jamaica",
    "title": "Jamaica Five-Star Oceanfront Luxury with Private Beach in Picture-Perfect Montego Bay",
    "description": "Relax into the tranquil rhythm of Jamaica’s Montego Bay with a serene escape at Half Moon, where old-school elegance perfectly fuses with modern five-star luxury. Step into the sweeping open-air lobby, catch a glimpse of the glimmering Caribbean Sea and feel the powdery sand beneath your feet at the private beach, before exploring some of Jamaica’s best dining at the onsite restaurants. From Jamaican cuisine with a twist at signature restaurant The Sugar Mill to award-winning seafood at Delmare and relaxed beach bbqs: every meal is sure to delight. Set on 400 acres of impeccably manicured grounds, Half Moon is also home to the zen-inducing Fern Tree Spa, an equestrian centre that lets guests swim with horses, a state-of-the-art gym, and an 18-hole golf course.\n\nStay in the resort's Founders Cove precinct, home to just 10 exclusive rooms and suites. Historically a playground for the world’s elite, Founders Cove was established in 1954 and quickly became the “it” place for white-glove service, palatial amenities and a sun-drenched subtropical setting",
    "offer_country_name": "Jamaica",
    "offer_country_code_alpha_2": "JM",
    "offer_geo_area_level_1": "St. James Parish",
    "offer_geo_area_level_2": "Montego Bay",
    "location_heading": "Montego Bay",
    "location_subheading": "Jamaica",
    "location_description": "Half Moon Jamaica",
    "offer_address": "Rose Hall St James Jamaica WI, Montego Bay, Jamaica",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 527.0,
    "value": 527.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AbNO4AAN",
    "hero_image": "https://images.luxuryescapes.com/xvi7hy2e6jx9t9gv26fp",
    "image_two": "https://images.luxuryescapes.com/nepfuu91xlfdizr7i4wm",
    "image_three": "https://images.luxuryescapes.com/ux17edgsoptjk97gzich",
    "vendor_name": "Round Hill Hotel and Villas",
    "title": "Top-Rated Five-Star Jamaica Island Villa Retreat on Montego Bay",
    "description": "Savour the soul of the Caribbean and sink into incomparable island luxury with an exclusive five-star stay at the acclaimed Round Hill Hotel and Villas. Surrounded by 100 acres of lush hinterland and surrounded by pristine natural beaches, this heritage mansion showcases Ralph Lauren design, elevated by a suite of personal touches for an unforgettable stay. Awake each morning to spectacular views of Montego Bay's emerald waters and be wined and dined as you're treated to smoky, sumptuous and unmistakenly Jamaican plates backed by world-class culinary brilliance at The Grille or enjoy tropical sips and soft piano melodies at the Cocktail Bar.",
    "offer_country_name": "Jamaica",
    "offer_country_code_alpha_2": "JM",
    "offer_geo_area_level_1": "Hanover",
    "offer_geo_area_level_2": "Montego Bay",
    "location_heading": "Montego Bay",
    "location_subheading": "Jamaica",
    "location_description": "Round Hill Hotel and Villas",
    "offer_address": "John Pringle Drive, Montego Bay, Jamaica",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 638.0,
    "value": 638.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004U8pdAAC",
    "hero_image": "https://images.luxuryescapes.com/yhgwes4vispotsekgaj",
    "image_two": "https://images.luxuryescapes.com/um6a8qggedlazvj1clm",
    "image_three": "https://images.luxuryescapes.com/ejkvpn7pvioj4h9zy4w",
    "vendor_name": "S Hotel Jamaica",
    "title": "Oceanfront Jamaica Luxury in Picture-Perfect Montego Bay with Exclusive Sky Deck",
    "description": "Transport yourself to a world of Caribbean oceanfront bliss with a stay at S Hotel Montego Bay - a Small Luxury Hotels of the World hotel and ranked within the top 1% of the world on Tripadvisor. Tucked away on a private section of Doctor’s Cave Beach in Montego Bay, on the iconic Hip Strip, you have access to some of Jamaica’s finest coastal views.\n\nInside, the ocean-view rooms perfectly frame a dazzling landscape of swaying palms, while the top-floor lounge creates the ideal haven for you to bask in the peaceful atmosphere. The Sky Deck awaits with an ocean-view infinity pool and bar. Sun yourself on the beach in a section reserved just for guests or dine at the onsite restaurants and bars from international cuisine at Rocksteady to traditional Jamaican at Roots Rock or grab some snacks at the Vibes Bar & Grill. \n\nTreat yourself at Irie Spa and Baths which offers ancient bath therapies and relaxing treatments or work up a sweat at the fitness centre or cool off the main pool dotted with palm trees and signature red loungers.",
    "offer_country_name": "Jamaica",
    "offer_country_code_alpha_2": "JM",
    "offer_geo_area_level_1": "Saint James",
    "offer_geo_area_level_2": "Montego Bay",
    "location_heading": "Montego Bay",
    "location_subheading": "Jamaica",
    "location_description": "S Hotel Montego Bay",
    "offer_address": "7 Jimmy Cliff Boulevard, Montego Bay, Jamaica",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 313.0,
    "value": 313.0
  }
]