[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BelMiAAJ",
    "hero_image": "https://images.luxuryescapes.com/m9wobdkjmrz3jk440q",
    "image_two": "https://images.luxuryescapes.com/n0054omjir0w18hk8le5",
    "image_three": "https://images.luxuryescapes.com/ypn5rq4179yx1uhxi44p",
    "vendor_name": "Trinity Beach Palace",
    "title": "Private Cairns Estate for up to 10 Guests with Direct Beachfront Access",
    "description": "Surrounded by verdant greenery and boasting a secluded beachfront location, the stunning Trinity Beach Palace is a regal private house easily accommodating up to 10 guests in absolute comfort. Admire the aesthetic yet functional interior design of this unique residence, featuring a putting green, open-air lounge and dining areas, a fully-equipped gourmet kitchen doubling as the central hub of the property, and five luxurious suites all creatively designed with individual themes. Indulge in direct access to a secluded stretch of Trinity Beach, perfect for glamorous beach parties or a relaxed barbeque by the spectacular Coral Sea, or take it easy in the three outdoor bar areas providing an ideal setting for sunset cocktails.\n\nVenture out of your private hideaway, found just a 25-minute drive from the centre of Cairns, to explore the regional attractions and the range of enjoyable beachfront restaurants and bars close by. Of course, any visit to Cairns isn't complete with witnessing the majesty of the iconic Great Barrier Reef. After you've had your fill of exploring beneath the water, marvel at the world’s oldest tropical rainforest, Daintree National Park, with a spectacular rugged landscape like no other - located just an hour's drive from the property.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Cairns",
    "location_heading": "Trinity Beach",
    "location_subheading": "Queensland",
    "location_description": "Trinity Beach Palace",
    "offer_address": "129 Vasey Esplanade, Trinity Beach, Queensland 4879, Australia",
    "percentage_discount": 34.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 6899.0,
    "value": 10516.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fdap5AAB",
    "hero_image": "https://images.luxuryescapes.com/z9raxujr1le3ng2ogid",
    "image_two": "https://images.luxuryescapes.com/i4nf6u57k47z9yf80aj",
    "image_three": "https://images.luxuryescapes.com/9ml7dawifex184i1o36",
    "vendor_name": "Trinity Beach Palace",
    "title": "Exclusive Cairns Luxury Estate for 10 Guests with Direct Beachfront Access & Private Airport Transfers",
    "description": "Surrounded by verdant greenery and boasting a secluded beachfront location, the stunning Trinity Beach Palace is a regal private house easily accommodating up to 10 guests in absolute comfort. Admire the aesthetic yet functional design of this unique residence, featuring open-air lounge and dining areas, a fully-equipped gourmet kitchen and five luxurious suites, all creatively designed with individual themes. Indulge in direct access to a secluded stretch of beach and take it easy in the three outdoor bar areas, providing an ideal setting for sunset cocktails.\n\nVenture out of your private hideaway to explore the regional attractions and range of nearby beachfront restaurants and bars. Of course, a visit to Cairns isn't complete without witnessing the majesty of the iconic Great Barrier Reef. After you've had your fill beneath the water, marvel at the world’s oldest tropical rainforest, Daintree National Park - just an hour's drive from the property.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Cairns",
    "location_heading": "Trinity Beach",
    "location_subheading": "Queensland",
    "location_description": "Trinity Beach Palace",
    "offer_address": "129 Vasey Esplanade, Trinity Beach, Queensland 4879, Australia",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 4129.0,
    "value": 9147.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECcYvAAL",
    "hero_image": "https://images.luxuryescapes.com/iqm9b1eh3nmxhla3s51p",
    "image_two": "https://images.luxuryescapes.com/rmytsa59uo663ylf0zue",
    "image_three": "https://images.luxuryescapes.com/pe5ervzw0ozwcc06vx3",
    "vendor_name": "Trinity Beach Palace",
    "title": "Exclusive Cairns Luxury Estate for 10 Guests with Direct Beachfront Access & Airport Transfers",
    "description": "Surrounded by verdant greenery and boasting a secluded beachfront location, the stunning Trinity Beach Palace is a regal private house easily accommodating up to 10 guests in absolute comfort. Admire the aesthetic yet functional design of this unique residence, featuring open-air lounge and dining areas, a fully-equipped gourmet kitchen and five luxurious suites, all creatively designed with individual themes. Indulge in direct access to a secluded stretch of beach and take it easy in the two outdoor bar areas, providing an ideal setting for sunset cocktails.\n\nVenture out of your private hideaway to explore the regional attractions and range of nearby beachfront restaurants and bars. Of course, a visit to Cairns isn't complete with witnessing the majesty of the iconic Great Barrier Reef. After you've had your fill beneath the water, marvel at the world’s oldest tropical rainforest, Daintree National Park - just an hour's drive from the property.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Cairns",
    "location_heading": "Trinity Beach",
    "location_subheading": "Queensland",
    "location_description": "Trinity Beach Palace",
    "offer_address": "129 Vasey Esplanade, Trinity Beach, Queensland 4879, Australia",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 4269.0,
    "value": 9457.0
  }
]