[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IhhtIAC",
    "hero_image": "https://images.luxuryescapes.com/8xanpypn0nv7ko8ky2l",
    "image_two": "https://images.luxuryescapes.com/ho5iwhcnmtj1ulvjdps",
    "image_three": "https://images.luxuryescapes.com/vrmjqek13gxk30nz59cl",
    "vendor_name": "Oaga Art Resort",
    "title": "Maldives All-Inclusive Boutique Art Villa Luxury with Unlimited Free-Flow Drinks & Roundtrip Malé Transfers",
    "description": "Nestled in the turquoise waters and pristine sands of North Malé Atoll, this ultra-cool oceanfront oasis - the first art resort in the Maldives - offers an all-inclusive five-star stay unlike anything else in the archipelago.\n\nLocated just a 45-minute speedboat transfer from Malé, Oaga Art Resort takes all-inclusive bliss to another level with a near-endless array of included activities and experiences. With mixology classes, jet-ski rides, high teas, guided snorkels and more included, you’ll be all set to customise the island escape of your dreams.\n\nHere, classic Maldives luxury has creative flair to spare, with each villa telling a story through carefully curated art. From the local artists’ work sprinkled around the resort to the beachside food cart collection Kaa Kada and theatrical dining restaurant Samaasaa, Oaga Art Resort offers a cultural immersion like no other.\n\nLose track of time snorkelling through marine wonderlands, or setting sail into the sunset on a complimentary cruise. Between island adventures, escape to the tranquillity of Hoba Spa, whether it’s for spiritual sound healing or tension-melting massage.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Maaranfushi",
    "location_heading": "North Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Oaga Art Resort",
    "offer_address": "Maaranfushi, Maadhunifaru Lagoon, North Malé Atoll, Maldives",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 2339.0,
    "value": 4991.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zWFpAAM",
    "hero_image": "https://images.luxuryescapes.com/b0nj3puu6h59nh0ncdv",
    "image_two": "https://images.luxuryescapes.com/zsvy30neba856ysg5ne",
    "image_three": "https://images.luxuryescapes.com/shvhl76dekzrlqdzbd1",
    "vendor_name": "Kuda Villingili Resort",
    "title": "Brand-New, Five-Star Maldives Resort with Prime Surf Break, Daily Breakfast & Dinner, Nightly Cocktails & Roundtrip Speedboat Transfers",
    "description": "Redefine privacy and luxury in the brand-new Kuda Villingili Resort Maldives, an impeccable five-star island resort featuring the largest pool in the archipelago, where you can relax within an hour of touching down in Malé (without the need for a seaplane transfer!). Satiate your hunger at the resort’s signature beachfront dining establishment, The Restaurant, or the beachside Mar-Umi restaurant, which transforms into a bar in the evening, with a further five dining venues to choose from. Then, cool off in the emerald pool extending throughout the heart of the island, which has the luxury of being sectioned off into a jacuzzi, lap pool and kid-friendly area.\n\nSurrounded by aquamarine waters and breathtaking dive sites, the entire island is at your disposal, with the guarantee of absolute privacy. For surf aficionados, the resort is right next to Chicken's Break, one of the largest and most iconic surf breaks in the Maldives. Kids will have plenty of unforgettable fun at the Kuda Fiyo Island Playground while parents relax at the resort’s eight spa treatment villas or sweat it out at the wellness centre.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Kuda Villingili",
    "location_heading": "North Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Kuda Villingili Resort",
    "offer_address": "Main Road, Viligilimathidhahuraa, Maldives",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 3299.0,
    "value": 7241.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070VguAAE",
    "hero_image": "https://images.luxuryescapes.com/olnl9kv51nzwe26bc5kf",
    "image_two": "https://images.luxuryescapes.com/3998uldklw8m2239nr",
    "image_three": "https://images.luxuryescapes.com/q6cvbdqi2ikkfburlkml",
    "vendor_name": "Kagi Maldives Spa Island",
    "title": "Five-Star Maldives Overwater Pool Villas with Daily Dining, Nightly Cocktails & Roundtrip Speedboat Transfers",
    "description": "Breathe in, breathe out and immerse yourself in unparalleled relaxation in the cerulean waters of the North Malé Atoll at the five-star Kagi Maldives Spa Island, an intimate slice of serenity with just 50 villas, each featuring private pools and easy access to the beach. Take things to the next level at the 1,500sqm floating Baani Spa Complex and feel the ocean swell embrace your spirit - the world-class facility features a sound therapy studio, restorative rituals, and an open-air yoga pavilion - or indulge in a wealth of culinary options at the resort’s Japanese-designed Nourishing Complex, featuring three spectacular restaurants and a comprehensively stocked wine cellar.\n\nOnly a 60-minute speedboat transfer from Malé, this is your chance to experience the authentic, joyous Maldives spirit. Feel the salt breeze in your hair as you cruise with the dolphins or dive deep into warm waters to explore the resort’s kaleidoscopic house reef, brimming with hundreds of species of marine life. With each villa featuring a private pool and easy access to the beach, Kagi Maldives Spa Island is the perfect place to unwind and savour island living surrounded by lush vegetation and the captivating island lagoon.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Kagi Island",
    "location_heading": "North Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Kagi Maldives Spa Island",
    "offer_address": "Kagi Maldives Spa Island, North Malé Atoll, Maldives",
    "percentage_discount": 56.0,
    "min_duration": 5,
    "max_duration": 15,
    "price": 3769.0,
    "value": 8516.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Cuvh3AAB",
    "hero_image": "https://images.luxuryescapes.com/zct7vdxkn6jdcm336z",
    "image_two": "https://images.luxuryescapes.com/bomhe3zsypcsbebx1v3",
    "image_three": "https://images.luxuryescapes.com/dnbjd2ghphfwqpeg7jge",
    "vendor_name": "Centara Ras Fushi Resort & Spa Maldives",
    "title": "Maldives Private Island Paradise with All-Inclusive Dining, Unlimited Free-Flow Drinks & Roundtrip Speedboat Transfers",
    "description": "Immerse yourself in an island escape where reality is even more magical than fantasy at the breathtaking Centara Ras Fushi Resort & Spa Maldives. This oasis is a honeymooner's dream, overlooking the glistening blue lagoon of North Malé Atoll, just 15 minutes by speedboat from Malé. Secluded, thatched-roof villas rise above the impossibly blue waters and sugar-fine shores of the champagne beachfront, while undersea exploration is at your doorstep thanks to the resort’s house reef, boasting an array of colourful marine life in an unforgettable kaleidoscopic world. Getting away from it all takes on a whole new meaning with famous dive sites, including Kikki Reef and Old Shark Point, within easy reach.\n\nPut your hair down and keep the cocktails coming as you lounge poolside, lap-up the cool sea breeze while dining on ocean-fresh seafood and forget about the world back home as you hop between seven restaurants and bars. When you are ready to truly unplug, harness the healing energy of Thai therapies at SPA Cenvaree, a world-leading spa experience focussed on holistic wellness that is sure to leave you feeling renewed.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Giravaru",
    "location_heading": "North Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Centara Ras Fushi Resort & Spa Maldives",
    "offer_address": "North Malé Atoll, Maldives",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 2355.0,
    "value": 5812.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id7olAAB",
    "hero_image": "https://images.luxuryescapes.com/tk8z04gm7tz95n4w8fr8",
    "image_two": "https://images.luxuryescapes.com/0xpeb86oao6ldwrk03nn",
    "image_three": "https://images.luxuryescapes.com/908n5b4q2kcyvcaqdfc",
    "vendor_name": "Centara Ras Fushi Resort & Spa Maldives",
    "title": "Maldives Adults-Only Private Island Paradise with All-Inclusive Dining, Unlimited Free-Flow Drinks & Roundtrip Malé Transfers",
    "description": "Honeymooner's dream, romantic's delight: there's nowhere else in the world like this spectacular, adults-only private island hideaway, embraced on all sides by the spellbinding waters of the North Malé Atoll. Located just 25 minutes by speedboat from Malé, this haven offers a very special slice of paradise. Secluded, thatched-roof villas rise above the island's golden shores and impossibly blue waters, hiding a spellbinding house reef, with famous dive sites Kikki Reef and Old Shark Point both within easy reach. You'll be all set to kick back and savour life at its finest with the resort's 'Gold' all-inclusive plan, with daily gourmet dining, drinks, canapes, afternoon tea and US$100 spa credit per person included.\n\nPut your hair down and keep the cocktails coming as you lounge poolside, lap up the cool sea breeze while dining on ocean-fresh seafood and forget about the world back home as you hop between restaurants and bars. When you are ready to truly unplug, harness the healing energy of Thai therapies at SPA Cenvaree, a world-leading spa experience focused on holistic wellness.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Giravaru",
    "location_heading": "North Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Centara Ras Fushi Resort & Spa Maldives",
    "offer_address": "North Malé Atoll, Maldives",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 2449.0,
    "value": 4762.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000041zFTAAY",
    "hero_image": "https://images.luxuryescapes.com/4y11ikwsefoc3ruzvktq",
    "image_two": "https://images.luxuryescapes.com/cnb3hf0lx37qeg10wif",
    "image_three": "https://images.luxuryescapes.com/udko1mpy7b1ptrcuffwh",
    "vendor_name": "Centara Ras Fushi Resort & Spa Maldives",
    "title": "Maldives Private Island Escape with Daily Dining, Nightly Free-Flow Cocktails & Return Speedboat Transfers",
    "description": "Immerse yourself in an island escape where reality is even more magical than fantasy at the breathtaking Centara Ras Fushi Resort & Spa Maldives - currently ranked as Tripadvisor’s top hotel in Malé. A child-free oasis overlooking the glistening blue lagoon, this gem in the ocean sits less than a 20-minute speedboat ride from Malé Airport.\n\nElegant, secluded thatched villas rise above the impossibly blue waters or rest on the sugar-fine shore of the champagne beachfront, while undersea exploration is at your doorstep thanks to the resort’s house reef - just 20m off the beach. Luxury comes as standard with incredible dining at your fingertips, while ‘getting away from it all’ takes on a whole new meaning with famous dive sites, including Kikki Reef and Old Shark Point, within easy reach.\n\n**Your handpicked inclusions:**\n\n- Arriving at this otherworldly oasis is effortless with roundtrip speedboat transfers to and from Malé\n- Days in paradise begin as they should... with daily buffet breakfast at Oceans restaurant\n- Nightly rotating buffet dinner at the authentic Maldivian-style Oceans restaurant\n- The option to exchange the buffet dinner for a three-course chef's menu or US$40 credit per person at La Brezza and Suan Bua, once per stay\n- Three hours of free-flow cocktails, wine, beer or spirits with your nightly dinner\n- Pamper yourself with US$50 massage credit per person, per stay to put towards massages at Spa Cenvaree\n- Complimentary watersport equipment hire, including canoes and windsurfing equipment\n\n**All-inclusive upgrades available:** Treat yourself to unparalleled indulgence when you choose an all-inclusive package, including daily breakfast, lunch and dinner, morning and afternoon tea, nightly pre-dinner canapés, unlimited alcoholic drinks between 11am and 11pm and the minibar in your villa replenished daily.\n\n**Overwater villa upgrades available:** Indulge in the quintessential Maldives experience by upgrading to a dreamy overwater villa suspended over the aquamarine waters of the lagoon.\n\n**Book with 100% Confidence**: If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Giravaru",
    "location_heading": "North Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Centara Ras Fushi Resort & Spa Maldives",
    "offer_address": "North Malé Atoll, Maldives",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 1549.0,
    "value": 2910.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ExwxjAAB",
    "hero_image": "https://images.luxuryescapes.com/p4llf3rj9g5ls7hpskbg",
    "image_two": "https://images.luxuryescapes.com/vuoau8t55g4vl7etj6h",
    "image_three": "https://images.luxuryescapes.com/pnbem70uwjwx52ovmixa",
    "vendor_name": "Gili Lankanfushi",
    "title": "Luxurious Maldives Retreat with World's Largest Overwater Villa on Private Island",
    "description": "Slow down, breathe deeply and immerse yourself in the epitome of barefoot island luxury at the enchanting Gili Lankanfushi Maldives resort, home to the world’s largest overwater villa, in the stunning North Malé Atoll. This private island sanctuary is the ultimate island escape where every moment is met with the breathtaking backdrop of unbelievably clear turquoise waters, blue skies, towering palm trees and silky-white sand. Treat your senses to a sophisticated oceanfront meal of Japanese-fusion flavours at By The Sea restaurant, or venture through the nightly market-style dining at Kashiveli restaurant, showcasing the best of local produce.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Lankanfushi Island",
    "location_heading": "North Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Gili Lankanfushi",
    "offer_address": "Lankanfushi Island, North Malé Atoll, Republic of Maldives, 08290",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1958.0,
    "value": 1958.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UOI1AAO",
    "hero_image": "https://images.luxuryescapes.com/lnfhkuclags0sia5ixte",
    "image_two": "https://images.luxuryescapes.com/ztomrv1ixmq8qm6yurr",
    "image_three": "https://images.luxuryescapes.com/y02frw261eja0v2jz0fq",
    "vendor_name": "Dhawa Ihuru",
    "title": "Maldives Five-Star Boutique Island Paradise with PADI Dive Centre & Ranamaari Shipwreck",
    "description": "Dive into luxury with a five-star villa stay at the boutique Dhawa Ihuru, a flawless slice of paradise in the Maldives’ North Malé Atoll. Boasting one of the clearest house reefs in the archipelago - containing the famed Ranamaari shipwreck - and an onsite PADI Dive Centre, it’s the perfect gateway to the wonders of the atoll’s prismatic underwater kingdoms. Enjoy alfresco dining at the beachfront restaurant or head to Angsana Spa Ihuru for enchanting treatments under swaying palms.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Ihuru",
    "location_heading": "North Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Dhawa Ihuru",
    "offer_address": "North Malé Atoll, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 741.0,
    "value": 741.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HkF7IAK",
    "hero_image": "https://images.luxuryescapes.com/6qbv2zf9hfeuuwrsnd",
    "image_two": "https://images.luxuryescapes.com/e8hd0u3gdt39mzz7fmo",
    "image_three": "https://images.luxuryescapes.com/51amo039t6s43ciw62x",
    "vendor_name": "Centara Ras Fushi Resort & Spa Maldives",
    "title": "Maldives Adults-Only Private Island Paradise with Gourmet Restaurants, Wellness Spa & Dive Sites",
    "description": "This spectacular, adults-only private island hideaway in the North Malé Atoll offers a special slice of paradise. Just 25 minutes by speedboat from Malé, it features secluded, thatched-roof villas above golden shores and blue waters, with famous dive sites Kikki Reef and Old Shark Point nearby.\n\nLounge poolside, enjoy ocean-fresh seafood, and explore the seven gourmet restaurants and scenic bars. For true relaxation, SPA Cenvaree offers world-leading holistic wellness and Thai therapies.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Giravaru",
    "location_heading": "North Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Centara Ras Fushi Resort & Spa Maldives",
    "offer_address": "North Malé Atoll, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 401.0,
    "value": 401.0
  }
]