[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BceZxAAJ",
    "hero_image": "https://images.luxuryescapes.com/qx1op585gcar18v4tzgn",
    "image_two": "https://images.luxuryescapes.com/jju8cb4z03nnaohmi1o",
    "image_three": "https://images.luxuryescapes.com/m6lvh3yymik5vqonplc5",
    "vendor_name": "Oaks The Entrance Waterfront Suites",
    "title": "NSW Oaks Central Coast Waterfront Retreat Just 90 Minutes from Sydney",
    "description": "Pelican-filled bright blue skies, a high street brimming with scrumptious cafés and shimmering waters stretching as far as the eye can see - an escape to Oaks The Entrance Waterfront Suites is the perfect chance to discover everything that makes NSW's Central Coast so special. Situated just 90 minutes from Sydney in a picturesque seaside town, the hotel boasts a heated swimming pool, Jacuzzi, fitness centre and dazzling views of Tuggerah Lake and the surrounding seascape.\n\nWhen you’re ready to explore the region’s countless charms, Oaks The Entrance Waterfront Suites is the ultimate launchpad. Ride one of the oldest carousels in the country, swim in the heritage-listed The Grant McBride Baths, cycle around the mighty lake or savour every scoop at the Great Australian Ice Creamery, all just minutes away on foot.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "The Entrance",
    "location_heading": "The Entrance",
    "location_subheading": "New South Wales",
    "location_description": "Oaks The Entrance Waterfront Suites",
    "offer_address": "89 The Entrance Road, The Entrance NSW 2261 Australia",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 200.0,
    "value": 307.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2ycIAC",
    "hero_image": "https://images.luxuryescapes.com/1s5k3go40s55rkf0a8q",
    "image_two": "https://images.luxuryescapes.com/dm7cypm1h8yl6ddjp9p",
    "image_three": "https://images.luxuryescapes.com/2gpeepgb9gq4at7ty39u",
    "vendor_name": "Ibis Styles The Entrance",
    "title": "Coastal NSW Escape Overlooking Tuggerah Lakes with Onsite Restaurant & Sports Bar",
    "description": "Wake to peaceful views of Tuggerah Lakes at this contemporary retreat, and spend your days discovering the breathtaking beauty of the New South Wales Central Coast. Featuring bright and airy rooms and only two minutes from the beautiful local beaches, this is the ideal launchpad for your laidback coastal escape.\n\nPerfectly placed on the sunny Central Coast, those seeking outdoor adventure are in the right place with plenty at hand, from diving at the historic HMAS Adelaide or hiking through lush national parks. After a day of fun, tuck into a meal at Outside In Kitchen and Café, sip on a cocktail at Liquid Bar or catch a game at the Quids sports bar.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Long Jetty",
    "location_heading": "The Entrance",
    "location_subheading": "New South Wales",
    "location_description": "ibis Styles The Entrance",
    "offer_address": "315 Central Coast Highway, The Entrance, New South Wales 2261, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 70.0,
    "value": 70.0
  }
]