[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lo2NAAS",
    "hero_image": "https://images.luxuryescapes.com/oramghxinsh9grr8s5u",
    "image_two": "https://images.luxuryescapes.com/9yx2p7runflxyuqeh69",
    "image_three": "https://images.luxuryescapes.com/lvmcijrolubiamr78ff",
    "vendor_name": "Castaway Island Resort",
    "title": "Award-Winning Fiji Island Paradise with All-Inclusive Dining",
    "description": "Experience barefoot luxury at its finest with an escape to one of Fiji’s most renowned properties and an absolute family favourite: Castaway Island, Fiji. Set on a pristine private island in the Mamanuca archipelago, this iconic resort is an award-winning haven surrounded by white-sand beaches and colourful coral reefs, easily accessible from Fiji's mainland with a scenic ferry transfer - available for purchase as an add-on at checkout.\n\nEmbrace the laidback island lifestyle staying in a traditional bure, with resort activities ranging from snorkelling to hiking and dolphin watching.\n\n**Your handpicked inclusions**:\n\n- Indulge with all-inclusive dining: daily breakfast, lunch and nightly dinner\n- Enjoy a decadent high tea for two adults once during your stay\n- Your choice of an exciting banana boat ride or snorkelling adventure on the outer reef for two adults and two children\n- Two children (2-12) stay and eat free from the kids' menu\n\n**Tripadvisor Travellers’ Choice, Best of the Best 2020** Top 25 Hotels for Families - South Pacific\n\n**Out & About with Kids 2020 Readers’ Choice Awards** Best International Hotels & Resorts - Fiji\n\n**Book with 100% Confidence**: If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Castaway Island",
    "location_heading": "Castaway Island",
    "location_subheading": "Fiji",
    "location_description": "Castaway Island, Fiji APR21",
    "offer_address": "Qailto Island, Mamanuca group of islands, Fiji 0000 Mamanuca Fiji",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 1879.0,
    "value": 3987.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006z2RrAAI",
    "hero_image": "https://images.luxuryescapes.com/wh0pchc0ebs4liltpui",
    "image_two": "https://images.luxuryescapes.com/4cke7mgjzk4v8d9gmymh",
    "image_three": "https://images.luxuryescapes.com/k0df8bgub6vs5emta21g",
    "vendor_name": "Castaway Island Resort",
    "title": "Award-Winning Fiji Island Paradise with All-Inclusive Dining & Roundtrip International Flights with Fiji Airways for Two Adults",
    "description": "Experience barefoot luxury at its finest with an escape to one of Fiji’s most renowned properties and an absolute family favourite: Castaway Island, Fiji. Set on a pristine private island in the Mamanuca archipelago, this iconic resort is an award-winning haven surrounded by white-sand beaches and colourful coral reefs.\n\nSet sail from the mainland and step foot onto 174 acres of rainforest-draped bliss and embrace island life from your gorgeous thatched-roof bure, set moments from the water's edge. Listen to the ocean soundscape echo through the resort and indulge across your choice of four eateries, including the exceptional Asian-inspired Restaurant 1808. Enhanced by the warmth of tropical sunshine and renowned Fijian hospitality, this island oasis invites guests to curate their own escape through myriad resort activities; explore the translucent shores by paddleboard or kayak, align your chakras with a sunrise yoga session or head into the hinterland on a guided nature walk.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Castaway Island",
    "location_heading": "Castaway Island",
    "location_subheading": "Fiji",
    "location_description": "Castaway Island, Fiji",
    "offer_address": "Qalito Island, Fiji 0000 Mamanuca Fiji",
    "percentage_discount": 0.0,
    "min_duration": 3,
    "max_duration": 16,
    "price": 1219.0,
    "value": 0.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008IxvWAAS",
    "hero_image": "https://images.luxuryescapes.com/6zsig4925ehiyopkcefvs",
    "image_two": "https://images.luxuryescapes.com/4vdcqtsnb391kr8zfbf",
    "image_three": "https://images.luxuryescapes.com/zorhbcmros12zju4erkh",
    "vendor_name": "Castaway Island Resort",
    "title": "Award-Winning Fiji Island Paradise with All-Inclusive Dining & Roundtrip International Flights for Two Adults",
    "description": "Experience barefoot luxury at its finest with an escape to one of Fiji’s most renowned properties and an absolute family favourite: Castaway Island, Fiji. Set on a pristine private island in the Mamanuca archipelago, this iconic resort is an award-winning haven (named among the top 1% of properties worldwide on Tripadvisor) surrounded by white-sand beaches and colourful coral reefs.\n\nSet sail from the mainland, step foot onto 174 acres of rainforest-draped bliss and embrace island life from your gorgeous thatched-roof bure, set moments from the water's edge. Listen to the ocean soundscape echo through the resort and indulge across your choice of four eateries, including the exceptional Asian-inspired Restaurant 1808. Enhanced by the warmth of tropical sunshine and renowned Fijian hospitality, this island oasis invites guests to curate their own escape through myriad resort activities; explore the translucent shores by paddleboard or kayak, align your chakras with a sunrise yoga session or head into the hinterland on a guided nature walk.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Castaway Island",
    "location_heading": "Castaway Island",
    "location_subheading": "Fiji",
    "location_description": "Castaway Island, Fiji",
    "offer_address": "Qalito Island, Fiji 0000 Mamanuca Fiji",
    "percentage_discount": 0.0,
    "min_duration": 4,
    "max_duration": 14,
    "price": 1886.0,
    "value": 0.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cpqYNQAY",
    "hero_image": "https://images.luxuryescapes.com/ygvegmh79l98untgziju",
    "image_two": "https://images.luxuryescapes.com/0k2jpnehhcf0tdgczuxs",
    "image_three": "https://images.luxuryescapes.com/tywx1jeefjz7js0n1keq",
    "vendor_name": "Castaway Island Resort",
    "title": "All-Inclusive Dining: Island Paradise in Fiji",
    "description": "Set your watch to island time and escape to one of Fiji’s most renowned island getaways, Castaway Island Resort. Embrace laid-back Fiji life staying in a traditional bure with all-inclusive dining (full buffet breakfast, delicious à la carte and themed buffet lunches and dinners), one high tea for two and your choice of two Happiness Passes, offering exclusive experiences such as dolphin safaris, a romantic beach dinner with sparkling wine, tropical Lailai massages and more. Plus, two kids (aged 12 years and under) stay and eat free!",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "",
    "location_heading": "Castaway Island",
    "location_subheading": "Fiji",
    "location_description": "Castaway Island Resort - 2019",
    "offer_address": "Qailto Island, Mamanuca group of islands, Fiji 0000 Mamanuca Fiji",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 2398.0,
    "value": 4503.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004SYjDAAW",
    "hero_image": "https://images.luxuryescapes.com/rjnk1b8n7l1czzgh730h",
    "image_two": "https://images.luxuryescapes.com/b5w4z0uk361mpqf3c",
    "image_three": "https://images.luxuryescapes.com/rj27vvvc19ebzl9g7ngh",
    "vendor_name": "Castaway Island Resort",
    "title": "Award-Winning Castaway Island Paradise",
    "description": "Experience barefoot luxury at its finest with an escape to one of Fiji’s most renowned properties and an absolute family favourite: Castaway Island, Fiji. Set on a pristine private island surrounded by white-sand beaches and colourful coral reefs in the Mamanuca archipelago, this iconic resort is ranked in the top 1% of properties worldwide on Tripadvisor.\n\nSet sail from the mainland and step foot onto 174 acres of rainforest-draped bliss and embrace island life from your gorgeous thatched-roof bure, set moments from the water's edge. Listen to the ocean soundscape echo through the resort and indulge across your choice of four eateries, including the exceptional Asian-inspired Restaurant 1808. Enhanced by the warmth of tropical sunshine and renowned Fijian hospitality, this island oasis invites guests to curate their own escape through myriad resort activities; explore the translucent shores by paddleboard or kayak, align your chakras with a sunrise yoga session, or head into the hinterland on a guided nature walk.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Castaway Island",
    "location_heading": "Castaway Island",
    "location_subheading": "Fiji",
    "location_description": "Castaway Island, Fiji",
    "offer_address": "Qalito Island, Fiji 0000 Mamanuca Fiji",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 445.0,
    "value": 445.0
  }
]