[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J64xIAC",
    "hero_image": "https://images.luxuryescapes.com/yz04hth5fvx0wodr5x3k",
    "image_two": "https://images.luxuryescapes.com/kwl01y4snjioqiei387",
    "image_three": "https://images.luxuryescapes.com/nxgrvz5bwhmurodf4o6h",
    "vendor_name": "Radisson Blu Resort Cam Ranh",
    "title": "Renowned Vietnam Beachfront Escape with Daily Breakfast, Daily Lunch or Dinner, Cocktails & Return Airport Transfers",
    "description": "Run away to beachfront bliss at this luxurious retreat perched on the sands of Vietnam's Bai Dai Beach. With every room overlooking the crystal-clear waters of the South China Sea and surrounded by lush tropical gardens, this luxurious hideaway is a sunseeker’s sanctuary that sits just 40 minutes south of the lively bars and theme parks of Nha Trang.\n\nSpend your afternoon relaxing by the pool before wandering to the pure-white sands of Bai Dai. When hunger strikes, you’ll be spoilt for choice with five restaurants and bars dotted throughout the resort, offering local and international dishes alongside curated refreshments.\n\nRelax and recharge with a treatment at the tranquil ESC Spa with unique crystal room, ice room and herbal steam bath therapies or work up a sweat at the tennis or volleyball courts - the choices are endless, and all at your fingertips.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Radisson Blu Resort Cam Ranh",
    "offer_address": "D12 Slot A, Nguyen Tat Thanh, Cam Lam, Khanh Hoa, Vietnam",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 609.0,
    "value": 1276.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzFe9AAF",
    "hero_image": "https://images.luxuryescapes.com/h7emnelbeefmbqbdehj",
    "image_two": "https://images.luxuryescapes.com/qkhx45sfpsv7wb82vxk",
    "image_three": "https://images.luxuryescapes.com/uvsljo8iwruywo6h8dqj",
    "vendor_name": "Radisson Blu Resort Cam Ranh",
    "title": "Renowned Vietnam Beachfront Escape with Daily Dining, Lounge Access & Return Airport Transfers",
    "description": "Run away to beachfront bliss at the Radisson Blu Resort Cam Ranh, a luxurious retreat perched on the sands of Bai Dai Beach. With every room overlooking the crystal-clear waters of the South China Sea and surrounded by lush tropical gardens, this luxurious hideaway is a sunseeker’s sanctuary that sits just 40 minutes south of the lively bars and theme parks of Nha Trang.\n\nSpend your afternoon relaxing by the pool before wandering to the pure-white sands of Bai Dai for hours spent splashing and sunning. When hunger strikes, you’ll be spoilt for choice with six restaurants and bars dotted throughout the resort, offering local and international dishes alongside curated cocktails, local beers and smoothies. Relax and recharge with a treatment at the tranquil ESC Spa with unique crystal room, ice room and herbal steam bath therapies or work up a sweat at the tennis or volleyball courts - the choices are endless, and all at your fingertips.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Radisson Blu Resort Cam Ranh",
    "offer_address": "D12 Slot A, Nguyen Tat Thanh, Cam Lam, Khanh Hoa, Vietnam",
    "percentage_discount": 41.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1019.0,
    "value": 1733.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zFjNAAU",
    "hero_image": "https://images.luxuryescapes.com/fptnnuv0d7lx9nf1842t",
    "image_two": "https://images.luxuryescapes.com/446xtpyps81siqha99d",
    "image_three": "https://images.luxuryescapes.com/tcrg38144930gbvf076a",
    "vendor_name": "Radisson Blu Resort Cam Ranh",
    "title": "Five-Star Radisson Blu Vietnam Beachfront Escape with Ocean-View Suite Upgrade, Daily Breakfast & Nightly Dinner",
    "description": "Indulge in five-star beachfront bliss at the luxurious Radisson Blu Resort Cam Ranh, an award-winning retreat perched on the sands of Bai Dai Beach. Overlooking the crystal-clear waters of the South China Sea and surrounded by lush tropical gardens, this luxurious hideaway is a sunseeker’s sanctuary that sits just 30km south of the lively bars and theme parks of Nha Trang.\n\nAdmire floor-to-ceiling ocean views in your room or villa before wandering to the pure-white sands of Bai Dai for hours spent splashing and sunning. When hunger strikes, you’ll be spoilt for choice with six restaurants and bars dotted throughout the resort, offering local and international dishes alongside curated cocktails, local beers and smoothies. Relax and recharge with a treatment or two at the tranquil Spa ESC and a yoga class, or work up a sweat at the tennis or volleyball courts - the choices are endless, and all at your fingertips from this Luxury Hotel Awards 2020 global winner.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Radisson Blu Resort Cam Ranh",
    "offer_address": "D12 Slot A, Nguyen Tat Thanh, Cam Lam, Khanh Hoa, Vietnam",
    "percentage_discount": 59.0,
    "min_duration": 7,
    "max_duration": 14,
    "price": 899.0,
    "value": 2216.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LqInAAK",
    "hero_image": "https://images.luxuryescapes.com/a0goccwq2kwtgyucfoh6",
    "image_two": "https://images.luxuryescapes.com/q870jzhk3nf92fwpxc8w",
    "image_three": "https://images.luxuryescapes.com/9266e5h46banb7tgmo8",
    "vendor_name": "ALMA Resort Cam Ranh",
    "title": "Grand Opening: Ultimate Vietnam Destination Resort with Decadent Dining, Massages & Nightly Drinks",
    "description": "Escape and experience barefoot Vietnam luxury with this once-in-a-lifetime stay at the recently-opened Alma Resort Cam Ranh - already ranked within TripAdvisor’s top four resorts in Cam Hai Dong. Unfurling over 30 hectares of beachfront on the Cam Ranh Peninsula with a private beach, this newly-opened, fully-integrated resort sets the scene for an unparalleled escape where absolutely everything is at your fingertips.\n\nExperience a whole new level of destination resort luxury where you can indulge across 14 exceptional restaurants and bars, plunge into the glistening depths of 12 pools cascading down to the pristine Long Beach and make a splash at the soaring waterpark. This unmissable escape puts the best of world-class amenities within easy reach with a 70-seat cinema and outdoor theatre under the stars, an 18-hole mini golf course and a revitalising 13-room spa - you’ll be living like royalty at Alma Resort Cam Ranh.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Alma Resort Cam Ranh 20",
    "offer_address": "Nguyễn Tất Thành, Cam Hải Đông, Cam Lâm, Khánh Hòa, Vietnam",
    "percentage_discount": 62.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 599.0,
    "value": 1572.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPN35AAH",
    "hero_image": "https://images.luxuryescapes.com/kcjbv5ser81fvtwzdz4h",
    "image_two": "https://images.luxuryescapes.com/qw673o692epefz2tzp8v",
    "image_three": "https://images.luxuryescapes.com/m67v3yg6714et8x95am",
    "vendor_name": "Radisson Blu Resort Cam Ranh",
    "title": "Five-Star Radisson Blu Vietnam Beachfront Escape with Daily Breakfast, Daily Lunch or Dinner & Nightly Drinks",
    "description": "Indulge in five-star beachfront bliss at the luxurious Radisson Blu Resort Cam Ranh, an award-winning retreat perched on the sands of Bai Dai Beach. Overlooking the crystal-clear waters of the South China Sea and surrounded by lush tropical gardens, this luxurious hideaway is a sunseeker’s sanctuary that sits just 30km south of the lively bars and theme parks of Nha Trang. This magnificent resort is designed around a spectacular outdoor pool that overlooks the turquoise ocean, only metres away. Soak in the sunshine, enjoy a refreshing dip and indulge in a poolside cocktail from the pool bar.\n\nAdmire floor-to-ceiling ocean views in your room or villa before wandering to the pure-white sands of Bai Dai for hours spent splashing and sunning. When hunger strikes, you’ll be spoilt for choice with six restaurants and bars dotted throughout the resort, offering local and international dishes alongside curated cocktails, local beers and smoothies. Relax and recharge with a treatment or two at the tranquil ESC Spa and a yoga class, or work up a sweat at the tennis or volleyball courts - the choices are endless, and all at your fingertips from this luxury resort.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Radisson Blu Resort Cam Ranh",
    "offer_address": "D12 Slot A, Nguyen Tat Thanh, Cam Lam, Khanh Hoa, Vietnam",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 974.0,
    "value": 2679.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ct2RYQAY",
    "hero_image": "https://images.luxuryescapes.com/ck44rudqpjbqskic2wp",
    "image_two": "https://images.luxuryescapes.com/lginyljsohhln2efjn9a",
    "image_three": "https://images.luxuryescapes.com/xtdo1k40iovnjnp80w5",
    "vendor_name": "Radisson Blu Resort Cam Ranh",
    "title": "Grand Opening: Radisson Beachfront Luxury with Daily Dining and Nightly Cocktails",
    "description": "Be amongst the first to experience the brand-new Radisson Blu Cam Ranh, a five-star beachfront jewel with spectacular ocean views from every room, nestled on a pristine private beach. Find your slice of tropical paradise in Vietnam’s hottest beach destination as you indulge in daily breakfast, your choice of daily buffet lunch or dinner each day, a nightly sunset cocktail per person, a 45-minute massage, in-room minibar with complimentary water and soft drinks replenished daily and return airport transfers from Cam Ranh International Airport.\n\n**Travelling with children?** Check out our family upgrade, with two children aged 12 years and under staying for free, unlimited access to the Kids Club and two interconnecting rooms with plenty of space for everyone.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khánh Hòa",
    "offer_geo_area_level_2": "Cam Lâm",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Radisson Blu Resort Cam Ranh DEC 2019",
    "offer_address": "ABC, D12, Nguyễn Tất Thành, Street, Ward, Khánh Hòa, Vietnam",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 805.0,
    "value": 1665.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dZPjfQAG",
    "hero_image": "https://images.luxuryescapes.com/b1b177q1n3m3z4rfh56x",
    "image_two": "https://images.luxuryescapes.com/9zeckatw19sbvjcqd0t",
    "image_three": "https://images.luxuryescapes.com/trfgolocv9fqacdxg6pc",
    "vendor_name": "Swandor Cam Ranh Hotels and Resort",
    "title": "Beachfront Luxury with All-Inclusive Dining and Drinks",
    "description": "Journey to Vietnam’s hottest beach destination, Cam Ranh, to enjoy an all-inclusive holiday like no others perfect for couples and families alike. Experience a spectacular oasis located just 35kms from Nha Trang, perched on a pristine private beach lapped by bright blue waters, at the ultra-luxe Swandor Hotels & Resorts Cam Ranh. Indulge in daily buffet breakfast, lunches and dinners, plus unlimited alcoholic beverages and soft drinks and a 60-minute massage per adult.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Swandor Hotels & Resorts Cam Ranh",
    "offer_address": "Km11, Nguyen Tat Thanh Boulevard, Cam Hai Dong Commune, Cam Lam District, Cam Lâm, Khánh Hòa 650000, Vietnam",
    "percentage_discount": 72.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 681.0,
    "value": 2439.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RAwEpQAL",
    "hero_image": "https://images.luxuryescapes.com/iwrojc7mnauuqcdqifal",
    "image_two": "https://images.luxuryescapes.com/yiseoru7gow229hhfsxv",
    "image_three": "https://images.luxuryescapes.com/b9xmr2atnfucfokbsb06",
    "vendor_name": "The Anam Cam Ranh",
    "title": "Five-Star Luxury Beachfront Oasis",
    "description": "Escape to a tropical paradise with seven nights at The Anam Nha Trang - a sophisticated beachside oasis with 3,000 tropical palm trees, three beautiful pools and a 300-metre white-sand private beach - with daily breakfasts, your choice of three unlimited à la carte lunches or dinners, four blissful massages, return airport transfers, a nightly hour of unlimited sunset cocktails and canapes, Vietnamese cooking class, super late 6pm checkout and a AU$50 flight credit.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "The Anam",
    "offer_address": "Lot 3 Nguyen Tat Thanh, Cam Hai Đong, Cam Lam, Khanh Hoa 650000, Vietnam",
    "percentage_discount": 58.0,
    "min_duration": 7,
    "max_duration": 9,
    "price": 899.0,
    "value": 2147.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009Eaw3AAC",
    "hero_image": "https://images.luxuryescapes.com/lukk2i6vu7lx7p1p53n",
    "image_two": "https://images.luxuryescapes.com/yrhh6nu56f8rn9hq1llb",
    "image_three": "https://images.luxuryescapes.com/p7rn7jts6xpxvsyyeea",
    "vendor_name": "Mövenpick Resort Cam Ranh",
    "title": "Five-Star Mövenpick Vietnam Beachfront Retreat with Daily Breakfast, Nightly Drinks & Roundtrip Transfers",
    "description": "Experience the pinnacle of barefoot bliss at Mövenpick Resort Cam Ranh, a five-star, family-friendly sanctuary ideally located just 35km from Nha Trang and perched on a pristine private stretch of Bai Dai Beach on Vietnam’s South Central Coast. Inspired by nature, the ocean and modern European style, this haven features a sun-kissed infinity swimming pool surrounded by oversized sunbeds and verdant gardens, with the sapphire-blue ocean and a white-sand beach forming the backdrop to an indulgent escape to please travellers of all styles.\n\nBe sure to kickstart your day with a fresh breakfast at the international Panorama restaurant, or take it slow with a coffee and pastry at the Lobby Lounge, before afternoon pints or Munich-style specialties at Chubeli Beer House. Then, ease your tired muscles with a traditional massage or treatment at Serenity Spa, or hit the onsite outdoor fitness centre or tennis court. Keeping the little ones occupied is easy with dedicated kids' swimming pools, waterslides and the exciting Little Birds Kids Club with its outdoor obstacle rope course, while the adults head to Tropicana Beach Club, an effortlessly cool beachfront bar and restaurant, and the most hip and happening venue in Cam Ranh for nightly entertainment, casual luxury and delicious cuisine.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Mövenpick Resort Cam Ranh",
    "offer_address": "Plot D 12 Abc, Cam Hải Đông 57615, Cam Lâm District, Vietnam",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 937.0,
    "value": 1905.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CNWt7AAH",
    "hero_image": "https://images.luxuryescapes.com/v4j6mxpgtrm13jsuz4wh",
    "image_two": "https://images.luxuryescapes.com/mtytgza96gw0rapqpdw9",
    "image_three": "https://images.luxuryescapes.com/fz9jybytsolnmuppmm5",
    "vendor_name": "The Anam Cam Ranh",
    "title": "Top-Rated Vietnam Beachside Splendour near Nha Trang with Daily Breakfast & Nightly Free-Flow Drinks Hour",
    "description": "Discover old-world Vietnam opulence among Cam Ranh’s rolling hillsides, emerald waters and unrivalled sands with a five-star stay at The Anam, located just a 40-minute journey from Nha Trang’s dazzling array of world-class marketplaces, restaurants and nightlife. Step into the resort’s magnificent open-air lobby and become enchanted by The Anam’s inimitable Indochine charm, backed by top-notch service, an unrivalled beachside location and five extraordinary dining venues. Listen to the ocean as you enjoy local beers and locally inspired bites at Lang Viet restaurant and bar, savour sundowners and unforgettable views at Beach Club or head to The Colonial Restaurant for classic French fine dining.\n\nWhether it's laidback beachside bliss or unforgettable evenings, The Anam offers guests the best of both worlds. Spend afternoons soaking up sunlight on the resort’s breathtaking slice of Cam Ranh's golden shores, lazing by any of the three mirage-like pools or wandering flawless gardens before heading out to experience nearby Nha Trang's countless treasures, including Long Son Pagoda - home to the world’s biggest Buddha statue - and some of Vietnam's finest surf.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "The Anam",
    "offer_address": "Lot 3 Nguyen Tat Thanh, Cam Hai Đong, Cam Lam, Khanh Hoa 650000, Vietnam",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 18,
    "price": 974.0,
    "value": 1906.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dg0jOAAR",
    "hero_image": "https://images.luxuryescapes.com/qtvu48nhhby66uwam4a",
    "image_two": "https://images.luxuryescapes.com/6e0evwe2wto4o340crq",
    "image_three": "https://images.luxuryescapes.com/l93y9n5vrno68ohgtgn9",
    "vendor_name": "Melia Vinpearl Cam Ranh",
    "title": "Beachfront Vietnam Meliá Pool Villa Retreat with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Experience the pinnacle of barefoot bliss at Meliá Vinpearl Cam Ranh Beach Resort, a five-star beachside sanctuary offering pool villa luxury on the sought-after Cam Ranh Peninsula. Inspired by nature, the ocean and elegant European style, this is a paradisiacal oasis surrounded by sprawling champagne beachfront for as far as the eye can see.\n\nPerched on the shores of Cam Ranh amid 64sqm of lush tropical gardens, this idyllic hideaway is the epitome of seaside indulgence. Plunge into the glittering resort pool which feels like an extension of the ocean, dine around three sumptuous restaurants serving everything from seafood to Vietnamese specialities and poolside fare, or allow little ones to run free at the adventure-filled Kidsdom kids' club, whilst adults make the most of the serene spa and fully equipped fitness centre. Ready to explore? Discover local bars along the beachfront or venture to the nearby Nha Trang for vibrant nightlife and markets.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Meliá Vinpearl Cam Ranh",
    "offer_address": "Lô D6B2 - D7A1, Nguyễn Tất Thành, Khu 2, Cam Lâm, Khánh Hòa 650000, Vietnam",
    "percentage_discount": 28.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 881.0,
    "value": 1225.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GOI0sAAH",
    "hero_image": "https://images.luxuryescapes.com/cf4bk9nzxrp0xwlepber",
    "image_two": "https://images.luxuryescapes.com/527btcljd92w9s1h150u",
    "image_three": "https://images.luxuryescapes.com/o4gfm7a98kd503z3m1e8",
    "vendor_name": "Ana Mandara Cam Ranh",
    "title": "Vietnam’s Newest Award-Winning Five-Star Beachfront Resort with Daily Dining & Nightly Drinks",
    "description": "Discover the beauty of Vietnam's coastline with a stay at the five-star Ana Mandara Cam Ranh - Asia's Leading New Resort, as per the World Travel Awards. This beachfront retreat offers a serene escape from the hustle and bustle but remains close enough to Nha Trang for those who want to relax by day and explore by night. Indulge in fresh seafood at the beachside Ana Beach House restaurant, serving elegant yet laidback cuisine spanning from traditional Vietnamese flavours to international favourites. The Sunken Pool Bar is the perfect place to unwind in the sunshine, sipping on refreshing cocktails as the sunset turns the sky a vibrant shade of red.\n\nThe modern design of the hotel blends perfectly with the surroundings, as the lines curve with the land and the pale shades of the buildings melt seamlessly into the sandy shore. Visit the luxury onsite spa to truly experience the rejuvenating power of this resort, and succumb to island life.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Ana Mandara Cam Ranh",
    "offer_address": "Slot D6A, Zone 2, Cam Ranh, Cam Lam 57000, Vietnam",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 929.0,
    "value": 2380.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FyuGSYAZ",
    "hero_image": "https://images.luxuryescapes.com/d9u40ct3jfcu6gn99yob",
    "image_two": "https://images.luxuryescapes.com/wgw4fwpl68gxsrukfwic",
    "image_three": "https://images.luxuryescapes.com/mns0x6l4wr9dg7fe333w",
    "vendor_name": "Ana Mandara Cam Ranh",
    "title": "Stylish Vietnam Beachfront Escape with Daily Breakfast, Nightly Drinks & Massages",
    "description": "Discover the beauty of Vietnam’s coastline with a stay at the five-star, award-winning Ana Mandara Cam Ranh. This beachfront retreat offers a serene escape from the hustle and bustle but remains close enough to Nha Trang for those who want to relax by day and explore by night.\n\nIndulge in fresh seafood at the beachside Ana Beach House Restaurant, serving elegant yet laidback cuisine. The Sunken Pool Bar is the perfect place to unwind in the sunshine, sipping on refreshing cocktails as the sunset turns the sky a vibrant shade of red; or enjoy traditional Vietnamese flavours and international favourites at Ana Sand House.\n\nThe modern design of the hotel has a strong focus on sustainability, blending perfectly with the surroundings as the lines curve with the land and the pale shades of the buildings melt seamlessly into the sandy shore. Visit the luxury onsite spa to truly experience the rejuvenating power of this resort, and succumb to island life.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Ana Mandara Cam Ranh",
    "offer_address": "Slot D6A, Zone 2, Cam Ranh, Cam Lam 57000, Vietnam",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 389.0,
    "value": 975.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ct2SlQAI",
    "hero_image": "https://images.luxuryescapes.com/gze7hqbx76txa5l74d",
    "image_two": "https://images.luxuryescapes.com/ue4a6mm8b7zacgc8yj",
    "image_three": "https://images.luxuryescapes.com/22yp7z4modqhe8gylq3",
    "vendor_name": "Mövenpick Resort Cam Ranh",
    "title": "Mövenpick Vietnam Beachfront Escape with Daily Drinks & Dining",
    "description": "Treat yourself to five-star luxury at Mövenpick Resort Cam Ranh, a luxe beachfront sanctuary boasting panoramic ocean views. Discover up-and-coming Cam Ranh with a stay at one of the area's newest resorts. Mövenpick Resort Cam Ranh is inspired by modern European style and home to world-class dining venues, sublime facilities, a Swiss Village with a beerhouse, an amazing kids' club with waterslides, and - of course - a daily decadent Mövenpick chocolate hour with Swiss-style desserts.\n\nExperience an unforgettable escape with deluxe daily buffet breakfast, your choice of daily buffet lunch or dinner, one nightly glass of wine or beer per adult, a 60-minute massage per adult, convenient return airport transfers from Cam Ranh and complimentary access to the sprawling Little Birds kids' club.\n\n**Travelling with kids?** Family upgrades for two adults and up to three children are available.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Mövenpick Resort Cam Ranh",
    "offer_address": "Plot D 12 Abc, Cam Hải Đông 57615, Cam Lâm District, Vietnam",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 871.0,
    "value": 1497.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DSZ6bYAH",
    "hero_image": "https://images.luxuryescapes.com/ittz1oun1s1gn9l18vj",
    "image_two": "https://images.luxuryescapes.com/fqgz7hykqk5fpvagncla",
    "image_three": "https://images.luxuryescapes.com/tfpzb8mc0843q6k8rftx",
    "vendor_name": "The Anam Cam Ranh",
    "title": "Five-Star Vietnam Beachfront Escape with Three Restaurants, Outdoor Pools & Spa",
    "description": "Discover the magic of Vietnam's captivating and picturesque Cam Ranh Bay with a stay at this elegant Indochine-inspired beachfront retreat. Savour authentic Vietnamese cuisine at Lang Viet Restaurant & Bar or master the art of Vietnamese cuisine by joining a traditional cooking class. Unwind by one of three outdoor pools and rejuvenate at The Anam Spa, a tranquil sanctuary.\n\nWhen it's time to explore, the vibrant city of Nha Trang awaits, offering bustling markets and stunning landscapes. With serene beaches on your doorstep, embark on unforgettable island-hopping adventures. Explore the nearby coastal town of Nha Trang, famous for its mud baths and cultural sites. When you retreat to this elegant haven, unwind at Saigon Bar with handcrafted cocktails and melodies from the resident pianist.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "The Anam Cam Ranh",
    "offer_address": "Long Beach, Northern Peninsula Cam Ranh, Khanh Hoa 650000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 182.0,
    "value": 182.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Vi4VAAS",
    "hero_image": "https://images.luxuryescapes.com/ghcuxss1mfmqjca9t1hn",
    "image_two": "https://images.luxuryescapes.com/11vfebdmdv72sk3gg6p",
    "image_three": "https://images.luxuryescapes.com/z0eout5egac9k8lj4slb",
    "vendor_name": "Radisson Blu Resort Cam Ranh",
    "title": "Five-Star Radisson Blu Vietnam Beachfront Escape",
    "description": "Indulge in five-star beachfront bliss at the sophisticated Radisson Blu Resort Cam Ranh, an award-winning retreat perched on the sands of Bai Dai Beach. Overlooking the crystal-clear waters of the South China Sea and surrounded by lush tropical gardens, this luxury hideaway is a sunseeker’s sanctuary that sits just 30km south of the lively bars and theme parks of Nha Trang.\n\nAdmire floor-to-ceiling ocean views in your room or villa before wandering to the pure-white sands of Bai Dai for hours spent splashing and sunning. When hunger strikes, you’ll be spoilt for choice: six restaurants and bars are dotted throughout the resort, offering local and international dishes alongside curated cocktails, local beers and smoothies. Relax and recharge with a treatment or two at the tranquil Spa ESC and a yoga class, or work up a sweat at the tennis or volleyball courts - the choices are endless, and all at your fingertips.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Radisson Blu Resort Cam Ranh",
    "offer_address": "D12 Slot A, Nguyen Tat Thanh Highway, Cam Ranh, Vietnam",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GijKAAS",
    "hero_image": "https://images.luxuryescapes.com/rlntlqnwvqnwbzwtoyk",
    "image_two": "https://images.luxuryescapes.com/xpc5g5z5hf1b9som4zp",
    "image_three": "https://images.luxuryescapes.com/dqoxwe0w81n5yg3cjqt",
    "vendor_name": "ALMA Resort Cam Ranh",
    "title": "Five-Star Vietnam Beachfront Resort with Daily Breakfast & Nightly Free-Flow Cocktails",
    "description": "Escape and experience barefoot Vietnam luxury with this once-in-a-lifetime stay at the breathtaking Alma Resort Cam Ranh - an ultra-indulgent paradise, where blissful ocean vistas extend to each suite and pavilion. Unfurling over 30 hectares of beachfront on the Cam Ranh Peninsula, with a private beach exclusively for its guests, this fully integrated, five-star resort sets the scene for an unparalleled escape where absolutely everything is at your fingertips.\n\nExperience a whole new level of destination resort luxury where you can indulge across 14 exceptional restaurants and bars, plunge into the glistening depths of 12 pools cascading down to the pristine Long Beach, and make a splash at the soaring waterpark. This unmissable escape puts the best of world-class amenities within easy reach, with a 70-seat cinema and outdoor theatre under the stars, an 18-hole minigolf course and a revitalising 13-room spa - you’ll be living like royalty at Alma Resort Cam Ranh.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Alma Resort Cam Ranh",
    "offer_address": "Nguyễn Tất Thành, Cam Hải Đông, Cam Lâm, Khánh Hòa, Vietnam",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP4zYAF",
    "hero_image": "https://images.luxuryescapes.com/qns95s28hjl6edcwob5",
    "image_two": "https://images.luxuryescapes.com/snz9hgi01o4icyftewd",
    "image_three": "https://images.luxuryescapes.com/p2wquse30sq15di8clm8",
    "vendor_name": "Mövenpick Resort Cam Ranh",
    "title": "Five-Star Vietnam Beachfront Escape with Three Restaurants, Water Park, Outdoor Pools & Spa",
    "description": "Nestled amid lush tropical gardens on a white sandy beach, discover the magic of Vietnam's captivating and picturesque Cam Ranh Bay. With each room offering direct ocean views, this five-star retreat offers a serene sanctuary, with its private beach, shimmering infinity pool, water park and spa. Delight in the flavours of the world at Chübeli Beer House or indulge in the local seafood at Panorama Restaurant.\n\nWhen it's time to explore, the vibrant city of Nha Trang awaits, offering bustling markets and stunning landscapes. Explore the nearby coastal town, famous for its mud baths and cultural sites. When you return, bask in mesmerising sunsets before another day of adventure within the resort.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Khanh Hoa Province",
    "offer_geo_area_level_2": "Cam Lam",
    "location_heading": "Cam Ranh",
    "location_subheading": "Vietnam",
    "location_description": "Mövenpick Resort Cam Ranh",
    "offer_address": "Plot D 12 Abc, Cam Hai Dong, Cam Ranh, Khanh Hoa Province 57615, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 95.0,
    "value": 95.0
  }
]