[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bd5GsAAJ",
    "hero_image": "https://images.luxuryescapes.com/5mlsy926nujn0v0rp53f",
    "image_two": "https://images.luxuryescapes.com/a5hp8w99kqnc76cnbyqn",
    "image_three": "https://images.luxuryescapes.com/cwpryz0e62x9a7qhu0ap",
    "vendor_name": "Movenpick Asara Resort & Spa Hua Hin",
    "title": "Ultimate Mövenpick Luxury: Five-Star Bangkok & Hua Hin Stays with Daily Dining, Cocktails & Ground Transfers",
    "description": "Embark on the ultimate, easy-to-plan Mövenpick five-star Thailand journey - beginning at the magnificent Mövenpick Hotel Sukhumvit 15 Bangkok and ending at beachfront palace Mövenpick Asara Resort & Spa Hua Hin, there's no better way to journey between Bangkok’s exhilarating food-filled streets and Hua Hin’s sweeping alabaster sands. In Bangkok, shop your way through Sukhumvit’s glitzy boutiques and dine on soul-warming pad thai at the onsite Lelawadee Restaurant before heading to the serene seaside where Mövenpick Asara Resort & Spa Hua Hin’s shimmering lagoons and quiet gardens await. Dine on sumptuous seafood under the vast night sky at Baan Dum, savour mai tais and the caresses of the ocean breeze at Ocean Bar or laze the day away by the hotel’s masterpiece central pool.\n\nYou’ll be embraced with warm hospitality, effortless Swiss luxury and the famed Mövenpick Chocolate Hour throughout your stay. When you’re ready to explore, both cities offer abundant surprises and delights - explore Bangkok’s countless rave-worthy restaurants, bars and clubs or lose yourself on Hua Hin’s legendary shores.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Prachuap Khiri Khan Province",
    "offer_geo_area_level_2": "Hua Hin",
    "location_heading": "Bangkok and Hua Hin",
    "location_subheading": "Thailand",
    "location_description": "Mövenpick Resorts in Hua Hin & Bangkok",
    "offer_address": "53 Hua Hin 5 Alley, Tambon Hua Hin, Hua Hin District, Prachuap Khiri Khan 77110, Thailand",
    "percentage_discount": 34.0,
    "min_duration": 4,
    "max_duration": 10,
    "price": 1291.0,
    "value": 1942.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqOBuAAN",
    "hero_image": "https://images.luxuryescapes.com/utwcpgn0dv8t1h7nz8kt",
    "image_two": "https://images.luxuryescapes.com/hbtcap0cznq5kqwy5psl",
    "image_three": "https://images.luxuryescapes.com/b5r8dowrhev2gl6fqfn",
    "vendor_name": "Movenpick Asara Resort & Spa Hua Hin",
    "title": "Ultimate Mövenpick Luxury: Five-Star Bangkok & Hua Hin Stays with Daily Dining, Cocktails & Private Transfers",
    "description": "Embark on an unforgettable city-to-surf journey between Bangkok’s exhilarating food-filled streets and Hua Hin’s sweeping alabaster sands with the ultimate Mövenpick five-star, easy-to-plan Thailand escape. In Bangkok, shop your way through Sukhumvit’s glitzy boutiques and dine on soul-warming pad thai at the onsite Lelawadee Restaurant, before heading to the serene seaside where Mövenpick Asara Resort & Spa Hua Hin’s shimmering lagoons and quiet gardens await. Dine on sumptuous seafood under the vast night sky at Baan Dum Oceanfront Seafood, savour mai tais and the caresses of the ocean breeze at Ocean Bar or laze the day away by the hotel’s masterpiece central pool.\n\nYou’ll be embraced with warm hospitality, effortless Swiss luxury and the famed Mövenpick Chocolate Hour throughout your stay. When you’re ready to explore, both locations offer abundant surprises and delights - explore Bangkok’s countless rave-worthy restaurants, bars and clubs or lose yourself on Hua Hin’s legendary shores.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Prachuap Khiri Khan Province",
    "offer_geo_area_level_2": "Hua Hin",
    "location_heading": "Bangkok and Hua Hin",
    "location_subheading": "Thailand",
    "location_description": "Mövenpick Resorts in Hua Hin & Bangkok",
    "offer_address": "53 Hua Hin 5 Alley, Tambon Hua Hin, Hua Hin District, Prachuap Khiri Khan 77110, Thailand",
    "percentage_discount": 48.0,
    "min_duration": 4,
    "max_duration": 10,
    "price": 1179.0,
    "value": 2280.0
  }
]