[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gTiZAAU",
    "hero_image": "https://images.luxuryescapes.com/zsjohmdyv9sxb228bks5",
    "image_two": "https://images.luxuryescapes.com/15cei54qxct48zlqvyoq",
    "image_three": "https://images.luxuryescapes.com/5naluiqbrphpf7eexqib",
    "vendor_name": "100 Luxury Suites Prr",
    "title": "Sophisticated Colombia Escape in the Heart of Bogotá with Rooftop Terrace",
    "description": "Set your sights on Bogotá, the bustling heart of Colombia, famed for lively nightlife, gourmet dining and countless museums and galleries, and enjoy a well-deserved stay at 100 Luxury Suites. This upscale property will feel like the perfect place to recharge in style and boasts sleek amenities including a state-of-the-art fitness centre, tranquil spa and rooftop terrace with impressive city views. If you're feeling hungry, a visit to the onsite Cornelia restaurant, specialising in slow-cooked meats and boasting an extensive wine list, is a must.\n\nExploration beyond your stylish abode is essential, and you’ll be perfectly placed just moments away from the Bogotá World Trade Center, café-lined greenery of Parque de la 93 and within easy reach of the city’s best luxury shopping or restaurants. Once the sun sets, immerse yourself in Bogotá’s legendary nightlife and get lost in a sea of colour and sound.",
    "offer_country_name": "Colombia",
    "offer_country_code_alpha_2": "CO",
    "offer_geo_area_level_1": "Distrito Capital",
    "offer_geo_area_level_2": "Bogotá",
    "location_heading": "Bogotá",
    "location_subheading": "Colombia",
    "location_description": "100 Luxury Suites",
    "offer_address": "Cra. 9a #98-3, Bogotá, Colombia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 73.0,
    "value": 73.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gRN5AAM",
    "hero_image": "https://images.luxuryescapes.com/y6035rlau7rh9dioaftq",
    "image_two": "https://images.luxuryescapes.com/5ee3jy3llrq76e61z7ov",
    "image_three": "https://images.luxuryescapes.com/4q1xv2zzv90lshi5uk7f",
    "vendor_name": "93 Luxury Suites & Residences L.v.x.",
    "title": "Colombia Suite Luxury in the Heart of Bogotá's Iconic Parque de la 93 District",
    "description": "Experience the art of living from the heart of Parque de la 93, an exclusive area surrounded by bars, vibrant dining and nightlife, at 93 Luxury Suites & Residences. Part of the Blue Doors Collection, this apartment-style hotel was created for the modern traveller who appreciates innovative, intelligent design without having to give up the comforts of home. After a busy day exploring the Columbian capital retreat to your opulent sanctuary featuring modern amenities, including a state-of-the-art fitness centre, a specular 17-seat cinema and spacious coffee lounge bar. For the ultimate indulgence, in-room spa treatments are available on request (surcharges apply).",
    "offer_country_name": "Colombia",
    "offer_country_code_alpha_2": "CO",
    "offer_geo_area_level_1": "Distrito Capital",
    "offer_geo_area_level_2": "Bogotá",
    "location_heading": "Bogotá",
    "location_subheading": "Colombia",
    "location_description": "93 Luxury Suites & Residences",
    "offer_address": "Cra. 13a #93-51, Bogotá, Colombia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 170.0,
    "value": 170.0
  }
]