[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LeZZAA0",
    "hero_image": "https://images.luxuryescapes.com/fc4hv0komh5dd5ffv3w",
    "image_two": "https://images.luxuryescapes.com/wvp5gyce9xuj2x6c22",
    "image_three": "https://images.luxuryescapes.com/3cr17vwjdou5nurum8na",
    "vendor_name": "Castello dal Pozzo",
    "title": "18th-Century Castle Stay with Indulgent Dining Inclusions",
    "description": "A world of traditional elegance, historic grandeur and perfectly manicured gardens awaits near the picturesque Lake Maggiore, in northern Italy. Enter your very own fairy tale with a stay at Castello Dal Pozzo, a charming boutique hotel housed in an 18th-century castle. Enjoy daily American buffet breakfast, a welcome drink on arrival, a three-course dinner with a bottle of wine and two Italian aperitivi per person, with an alcoholic beverage and finger food.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Piedmont",
    "offer_geo_area_level_2": "Oleggio Castello",
    "location_heading": "Lake Maggiore",
    "location_subheading": "Italy",
    "location_description": "Castello Dal Pozzo",
    "offer_address": "Via Visconti 8, Oleggio Castello 28040, Italy",
    "percentage_discount": 44.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 836.0,
    "value": 1490.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRfq0AAD",
    "hero_image": "https://images.luxuryescapes.com/2xcajgf6wg5xkhivxizi",
    "image_two": "https://images.luxuryescapes.com/ctq5z5lz4cmhk2x4wdmp",
    "image_three": "https://images.luxuryescapes.com/2b5lj0lf6oiwtsk6yp",
    "vendor_name": "Castello dal Pozzo",
    "title": "Elegant Northern Italy Castle Escape near Lake Maggiore with Daily Breakfast & EUR50 Dining Credit",
    "description": "Be swept away by the enigmatic Neo-Gothic charms and grandeur of Italian nobility with a fairytale stay in a medieval castle near the picturesque Lake Maggiore in northern Italy. Ensconced amid manicured gardens in charming Piedmont, this lavish five-star castle hotel is perched atop a verdant hill, offering scenic views of the lake and the rolling hills of Arona's wine country.\n\nSeamlessly blending centuries-old history with modern elegance, the interiors of the hotel are as grand as the exterior: the halls and rooms display regal opulence with lavish chandeliers, marble floors, glorious drapes and Venetian-plastered walls.\n\nLive a gourmet food lover’s dream at two world-class restaurants: Le Fief, one of the most intimate restaurants on Lake Maggiore, or the more informal Dan Garden Lounge, surrounded by the hotel’s lush gardens. Spend hours by the outdoor swimming pool, or take a day trip to the magical Lake Orta, a picturesque hideaway blessed with beautiful medieval villages, Michelin-starred food and packed with charm.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Piedmont",
    "offer_geo_area_level_2": "Oleggio Castello",
    "location_heading": "Lake Maggiore",
    "location_subheading": "Italy",
    "location_description": "Castello Dal Pozzo",
    "offer_address": "Via Visconti 8, Oleggio Castello 28040, Italy",
    "percentage_discount": 35.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 749.0,
    "value": 1150.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IaxpsAAB",
    "hero_image": "https://images.luxuryescapes.com/7t8vvb9fm9b974lbvxdg",
    "image_two": "https://images.luxuryescapes.com/xsji4umefr0k3pgrh",
    "image_three": "https://images.luxuryescapes.com/2xedtwv5sdyvb32r33sp",
    "vendor_name": "Castello dal Pozzo",
    "title": "Charming Northern Italy Castle Escape Near Lake Maggiore with Daily Breakfast & EUR50 Dining Credit",
    "description": "A world of traditional elegance, historic grandeur and perfectly manicured gardens awaits near the picturesque Lake Maggiore, in northern Italy. Enter your very own fairy tale with a stay at this charming boutique hotel housed in an 18th-century castle. Perched atop a verdant hill, offering scenic views of the lake and the rolling hills of the wine country, this charming resort effortlessly combines modern elegance with its centuries-old history. The interiors are as grand as its exterior: the halls and rooms are a display of unparalleled elegance, decorated with lavish chandeliers, marble floors, glorious drapes and Venetian-plastered walls.\n\nLive a gourmet food lovers' dream at either of the two world-class restaurants located in the romantic settings of Castello Dal Pozzo: Le Fief, one of the most intimate restaurants on Lake Maggiore, or the more informal Dan Garden Lounge, surrounded by the hotel’s lush gardens. Take a day trip to the magical Lake Orta, this unspoilt lake, separated from Lake Maggiore by Monte Mattarone, is a picturesque hideaway surrounded by lush woodlands, blessed with beautiful medieval villages, Michelin-starred food and packed with charm.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Piedmont",
    "offer_geo_area_level_2": "Oleggio Castello",
    "location_heading": "Lake Maggiore",
    "location_subheading": "Italy",
    "location_description": "Castello Dal Pozzo",
    "offer_address": "Via Visconti 8, Oleggio Castello 28040, Italy",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 669.0,
    "value": 1241.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HSQFVYA5",
    "hero_image": "https://images.luxuryescapes.com/260g5ftg8udvbr3omfj",
    "image_two": "https://images.luxuryescapes.com/mydhsipyzkhwecf14dohr",
    "image_three": "https://images.luxuryescapes.com/p00e8qxk2uvub9j2k54s",
    "vendor_name": "Castello dal Pozzo",
    "title": "Northern Italy Hilltop Castle Elegance near Lake Maggiore with Palazzo Dinner & Daily Breakfast",
    "description": "Be swept away by the enigmatic Neo-Gothic charms and grandeur of Italian nobility with a fairytale stay in a medieval castle near the picturesque Lake Maggiore in northern Italy. Ensconced amid manicured gardens in charming Piedmont, this lavish, five-star hilltop castle hotel offers scenic views of the lake and the rolling hills of Arona's wine country.\n\nBlending centuries-old history with modern elegance, the interiors of the hotel are as grand as the exterior: the halls and rooms display regal opulence with lavish chandeliers, marble floors, glorious drapes and Venetian-plastered walls.\n\nLive a gourmet food lover’s dream at two world-class restaurants: Le Fief, one of the most intimate restaurants on Lake Maggiore, or the more informal Dan Garden Lounge, surrounded by lush gardens. Spend hours by the swimming pool, or take a day trip to Lake Orta, a picturesque hideaway blessed with medieval villages, Michelin-starred food and packed with charm.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Piedmont",
    "offer_geo_area_level_2": "Oleggio Castello",
    "location_heading": "Lake Maggiore",
    "location_subheading": "Italy",
    "location_description": "Castello Dal Pozzo",
    "offer_address": "Via Visconti 8, Oleggio Castello 28040, Italy",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 659.0,
    "value": 1195.0
  }
]