[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HTsbCYAT",
    "hero_image": "https://images.luxuryescapes.com/5ys0olvxl7qzh8yts7ha",
    "image_two": "https://images.luxuryescapes.com/vw13cde2bke9w4ao9ebr",
    "image_three": "https://images.luxuryescapes.com/62agdvrgehnmp6jds5do",
    "vendor_name": "H on Mitchell Apartment Hotel",
    "title": "Modern Central Darwin Self-Contained Apartment Escape with Daily Breakfast & A$50 Dining Credit",
    "description": "Elevate your stay in the Top End with a boutique, self-contained apartment in the heart of Darwin’s CBD. Whether here for work or play, this modern retreat has everything you need for ultimate relaxation; unwind on a cabana by the shimmering rooftop pool with sweeping city views, stay active at the fully equipped fitness centre and enjoy the atmosphere at the onsite sports bar.\n\nSavour the flavours of the Northern Territory at the hotel’s onsite venue, Lizards Bar & Restaurant, or venture out to the laid-back Darwin Waterfront Precinct and Mitchell Street’s bustling nightlife - perhaps sit down for a frothy pint and pub music at Shenannigans or The Tap on Mitchell, or try local craft brews at Six Tanks.\n\nWhen you’re ready for adventure, discover Darwin’s nearby natural wonders including the awe-inspiring Litchfield National Park, home to stunning waterfalls, just over an hour’s drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "H on Mitchell Apartment Hotel",
    "offer_address": "105 Mitchell Street, Darwin City, Northern Territory 0800, Australia",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 209.0,
    "value": 396.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xTDjAAM",
    "hero_image": "https://images.luxuryescapes.com/fds4ntro1utmdz4k0rwn",
    "image_two": "https://images.luxuryescapes.com/pyc92s9w6pvn7pbcvo3",
    "image_three": "https://images.luxuryescapes.com/n5dpoye8e6jfhzkvczp",
    "vendor_name": "DoubleTree by Hilton Hotel Darwin",
    "title": "Darwin DoubleTree by Hilton Family-Friendly Escape with Daily Breakfast & A$50 Dining Credit",
    "description": "Discover Australia’s Top End with a stay at the family-friendly DoubleTree by Hilton Hotel Darwin, perfectly placed for exploring the Northern Territory’s must-see destinations. The hotel is conveniently situated along Darwin Harbour and the Esplanade, so you can enjoy captivating waterfront views, with the best restaurants, bars and shopping at your fingertips. Take things at your own pace or join a day tour to iconic sites like Kakadu National Park, Litchfield National Park, Adelaide River, Katherine and more. \n\nAfter a long, hot day exploring the Top End, what could be better than returning to your hotel and slipping into the generously sized swimming pool? Pair your refreshing dip with an ice-cold beer and alfresco meal at the sun-soaked Poolside Restaurant for the ultimate relaxing evening. Throughout your stay, enjoy trademark DoubleTree by Hilton comfort: from the friendly service to the modern facilities and that signature warm chocolate chip cookie on arrival.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "DoubleTree by Hilton Hotel Darwin SEP21",
    "offer_address": "122 Esplanade, Darwin City NT 0800",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 335.0,
    "value": 658.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nGb8AAE",
    "hero_image": "https://images.luxuryescapes.com/xufgy4sw4tyfnezwyix",
    "image_two": "https://images.luxuryescapes.com/9nfnendd6mrmra4uu75",
    "image_three": "https://images.luxuryescapes.com/p9jhh61nm5vddbdqqrl",
    "vendor_name": "Travelshoot",
    "title": "Darwin: One-Hour Mother's Day Photoshoot for up to Eight People",
    "description": "Give the gift of lifelong memories for Mother's Day and say 'I love you,' with a one-hour professional photoshoot experience with Travelshoot, Australia's leading travel photography experts. You'll have the luxury of deciding where in Darwin you and your family will be photographed - maybe you'd like to get snapped with the wallabies at East Point Reserve, by the mangroves in the George Brown Darwin Botanic Gardens or at one of the city's famous markets. Be guided by your expert photographer on the day, as they capture a series of candid, natural and relaxed moments - including warm smiles and tender hugs shared between you and your loved ones.\n\nThis experience's great strength is its flexibility - bring up to eight guests, including infants and children of all ages, and decide on a time and place that suits you. You'll receive 30 edited digital images within seven days of your photoshoot; your captured memories to print, frame and hang.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Travelshoot Darwin",
    "offer_address": "Darwin",
    "percentage_discount": 20.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 271.0,
    "value": 339.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JGCTIA4",
    "hero_image": "https://images.luxuryescapes.com/4z07ubsyuhlfbh5qugtl",
    "image_two": "https://images.luxuryescapes.com/hefwpnr5whhsfjplohd",
    "image_three": "https://images.luxuryescapes.com/x8itybzkgele5kg9hnrw",
    "vendor_name": "Adina Apartment Hotel Darwin Waterfront",
    "title": "Darwin Waterfront Apartment-Style Escape with Daily Breakfast & Nightly Cocktails",
    "description": "Stay at the gateway to Australia's Top End at this waterfront hotel, perfectly positioned along the promenade with vibrant restaurants and popular city sights at your fingertips. The hotel's studios and apartments ensure a home-away-from-home feel, coupled with the excitement of exploring a new city.\n\nFind yourself moments from top attractions including Crocosaurus Cove, Bicentennial Park, Deckchair Cinema, Museum and Art Gallery of the Northern Territory and, of course, the vibrant waterfront precinct.\n\nBetween exploring Darwin and its surroundings, enjoy a meal at the onsite Curve Restaurant and Bar, where Australian cuisine is shown off with a modern twist, or cool off with a dip in the expansive lagoon pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Adina Apartment Hotel Darwin Waterfront",
    "offer_address": "7 Kitchener Drive, Darwin City, Northern Territory 0800, Australia",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 249.0,
    "value": 468.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C3XahAAF",
    "hero_image": "https://images.luxuryescapes.com/cm4kzh8pzb93l0t6xgkl",
    "image_two": "https://images.luxuryescapes.com/wilycojvrcaerxo0p0bj",
    "image_three": "https://images.luxuryescapes.com/wwxyq6o7aq1vybspaueg",
    "vendor_name": "Adina Apartment Hotel Darwin Waterfront",
    "title": "Darwin Studio Apartment Stay along the Waterfront with Daily Breakfast & Late Checkout",
    "description": "Stay at the gateway to Australia's Top End at Adina Apartment Hotel Darwin Waterfront, perfectly positioned along the capital's promenade with vibrant restaurants and popular city sights at your fingertips. The hotel's studios and apartments ensure a home-away-from-home feel, coupled with the excitement of exploring a new city. Find yourself just moments from the city’s best attractions, including Crocosaurus Cove, Bicentennial Park, the iconic Deckchair Cinema, Museum and Art Gallery of the Northern Territory and the waterfront precinct.\n\nBetween exploring Darwin and its surrounds, enjoy a meal at the onsite Curve Restaurant and Bar or cool off with a dip in the pool. Then, recharge in your stylish studio or step onto your private balcony to embrace the tropical breeze.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Adina Apartment Hotel Darwin Waterfront",
    "offer_address": "7 Kitchener Drive, Darwin City, Northern Territory 0800, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 11,
    "price": 267.0,
    "value": 531.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcxWBAAZ",
    "hero_image": "https://images.luxuryescapes.com/ant6xhz1bq3ft20vnv4",
    "image_two": "https://images.luxuryescapes.com/s8esf9qmzrrmp2uu8zd6",
    "image_three": "https://images.luxuryescapes.com/p8p7pz6m1nmmrngfemjo",
    "vendor_name": "Ramada Suites by Wyndham Zen Quarter Darwin",
    "title": "Darwin Apartment Stay near Waterfront Precinct with Daily Breakfast",
    "description": "With spectacular sunsets, fascinating history and culture, exceptional museums and a bourgeoning culinary scene, the Northern Territory's tropical capital is your gateway to endless wonders. Make the most of every moment in the Top End with a stylish stay at Ramada Suites by Wyndham Zen Quarter Darwin. Find yourself just moments from the city’s best attractions, including Crocosaurus Cove, Bicentennial Park, the iconic Deckchair Cinema, Museum and Art Gallery of the Northern Territory and the waterfront precinct. Then, recharge in your stylish apartment with kitchen and laundry facilities or step onto your private balcony to embrace the sea breeze. To round out the day, take a refreshing dip in the infinity pool overlooking the shimmering harbour or relax at the rooftop bar and enjoy a drink overlooking the water.\n\nBeyond the city grid, be drawn to the otherworldly landscapes of Kakadu or Litchfield National Park, be amazed by the mighty crocodiles that call the Adelaide River home, or take a trip to the Tiwi Islands and find out why they're known as the ‘Islands of Smiles’.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Ramada Suites by Wyndham Zen Quarter Darwin",
    "offer_address": "6 Carey Street, Darwin 0800, Northern Territory, Australia",
    "percentage_discount": 33.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 301.0,
    "value": 446.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IeGAUAA3",
    "hero_image": "https://images.luxuryescapes.com/hxc3q15877g9h4uws3w",
    "image_two": "https://images.luxuryescapes.com/spqawi29hsetrwmvy8il",
    "image_three": "https://images.luxuryescapes.com/snkdontl84350521hu1",
    "vendor_name": "Hilton Darwin",
    "title": "Newly Renovated Darwin Five-Star Hilton Stay with Harbour Views, Daily Breakfast & Nightly Drinks",
    "description": "World-renowned Hilton hospitality awaits in the heart of Australia's spellbinding Top End. Newly refurbished and brimming with modern Australian charm, Hilton Darwin offers the perfect place to discover the city's laidback spirit, with Bicentennial Park, Crocosaurus Cove and the lagoon at Darwin Waterfront Precinct all within easy reach. Savour lazy afternoons on the hotel's 10th-floor outdoor pool terrace, enjoy cocktails at Palm Court Bar & Lounge or dine at award-winning modern Australian restaurant PepperBerry, boasting a bushland-inspired menu that has earned countless acclaim, including an Australian Good Food Guide Chef's Hat in 2023.\n\nDarwin's a city blessed with proximity to two of the country's most spectacular national parks - discover the region's profound Indigenous history at Litchfield National Park, home to multiple stunning waterfalls, or travel a little further afield to explore the wonders of Kakadu National Park, timeless and spectacular. On your return, you'll be met with signature Hilton service in the heart of paradise.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Hilton Darwin",
    "offer_address": "32 Mitchell St, Darwin City NT 0800, Australia",
    "percentage_discount": 22.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 359.0,
    "value": 462.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ec4lYAAR",
    "hero_image": "https://images.luxuryescapes.com/r6sf46qpbrbe6kjgzzqy",
    "image_two": "https://images.luxuryescapes.com/j9fhnr9ihtl24ehtn5x",
    "image_three": "https://images.luxuryescapes.com/j453s7imvoxd86um8f5",
    "vendor_name": "Courtyard by Marriott Darwin (Formerly The Smith Hotel)",
    "title": "Darwin CBD Haven Minutes from Mindil Beach with Daily Breakfast, Dining Credit & Wine",
    "description": "Experience the best of beachside living at the H on Smith Hotel, a Darwin CBD haven nestled just moments from the Esplanade and the palm-lined shores of Mindil Beach. Savour poolside dining in the sun-kissed ambience of The D Bar & Restaurant, where delectable flavours of locally sourced cuisine are infused with tantalizing Asian influences. The inviting outdoor pool offers a refreshing respite from the tropical Northern Territory heat and days chock-full of adventures, say getting up close and personal with crocodiles at Crocsaurus Cave, home to Australia’s only crocodile dive. \n\nWander along the esplanade to take in the breathtaking beauty of Darwin Harbour and lap up the famous Northern Territory sunset, or set off on a day trip to take in the cascading falls of the lush Litchfield National Park. This laidback destination is the ultimate place to soak in the warmth of the sun and let your worries fade away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Australia",
    "location_description": "The Smith Hotel",
    "offer_address": "81 Smith Street, Darwin 0800, Northern Territory, Australia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 294.0,
    "value": 716.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FOZMUAA5",
    "hero_image": "https://images.luxuryescapes.com/jx05wwzstpuy6xtn4ua",
    "image_two": "https://images.luxuryescapes.com/tpcepdc59kopux3rdzmgk",
    "image_three": "https://images.luxuryescapes.com/obkvgtm8ot9kqazf0f",
    "vendor_name": "Ramada Suites by Wyndham Zen Quarter Darwin",
    "title": "Top-Rated Darwin Apartment Stay near Waterfront Precinct with Rooftop Bar, Daily Breakfast & Guaranteed Upgrade",
    "description": "With spectacular sunsets, fascinating history and culture, exceptional museums and a bourgeoning culinary scene, the Northern Territory's tropical capital is your gateway to endless wonders. Make the most of every moment in the Top End with a stylish stay at Ramada Suites by Wyndham Zen Quarter Darwin - ranked the number 2 hotel in Darwin on Tripadvisor. Find yourself just moments from the city’s best attractions, including Crocosaurus Cove, Bicentennial Park, the iconic Deckchair Cinema, Museum and Art Gallery of the Northern Territory and the waterfront precinct.\n\nBeyond the city grid, be drawn to the otherworldly landscapes of Kakadu or Litchfield National Park, be amazed by the mighty crocodiles that call the Adelaide River home, or take a trip to the Tiwi Islands and find out why they're known as the ‘Islands of Smiles’. Then, recharge in your stylish apartment with kitchen and laundry facilities or step onto your private balcony to embrace the sea breeze. To round out the day, take a refreshing dip in the infinity pool overlooking the shimmering harbour or relax at the rooftop bar and enjoy a drink overlooking the water.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Ramada Suites by Wyndham Zen Quarter Darwin",
    "offer_address": "6 Carey Street, Darwin 0800, Northern Territory, Australia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 269.0,
    "value": 654.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006RIXxAAO",
    "hero_image": "https://images.luxuryescapes.com/xqemre41xkz43wd3g35m",
    "image_two": "https://images.luxuryescapes.com/kt00gt6o16nno32otwem",
    "image_three": "https://images.luxuryescapes.com/55vgp1xt5bhcnfn08ea72",
    "vendor_name": "Mercure Darwin Airport Resort",
    "title": "Tropical Mercure Darwin Private Pool Villas with Gourmet Dining",
    "description": "There's nothing more luxurious than plunging into your own private pool after an adventurous day in the Northern Territory; experience the opulence of your own villa with an indulgent stay at Mercure Darwin Airport Resort, a stylish oasis within easy reach of the Top End's must-see attractions.\n\nThis newly-renovated resort embraces Darwin's cultural heritage and tropical ambience through its Indigenous-inspired design and landscaped gardens, and features first-class facilities including a palm-fringed lagoon pool with a soothing spa and a freshly refurbished poolside bar and bistro offering alfresco dining and refreshing cocktails.\n\nStaying in a secluded villa, complete with your very own pool, let Mercure Darwin Airport Resort be your launchpad for exploring the region's impressive natural wonders, from Litchfield National Park's thundering waterfalls to the sprawling Kakadu outback. Plus, find yourself conveniently located moments from Darwin Airport, just a five-minute walk or a complimentary shuttle away, and a 15-minute drive from the wave pool and waterfront eateries of Darwin CBD.\n\n**Your** **handpicked inclusions:**\n\n- Wake up with daily breakfast for two at Cossie's Poolside Bar and Bistro\n- Celebrate on arrival with a chilled bottle of sparkling wine\n- Indulge with a one-time two-course dinner at Cossie's Poolside Bar and Bistro\n- Feast on a one-time two-course banquet dinner at Loong Fong Seafood Chinese Restaurant\n- Explore the Top End at your own pace with complimentary onsite parking for one vehicle\n- Plan adventurous days in the Top End with complimentary high-speed Wi-Fi\n\n**This deal has NO peak surcharges:** Travel any time for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Mercure Darwin Airport Resort AUG21",
    "offer_address": "1 Sir Norman Brearley Dr, Darwin City, Northern Territory 0812",
    "percentage_discount": 40.0,
    "min_duration": 3,
    "max_duration": 13,
    "price": 743.0,
    "value": 1238.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xOpgAAE",
    "hero_image": "https://images.luxuryescapes.com/kfqnx6gi3ns80qjmvfqp",
    "image_two": "https://images.luxuryescapes.com/1obiqnvkabivw3lfvxb",
    "image_three": "https://images.luxuryescapes.com/7gdu99oq1gqwgikifzs7",
    "vendor_name": "Hilton Darwin",
    "title": "Five-Star Hilton Luxury in the Heart of Darwin with Daily Breakfast & A$50 Dining Credit",
    "description": "Enjoy world-renowned five-star luxury in the heart of the Northern Territory's capital at Hilton Darwin. With Bicentennial Park, Crocosaurus Cove and the beach at Darwin Waterfront Precinct all within easy reach, and the region's Indigenous history within a two-hour drive - Litchfield National Park, with its ancient termite mounds, and the UNESCO World Heritage-listed Kakadu National Park, offering thousands of years old art walks and access to the iconic Yellow Water Billabong - this is the perfect way to experience the city's laidback charm and beyond.\n\nSignature Hilton service awaits: arrive to a warm welcome in the grand lobby and make the most of the onsite five-star facilities. The 10th-floor outdoor pool provides the perfect spot to cool off from the Darwin sun, while the onsite fitness centre will help you stay active. Enjoy a drink at Palm Court Bar & Lounge before dinner at the Gold Plate 2021 award-winning PepperBerry Restaurant - recently awarded 'Restaurant of the Year' in the Northern Territory - where modern Australian cuisine is paired with authentic bush spices. Central, luxurious and elegant, Hilton Darwin provides the ideal base for a Northern Territory city break.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Hilton Darwin SEP21",
    "offer_address": "32 Mitchell St, Darwin City NT 0800",
    "percentage_discount": 36.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 426.0,
    "value": 670.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007ozdzAAA",
    "hero_image": "https://images.luxuryescapes.com/x4wfnaeev4535fnqz8s",
    "image_two": "https://images.luxuryescapes.com/bgi4yckobukyrxdimc",
    "image_three": "https://images.luxuryescapes.com/2vwks4wfoq6cugacfgy3",
    "vendor_name": "DoubleTree by Hilton Hotel Darwin",
    "title": "Darwin DoubleTree by Hilton Escape with Daily Breakfast & A$40 Drinks & Dining Credit",
    "description": "Discover Australia’s Top End with a stay at the family-friendly DoubleTree by Hilton Darwin, perfectly placed for exploring the Northern Territory’s must-see destinations. The hotel is conveniently situated along Darwin Harbour and the Esplanade, so you can enjoy captivating waterfront views, with the best restaurants, bars and shopping within walking distance.\n\nTake things at your own pace or join a day tour to iconic sites like Kakadu National Park, Litchfield National Park, Adelaide River, Katherine and more. After a day exploring the Top End, what could be better than returning to your hotel and slipping into the outdoor swimming pool surrounded by lush tropical gardens? Pair your refreshing dip with an ice-cold beer and alfresco meal at the sun-soaked Poolside Restaurant for the ultimate relaxing evening. Throughout your stay, enjoy trademark DoubleTree by Hilton comfort: from the friendly service to the modern facilities and that signature DoubleTree warm chocolate chip cookie on arrival.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "DoubleTree by Hilton Darwin",
    "offer_address": "122 Esplanade, Darwin City NT 0800",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 247.0,
    "value": 441.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IazAiAAJ",
    "hero_image": "https://images.luxuryescapes.com/v08hefbvgrea1v0ome9v",
    "image_two": "https://images.luxuryescapes.com/m9vhkxcew0atgpz4egf",
    "image_three": "https://images.luxuryescapes.com/lic4nhdzhp1pg1sexnvn",
    "vendor_name": "Courtyard by Marriott Darwin (Formerly The Smith Hotel)",
    "title": "Darwin Haven Minutes from Mindil Beach with Daily Breakfast & Crocodile Tour Upgrade Available",
    "description": "Get set for tranquil living at this Darwin haven, close to the palm-lined shores of Mindil Beach. Indulge in sun-soaked poolside dining at the D Bar & Restaurant, where delectable cuisine sourced locally combines Asian flavours with modern Australian twists. Take a refreshing dip in the outdoor pool before embarking on unforgettable adventures unique to Darwin, such as encountering saltwater crocodiles up close at Crocosaurus Cove, the exclusive destination for crocodile dives in Australia.\n\nSoak up the famous Northern Territory sunset as you wander through the Mindil Beach Markets, or lose yourself on a day trip to the cascading falls of Litchfield National Park. The ultimate place to let your worries fade away, this remarkable destination offers everything from natural beauty to wildlife adventure.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Australia",
    "location_description": "The Smith Hotel",
    "offer_address": "81 Smith Street, Darwin 0800, Northern Territory, Australia",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 269.0,
    "value": 673.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csisNQAQ",
    "hero_image": "https://images.luxuryescapes.com/4mafxlx4ml484sucxsr",
    "image_two": "https://images.luxuryescapes.com/yq0yi9qsu8e4vzah24ep",
    "image_three": "https://images.luxuryescapes.com/m6w02bv68i4s51tb7ibk",
    "vendor_name": "Oaks Darwin Elan Hotel",
    "title": "Modern City Stay in Darwin CBD",
    "description": "Discover Australia’s Top End with a stay at the harbour-view Oaks Elan Darwin, a modern oasis in the heart of the CBD. Your tropical capital city escape includes daily à la carte breakfast, happy hour drinks on your first night, a guaranteed 12pm late check-out and complimentary parking during your stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Oaks Darwin Elan Hotel",
    "offer_address": "31-33 Woods St, Darwin City NT 0800, Australia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 245.0,
    "value": 661.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dZNISQA4",
    "hero_image": "https://images.luxuryescapes.com/ovs532h34bcdwz0j1uf",
    "image_two": "https://images.luxuryescapes.com/877pdsj2oliheaqh6z3cn",
    "image_three": "https://images.luxuryescapes.com/h7hx8nduraeom5unnde",
    "vendor_name": "Mindil Beach Casino Resort (Formerly SkyCity Darwin)",
    "title": "Tropical City Break in Darwin’s Premier Resort",
    "description": "Experience Darwin’s only resort and casino, Mindil Beach Casino Resort, a beachside oasis surrounded by lush gardens minutes from the CBD. Discover Australia’s Top End from this premier resort in the capital city and enjoy daily buffet breakfast, a nightly drink per person, AU$100 food and beverage credit to use at any of the resort’s eight dining venues and a guaranteed late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Mindil Beach Casino Resort",
    "offer_address": "Mindil Beach, Gilruth Ave, Darwin City NT 0820, Australia",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 304.0,
    "value": 663.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fl0iBAAR",
    "hero_image": "https://images.luxuryescapes.com/ovquglm088uaumxh456",
    "image_two": "https://images.luxuryescapes.com/awosowbhro2m7tn0izl",
    "image_three": "https://images.luxuryescapes.com/u8pf7rg5499kkdl59w8j",
    "vendor_name": "Adina Apartment Hotel Darwin Waterfront",
    "title": "Stylish Darwin Waterfront Stay with Guaranteed Room Upgrade & Daily Breakfast",
    "description": "Stay at the gateway to Australia's Top End at Adina Apartment Hotel Darwin Waterfront, perfectly positioned along the capital's promenade, with vibrant restaurants and popular city sights at your fingertips. The hotel's studios and apartments ensure a home-away-from-home feel, coupled with the excitement of exploring a new city. Find yourself moments from the city’s best attractions, including Crocosaurus Cove, Bicentennial Park, Deckchair Cinema, Museum and Art Gallery of the Northern Territory and, of course, the waterfront precinct.\n\nBetween exploring Darwin and its surroundings, enjoy a meal at the onsite Curve Restaurant and Bar, where Australian cuisine is shown off with a modern twist, or cool off with a dip in the pool. Then, recharge in your stylish studio or step onto your private balcony to embrace the tropical breeze.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Adina Apartment Hotel Darwin Waterfront",
    "offer_address": "7 Kitchener Drive, Darwin City, Northern Territory 0800, Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 235.0,
    "value": 418.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CMeRSAA1",
    "hero_image": "https://images.luxuryescapes.com/sqg1tbsxjnl1v4s9ssx7",
    "image_two": "https://images.luxuryescapes.com/5tza4bbc4kj2bl16gmwg",
    "image_three": "https://images.luxuryescapes.com/e7f9wqlm5atd82cxdxcl",
    "vendor_name": "Mercure Darwin Airport Resort",
    "title": "Mercure Tropical Escape just 15 Minutes from Darwin CBD with Daily Breakfast",
    "description": "Experience the joy of a relaxing escape after an adventurous day in the Northern Territory at Mercure Darwin Airport Resort, a tropical oasis within easy reach of the Top End's must-see attractions. First-class facilities include a palm-fringed lagoon pool with a soothing spa and a poolside bar and bistro, offering alfresco dining and cocktails. Let Mercure Darwin Airport Resort be your base for exploring the region's impressive natural wonders, from Litchfield National Park's thundering waterfalls to the sprawling Kakadu outback. The resort is conveniently located moments from Darwin Airport (just a five-minute walk or complimentary shuttle ride away), and a 15-minute drive from the waterfront eateries of Darwin CBD.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Mercure Darwin Airport Resort",
    "offer_address": "1 Sir Norman Brearly Dr, Darwin City, Northern Territory 0812 Australia",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 11,
    "price": 259.0,
    "value": 693.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JD5VIAW",
    "hero_image": "https://images.luxuryescapes.com/2jmmwkvv9arnryhgbd",
    "image_two": "https://images.luxuryescapes.com/334wt9ol3ns4ddpdayb3",
    "image_three": "https://images.luxuryescapes.com/ygxhnj6kefen0mtspfli",
    "vendor_name": "H on Mitchell Apartment Hotel",
    "title": "Central Darwin Self-Contained Apartment Escape with Daily Breakfast & A$50 Dining Credit",
    "description": "Elevate your stay in the Top End with a boutique, self-contained apartment in the heart of Darwin's CBD. Whether here for work or play, this modern retreat has everything you need for ultimate relaxation; unwind on a cabana by the newly renovated rooftop pool with sweeping city views, stay active at the fully equipped fitness centre and enjoy the atmosphere at the onsite sports bar.\n\nSavour the flavours of the Northern Territory at the hotel’s onsite venue, Lizards Bar & Restaurant, or venture out to the laid-back Darwin Waterfront Precinct and Mitchell Street's bustling nightlife - perhaps sit down for a frothy pint and pub music at Shenannigans or The Tap on Mitchell, or try local craft brews at Six Tanks.\n\nWhen you’re ready for adventure, discover Darwin's natural wonders, like the awe-inspiring Litchfield National Park, home to stunning waterfalls, just over an hour’s drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "H on Mitchell Apartment Hotel",
    "offer_address": "105 Mitchell Street, Darwin City, Northern Territory 0800, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 219.0,
    "value": 429.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4Tm0AAF",
    "hero_image": "https://images.luxuryescapes.com/g8ul3p631jfo6plsbx8k",
    "image_two": "https://images.luxuryescapes.com/nx8tx395xk35ipvl4w1",
    "image_three": "https://images.luxuryescapes.com/wqzvdm4ciqxxwtd9xom9",
    "vendor_name": "Oaks Darwin Elan Hotel",
    "title": "Contemporary Darwin City Break Overlooking the Harbour with Daily Breakfast",
    "description": "For that perfect Northern Territory escape that's only a stone's throw from Darwin's CBD and waterfront precinct, look no further than Oaks Darwin Elan Hotel, ranked within the top 10% of properties on Tripadvisor. Located just 400 metres from the centre of the city, you're perfectly positioned to explore Darwin's cultural curiosities and outdoor adventures - including Smith Street shopping and dining precinct, Crocosaurus Cove, Bicentennial Park and the Darwin Waterfront Precinct, less than a 15-minute walk away.\n\nFurther afield, discover the UNESCO World Heritage-listed Kakadu National Park and Litchfield National Park, and when you return, enjoy local flavours at The Original Australian Kitchen restaurant or relax with a dip in the outdoor pool, the perfect way to kick back after a day exploring this incredible part of Australia.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Oaks Darwin Elan Hotel",
    "offer_address": "31-33 Woods St, Darwin City NT 0800, Australia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 11,
    "price": 268.0,
    "value": 491.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I1HLIA0",
    "hero_image": "https://images.luxuryescapes.com/a3wjbe34mjil71we3u8f",
    "image_two": "https://images.luxuryescapes.com/h5ua4b9derg3xbbg2lm",
    "image_three": "https://images.luxuryescapes.com/szmg7yntyyvmgrix673n",
    "vendor_name": "DoubleTree by Hilton Hotel Esplanade Darwin",
    "title": "Central Darwin Esplanade Hilton Retreat with Daily Breakfast & Welcome Drinks",
    "description": "Savour the warmth of Australia’s Top End with a central Darwin escape, where beaches, restaurants, cafes and bars are all within easy walking distance. Take a dip in the hotel's sparkling outdoor pool, featuring a waterfall and plenty of sun loungers, then dine alfresco at Aqua restaurant, located beside the pool, for Mediterranean-meets-Australian cuisine.\n\nFor the adventurous, DoubleTree by Hilton Hotel Esplanade Darwin is an ideal base for exploring stunning national parks, including day trips to the awe-inspiring Litchfield National Park and the renowned Kakadu National Park. Enhance your adventure by booking a thrilling crocodile tour to observe these incredible predators in their natural habitat, before returning to rest in your modern abode.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "DoubleTree by Hilton Hotel Esplanade Darwin",
    "offer_address": "116 Esplanade Darwin, Northern Territory 0800, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 249.0,
    "value": 496.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CN7k9AAD",
    "hero_image": "https://images.luxuryescapes.com/935pdbyjwi1ioom3mz0q",
    "image_two": "https://images.luxuryescapes.com/vcvfsnbouunt0zwbqxor",
    "image_three": "https://images.luxuryescapes.com/q44xo2un6voidrfj00vsd",
    "vendor_name": "The Glass House Darwin",
    "title": "Magnificent Architectural Darwin Central Private Home Stay for up to 10 Guests",
    "description": "Embrace top-end luxury and comfort with a private home escape at The Glass House Luxury Residence, a spectacularly sculpted glass retreat perfectly positioned just minutes from the city’s central business district.  Wake each morning to uninterrupted views of the city skyline and the shimmering waters of the Timor Sea before exploring the Northern Territory’s capital’s abundance of world-class museums, national parks, restaurants and bars. With five sprawling bedrooms, multiple outside balconies and living areas and a mirage-like infinity pool, you’ll be all set for the northern escape of a lifetime.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory,",
    "location_description": "The Glass House Luxury Residence",
    "offer_address": "39 Ruddick Circuit Stuart Park, NT 0820",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 2274.0,
    "value": 1.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000daqdIQAQ",
    "hero_image": "https://images.luxuryescapes.com/fwiv65wc2sqtf6y50q9o",
    "image_two": "https://images.luxuryescapes.com/7yer33jfqloloei5zb",
    "image_three": "https://images.luxuryescapes.com/nj5i033uijtjnkao7kra",
    "vendor_name": "Accommodation @ Darwin Waterfront (Saltwater)",
    "title": "Modern Apartment Escape on Darwin's Waterfront",
    "description": "Experience Darwin’s tropical lifestyle from its lively Waterfront Precinct, ideally located just five minutes’ walk from the city centre. Brimming with cafes, restaurants, bars and complete with a free saltwater lagoon pool, this is the place to be in the city, and you will have the chance to stay right in the heart of it at Accommodation @ Darwin Waterfront. Relax after days of exploring in one of the ultra-modern apartments, all complete with balconies, fully equipped kitchens and quality furnishings.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Australia",
    "location_description": "Accommodation @ Darwin Waterfront",
    "offer_address": "19 Kitchener Drive Darwin NT 0800 Australia",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 396.0,
    "value": 1068.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dbiWdQAI",
    "hero_image": "https://images.luxuryescapes.com/8aku1cwek806alzinvk",
    "image_two": "https://images.luxuryescapes.com/gkevij0u6jnhvr1nyqsuf",
    "image_three": "https://images.luxuryescapes.com/i1ob9j0alhrzyorgyjm",
    "vendor_name": "H on Mitchell Apartment Hotel",
    "title": "Stylish Apartment Stay in Darwin’s Thriving Entertainment District",
    "description": "Fast becoming one of Australia’s must-see cities thanks to its tropical climate and cosmopolitan culinary scene, Darwin is your gateway to the awe-inspiring Top End with some of Australia’s greatest attractions, like Kakadu and Litchfield National Park, at its doorstep. Unearth this city on the rise from one of the best addresses in town at H on Mitchell with a stay in a stylish Studio Apartment. Located in Darwin’s entertainment esplanade, H on Mitchell offers easy access to some of Darwin’s most popular bars and restaurants, plus daily à la carte breakfast, a welcome drink each, a two-course dinner and guaranteed 11am late checkout.\n\n**Keen to bring friends or family along?** Up to one child and one infant stay free in a One-Bedroom Apartment, while the Two-Bedroom Apartment is perfect for up to four adults, with the option to add one extra child and infant at no extra cost! (See the 'Fine Print' for details).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "H on Mitchell Apartment Hotel",
    "offer_address": "105 Mitchell St, Darwin City NT 0800, Australia",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 182.0,
    "value": 419.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zIRpAAM",
    "hero_image": "https://images.luxuryescapes.com/f5oglue11gfq8t239wai",
    "image_two": "https://images.luxuryescapes.com/ctu4y10qpc39wyu0mqgv",
    "image_three": "https://images.luxuryescapes.com/liyhfto5gdt6z3itfgfa",
    "vendor_name": "Ramada Suites by Wyndham Zen Quarter Darwin",
    "title": "Top End Apartment Stay at Darwin’s #1 Hotel with Daily Breakfast & Bottle of Wine",
    "description": "Your Top End haven awaits at the award-winning Ramada Suites by Wyndham Zen Quarter Darwin - currently rated Darwin’s number one hotel according to TripAdvisor and a winner in TripAdvisor's 2020 Travellers' Choice Awards. Boasting a prime position 650m from the waterfront beach and wave pool, this seriously stylish apartment hotel offers the ultimate escape for couples and families alike.\n\nFind yourself within the CBD and moments from the region’s best attractions, including Crocosaurus Cove and Darwin Waterfront Precinct. Stay in a sophisticated Executive One-Bedroom Apartment with a spacious balcony boasting city or sunset views and indulge with daily à la carte breakfast, a welcome bottle of wine and a guaranteed 12pm late checkout.\n\n**Travelling as a group or family?** Upgrade to a Two-Bedroom Apartment, valid for four people.\n\n**Sunset Harbour Cruise Upgrade**: For added luxury, upgrade your stay to enjoy a romantic 2.5-hour sunset cruise of Darwin Harbour for two adults.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Ramada Suites by Wyndham Zen Quarter Darwin",
    "offer_address": "6 Carey Street, Darwin 0800, Northern Territory, Australia",
    "percentage_discount": 31.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 214.0,
    "value": 312.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lk3tAAC",
    "hero_image": "https://images.luxuryescapes.com/oo0pt9f8l16vdjfiwr07",
    "image_two": "https://images.luxuryescapes.com/om9kumyfwhe0kra3gzib",
    "image_three": "https://images.luxuryescapes.com/372u946pdm2o9ifjpwco",
    "vendor_name": "Hilton Darwin",
    "title": "Hilton City Stay with Litchfield National Park Waterfall Tour",
    "description": "An unforgettable Darwin discovery awaits you at the Hilton Darwin. Proudly perched in the CBD with enticing harbour views and an incredible position on Darwin’s entertainment esplanade along Mitchell Street, this elegant hotel is your gateway to the thundering waterfalls and ancient rainforest of Litchfield National Park. Your stay includes daily buffet breakfast, a welcome drink per person, free in-room movies, 20% off dining and drinks and guaranteed 1pm late checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin Municipality",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Hilton Darwin - 2020",
    "offer_address": "32 Mitchell St, Darwin City NT 0800",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 435.0,
    "value": 909.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IeWuJAAV",
    "hero_image": "https://images.luxuryescapes.com/rkke878r9nb0ulppiw2h",
    "image_two": "https://images.luxuryescapes.com/xiq8820wgeeo7t7jy3",
    "image_three": "https://images.luxuryescapes.com/2pj7bkt9wgdpolds459",
    "vendor_name": "Hilton Garden Inn Darwin",
    "title": "Newly Refurbished Darwin Waterfront Stay with Daily Breakfast & Nightly Drinks",
    "description": "Discover Australia’s Top End with a stay at this newly refurbished escape, perfectly placed for exploring the Northern Territory’s must-see destinations. Hilton Garden Inn Darwin is conveniently situated along Darwin Harbour and the Esplanade, so you can enjoy captivating waterfront views, with the best restaurants, bars and shopping within walking distance. After exploring, what could be better than returning to your hotel and slipping into the outdoor swimming pool surrounded by lush tropical gardens? Pair your refreshing dip with an ice-cold beer and meal at Together and Co. for the ultimate relaxing evening.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Hilton Garden Inn Darwin",
    "offer_address": "122 Esplanade, Darwin, Northern Territory 0800, Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 269.0,
    "value": 480.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007ozdkAAA",
    "hero_image": "https://images.luxuryescapes.com/mhdu26i3xagnp86zqt6",
    "image_two": "https://images.luxuryescapes.com/p7j3fwnsqta7bwsbifq",
    "image_three": "https://images.luxuryescapes.com/8fnfcqcmbbb9t06tj5j",
    "vendor_name": "Hilton Darwin",
    "title": "Five-Star Hilton Luxury in the Heart of Darwin with Dining Credit & Daily Breakfast",
    "description": "Enjoy world-renowned five-star luxury in the heart of the Northern Territory's capital at Hilton Darwin. With Bicentennial Park, Crocosaurus Cove, and the lagoon at Darwin Waterfront Precinct all within easy reach, this is the perfect way to experience the city's laidback charm. Discover the region's incredible Indigenous history within an 80-minute drive at Litchfield National Park, home to multiple stunning waterfalls, and a little further afield, the UNESCO World Heritage-listed Kakadu National Park, boasting rock art that dates back thousands of years.\n\nSignature Hilton service awaits: arrive to a warm welcome in the grand lobby and make the most of the onsite facilities. The 10th-floor outdoor pool provides the perfect spot to cool off, while the fitness centre will help you stay active. Enjoy a drink at Palm Court Bar & Lounge, before dinner at the Gold Plate 2021 award-winning PepperBerry Restaurant, where modern Australian cuisine is paired with authentic bush spices. Central, luxurious and elegant, Hilton Darwin provides the ideal base for a Northern Territory city break.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Hilton Darwin",
    "offer_address": "32 Mitchell St, Darwin City NT 0800, Australia",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 278.0,
    "value": 435.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000COhN8AAL",
    "hero_image": "https://images.luxuryescapes.com/lunyl6w79npsvzuxdquj",
    "image_two": "https://images.luxuryescapes.com/d4sco9gpsdupniny9rfo",
    "image_three": "https://images.luxuryescapes.com/nf9tienthnpajk2usv6",
    "vendor_name": "Travelodge Resort Darwin",
    "title": "Tropical Oasis in the Heart of Darwin with Daily Breakfast",
    "description": "Experience the magic of Australia’s Top End at Travelodge Resort Darwin. Ideally located in the city centre, this hotel is the perfect place to recalibrate after full days spent exploring - take a short five-minute stroll to Crocosaurus Cove and see some of the largest saltwater crocodiles in Australia, plan a day trip to marvel at the rugged landscapes of Kakadu National Park or wander through shopping and dining options at Darwin Waterfront Precinct. Back at the hotel, the outdoor pool will be a welcome oasis as you wind down for the evening. Treat yourself to dinner at the pool bar, but be sure to make your way to Treetops Restaurant for a delicious breakfast the next morning.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Travelodge Resort Darwin",
    "offer_address": "64 Cavenagh St, Darwin City NT 0800 Australia",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 191.0,
    "value": 335.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dbmeTQAQ",
    "hero_image": "https://images.luxuryescapes.com/7h1ozp05dqdjdcezw7mg",
    "image_two": "https://images.luxuryescapes.com/4l0czmwt3436igm29v6",
    "image_three": "https://images.luxuryescapes.com/tmg6g1nkzcu5u0fa07f",
    "vendor_name": "Courtyard by Marriott Darwin (Formerly The Smith Hotel)",
    "title": "Top End City Break with Gourmet Inclusions and Bottle of Wine",
    "description": "The Top End delivers a city break with a difference at H on Smith Hotel in Darwin, providing the ultimate gateway for impressive national parks with plenty to do in town as well. With a CBD stay at the centrally located H on Smith Hotel, you can swim with crocodiles at Crocosaurus Cave, catch the sunset over the Timor Sea and discover the thriving nightlife on Mitchell Street. Toast to your Northern Territory escape with a bottle of wine in-room on arrival, daily continental buffet breakfast, an entrée each at D Bar & Restaurant and guaranteed 11am late checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "H on Smith Hotel",
    "offer_address": "81 Smith Street, Darwin, Northern Territory 0800, Australia",
    "percentage_discount": 29.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 225.0,
    "value": 318.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DILuPAAX",
    "hero_image": "https://images.luxuryescapes.com/4bbjrs9qil8i5gixgzc",
    "image_two": "https://images.luxuryescapes.com/due0e01cdbiyqkkha3x",
    "image_three": "https://images.luxuryescapes.com/kblankmc9tmpw7ycm",
    "vendor_name": "Mercure Darwin Airport Resort",
    "title": "Darwin Mercure Tropical Private Pool Villas with Daily Breakfast & Resort Credit",
    "description": "Experience the joy of a relaxing escape after an adventurous day in the Northern Territory at Mercure Darwin Airport Resort, a tropical oasis within easy reach of the Top End's must-see attractions. First-class facilities include a palm-fringed lagoon pool with a soothing spa and a poolside bar and bistro, offering alfresco dining and cocktails. Let Mercure Darwin Airport Resort be your base for exploring the region's impressive natural wonders, from Litchfield National Park's thundering waterfalls to the sprawling Kakadu outback. The resort is conveniently located moments from Darwin Airport (just a five-minute walk or complimentary shuttle ride away), and a 15-minute drive from the waterfront eateries of Darwin CBD.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Mercure Darwin Airport Resort",
    "offer_address": "1 Sir Norman Brearly Dr, Darwin City, Northern Territory 0812 Australia",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 532.0,
    "value": 934.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oo6KAAQ",
    "hero_image": "https://images.luxuryescapes.com/4qi9sjxdatnd8hs6jbd",
    "image_two": "https://images.luxuryescapes.com/9tyl86lt64hzy1306k",
    "image_three": "https://images.luxuryescapes.com/zlz0kjovkje93s7bfrk",
    "vendor_name": "Mercure Darwin Airport Resort",
    "title": "Darwin Mercure Tropical Private Pool Villas with Two-Course Dinner & Daily Breakfast",
    "description": "There's nothing better than plunging into your own private pool after an adventurous day in the Northern Territory. Experience the joy of having your own private pool villa with a stay at Mercure Darwin Airport Resort, a stylish oasis within easy reach of the Top End's must-see attractions. \n\nThe resort embraces Darwin's cultural heritage and tropical ambience through its Indigenous-inspired design and landscaped gardens. First-class facilities include a palm-fringed lagoon pool with a soothing spa, and a freshly refurbished poolside bar and bistro, offering alfresco dining and cocktails. Let Mercure Darwin Airport Resort be your base for exploring the region's impressive natural wonders, from Litchfield National Park's thundering waterfalls to the sprawling Kakadu outback. The resort is conveniently located moments from Darwin Airport (just a five-minute walk or complimentary shuttle ride away), and a 15-minute drive from the wave pool and waterfront eateries of Darwin CBD.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Mercure Darwin Airport Resort",
    "offer_address": "1 Sir Norman Brearly Dr, Darwin City, Northern Territory 0812 Australia",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 503.0,
    "value": 975.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UyJBEQA3",
    "hero_image": "https://images.luxuryescapes.com/tcm9pt3jnz3sxely4rkx",
    "image_two": "https://images.luxuryescapes.com/jh9ysfiefejeodfdbozf",
    "image_three": "https://images.luxuryescapes.com/jjavvxr2gtotciho5ldi",
    "vendor_name": "Hilton Darwin",
    "title": "Hilton Stay in the Heart of the City with Daily Breakfast, Dining Credit & More",
    "description": "Discover tropical Darwin - the gateway to Kakadu National Park - and the Northern Territory with a stay at the harbour-view Hilton Darwin. Includes an unforgettable tour of either Kakadu National Park or a Katherine Gorge Cruise and Edith Falls tour, daily buffet breakfast, a welcome drink each (beer, wine or spirits), guaranteed late checkout until 1pm, an AU$25 food and beverage credit and two complimentary in-house movies.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin Municipality",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Hilton Darwin Feb 2018",
    "offer_address": "32 Mitchell St, Darwin City NT 0800",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 279.0,
    "value": 705.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007nQviAAE",
    "hero_image": "https://images.luxuryescapes.com/2qhrt0z0zokofx0tpgpk",
    "image_two": "https://images.luxuryescapes.com/zq48uz6jw8qknaogz4gph",
    "image_three": "https://images.luxuryescapes.com/1tmliv65ncj39uilw2h5",
    "vendor_name": "Ramada Suites by Wyndham Zen Quarter Darwin",
    "title": "Top-Rated Central Darwin Self-Contained Apartments with Infinity Pool",
    "description": "For a perfect city escape that's only a stone's throw from Darwin's CBD and waterfront precinct, look no further than Ramada Suites by Wyndham Zen Quarter Darwin, ranked within the top 10% of properties on Tripadvisor. Located just 550 metres from the centre of the city, you're perfectly positioned to explore Darwin's cultural curiosities and outdoor adventures - including Crocosaurus Cove, home to the world’s largest display of Australian reptiles, less than a 15-minute walk away. Further afield, discover the UNESCO World Heritage-listed Kakadu National Park and Litchfield National Park, and when you return, enjoy the use of a rooftop café overlooking the leafy streets below, or take a dip in the 28-metre infinity pool, the perfect way to relax after a day exploring this incredible part of the world.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Ramada Suites by Wyndham Zen Quarter Darwin",
    "offer_address": "6 Carey Street, Darwin 0800, Northern Territory, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 15,
    "price": 83.0,
    "value": 83.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006Pm6VAAS",
    "hero_image": "https://images.luxuryescapes.com/b9vhuq4aq3q7dsuimn6",
    "image_two": "https://images.luxuryescapes.com/2j5ghpde6sm1jfzb88k",
    "image_three": "https://images.luxuryescapes.com/0ayvsf4c1tpvevyjxuwc",
    "vendor_name": "Argus Apartments",
    "title": "Darwin Spacious Self-Contained Apartments Minutes from Waterfront Precinct",
    "description": "In the heart of Australia’s tropical capital city is where you will find the luxurious and spacious Argus Apartments, Darwin - perfectly located moments from Darwin Waterfront Precinct, the bustling foodie haven of Mitchell Street, and the city’s unmissable attractions. Be sure to grab a bite at one of the many exceptional Asian-influenced restaurants and cafés, venture to Mindil Beach Sunset Markets, or visit the many museums and galleries, and delve deeper into Aboriginal culture, history, and traditions. Leave it all behind for the day and explore Litchfield National Park’s magnetic termite mounds, thundering waterfalls, monsoon rainforests, and historic sacred sites.\n\nAfter a day of exploration, take a refreshing dip in the property’s outdoor pool or unwind in your self-contained apartment. Apartments offer a full kitchen with modern appliances, artwork from local creators, comfortable furnishings, and a generous balcony for alfresco dining - perfect for couples, groups, or families seeking an escape in the Top End.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Argus Apartments",
    "offer_address": "6 Cardona Ct, Darwin City NT 0800",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 304.0,
    "value": 304.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008fSM6AAM",
    "hero_image": "https://images.luxuryescapes.com/lq2yx35ug4fvfknmxnqp",
    "image_two": "https://images.luxuryescapes.com/dp1i9s9qu2ijb8z4lcm",
    "image_three": "https://images.luxuryescapes.com/dl2mc2w6jfuls8pfm3p",
    "vendor_name": "Ramada Suites by Wyndham Zen Quarter Darwin",
    "title": "Top-Rated Central Darwin Self-Contained Apartments",
    "description": "For a perfect city escape that's only a stone's throw from Darwin's CBD and waterfront precinct, look no further than Ramada Suites by Wyndham Zen Quarter Darwin, ranked within the top 10% of properties on Tripadvisor.\n\nLocated just 550 metres from the centre of the city, you're perfectly positioned to explore Darwin's cultural curiosities and outdoor adventures - including Crocosaurus Cove, home to the world’s largest display of Australian reptiles, less than a 15-minute walk away. Further afield, discover the UNESCO World Heritage-listed Kakadu National Park and Litchfield National Park, and when you return, enjoy the use of a rooftop café overlooking the leafy streets below, or take a dip in the 28-metre saltwater infinity pool, the perfect way to relax after a day exploring this incredible part of the world.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Ramada Suites by Wyndham Zen Quarter Darwin",
    "offer_address": "6 Carey Street, Darwin 0800, Northern Territory, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 95.0,
    "value": 95.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DMhgAAG",
    "hero_image": "https://images.luxuryescapes.com/nei9o2g03npqa7bhhe4m",
    "image_two": "https://images.luxuryescapes.com/b3cdrll1ej9ktqu0pxz",
    "image_three": "https://images.luxuryescapes.com/tq7c4fuemnu0craz5e",
    "vendor_name": "Adina Apartment Hotel Darwin Waterfront",
    "title": "Darwin Studio Apartment Stay Along the Waterfront",
    "description": "Stay at the gateway to Australia's Top End at Adina Apartment Hotel Darwin Waterfront, perfectly positioned along the capital's promenade with vibrant restaurants and popular city sights at your fingertips. The hotel's studios and apartments ensure a home-away-from-home feel, coupled with the excitement of exploring a new city. Between exploring Darwin and its surrounds, enjoy a meal at the onsite Curve Restaurant and Bar or cool off with a dip in the pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Adina Apartment Hotel Darwin Waterfront",
    "offer_address": "7 Kitchener Drive, Darwin City, Northern Territory 0800, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 130.0,
    "value": 130.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTkfAAG",
    "hero_image": "https://images.luxuryescapes.com/6gagyr9d6osvn54gorm",
    "image_two": "https://images.luxuryescapes.com/51eg8eji18hoho47ps1a",
    "image_three": "https://images.luxuryescapes.com/z48ev76gcnp2r08iysdr",
    "vendor_name": "Oaks Darwin Elan Hotel",
    "title": "Contemporary Darwin City Break Overlooking the Harbour",
    "description": "For a city escape that's only a stone's throw from Darwin's CBD and waterfront precinct, look no further than Oaks Darwin Elan Hotel. The contemporary hotel is perfectly positioned to explore Darwin's dining, entertaining and shopping hubs, sitting near Crocosaurus Cove and Smith Street Mall. After a day of discovering the Territory, sample local flavours at The O.A.K Restaurant or relax with a dip in the outdoor pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Australia",
    "location_description": "Oaks Elan Darwin Hotel",
    "offer_address": "31-33 Woods St, Darwin NT 0800, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 92.0,
    "value": 92.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2vzIAC",
    "hero_image": "https://images.luxuryescapes.com/bz9hukg5jpa309o6hh2u",
    "image_two": "https://images.luxuryescapes.com/jmu7e9qeskxinf50sbo8",
    "image_three": "https://images.luxuryescapes.com/sl1op4m0ihjx3bjhcr2",
    "vendor_name": "Mercure Darwin Airport Resort",
    "title": "Tropical Darwin Escape Near the Airport with Lagoon-Style Pool & Poolside Restaurant",
    "description": "Lose yourself in the tropical allure of Australia's Top End with a stay at this delightful resort. Just moments from Darwin International Airport, this modern oasis is your gateway to the region's rich Indigenous heritage, stunning national parks and vibrant food scene. Sit back and enjoy the tropical landscaping, take a dip in the lagoon-style pool, or tuck into the Territory's famous barramundi at Cossies Poolside Bar and Bistro.\n\nWhen it's time to explore, the city centre of Darwin is just 15 minutes away. Head to the bustling Mindil Beach Sunset Market, savour fresh seafood at the waterfront precinct or marvel at the region's unique wildlife at Crocosaurus Cove.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Mercure Darwin Airport Resort",
    "offer_address": "1 Sir Norman Brearley Drive, Darwin, Northern Territory 0812, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 90.0,
    "value": 90.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HkRaIAK",
    "hero_image": "https://images.luxuryescapes.com/iseiqs7nlbko0i8uoqwe",
    "image_two": "https://images.luxuryescapes.com/rf3viwl7b8vgbqqi51me",
    "image_three": "https://images.luxuryescapes.com/l57xna9zjamio5orry9",
    "vendor_name": "H on Mitchell Apartment Hotel",
    "title": "Contemporary Darwin City Self-Contained Stay with Rooftop Pool, Restaurant & Bar",
    "description": "Experience the vibrancy of Darwin from this contemporary self-contained stay. Located in the heart of the city, this modern retreat offers a rooftop pool with city views, a fully equipped gym and an onsite sports bar.\n\nSavour the flavours of the Northern Territory at the hotel's restaurant, Lizards Bar and Restaurant, or venture out to explore the bustling Mitchell Street, lined with bars, eateries and shops. When you're ready for adventure, the stunning Litchfield National Park is just over an hour's drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "H on Mitchell Apartment Hotel",
    "offer_address": "105 Mitchell Street, Darwin City, Northern Territory 0800, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 72.0,
    "value": 72.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BeLivAAF",
    "hero_image": "https://images.luxuryescapes.com/7yqeg9a23a7rcp5b6us6",
    "image_two": "https://images.luxuryescapes.com/zonw41v7wak6nu2jejba",
    "image_three": "https://images.luxuryescapes.com/13tj4ic8ugcs4lqbpdou",
    "vendor_name": "Rydges Darwin Central",
    "title": "Modern Retreat in Heart of Darwin CBD near Harbour Esplanade",
    "description": "Experience a vibrant mix of coastal and city life at the relaxed Rydges Darwin Central, perfectly positioned in the heart of the CBD. Only a short distance from the palm-fringed harbour esplanade, the hotel is conveniently located among local waterfront attractions and opposite boutique stores - the ideal launchpad for a sunny Darwin escape. Venture out to explore historic monuments and WWII sites, or take a day trip to Litchfield or Kakadu National Parks, just a few hours away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Australia",
    "location_description": "Rydges Darwin Central",
    "offer_address": "21 Knuckey Street, Darwin, Northern Territory 0801, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 73.0,
    "value": 73.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2xoIAC",
    "hero_image": "https://images.luxuryescapes.com/ltcws9cy8vzhqw3d5rlb",
    "image_two": "https://images.luxuryescapes.com/3njkgaes1utv4hodsxg",
    "image_three": "https://images.luxuryescapes.com/0veg23fehc61a0g4fzzl",
    "vendor_name": "Novotel Darwin Airport",
    "title": "Convenient Darwin Airport Stay 15 Minutes from CBD with Three Restaurants & Swimming Pool",
    "description": "Discover a new standard of airport accommodation at Novotel Darwin Airport. Unwind by the outdoor lap pool, savour delicious all-day dining at Splash Cafe, or toast to your travels at the stylish Cossie's Poolside Bar and Bistro.\n\nLocated a short drive from Darwin CBD, this hotel is an ideal launchpad for the famous Mindil Beach Sunset Markets or the natural wonders of Berry Springs. Business travellers appreciate close acess to business districts, while leisure guests can discover nearby shopping at Casuarina Square.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Novotel Darwin Airport",
    "offer_address": "2 Sir Norman Brearley Drive, Darwin, Northern Territory 0812, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 90.0,
    "value": 90.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JReuuAAD",
    "hero_image": "https://images.luxuryescapes.com/fp9qblridohmahc4ueg",
    "image_two": "https://images.luxuryescapes.com/mdpmgvm5wtv0de9u0zf",
    "image_three": "https://images.luxuryescapes.com/lsek6ty3rf76175xgxle",
    "vendor_name": "Mantra Pandanas",
    "title": "Contemporary Central Darwin City Stay with Onsite Restaurant",
    "description": "Experience the tropical allure of Darwin with a stay in the city centre, just minutes from the bustling waterfront precinct, the Esplanade and some of the Northern Territory's most sensational beaches. This modern retreat offers panoramic views of the ocean and city skyline, depending on which room, studio, or apartment you book. \n\nSpend your days exploring the pristine national parks, before heading to Mindil Beach in the evening to catch the sunset and lively night markets.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Australia",
    "location_description": "Mantra Pandanas Darwin",
    "offer_address": "43 Knuckey Street, Darwin, Northern Territory 800, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 81.0,
    "value": 81.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JReupAAD",
    "hero_image": "https://images.luxuryescapes.com/dbrqgj25de6xqcqu2pva",
    "image_two": "https://images.luxuryescapes.com/msxvx36dcke517wp3r",
    "image_three": "https://images.luxuryescapes.com/x9y9tweyt64qzid48qwsv",
    "vendor_name": "Mantra on the Esplanade",
    "title": "Waterfront Escape in Heart of Darwin with Harbour Views & Outdoor Pool",
    "description": "Immerse yourself in the vibrant heart of Darwin with a stay at this convenient waterfront property with stunning views. This urban retreat offers panoramic vistas of the harbour, and is close to the city's shopping precinct and the historic Stokes Hill Wharf. Sample regional flavours with restaurants and cafes at your doorstep and take a relaxed stroll to nearby Mindil Beach Sunset Market. For a touch of history, the Museum and Art Gallery of the Northern Territory is just a short drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Australia",
    "location_description": "Mantra on the Esplanade Darwin",
    "offer_address": "88 The Esplanade, Darwin, Northern Territory 0800, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 92.0,
    "value": 92.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlvqIAC",
    "hero_image": "https://images.luxuryescapes.com/7w6y578hpsljdxb2tyu5",
    "image_two": "https://images.luxuryescapes.com/oxv7fuedsh4a0mllp79x",
    "image_three": "https://images.luxuryescapes.com/arkwi2cmbmn1rgpdu69w",
    "vendor_name": "Novotel Darwin CBD",
    "title": "Waterfront Retreat in Darwin CBD with Outdoor Pool & Onsite Dining",
    "description": "Located in Darwin's dynamic cityscape, this property offers all the comfort you need with the city right on your doorstep. It's a quick wander to the Darwin Waterfront Precint, where you can sip, shop and savour breathtaking views of the Timor Sea. Head to the Darwin Sailing Club, one of the best places in town to watch the sunset while enjoying a cold drink.\n\nRelax in the Novotel Darwin CBD's spacious rooms with modern amenities, including a cool outdoor pool to beat the tropical heat. Whether you’re unwinding after a day of exploring the nearby Mindil Beach Markets or gearing up for an evening of leisure in the CBD, you’ll find everything you need for a memorable stay in the heart of this city.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Darwin",
    "location_heading": "Darwin",
    "location_subheading": "Northern Territory",
    "location_description": "Novotel Darwin CBD",
    "offer_address": "100 The Esplanade, Darwin, Northern Territory 0800, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 85.0,
    "value": 85.0
  }
]