[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4Cx8QAF",
    "hero_image": "https://images.luxuryescapes.com/kg8lz2ldzojgwvdfc8h0",
    "image_two": "https://images.luxuryescapes.com/jujns6py4fop3bvhtl3d",
    "image_three": "https://images.luxuryescapes.com/eqidundzdyk2kycct3vf",
    "vendor_name": "Balgownie Estate Yarra Valley",
    "title": "Luxe Vineyard Stay with Cellar Door Wine Tasting",
    "description": "Experience the tranquility of the Yarra Valley - Victoria’s premier wine region - with a stay at Balgownie Estate. Set amid lush green vineyards, the property boasts a luxe day spa, a stylish cellar door and the gourmet Rae’s Restaurant. Included in your stay is a daily buffet breakfast, a complimentary wine tasting, one beer or wine each, one AU$25 spa voucher each and a leisurely 11am check-out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Yarra Glen",
    "location_heading": "Yarra Valley",
    "location_subheading": "Victoria",
    "location_description": "Balgownie Estate Yarra Valley",
    "offer_address": "1309 Melba Highway, Yarra Valley, Victoria 3775, Australia",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 250.0,
    "value": 394.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CBovAAG",
    "hero_image": "https://images.luxuryescapes.com/z8lng3cmkn7z9wzt52ie",
    "image_two": "https://images.luxuryescapes.com/ntbwv4g6kxi04b2c01pr",
    "image_three": "https://images.luxuryescapes.com/cemqqpn9t33adpuip1xn",
    "vendor_name": "Ultimate Winery Experiences",
    "title": "Yarra Valley: Private Half-Day Winery Experience with Rosé Tasting, De Bortoli Three-Course Lunch with Matched Wines & Transfers",
    "description": "Wind your way through the acclaimed, grapevine-lined Yarra Valley hills and go beyond the usual winery experience with this enthralling tour of two of the region's most iconic cellar doors. Your oenophile-oriented experience will begin at De Bortoli Wines Yarra Valley Cellar Door and Restaurant with a seasonally-inspired chef’s menu to delight any gourmand, featuring a selection of the finest local produce with a glass of wine perfectly matched to each course. Guests are greeted with house-baked bread to set the farm-to-table tone. A three-course lunch follows, with a premium wine matched to your entree and main, before ending with a glass of the internationally-acclaimed Noble One wine served alongside a tempting dessert.\n\nPost lunch, you will be whisked away to Dominique Portet Winery, who have been producing rosé in Australia since 1989, to enjoy a tasting experience that encompasses three different styles - sparkling Brut Rosé, their highly-regarded Fontaine Rosé and a new addition: Single Vineyard Rosé. Enjoy a warm welcome from a Dominique Portet host, who will provide you with an intriguing overview of the winery's history before guiding you through three wines matched with a selection of charcuterie, cheese and rustic baguette for the ultimate pairing experience to write home about.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Yarra Glen",
    "location_heading": "Yarra Valley",
    "location_subheading": "Victoria",
    "location_description": "Ultimate Winery Experiences",
    "offer_address": "Yarra Valley",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 377.0,
    "value": 1.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IE9vVYAT",
    "hero_image": "https://images.luxuryescapes.com/yv6p2kiosmbhocfktbm",
    "image_two": "https://images.luxuryescapes.com/bxy5v682nqjwujpiszl",
    "image_three": "https://images.luxuryescapes.com/y6tjoujx0qgmc1nt9u28",
    "vendor_name": "Balgownie Estate Yarra Valley",
    "title": "Yarra Valley Wine Country Escape with Daily Breakfast, Wine Tasting & A$50 Dining Credit",
    "description": "Tucked away in the heart of Victoria, this resort is a dream destination for wine lovers. Following a comprehensive A$7 million accommodation refurbishment, Balgownie Estate Yarra Valley now offers an elevated experience of luxury and comfort, with indulgent spa treatments and gourmet dining steps away.\n\nFood and wine enthusiasts will be delighted by the resort’s new offerings. Restaurant 1309 is perfect for any time of day, starting with a morning coffee through to a romantic dinner. At the stylish cellar door, you can sample Balgownie's award-winning wines, while the endota spa provides treatments and massages designed to leave you feeling refreshed and rejuvenated.\n\nSet in the stunning Yarra Valley, Balgownie Estate is ideally located to explore one of Australia’s most celebrated wine regions. Whether you’re floating above the valley in a hot air balloon, tasting local cheeses or simply enjoying the serene countryside, the Yarra Valley is yours to explore, with Balgownie Estate as the perfect retreat at its heart.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Yarra Glen",
    "location_heading": "Yarra Valley",
    "location_subheading": "Victoria",
    "location_description": "Balgownie Estate Yarra Valley",
    "offer_address": "1309 Melba Highway, Yarra Valley, Victoria 3775, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 259.0,
    "value": 614.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GgzwEAAR",
    "hero_image": "https://images.luxuryescapes.com/vdydvid8jmaqnoubvj",
    "image_two": "https://images.luxuryescapes.com/gg4gcxd5vm36w27md5j4",
    "image_three": "https://images.luxuryescapes.com/xk9ferbuebeuxrabcix2",
    "vendor_name": "Yarra Valley Lodge",
    "title": "Serene Yarra Valley Retreat Overlooking Championship Golf Course with Daily Breakfast & Nightly Drinks",
    "description": "It’s no secret that Victoria's Yarra Valley is teeming with treasures, and one of the best hidden gems is just waiting to be uncovered. Set within the Heritage Golf & Country Club, prepare to feel instantly at ease within the contemporary rooms or suites of Yarra Valley Lodge, with each carefully designed to reflect the beauty of the surrounding vineyards. Relax with a glass of wine in hand at the sophisticated onsite eatery, Bella Restaurant and enjoy a farm-to-table dinner served with the freshest seasonal ingredients, or practice your swing and putt on the Jack Nicklaus-designed, St. John golf course.\n\nBeyond the lodge, there’s no shortage of exceptional wineries, distilleries, boutique shops, galleries and national parks to keep you entertained. Close by, guests can trace nature trails along Mount Lofty and the Yarra River, visit the renowned Four Pillars Gin Distillery or give in to a day of pampering at Heritage Day Spa, located just a moment's walk away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Yarra Valley",
    "location_subheading": "Victoria",
    "location_description": "Yarra Valley Lodge",
    "offer_address": "2 Heritage Ave, Chirnside Park, Victoria 3116",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 269.0,
    "value": 413.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HglGrYAJ",
    "hero_image": "https://images.luxuryescapes.com/e2ve346dbidvrbcfpla4",
    "image_two": "https://images.luxuryescapes.com/yfmjfjw4jcemh8vgvfr",
    "image_three": "https://images.luxuryescapes.com/alrpr2awqhr4roquql9b",
    "vendor_name": "Chateau Yering Hotel",
    "title": "Heritage-Listed All-Suite Escape in Victoria’s Yarra Valley with Daily Breakfast & Dining Credit",
    "description": "Escape to the wine-filled countryside of the Yarra Valley with a stay at this historic chateau. Ideally located just an hour’s drive from Melbourne CBD, this is one of Victoria’s best gourmet destinations where food, wine and art are at their finest - and the natural scenery is second to none.\n\nWhile away the day in the cosy library or pop in for a meal at Eleonore’s Restaurant, where French and Australian dishes are served in a grand Victorian-style dining hall. Enjoy a coffee at Sweetwater Café or, should you be visiting on the weekend, book in for traditional high tea, complete with ribbon sandwiches and scones.\n\nSpend a sunny day exploring the heritage-listed gardens designed by Baron von Mueller (also behind Melbourne’s Royal Botanic Gardens), or enjoy a hit of tennis on the pristine courts.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Yarra Valley",
    "location_subheading": "Victoria",
    "location_description": "Chateau Yering Hotel",
    "offer_address": "42 Melba Highway, Yering, Victoria 3770, Australia",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 219.0,
    "value": 479.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002ItYGIA0",
    "hero_image": "https://images.luxuryescapes.com/wi4089odgkaamepgaiqa",
    "image_two": "https://images.luxuryescapes.com/w6fd88l82ljm377xks8",
    "image_three": "https://images.luxuryescapes.com/340v5x28pd67zhmpwoa3",
    "vendor_name": "Balgownie Estate Yarra Valley",
    "title": "Boutique Yarra Valley Vineyard Romance with Daily Breakfast, Wine Tasting & A$100 Resort Credit",
    "description": "Tucked away in the heart of Victoria, this newly renovated resort is a dream destination for wine lovers. Following a comprehensive A$7 million accommodation refurbishment, Balgownie Estate now offers an elevated experience of luxury and comfort, with indulgent spa treatments and gourmet dining steps away.\n\nFood and wine enthusiasts will be delighted by the resort’s offerings. Restaurant 1309 is perfect for everything from a morning coffee to a romantic dinner that will tantalise your taste buds. At the stylish cellar door, you can sample Balgownie's award-winning wines, while the endota spa provides treatments and massages designed to leave you feeling refreshed and rejuvenated.\n\nSet in the stunning Yarra Valley, Balgownie Estate is ideally located to explore one of Australia’s most celebrated wine regions. Whether you’re floating above the valley in a hot air balloon, tasting local cheeses or simply enjoying the serene countryside, the Yarra Valley is yours to explore, with Balgownie Estate as the perfect retreat at its heart.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Yarra Glen",
    "location_heading": "Yarra Valley",
    "location_subheading": "Victoria",
    "location_description": "Balgownie Estate Yarra Valley",
    "offer_address": "1309 Melba Highway, Yarra Valley, Victoria 3775, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 319.0,
    "value": 644.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R8XKcQAN",
    "hero_image": "https://images.luxuryescapes.com/ruv3kpkakplohkdtigu1",
    "image_two": "https://images.luxuryescapes.com/svt1jq4oczogctcmjbu9",
    "image_three": "https://images.luxuryescapes.com/zgwaoqjbad0jlykcvbju",
    "vendor_name": "Yarra Valley Lodge",
    "title": "Yarra Valley Lodge: Food & Wine Escape",
    "description": "Indulge in a heavenly midweek food and wine getaway in Victoria's picturesque Yarra Valley - just 45-minutes' drive from Melbourne. Enjoy two nights Including daily buffet breakfasts, a glass of wine each, a late check-out, a wine tasting, dining discounts and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Yarra Valley",
    "location_subheading": "Australia",
    "location_description": "Yarra Valley Lodge",
    "offer_address": "2 Heritage Ave, Chirnside Park VIC 3116",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 227.0,
    "value": 473.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FitgrAAB",
    "hero_image": "https://images.luxuryescapes.com/7oga620s4pukwhboqeqn",
    "image_two": "https://images.luxuryescapes.com/bomgwpafc99j6fgvsw",
    "image_three": "https://images.luxuryescapes.com/arakgsdbw9bdd2n5q91",
    "vendor_name": "Chateau Yering Hotel",
    "title": "Heritage-Listed Stay in Victoria’s Yarra Valley with Daily Breakfast & A$50 Dining Credit",
    "description": "Escape to the wine-filled countryside of the Yarra Valley with a stay at this elegant historic chateau. Ideally located just an hour’s drive from Melbourne's CBD, this is one of Victoria’s best gourmet destinations where food, wine and art are at their finest - and the natural scenery is second to none.\n\nEmbrace the old-world charm of Chateau Yering Hotel's expansive suites, where Australian and European antiquities and fine art combine with modern facilities for a relaxing stay. Common areas share the same approach - while away the day in the cosy library or pop in for a meal at Eleonore’s, where French and Australian dishes are served in a grand Victorian-style dining hall.\n\nEnjoy a leisurely breakfast at Sweetwater Cafe or, should you be visiting on the weekend, book in for traditional high tea, complete with ribbon sandwiches and sensational scones. Spend a sunny day exploring the heritage-listed gardens designed by Baron von Mueller (also behind Melbourne’s Royal Botanic Gardens), enjoy a hit of tennis on the pristine courts or relax with a dip in the pool.\n\nOccupying an 18th-century Victorian house and gardens, this heritage-listed hotel is perched between vineyards and valleys, offering a charming country retreat just minutes from some of the region’s finest cellar doors. Victoria's oldest vineyard, Yering Station Winery, is located just next door. It’s not all about wine though - the Eastern Golf Club, designed by Greg Norman, is a short drive away, while Healesville Sanctuary is just 20 minutes down the road.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Yarra Valley",
    "location_subheading": "Victoria",
    "location_description": "Chateau Yering Hotel",
    "offer_address": "42 Melba Highway, Yering, Victoria 3770, Australia",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 379.0,
    "value": 578.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JFWcIAO",
    "hero_image": "https://images.luxuryescapes.com/huc7segk9qpa681zezr",
    "image_two": "https://images.luxuryescapes.com/4y9zxzpqnfu9ainl0y9",
    "image_three": "https://images.luxuryescapes.com/z8kra04gbrmriufc5aye",
    "vendor_name": "Yarra Valley Lodge",
    "title": "Serene Yarra Valley Retreat Overlooking Championship Golf Course with Daily Breakfast & Dining Credit",
    "description": "It’s no secret that Victoria's Yarra Valley is teeming with treasures, and one of its best-kept gems is just waiting to be uncovered. Set within the Heritage Golf & Country Club, the contemporary rooms or suites put you instantly at ease, with each carefully designed to reflect the beauty of the surrounding vineyards. Relax with a glass of wine in hand at the sophisticated Bella Restaurant, enjoy all-day dining at the Lodge Bar, or practice your swing on the Jack Nicklaus-designed St. John golf course.\n\nBeyond the lodge, there’s no shortage of exceptional wineries, distilleries, boutique shops, galleries and national parks to keep you entertained. Close by, guests can trace nature trails along Mount Lofty and the Yarra River, visit the renowned Four Pillars Gin Distillery or give in to a day of pampering at the Heritage Retreat & Day Spa.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Yarra Valley",
    "location_subheading": "Victoria",
    "location_description": "Yarra Valley Lodge",
    "offer_address": "2 Heritage Ave, Chirnside Park, Victoria 3116",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 279.0,
    "value": 410.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Uxv4AAC",
    "hero_image": "https://images.luxuryescapes.com/05lxpkimao3frz898hx",
    "image_two": "https://images.luxuryescapes.com/l231g4gd93lp4u0mq19",
    "image_three": "https://images.luxuryescapes.com/c3p02jucijmb4h5admvl",
    "vendor_name": "Chateau Yering Hotel",
    "title": "Yarra Valley Romantic Heritage-Listed Suites",
    "description": "Escape to the wine-filled countryside of the Yarra Valley with a stay at the elegant Chateau Yering Hotel. Occupying an 18th-century Victorian house and gardens, this heritage-listed hotel is perched between vineyards and valleys, offering a charming country retreat just minutes from some of the region’s finest cellar doors. In fact, Victoria's oldest vineyard, Yering Station Winery, is located just next door. It’s not all about wine though - the Eastern Golf Club, designed by Greg Norman, is a short drive away, while Healesville Sanctuary is just 20 minutes down the road.\n\nEmbrace the old-world charm of Chateau Yering's expansive suites, where Australian and European antiquities and fine art combine with modern facilities for a relaxing stay. Common areas share the same approach - while away the day in the cosy library or pop in for a meal at Eleonore’s, where French and Australian dishes are served in a grand Victorian-style dining hall. Enjoy a leisurely breakfast at Sweetwater Cafe or, should you be visiting on the weekend, book in for traditional high tea in the Drawing Room, complete with ribbon sandwiches and sensational scones. Spend a sunny day exploring the heritage-listed gardens, designed by Baron von Mueller, the force behind Melbourne’s Royal Botanic Gardens, or beat the heat with a dip in the petite swimming pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Yarra Valley",
    "location_subheading": "Victoria",
    "location_description": "Chateau Yering Hotel",
    "offer_address": "42 Melba Highway, Yering, Victoria 3770, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 32,
    "price": 273.0,
    "value": 273.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v0oxAAA",
    "hero_image": "https://images.luxuryescapes.com/5jmvyyoi5k50swo2os7n",
    "image_two": "https://images.luxuryescapes.com/yo2caj1tlbb8kgkwora",
    "image_three": "https://images.luxuryescapes.com/iybwx4ro17qnuvbayxg",
    "vendor_name": "Yarra Valley Lodge",
    "title": "Yarra Valley Lodge Retreat Overlooking Championship Golf Course",
    "description": "It’s no secret that the Yarra Valley in Victoria is teeming with treasures, but one of the best hidden gems waiting to be uncovered is Yarra Valley Lodge, set within the Heritage Golf & Country Club. From the moment you arrive, prepare to feel instantly at ease within each of the contemporary rooms or suites, with each one carefully designed to reflect the beauty of the surrounding vineyards. Relax with a glass of wine in hand at the sophisticated onsite eatery, Bella Restaurant and enjoy a farm-to-table dinner served with the freshest seasonal ingredients, or practice your skills on the Jack Nicklaus-designed, St. John golf course. Beyond the lodge, there’s no shortage of exceptional wineries, distilleries, boutique shops, galleries and national parks to keep you entertained.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Yarra Valley",
    "location_subheading": "Victoria",
    "location_description": "Yarra Valley Lodge",
    "offer_address": "2 Heritage Ave, Chirnside Park, Victoria 3116",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 117.0,
    "value": 117.0
  }
]