[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004h7jvAAA",
    "hero_image": "https://images.luxuryescapes.com/xs9zu57zr6fivqd99q0m",
    "image_two": "https://images.luxuryescapes.com/06ve5xmwxiemt24l63ea",
    "image_three": "https://images.luxuryescapes.com/wp0dbecootvqvj9lrxbr",
    "vendor_name": "Miller Apartments Adelaide",
    "title": "Top-Rated Spacious Apartment Stay in the Heart of Adelaide",
    "description": "Not all city escapes are made the same and after an ultra-stylish stay at Miller Apartments Adelaide, you’ll soon discover what an unforgettable urban escape should be. This top-rated property - currently ranked in Adelaide's top five properties on Tripadvisor - is superbly located right in the heart of the action, close to Adelaide Oval and Rundle Mall, making it the perfect base for couples seeking a romantic escape or groups looking to discover the city in style.\n\nSlip into the cosmopolitan rhythm of the capital as you explore the burgeoning small-bar and restaurant scene, roam through exceptional shopping precincts and get a taste for world-class cultural experiences within moments of your doorstep. When you're not discovering the likes of the Art Gallery of South Australia or Adelaide Central Market, recharge at Miller Apartments Adelaide, where you'll find an onsite fitness centre plus complimentary access to a nearby Goodlife Gym and convenient undercover parking for day trips to the Adelaide Hills or the vine-laced Barossa Valley.\n\n**Your handpicked inclusions:**\n\n- Toast your escape with a bottle of sparkling wine on arrival\n- Indulge your sweet side with complimentary welcome chocolates\n- Forget about parking woes with complimentary secure parking for one vehicle\n- Make the most of your stay with late 12pm checkout\n\n**Want to make your stay extra special?** Upgrade to the One-Bedroom Executive Suite or sky-high Two-Bedroom Executive Suite and receive a five-course dinner for two including sparkling wine.\n\n**This deal has NO surcharges:** Travel any time for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide City Council",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Miller Apartments Adelaide MARCH 2021",
    "offer_address": "16 Hindley Street Adelaide SA 5000 Australia",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 15,
    "price": 176.0,
    "value": 318.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CMrl7YAD",
    "hero_image": "https://images.luxuryescapes.com/yq3yvsmxzj4wz6o3des",
    "image_two": "https://images.luxuryescapes.com/oph7hddf7qbwmu7hy8ad",
    "image_three": "https://images.luxuryescapes.com/zvfixpdbbcc4d2gt04x8",
    "vendor_name": "The Playford Adelaide - MGallery",
    "title": "Award-Winning Adelaide Luxury Suites with Daily Breakfast & Nightly Drinks",
    "description": "An escape to South Australia’s beguiling capital beckons with a sophisticated five-star suite stay at the glamorous The Playford Adelaide - MGallery Collection. Inspired by the city's rich artistic heritage, this hotel dazzles with art-nouveau touches, gilded accents and bespoke hospitality unlike anywhere else.\n\nThe facilities are exceptional - savour pared-back European-inspired dishes served with modern flair at Luma Restaurant & Bar (awarded One Chef Hat by The Australian Good Food Guide in 2025) or head to Health Club for a dip in the hotel's magnificent indoor pool.\n\nSurrounded by parks and tree-lined streets, separated from the city by the meandering River Torrens, this glamorous hotel provides the ultimate cosmopolitan lifestyle. Its North Terrace address, moments from Adelaide Oval and Rundle Mall, encourages effortless exploration on foot to discover nearby laneways packed with top-notch eateries and bars, trendy boutiques and must-see galleries housed within spectacular, history-rich buildings.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Playford Adelaide - MGallery Collection",
    "offer_address": "120 North Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 319.0,
    "value": 630.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FC8h8YAD",
    "hero_image": "https://images.luxuryescapes.com/jeaa3xs5fvs6j3ydru0d",
    "image_two": "https://images.luxuryescapes.com/ww50vkrejq9qxk2ooqpv9",
    "image_three": "https://images.luxuryescapes.com/kaw23mkhflwe4hxqoc8n",
    "vendor_name": "The Terrace Hotel, Adelaide",
    "title": "Adelaide Stay near Park Lands with Daily Breakfast & Welcome Drink",
    "description": "Explore the southern edge of Adelaide's CBD at this hotel near the Adelaide Park Lands, offering views of the surrounding greenery, with Mount Lofty's summit and the vineyards of the Adelaide Hills visible in the distance.\n\nStop for a bite to eat at the onsite Terrace Bar & Kitchen and enjoy fresh local produce from the surrounding wine regions before venturing out to explore South Australia’s coastal capital. The city's most popular attractions like the Adelaide Central Market, Rundle Mall and Art Gallery of South Australia are all a short drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Terrace Hotel Adelaide",
    "offer_address": "208 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 179.0,
    "value": 378.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HTnLNYA1",
    "hero_image": "https://images.luxuryescapes.com/kkzjqol3deqcr402zqig",
    "image_two": "https://images.luxuryescapes.com/xtalmj916gy1ximwa92",
    "image_three": "https://images.luxuryescapes.com/7jbzqj28b30gbo8n7tj",
    "vendor_name": "Pullman Adelaide",
    "title": "Adelaide Parkside Luxury near Rundle Mall with Daily Breakfast & Complimentary Parking",
    "description": "Embrace the intoxicating charm of Adelaide and experience one of the city's finest five-star stays at this Pullman jewel, boasting an award-winning brasserie and sleek guestrooms. \n\nThe hotel’s positioning in Hindmarsh Square is exceptional: perfectly poised in Adelaide's trendy East End, this stylish hotel sits moments from city parklands and happening Rundle Street and Ebenezer Place - plus you'll be within easy reach of Adelaide Oval and the famed Adelaide Central Markets. Further afield, you can find yourself sipping wine in the picturesque Barossa Valley, Adelaide Hills or Mclaren Vale wine regions, all less than an hour's drive away.\n\nPart of the acclaimed Pullman Hotels and Resorts collection, Pullman Adelaide offers guests a first-class experience through its state-of-the-art amenities and outstanding service. You can stay active at the 24-hour fitness centre, take a dip in the refreshing indoor pool and unwind with a laze in the sauna. \n\nTreat yourself to the flavours of Europe at PARC Brasserie & Bar, toasting your escape with locally sourced wines and produce showcasing the best of South Australia's culinary delights.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Pullman Adelaide",
    "offer_address": "16 Hindmarsh Square, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 70.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 229.0,
    "value": 766.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcYToAAN",
    "hero_image": "https://images.luxuryescapes.com/edf6eikb5c1ijggvjd",
    "image_two": "https://images.luxuryescapes.com/cf6vat4qin3nazajdm8a",
    "image_three": "https://images.luxuryescapes.com/8u24hoao8bypyddmbw5x",
    "vendor_name": "Oval Hotel",
    "title": "Australia's First Stadium Hotel: Adelaide Oval Historic Stay with Daily Breakfast, Nightly Drinks & Valet Parking",
    "description": "Stay at Australia's first and only stadium hotel, located within the historic Adelaide Oval. The 138-room boutique hotel wraps gently around the eastern façade of the iconic stadium and is just moments from the CBD. Every room frames panoramic views of the Adelaide Parklands, with the formidable Saint Peter's Cathedral to the north and the city skyline and River Torrens to the south. Food and wine are at the very heart of the Oval Hotel offering. Extending across level three of Oval Hotel sits one of Adelaide’s most impressive dining experiences at Bespoke Wine Bar & Kitchen - with sweeping stadium views, a stylish bar and lounge - and a ground-level cafe overlooking the River Torrens' walking trails.\n\nPerfectly positioned just moments from the city's endless urban delights, the hotel's central location lends itself to days spent wandering through Rundle Mall, afternoons admiring ever-changing exhibitions at the acclaimed art galleries and walks along River Torrens. Plus guests enjoy access to integrated facilities across the Adelaide Oval precinct including complimentary entry to Next Gen Lifestyle Club and its extensive gym, pool and spa.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Oval Hotel",
    "offer_address": "King William Road, North Adelaide, South Australia 5006, Australia",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 299.0,
    "value": 654.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IUO5lYAH",
    "hero_image": "https://images.luxuryescapes.com/4m7mgplsbv6sdmvm6nju",
    "image_two": "https://images.luxuryescapes.com/kiap49zn0jh161t4wdfg",
    "image_three": "https://images.luxuryescapes.com/36qqslsp5e9bq13uiwd",
    "vendor_name": "HotelMotel Adelaide",
    "title": "Retro Adelaide South Terrace City Break Overlooking the Park Lands with Daily Breakfast",
    "description": "Stay in this city stay on the leafy fringes of the central Adelaide Park Lands. Adelaide Oval, Rundle Mall and Adelaide Central Market are all within 10 minutes, making this the perfect Adelaide escape. When you're done exploring, find contemporary amenities in your thoughtful and comfortable room.\n\nIn between exploring Australia's festival city and its surrounds, indulge in resort-style comforts at the neighbouring Hotel Alba with shared facilities. Savour Mediterranean flavours at the hotel's coastal-cool ela Restaurant or bathe in the sun-soaked pool. Make ela Bar your first stop before a night out on the town.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "HotelMOTEL Adelaide",
    "offer_address": "216-225 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 151.0,
    "value": 296.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FNGk6AAH",
    "hero_image": "https://images.luxuryescapes.com/2xnjfph023g3dkx71iq",
    "image_two": "https://images.luxuryescapes.com/q3iwslelaallgkwirx1h",
    "image_three": "https://images.luxuryescapes.com/9bk2dt3jj5svmwr7xos",
    "vendor_name": "Nightcap at Watermark Glenelg",
    "title": "Beachside Glenelg Getaway just 20 Minutes from Adelaide with Breakfast Hamper",
    "description": "Immerse yourself in coastal comfort at Nightcap at Watermark Glenelg, a cosy retreat where the sun-soaked shores of the iconic Glenelg beach are just a stone's throw away. Just 20 minutes from Adelaide's CBD, Glenelg feels like a different world, with beachfront dining, palm-lined walkways and a thriving nightlife scene. Spend days splashing in the turquoise waters and making footprints in the sand or exploring the many eateries along the bustling Jetty Road. Afterwards, return to your private abode where convenient amenities create a home-away-from-home experience.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Nightcap at Watermark Glenelg",
    "offer_address": "631 Anzac Highway, Glenelg North 5045, South Australia, Australia",
    "percentage_discount": 7.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 224.0,
    "value": 241.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DP0HsAAL",
    "hero_image": "https://images.luxuryescapes.com/bjxycwepke4yh2rgvc18",
    "image_two": "https://images.luxuryescapes.com/jbzsiv68c813zg8ijoaj",
    "image_three": "https://images.luxuryescapes.com/d8g9a9gzquilp9zsq2c",
    "vendor_name": "Vibe Hotel Adelaide",
    "title": "Last Chance: Grand Opening Vibe Adelaide near Rundle Street Mall with Daily Breakfast & Nightly Drinks",
    "description": "**Exclusive offer:** This is your last chance to book Adelaide's brand-new designer destination and Vibe's first-ever South Australia hotel, complete with an Australian first: a suspended heated pool with a pool deck with a communal plaza. Inside, look up in awe to the eye-catching chandelier above the lobby, illuminated to 'glow' differently over 24 hours, a must-book-in-advance Storehouse Flinders East restaurant and access to the likes of iconic Rundle Street Mall, Adelaide Central Market and Vardon Avenue.\n\nBeyond this newly unvelieved retreat, you'll be within throwing (or sipping distance) of Adelaide's iconic wine regions - just a 30-40-minute drive to the rolling Adelaide Hills - so you can make the most of your city abode and venture out for a tipple or two in the Barossa within an hour.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Vibe Hotel Adelaide",
    "offer_address": "260 Flinders Street, Adelaide 5000, South Australia, Australia",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 255.0,
    "value": 620.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMY5xAAH",
    "hero_image": "https://images.luxuryescapes.com/1lwmii8w6r40nnmk2zn",
    "image_two": "https://images.luxuryescapes.com/uf9qm8513mnmoxo1v6mn",
    "image_three": "https://images.luxuryescapes.com/9j759kpsqa60ux3j6iua",
    "vendor_name": "Frome Apartments",
    "title": "Adelaide East End Apartment Escape near Rundle Mall",
    "description": "Immerse yourself in the heart of Adelaide's cultural precinct with a stay at the central Frome Apartments, located in the city's bustling East End. Find yourself within walking distance to Rundle Street's boutique shopping, the East End's buzzing dining scene, the foodie paradise of the Adelaide Central Markets and the iconic Adelaide Oval, plus the world-renowned wineries of Adelaide Hills are less than 30 minutes away. Catch the city tram to the glistening waters of Glenelg Beach or enjoy your central stay which is ideal for couples wanting to spend quality time together while also enjoying easy access to the best of Adelaide.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Frome Apartments",
    "offer_address": "88 Frome Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 182.0,
    "value": 353.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cpM7cQAE",
    "hero_image": "https://images.luxuryescapes.com/vloju3ivj7roszyjfnc6b",
    "image_two": "https://images.luxuryescapes.com/hcuvla7y8ogby5agr0a8",
    "image_three": "https://images.luxuryescapes.com/s09r3t5eohg22pokkfym",
    "vendor_name": "Avani Adelaide Residences",
    "title": "Grand Opening: Discover Adelaide’s Newest Apartments in the Heart of the City",
    "description": "Experience the brand new Avani Adelaide Residences, ideally located in the heart of the CBD. These ultra-stylish and super spacious apartments are the perfect way to experience South Australia's cosmopolitan capital. Stay in a new One Bedroom Apartment and enjoy a bottle of wine on arrival, complimentary minibar and a guaranteed, leisurely late 12pm checkout. Want to bring family or friends? Two Bedroom Apartment upgrades available.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide City Council",
    "location_heading": "Adelaide",
    "location_subheading": "Australia",
    "location_description": "Avani Adelaide Residences 2019",
    "offer_address": "176 Franklin St, Adelaide SA 5000",
    "percentage_discount": 65.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 184.0,
    "value": 528.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IEHtIAO",
    "hero_image": "https://images.luxuryescapes.com/lk9h532eghpieqzku6c",
    "image_two": "https://images.luxuryescapes.com/7yfegoi099qn17k1jvb",
    "image_three": "https://images.luxuryescapes.com/1068a49rhehtjjigqbiq",
    "vendor_name": "Franklin Apartments",
    "title": "Contemporary Central Adelaide Self-Contained Apartments near Rundle Mall & Adelaide Oval",
    "description": "Find yourself placed in Adelaide's vibrant West End when you stay at this boutique collection of self-contained apartments just minutes from the city's key landmarks. Franklin Apartments offers a home-away-from-home, with fully equipped kitchens, spacious bedrooms and in-room laundries. \n\nAdelaide Oval, Rundle Mall and the buzzing Adelaide Central Market are all within close reach, plus the world-renowned wineries of Adelaide Hills are less than 30 minutes away. This spacious retreat is ideal for families or groups wanting to spend quality time together, with some apartments offering space for up to six guests.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Franklin Apartments",
    "offer_address": "36 Franklin Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 13,
    "price": 185.0,
    "value": 439.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csr6mQAA",
    "hero_image": "https://images.luxuryescapes.com/a2ijx7jgwg0w4ijf8ll",
    "image_two": "https://images.luxuryescapes.com/baznhxf6v4qffqrah9ks",
    "image_three": "https://images.luxuryescapes.com/yx3mee1ajsdif16q6vdl",
    "vendor_name": "Stamford Plaza Adelaide",
    "title": "Five-Star Stamford Style with Classic High Tea Experience",
    "description": "Experience South Australia’s cosmopolitan capital city as you indulge in renowned Stamford luxury in Adelaide's CBD with a stay at Stamford Plaza Adelaide. Let this stylish hotel be your elegant launchpad as you explore the city’s vibrant dining and entertainment scene with the Casino, Adelaide Oval and Festival Centre all within easy walking distance. Be treated to five-star inclusions such as daily buffet breakfast for two, a complimentary bottle of wine in-room upon arrival and a famous Adelaide high tea at Cascades Cocktail Lounge, guaranteed 12pm late checkout and secure complimentary self-parking throughout your stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide City Council",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Stamford Plaza Adelaide- Incorrect- Do not use",
    "offer_address": "150 North Terrace Adelaide SA 5000 Australia",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 247.0,
    "value": 558.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ib2vQAAR",
    "hero_image": "https://images.luxuryescapes.com/ndkwb3mp7izcdk4144",
    "image_two": "https://images.luxuryescapes.com/gwxsvax42syti0oi0du",
    "image_three": "https://images.luxuryescapes.com/0zayd698z8np1qceaobp",
    "vendor_name": "Miller Apartments Adelaide",
    "title": "Contemporary Adelaide Self-Contained Apartment Stay in the Heart of the City",
    "description": "Not all city escapes are made the same and after a stylish stay in these self-contained apartments, you’ll soon discover what an unforgettable Adelaide escape should be. This elegant property is superbly located right in the heart of this laid-back city, close to Adelaide Oval and Rundle Mall, making it the perfect base for couples seeking a romantic escape or groups looking to discover the city in style. Slip into the cosmopolitan rhythm of the capital as you explore the burgeoning small bar and restaurant scene, roam through exceptional shopping precincts and get a taste of world-class cultural experiences.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Miller Apartments Adelaide",
    "offer_address": "16 Hindley Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 179.0,
    "value": 312.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FcK2xAAF",
    "hero_image": "https://images.luxuryescapes.com/eil8i2mtbetlpumfhwv",
    "image_two": "https://images.luxuryescapes.com/nvew0wjvlkrq4t1xxbj",
    "image_three": "https://images.luxuryescapes.com/uxhjjbm8vb2sqmytj2ir",
    "vendor_name": "The Playford Adelaide - MGallery",
    "title": "Grand Reopening: Five-Star Adelaide Suite Escape with A$100 Dining Credit, Daily Breakfast & Nightly Drinks",
    "description": "An escape to South Australia’s beguiling capital beckons with a sophisticated five-star suite stay at the newly refurbished The Playford Adelaide - MGallery. Luxuriate from the moment your experience begins with a guaranteed room upgrade to a New York Style Loft Suite, where art-nouveau touches are complemented by gilded accents. Savour the finest produce at the chef-hatted Luma Restaurant and Bar with A$100 dining credit included in your package and return to toast to your stay with nightly drinks.\n\nSurrounded by parks and tree-lined streets, separated from the city by the meandering River Torrens, this glamorous hotel provides the ultimate cosmopolitan lifestyle. Its North Terrace address, moments from Adelaide Oval and Rundle Mall, encourages effortless exploration on foot to discover nearby laneways packed with top-notch eateries and bars, trendy boutiques and must-see galleries housed within spectacular, history-rich buildings.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Playford Adelaide - MGallery Collection",
    "offer_address": "120 North Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 396.0,
    "value": 772.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I3i1IAC",
    "hero_image": "https://images.luxuryescapes.com/vbykwnocwnskcg1ogo6g",
    "image_two": "https://images.luxuryescapes.com/04ru7isy2xqe4v7bravb",
    "image_three": "https://images.luxuryescapes.com/nemo2tpd4984ryfosf5",
    "vendor_name": "Hotel Indigo Adelaide Markets",
    "title": "Contemporary Cool Adelaide Art Hotel with Rooftop Bar, Daily Breakfast & Nightly Drinks",
    "description": "Elevated above one of Adelaide's hottest cultural hubs, this boutique hotel celebrates the bold eccentricity of the Festival City. Bespoke art and odes to the city's heritage paint every surface, from reimagined 19th-century tessellated floors to custom installations from local contemporary artists.\n\nGastronomy at Hotel Indigo Adelaide Markets is defined by two trendy destinations - the modern Italian Market and Meander bar and eatery, curated by a Michelin-trained executive chef, and a retro-futuristic rooftop bar reminiscent of The Jetsons that overlooks the city skyline.\n\nWhen you aren't admiring glittering views from the heated outdoor pool, take advantage of your location in the bustling Market Precinct by wandering down red brick alleys to trendy bars, microbreweries and iconic sites like Rundle Mall and Chinatown.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Hotel Indigo Adelaide Markets",
    "offer_address": "23-29 Market Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 279.0,
    "value": 531.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gkzZAAQ",
    "hero_image": "https://images.luxuryescapes.com/yg64ynsg4hpfbdaa5hr8",
    "image_two": "https://images.luxuryescapes.com/pvskph0qngettabyl1ob",
    "image_three": "https://images.luxuryescapes.com/z8kzm0v7b4k7iz1hay",
    "vendor_name": "Skyline Restaurant",
    "title": "Adelaide: Three-Course Skyline Restaurant Dining Experience for Two with Bottle of Sparkling Wine",
    "description": "Send your tastebuds into a frenzy, savouring the best bites Adelaide has to offer, with a decadent three-course dinner at Skyline Restaurant. Be rewarded with 360-degree views across the glittering CBD while you dine on innovative dishes that shine a spotlight on South Australia's local produce. The restaurant itself enjoys an enviable location on the top floor of the iconic South Terrace building in Adelaide's CBD. The South Park Lands and rolling terrain of the Adelaide Hills create a stunning backdrop to your memorable meal. The menu is on a constant rotation, changed seasonally to reflect the best local produce available. Mouthwatering meals may include slow-cooked lamb shoulder, melt-in-your-mouth steak, and zesty asparagus and lemon risotto. Pour a fizzing flute of sparkling from your bottle of either Hentley Farm Blanc De Noir or Croser Sparkling and toast to a memorable evening.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Skyline Restaurant",
    "offer_address": "1 South Tce, Adelaide SA 5000",
    "percentage_discount": 54.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 66.0,
    "value": 144.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dp0ehAAB",
    "hero_image": "https://images.luxuryescapes.com/jt3vyfh5by5xn3vmin",
    "image_two": "https://images.luxuryescapes.com/65ol8nas5k1am9a19d5m",
    "image_three": "https://images.luxuryescapes.com/ur33wc96rkpgc3mgcih",
    "vendor_name": "TRYP by Wyndham Pulteney Street Adelaide",
    "title": "Grand Opening: TRYP by Wyndham Adelaide CBD Stay with Daily Breakfast & Nightly Drinks",
    "description": "Be one of the first to experience the contemporary haven that is TRYP by Wyndham Pulteney Street Adelaide, a brand-new city oasis in South Australia's vibrant and multicultural capital. Ideally situated in the heart of the entertainment and shopping district, with Rundle Mall on its doorstep and Adelaide Oval a short walk away, this urban sanctuary invites you to spend your days exploring the city streets, enjoying a picnic in the manicured parklands or sampling a world-renowned tipple at the National Wine Centre. When it's time to venture beyond the city limits, find yourself located less than an hour's drive from the famed Barossa Valley, McLaren Vale and the sun-soaked Glenelg beach.\n\nIn between exploring Australia's festival city and its surrounds, indulge in a blend of signature Wyndham luxury, upscale sophistication and inner-city living. Enjoy a grab-and-go meal at the Z Cafe or rejuvenate body and mind at the fitness centre. Make the Z Bar your first stop before a night out on the town, and return to your tranquil abode which features everything you could need for a relaxing stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "TRYP by Wyndham Pulteney Street Adelaide",
    "offer_address": "266 Pulteney Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 206.0,
    "value": 400.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FlfGXAAZ",
    "hero_image": "https://images.luxuryescapes.com/etnt1up0ko7to8zped5a",
    "image_two": "https://images.luxuryescapes.com/ck7yox9qzekyz9ifmr",
    "image_three": "https://images.luxuryescapes.com/en0euyckr5go0xx5hz",
    "vendor_name": "Peppers Waymouth Hotel",
    "title": "Contemporary Peppers Luxury in the Heart of Adelaide with Daily Breakfast & Nightly Drinks",
    "description": "Discover South Australia’s cosmopolitan capital city as you indulge in quintessential Peppers luxury in the heart of Adelaide's CBD. Let this stylish hotel be your elegant launchpad as you explore the city's vibrant dining scene - why not start at the elegant TUTTO Cucina + Bar, serving up elevated Italian cuisine and located right inside the hotel. Or, if your escape calls for relaxation, retreat to the hotel's inviting heated indoor pool with a spa and sauna for the ultimate Adelaide bliss.\n\nWhether you are a culture vulture, a foodie or a sports lover, Adelaide has it all - and Peppers Waymouth Hotel will take you right to the heart of it. Within walking distance, explore sites such as the Art Gallery of South Australia, or catch a game at Adelaide Oval. Do as the locals do, and head to Peel Street for your cocktail fix or complete your Adelaide trip with a visit to the lush Adelaide Hills: this leafy destination, just an hour’s drive from the city, brims with wineries where you can get cosy with a glass of red.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Peppers Waymouth Hotel",
    "offer_address": "55 Waymouth Street, Adelaide 5000, South Australia, Australia",
    "percentage_discount": 66.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 287.0,
    "value": 840.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTD2AAO",
    "hero_image": "https://images.luxuryescapes.com/3kvd207bekx4zotul5ph",
    "image_two": "https://images.luxuryescapes.com/wqjl54ffqg8ryykg73",
    "image_three": "https://images.luxuryescapes.com/ra12bsyr7gjq5v94bwlw",
    "vendor_name": "Pullman Adelaide",
    "title": "Five-Star Pullman Stay in the Heart of Adelaide CBD with Daily Breakfast",
    "description": "If you’re looking for a sophisticated central Adelaide city stay, look no further than Pullman Adelaide. Perfectly poised in Adelaide's trendy East End, this stylish hotel sits moments from the buzz of the CBD, city parklands, and the bars and boutiques of the eclectic Rundle Street and Ebenezer Place.\n\nThere’s plenty to discover beyond the hotel, but this luxury oasis will entice you to stay and enjoy. Part of the acclaimed Pullman Hotels and Resorts collection, Pullman Adelaide offers guests a first-class experience through its state-of-the-art amenities and outstanding service. Treat yourself to global dining at Salt Restaurant or opt for something more relaxed with a drink at Salt Bar & Lounge. Enjoy the 24-hour fitness centre in addition to the restorative sauna and steam room, or start the day with some lengths in the relaxing 13.5m indoor lap pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Pullman Adelaide",
    "offer_address": "16 Hindmarsh Square, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 263.0,
    "value": 524.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aj8S7QAI",
    "hero_image": "https://images.luxuryescapes.com/wdltucrbd55yrmwfyjgf",
    "image_two": "https://images.luxuryescapes.com/ney8zew064gfxyactnma",
    "image_three": "https://images.luxuryescapes.com/t9y758txw91kqf7pn2v6",
    "vendor_name": "Atura Adelaide Airport",
    "title": "Stylish Stay Next to Adelaide Airport with Buffet Breakfast",
    "description": "Embrace style and convenience during your Adelaide getaway with Atura Adelaide Airport. Featuring a modern atmosphere and free-flowing communal spaces, you’ll be able to relax and rejuvenate while you take in all Adelaide has to offer or prepare for a flight. Stay for one or two nights with daily buffet breakfast and a guaranteed 12pm late checkout included.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Atura Adelaide Airport",
    "offer_address": "1 Atura Circuit Adelaide Airport 5950 South Australia Australia",
    "percentage_discount": 57.0,
    "min_duration": 1,
    "max_duration": 2,
    "price": 87.0,
    "value": 204.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007ozexAAA",
    "hero_image": "https://images.luxuryescapes.com/ts2iby2p66t61pdf7lpq",
    "image_two": "https://images.luxuryescapes.com/sw3vjw1xpeoutlikdxf",
    "image_three": "https://images.luxuryescapes.com/lmn5qvazfbvmthst2f1",
    "vendor_name": "Sofitel Adelaide",
    "title": "Grand Opening: Five-Star Sofitel Adelaide with Daily Breakfast & Room Upgrade",
    "description": "South Australia’s ultra-cool capital has rightfully earned its place as the world’s third most livable city for 2021 - and you're invited to experience it for yourself with a French-inspired twist at the newly-opened Sofitel Adelaide. Its Currie Street address, moments from the River Torrens and Light Square, encourages effortless exploration on foot to discover nearby laneways packed with top-notch eateries and bars, trendy boutiques and must-see galleries housed within spectacular, history-rich buildings. For adventures beyond the urban grid, the world-class wine regions and glorious sandy stretches offer this unmissable destination a change of pace and a different perspective.\n\nRetire to your centrally located sanctuary where no detail has been spared at the end of each day. Each of the rooms offers a contemporary spin on French sophistication in signature Sofitel style, and the exceptional facilities are sure to impress. Get a taste for French fare where South Australian produce plays a leading role at Garçon Bleu, drop into Déjà Vu on the ground floor for a glass of champagne, or gaze across the city as you dive into the lap pool on level five.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Sofitel Adelaide",
    "offer_address": "108 Currie St, Adelaide SA 5000, Australia",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 435.0,
    "value": 791.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070jerAAA",
    "hero_image": "https://images.luxuryescapes.com/55r9t803pgi0oxtjbq4a",
    "image_two": "https://images.luxuryescapes.com/jugsm2fh2l8f35b1bq8d",
    "image_three": "https://images.luxuryescapes.com/ge3lg1j2wjgrkmpsq3yo",
    "vendor_name": "Sofitel Adelaide",
    "title": "Adelaide: Sofitel Two-Course French-Inspired Lunch with Glass of Premium House Wine for Two",
    "description": "Revel in a sensational two-course lunch with one glass of wine and get a taste for modern French-inspired dishes at Garçon Bleu, located within the recently opened five-star Sofitel Adelaide. Step inside this elegant eatery and savour vibrant and contemporary French fare while admiring abstract wall art, plush blue velvet seating, a partially mirrored ceiling and gold accents throughout the restaurant.\n\nEnjoy a gastronomical experience like no other, with a modern Australian twist on dishes with signature French flair. Choose between a selection of appetising dishes glazed duck breast with sauce a l’orange or fillet de boeuf with celeriac and sauce Madère for your first course, while sipping on a glass of a premium house-selected wine. For your second course, choose from a selection of sweet treats, which may include decadent chocolate fondant with cocoa nibs and apple tarte tartin with crème fraîche ice cream to perfectly round out your experience.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Garçon Bleu",
    "offer_address": "Level 9, 108 Currie Street, Adelaide, SA, 5000",
    "percentage_discount": 19.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 118.0,
    "value": 145.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z0k1AAA",
    "hero_image": "https://images.luxuryescapes.com/lojvcexlbyrm7kiul5m",
    "image_two": "https://images.luxuryescapes.com/6v6yrh6o8gyergk107kw",
    "image_three": "https://images.luxuryescapes.com/ldsxq424ssg9y42rit6",
    "vendor_name": "The Playford Adelaide - MGallery",
    "title": "Sophisticated MGallery by Sofitel Adelaide Escape with Daily Breakfast",
    "description": "South Australia’s vibrant capital city is yours to explore from the elegant halls of the five-star The Playford - MGallery by Sofitel, nestled on Adelaide's sought-after North Terrace. Part of the prestigious MGallery Sofitel brand, this beautiful hotel is a boutique city gem blending old-world charm and modern-day comforts in the heart of Adelaide’s cultural precinct. Here, you will have the best of Adelaide at your feet, with elegant rooms fitted with modern luxuries to return to after days spent exploring.\n\nYour stylish escape includes daily breakfast, a welcome drink per person, daily parking and a leisurely 12pm checkout.\n\n**Travelling with kids?** Upgrade to a Twin Queen Room for two adults and two children (aged 11 years and under) with a bonus Playford Feast lunch included.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Playford Adelaide - MGallery Collection",
    "offer_address": "120 North Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 180.0,
    "value": 447.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EgRfAAK",
    "hero_image": "https://images.luxuryescapes.com/m1912062afjn1i8gd7g",
    "image_two": "https://images.luxuryescapes.com/rx3swdhaypi0yqsawff",
    "image_three": "https://images.luxuryescapes.com/vv5lghmptlfsv6gp42kg",
    "vendor_name": "Majestic Roof Garden Hotel",
    "title": "Stylish Adelaide CBD Stay with Daily Breakfast",
    "description": "Boutique style, contemporary elegance and rooftop views await you at the Majestic Roof Garden Hotel. Set in Adelaide’s popular dining and nightlife precinct, the hotel is close to Rundle Mall, Adelaide Zoo, the Art Gallery of South Australia, the Adelaide Oval and Adelaide Central Market. Currently rated in Adelaide’s top 10 hotels on TripAdvisor, this stylish stay is a true hidden gem in the heart of the city. Live a majestic life with a daily in-room continental breakfast platter, a complimentary Negroni cocktail kit in-room on arrival, complimentary car parking and guaranteed 12pm late checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Majestic Roof Garden Hotel",
    "offer_address": "55 Frome Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 227.0,
    "value": 545.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DNeGcYAL",
    "hero_image": "https://images.luxuryescapes.com/lo1509bzq4qd4ks8duvd",
    "image_two": "https://images.luxuryescapes.com/t2xaa481cae29dnahi",
    "image_three": "https://images.luxuryescapes.com/zx2eqkwvsgpd29neme9p",
    "vendor_name": "Majestic Roof Garden Hotel",
    "title": "Adelaide Stay near Rundle Street with Daily Breakfast & Rooftop Garden",
    "description": "Nestled in Adelaide’s vibrant East End, the Majestic Roof Garden Hotel offers an exceptional stay with breathtaking rooftop garden views. On one side, enjoy sweeping vistas of the rolling Adelaide Hills, while the other reveals the twinkling lights of the city’s lively streets. \n\nThe hotel’s Culshaws restaurant celebrates fresh, local produce, complemented by an exclusive wine list featuring selections from renowned regions like the Barossa Valley, McLaren Vale and the Adelaide Hills. \n\nPerfectly located within walking distance of Rundle Mall, Adelaide Zoo, the National Wine Centre, the Art Gallery of South Australia, Adelaide Oval and the Botanic Gardens, the hotel offers easy access to the city’s top attractions.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Majestic Roof Garden Hotel",
    "offer_address": "55 Frome Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 229.0,
    "value": 739.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000d1WYVQA2",
    "hero_image": "https://images.luxuryescapes.com/j62bxvujzng8xa5eggu",
    "image_two": "https://images.luxuryescapes.com/d7cl2svg5honifxl2xn",
    "image_three": "https://images.luxuryescapes.com/6fgjft8ojoc631nyitcj",
    "vendor_name": "Hotel Grand Chancellor Adelaide",
    "title": "Stylish Launchpad in the Heart of Adelaide",
    "description": "Striking the perfect balance between location and refined comfort, the Hotel Grand Chancellor Adelaide is the ideal choice for a romantic weekend escape. Situated in the heart of the CBD and a short stroll from Adelaide’s premier shopping destination and historic Italianate arcades, this stylish launchpad is perfectly placed with the best wining, dining and entertainment the city has to offer at its doorstep. Includes daily buffet breakfast, a welcome drink each, daily parking, Wi-Fi and a lazy 11am late checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Hotel Grand Chancellor Adelaide",
    "offer_address": "65 Hindley St, Adelaide SA 5000",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 219.0,
    "value": 553.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EczAAAS",
    "hero_image": "https://images.luxuryescapes.com/erro6zvr9ktytogaudmk",
    "image_two": "https://images.luxuryescapes.com/ep2m6a8g85wty8qua3q",
    "image_three": "https://images.luxuryescapes.com/bh41otv3ro1uj3lvcjle",
    "vendor_name": "Avani Adelaide Residences",
    "title": "Luxe Adelaide City Escape with Daily Breakfast & Welcome Wine",
    "description": "Treat yourself to a lavish city escape at the glamorous Avani Adelaide Residences, ideally placed in the heart of the CBD. This urban retreat is spectacularly located on bustling Franklin Street, meaning you will be able to walk to cool bars, award-winning restaurants and high-end shops. The world-class Adelaide Oval, Rundle Mall, Adelaide Casino, the 150-year-old South Australian Museum ⁠- home to the largest collection of Indigenous Australian cultural artefacts anywhere in the country ⁠- and Adelaide Zoo are also within easy reach, making this stylish property the perfect base to explore all that this vibrant city offers.\n\nWhen you're ready to relax, retreat to one of the ultra-stylish and expansive rooms and suites, modern spaces boasting uninterrupted views over Adelaide’s skyline as well as the facilities to make your city escape even more unforgettable.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Avani Adelaide Residences",
    "offer_address": "176 Franklin St, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 179.0,
    "value": 444.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biNWcQAM",
    "hero_image": "https://images.luxuryescapes.com/efrwikwgllvr2mkiwcjl",
    "image_two": "https://images.luxuryescapes.com/eyfybulsewqdwfdedggv",
    "image_three": "https://images.luxuryescapes.com/t4znaawg5eisiozufoyk",
    "vendor_name": "Peppers Waymouth Hotel",
    "title": "Peppers Indulgence in the Heart of Adelaide",
    "description": "Discover South Australia’s cosmopolitan capital city as you indulge in quintessential Peppers luxury in the heart of Adelaide's CBD, at Peppers Waymouth Hotel. Let this stylish hotel be your elegant launchpad as you explore the city’s vibrant dining and entertainment scene - all of this as you get pampered with a guaranteed upgrade to a Deluxe Room, decadent daily full hot buffet breakfast, a nightly drink per person, a 15% discount on dinner at the hotel's restaurants and a guaranteed, leisurely late 12pm check out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Peppers Waymouth Hotel",
    "offer_address": "55 Waymouth Street, Adelaide 5000, South Australia, Australia",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 221.0,
    "value": 499.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037JDSAA2",
    "hero_image": "https://images.luxuryescapes.com/7v4skz8ctrgf5q67pac8",
    "image_two": "https://images.luxuryescapes.com/f4orss1kuhz38lcssgb5",
    "image_three": "https://images.luxuryescapes.com/ov96p71mfatuutb69kyi",
    "vendor_name": "Rydges Adelaide",
    "title": "Central City Escape Overlooking Adelaide Park Lands with Daily Breakfast",
    "description": "Bask in the serenity of Adelaide Park Lands with a city escape at the conveniently located Rydges Adelaide. Nestled on the effortlessly urban Southern Terrace, moments from the beautiful Himeji Garden, this stylish city hotel offers an unbeatable location - surrounded by secret bars, fine-dining restaurants and cosy pubs, within walking distance of Adelaide Oval and the lively Adelaide Central Market.\n\nIncluded in your city escape is daily breakfast, one welcome drink per person, A$25 food and drink credit per room to use at the onsite Deck Café and Bar, and guaranteed 2pm late checkout.\n\n**Travelling with family?** Upgrade to the Family Room package for two adults and two children (aged 11 years and under).\n\n**This deal has no surcharges**: Travel anytime - including school holidays - for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Rydges Adelaide",
    "offer_address": "1 South Tce, Adelaide SA 5000",
    "percentage_discount": 65.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 149.0,
    "value": 423.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4TksAAF",
    "hero_image": "https://images.luxuryescapes.com/f5fvd0hzw3peyr9ibw",
    "image_two": "https://images.luxuryescapes.com/c78pt7up46rzmk9r79",
    "image_three": "https://images.luxuryescapes.com/gfsc5xtgyoqztml09ur",
    "vendor_name": "Stamford Plaza Adelaide",
    "title": "Five-Star Stamford Elegance in the Heart of Adelaide with Daily Breakfast",
    "description": "Experience the magic of South Australia’s cosmopolitan capital city as you indulge in renowned Stamford luxury with a stay at Stamford Plaza Adelaide. Let this sophisticated stay be your elegant launchpad as you enjoy the finer things in life, with the best this vibrant city has to offer only a stone's throw away.\n\nAfter a restful night’s sleep and time spent soaking up the spellbinding vistas over the historic Parklands from your modern room, you will be well-placed to take on a day of adventures near and far. From its celebrated casual dining venues to outdoor swimming pool and gymnasium, there is no shortage of adventure to be found in this five-star property. Perfectly placed for those seeking a fun-filled escape, the hotel is within walking distance from Adelaide’s vibrant dining and entertainment scene with the Casino, Adelaide Oval and Festival Centre.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Stamford Plaza Adelaide",
    "offer_address": "150 North Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 295.0,
    "value": 600.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LiwDAAS",
    "hero_image": "https://images.luxuryescapes.com/ve7fueqv3ncellteemye",
    "image_two": "https://images.luxuryescapes.com/r56q17msrnysdptsm3c",
    "image_three": "https://images.luxuryescapes.com/pijbob37apoif0k1lh8o",
    "vendor_name": "Majestic Roof Garden Hotel",
    "title": "Stylish City Stay with Adelaide Hills Rooftop Views",
    "description": "Boutique style, contemporary elegance and rooftop city views await you at the Majestic Roof Garden Hotel Adelaide. Set in Adelaide’s popular dining and nightlife precinct - close to Rundle Mall, Adelaide Zoo, the Art Gallery of South Australia, the Adelaide Oval and Adelaide Central Market. Currently rated in Adelaide’s top 10 hotels on TripAdvisor, this stylish stay is a true hidden gem in the heart of the city. Includes daily buffet breakfast for two, a A$20 drink voucher for Culshaw’s Restaurant, a bottle of South Australian wine on arrival, complimentary valet car parking and guaranteed 12pm late checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Majestic Roof Garden Hotel",
    "offer_address": "55 Frome Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 241.0,
    "value": 606.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BfuolAAB",
    "hero_image": "https://images.luxuryescapes.com/gjcdrlfgk58y47vckmsb",
    "image_two": "https://images.luxuryescapes.com/3g48bi2nhkmivjjtnta",
    "image_three": "https://images.luxuryescapes.com/0txlnddkqrus0zbwcxwa",
    "vendor_name": "Franklin Apartments",
    "title": "Centrally Located Adelaide Apartment Stay near Rundle Mall with Late Checkout & Complimentary Parking",
    "description": "Find yourself placed in Adelaide's vibrant West End when you stay at Franklin Apartments. These self-contained apartments offer a home-away-from-home feeling, with each apartment offering a fully equipped kitchen, spacious bedrooms and in-room laundries. Adelaide Oval, Rundle Mall and the buzzing Adelaide Central Market are all within close reach, plus the world-renowned wineries of Adelaide Hills are less than 30 minutes away. This spacious retreat is ideal for families or groups wanting to spend quality time together while also enjoying easy access to the best Adelaide as to offer.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Franklin Apartments",
    "offer_address": "36 Franklin Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 179.0,
    "value": 359.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HgenIAC",
    "hero_image": "https://images.luxuryescapes.com/6nf6qgjhiqqm8lp4hpu",
    "image_two": "https://images.luxuryescapes.com/yvbsgid6ezuyukwqu4c",
    "image_three": "https://images.luxuryescapes.com/b6gw7grfjjlcbmfzibsm",
    "vendor_name": "The Terrace Hotel, Adelaide",
    "title": "Contemporary Adelaide Stay near Parklands with Dining Credit & Parking",
    "description": "Explore the lush southern edge of Adelaide's CBD by staying at this modern hotel near the Adelaide Parklands, offering stunning views of the surrounding greenery, with Mount Lofty's summit and the vineyards of the Adelaide Hills visible in the distance.\n\nStop for a bite to eat at the onsite Terrace Bar & Kitchen and enjoy fresh local produce from the surrounding wine regions, before venturing to explore South Australia’s coastal capital. The city's most popular attractions like the Adelaide Central Market, the Rundle Mall and the Art Gallery of South Australia are all a short drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Terrace Hotel Adelaide",
    "offer_address": "208 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 167.0,
    "value": 335.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bfum7AAB",
    "hero_image": "https://images.luxuryescapes.com/vik4rzkvlqh3p8576ebs",
    "image_two": "https://images.luxuryescapes.com/dc9lwdmtii35efnyykff",
    "image_three": "https://images.luxuryescapes.com/i7megdaozhnnt27xu2d",
    "vendor_name": "Miller Apartments Adelaide",
    "title": "Stylish Adelaide Apartment Stay in the Heart of the City with Welcome Wine",
    "description": "Not all city escapes are made the same and after a stylish stay at Miller Apartments Adelaide, you’ll soon discover what an unforgettable urban escape should be. This elegant property is superbly located right in the heart of this laid-back city, close to Adelaide Oval and Rundle Mall, making it the perfect base for couples seeking a romantic escape or groups looking to discover the city in style. Slip into the cosmopolitan rhythm of the capital as you explore the burgeoning small bar and restaurant scene, roam through exceptional shopping precincts and get a taste of world-class cultural experiences.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Miller Apartments Adelaide",
    "offer_address": "16 Hindley St, Adelaide SA 5000",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 191.0,
    "value": 307.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UyJBsQAN",
    "hero_image": "https://images.luxuryescapes.com/oksbe5trwghyjxwxkdxd",
    "image_two": "https://images.luxuryescapes.com/xgc9ucwbo7ahnjndfmto",
    "image_three": "https://images.luxuryescapes.com/zzsphtldikbmozojrta1",
    "vendor_name": "The Playford Adelaide - MGallery",
    "title": "Five-Star Adelaide Stay with MAMMA MIA! The Musical Tickets",
    "description": "Whether it’s a girls’ weekend away, a treat for mum or a couple’s escape: enjoy a stay at The Playford Adelaide, with two A-reserve tickets to MAMMA MIA! The Musical included. An award-winning hotel, this five-star property is managed by Accor’s prestigious MGallery Sofitel brand and sits on the vibrant North Terrace, one of the city’s most sought-after locations. The Adelaide Oval, Convention Centre, Elder Park, Sky City Casino and Rundle Mall are all within walking distance. Most importantly, it takes under ten minutes to walk to the Adelaide Festival Centre, where you’ll enjoy a performance of MAMMA MIA! which is included in the package. Also included in your stay is a complimentary noon check-out, allowing for a leisurely morning on your day of departure.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide City Council",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Playford Hotel OLD",
    "offer_address": "120 North Terrace, Adelaide SA 5000",
    "percentage_discount": 27.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 309.0,
    "value": 421.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HghmIAC",
    "hero_image": "https://images.luxuryescapes.com/hn7kp03km17tductn3g",
    "image_two": "https://images.luxuryescapes.com/63ffrxe88nw2uitqoo9d",
    "image_three": "https://images.luxuryescapes.com/4rvixv8bba6gxd341e39",
    "vendor_name": "HotelMotel Adelaide",
    "title": "Award-Winning Adelaide South Terrace City Break Overlooking the Park Lands with A$50 Daily Dining Credit & Self-Parking",
    "description": "Stay in a modern remake of the classic motel on the leafy fringes of the central Adelaide Park Lands. Adelaide Oval, Rundle Mall and Adelaide Central Market are all within 10 minutes of this cosy accommodation. When you're done exploring, you'll find modern amenities and contemporary comfort in your room.\n\nIn between exploring Australia's festival city and its surrounds, indulge in resort-style comforts at the neighbouring Hotel Alba with shared facilities. Savour Mediterranean flavours at the hotel's coastal-cool ELA Restaurant & Bar or bathe in the sun-soaked pool. Make the ELA Bar your first stop before a night out on the town, and return to your private oasis.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "HotelMOTEL Adelaide",
    "offer_address": "216-225 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 164.0,
    "value": 261.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzZtlAAF",
    "hero_image": "https://images.luxuryescapes.com/seh06rww41l0mu9di9n",
    "image_two": "https://images.luxuryescapes.com/gpbeahuduh2oj47ea9",
    "image_three": "https://images.luxuryescapes.com/9ka7dpzd1n4a4xauysbt",
    "vendor_name": "Peppers Waymouth Hotel",
    "title": "Newly Refurbished Peppers Luxury in the Heart of Adelaide with Daily Breakfast & Nightly Drinks",
    "description": "Discover South Australia’s cosmopolitan capital city as you indulge in quintessential Peppers luxury in the heart of Adelaide's CBD, at Peppers Waymouth Hotel. Let this stylish hotel with newly refurbished and immaculate rooms be your elegant launchpad as you explore the city’s vibrant dining and entertainment scene - all of this as you get pampered with daily buffet breakfast, nightly house drinks, dining discounts for elevated Italian cuisine at Tutto Cucina + Bar, plus late checkout. If unwinding completely is more your style, sit back and relax at the hotel's inviting heated indoor pool with a spa and sauna for the ultimate Adelaide bliss.\n\nWhether you are a culture vulture, a foodie or a sports lover, Adelaide has it all - and Peppers Waymouth Hotel will take you right to the heart of it. Within walking distance, explore sites such as the Art Gallery of South Australia, or catch a game at Adelaide Oval. Known for its laid-back vibes and artistic culture, Adelaide is a source of neverending opportunities. Do as the locals do, and head to Peel Street for your cocktail fix or complete your Adelaide trip with a visit to the lush Adelaide Hills: this leafy destination just an hour’s drive from the city, brims with wineries where you can get cosy with a glass of red.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Peppers Waymouth Hotel",
    "offer_address": "55 Waymouth Street, Adelaide 5000, South Australia, Australia",
    "percentage_discount": 68.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 274.0,
    "value": 854.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ib5aQAAR",
    "hero_image": "https://images.luxuryescapes.com/hwpiqkyxw5eofl67n0q",
    "image_two": "https://images.luxuryescapes.com/h605cfyg1br4qkwbwmcm",
    "image_three": "https://images.luxuryescapes.com/bj8up6mmu6fojx9bddhl",
    "vendor_name": "Franklin Apartments",
    "title": "Contemporary Central Adelaide Self-Contained Apartments near Rundle Mall & Adelaide Oval",
    "description": "Find yourself placed in Adelaide's vibrant West End when you stay at this boutique collection of self-contained apartments just minutes from the city's key landmarks. Franklin Apartments offers a home-away-from-home, with fully equipped kitchens, spacious bedrooms and in-room laundries. Adelaide Oval, Rundle Mall and the buzzing Adelaide Central Market are all within close reach, plus the world-renowned wineries of Adelaide Hills are less than 30 minutes away. This spacious retreat is ideal for families or groups wanting to spend quality time together, with some apartments offering space for up to six guests.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Franklin Apartments",
    "offer_address": "36 Franklin Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 13,
    "price": 179.0,
    "value": 341.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HqSzIAK",
    "hero_image": "https://images.luxuryescapes.com/hq0ncduc9mjx2qze3nyi",
    "image_two": "https://images.luxuryescapes.com/vafrn8y5cumnnlw07xzr",
    "image_three": "https://images.luxuryescapes.com/tcgwg3h39lts5herjudg",
    "vendor_name": "Frome Apartments",
    "title": "Contemporary Adelaide East End Studio Retreat near Rundle Mall with Welcome Bottle of Wine",
    "description": "Experience the eclectic charms of Adelaide's East End from this studio stay, occupying a prime location near the CBD. Be within mere steps of the Rundle Mall strip, indulge in Friday night drinks or morning coffee at Ebenezer Palace, or journey a little further and reach foodie heaven at the Adelaide Central Market.\n\nHop onboard the city tram to reach the shores of Glenelg Beach, stroll through the restored Victorian glasshouse at the nearby Botanic Gardens, or explore the local culinary scene with chef-hatted restaurants less than 10 minutes' drive away. With exciting activities everywhere, bookend fun days by resting in your well-appointed apartment and gazing at the city from your Juliette balcony.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Frome Apartments",
    "offer_address": "88 Frome Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 50.0,
    "min_duration": 1,
    "max_duration": 11,
    "price": 95.0,
    "value": 191.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I1hcAAC",
    "hero_image": "https://images.luxuryescapes.com/gh4c5suqaosp0kwjvki",
    "image_two": "https://images.luxuryescapes.com/v9jlb4lhm0ueayfah1",
    "image_three": "https://images.luxuryescapes.com/7tk5bsofcqhkrt2gdww",
    "vendor_name": "Oval Hotel",
    "title": "Grand Opening: Boutique Adelaide Oval Escape with Daily Breakfast & Nightly Drinks",
    "description": "A memorable stay awaits at the recently unveiled Oval Hotel, a boutique property nestled within the walls of one of the city’s most iconic landmarks - Adelaide Oval. Perfectly positioned just moments from the endless urban delights found within the city, the location lends itself to days spent wandering through premier retail precincts including Rundle Mall, afternoons admiring ever-changing exhibitions at the acclaimed art galleries and museums, and evenings sampling regional delights at the city’s lively restaurants and bars.\n\nEach one of the sophisticated rooms has been expertly designed to ensure total relaxation. The stunning vistas of the surrounding heritage-listed parklands or city skyline are simply breathtaking, enhanced by the addition of intuitive in-room technology and contemporary interiors.\n\n**Your handpicked inclusions:**\n\n- Start each day with a delightful breakfast - your choice of continental platter or plated hot dish with espresso coffee, tea and juice\n- Unwind with a complimentary drink in the Hotel lounge overlooking Adelaide’s parklands and St Peter’s Cathedral\n- Enjoy the luxury of included valet parking so you don't have to worry about finding a park\n\n**Studio King Upgrade Bonus:** Upgrade to a Studio King Room, offering breathtaking views over either the river and leafy parklands or St Peter's Cathedral, and receive A$50 drinks and dining credit to use onsite at Five Regions Restaurant or Bespoke Wine Bar & Restaurant.\n\n**Gourmet Upgrade:** Sample the very best of South Australia's acclaimed regional produce with an included five-course degustation at the hotel's Five Regions Restaurant, plus enjoy a bonus A$50 food and drinks credit, when you choose the Gourmet Upgrade Package.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Oval Hotel",
    "offer_address": "King William Road, North Adelaide, South Australia 5006, Australia",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 287.0,
    "value": 602.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HfvhIAC",
    "hero_image": "https://images.luxuryescapes.com/tlb855066757c1l3cwk",
    "image_two": "https://images.luxuryescapes.com/fcp4w6of1dw6b30n9oi7",
    "image_three": "https://images.luxuryescapes.com/sfy2dvip9g9puqvz1m8",
    "vendor_name": "TRYP by Wyndham Pulteney Street Adelaide",
    "title": "Stylish Adelaide CBD Stay with Onsite Mexican Bar & Restaurant & Daily Breakfast",
    "description": "Treat yourself to a luxurious city oasis escape to South Australia's vibrant and multicultural capital. Ideally situated in the heart of the entertainment and shopping district, with Rundle Mall on its doorstep and Adelaide Oval a short walk away, this urban sanctuary invites you to spend your days exploring the city streets, enjoying a picnic in the manicured parklands or sampling a world-renowned tipple at the National Wine Centre.\n\nWhether you're an urban explorer visiting the renowned architecture and church spires, a wine-lover sampling the nearby tipples or simply drawn to the area's incredible live music and arts scene, Adelaide is the perfect destination for travellers of all persuasions - and there's simply no better place to take it all in than at TRYP by Wyndham Pulteney Street Adelaide.\n\nMake Adelaide's newest Mexican venue, Mamacita Restaurant & Bar, your first stop before a night out on the town and return to your tranquil abode which features everything you could need for a relaxing stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "TRYP by Wyndham Pulteney Street Adelaide",
    "offer_address": "266 Pulteney Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 219.0,
    "value": 536.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070Z4iAAE",
    "hero_image": "https://images.luxuryescapes.com/b23dhkq3iipn161xmyt2",
    "image_two": "https://images.luxuryescapes.com/ek16zweqc3u7rmg50au",
    "image_three": "https://images.luxuryescapes.com/z1phrwmmzgnism9xvjdj",
    "vendor_name": "Hilton Adelaide",
    "title": "Five-Star Hilton Adelaide Elegance with Daily Breakfast & A$50 Dining Credit",
    "description": "Indulge in a blend of signature Hilton luxury, upscale sophistication and inner-city living at Hilton Adelaide. Ideally situated in the heart of the entertainment and shopping district, overlooking Victoria Square, this luxurious sanctuary is the perfect launchpad for exploring the city on your doorstep.\n\nWhether you're an urban explorer visiting the renowned architecture and church spires, a wine-lover sampling the nearby Barossa Valley’s unique flavours, or simply drawn to the area's incredible live music and arts scene, Adelaide is the perfect destination for travellers of all persuasions - and there's simply no better place to take it all in that the five-star Hilton Adelaide. With its lavish outdoor pool, modern fitness centre, casual tipples at The Collins Bar, expert chefs preparing signature dishes in Coal Cellar + Grill, as well as world-class service, this hotel ensures a stay you'll never forget.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Hilton Adelaide",
    "offer_address": "233 Victoria Square, Adelaide SA 5000",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 247.0,
    "value": 522.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037JA9AAM",
    "hero_image": "https://images.luxuryescapes.com/d3mhfqgw5dlviq33k5al",
    "image_two": "https://images.luxuryescapes.com/skre8ajs2gru0syyz",
    "image_three": "https://images.luxuryescapes.com/kc88tk1phytwgyy3cz",
    "vendor_name": "Art Series - The Watson",
    "title": "Boutique Adelaide Art Series Stay with Four-Course Dining Experience",
    "description": "Welcome to Adelaide’s only Art Series hotel, The Watson - a boutique hotel that champions the work of Aboriginal painter Yannima Pikarli Tommy Watson. One of Adelaide’s coolest city-fringe pads, with the leafy Walkerville Terrace shopping precinct on its doorstep and North Terrace’s cultural boulevard, upcoming galleries, dining institutions and in-the-know boutiques within easy reach, this is the ultimate boutique stay overlooking the majestic Adelaide Hills.\n\nStay in sophistication surrounded by vibrant, original Watson artwork and enjoy a welcome bottle of local wine on arrival, complimentary parking for one car throughout your stay and a luxuriously late 1pm checkout. Plus, enjoy a one-time four-course banquet dining experience with a welcome cocktail for two adults at the top-rated L'italy restaurant, voted among Australia's top 50 restaurants by Weekend Australian magazine 2019.\n\n**Travelling with friends or family?** Upgrade to the spacious Deluxe Studio Twin Suite or Two-Bedroom Balcony Suite for four people.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Watson Adelaide - Art Series",
    "offer_address": "33 Warwick St, Walkerville SA 5081",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 239.0,
    "value": 572.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4kSnQAJ",
    "hero_image": "https://images.luxuryescapes.com/qzppdthi7uou4gmmqygs",
    "image_two": "https://images.luxuryescapes.com/fkajocbsopbujgipskne",
    "image_three": "https://images.luxuryescapes.com/jbqd5pw1zzwrg71xaroy",
    "vendor_name": "The Playford Adelaide - MGallery",
    "title": "Five-Star Adelaide Stay with Aladdin the Musical Tickets",
    "description": "Enjoy a stay at The Playford Adelaide, with two tickets to Disney’s Aladdin the Musical included. An award-winning hotel, this five-star property is managed by Accor’s prestigious MGallery Sofitel brand and sits on the vibrant North Terrace, one of the city’s most sought-after locations. The Adelaide Oval, Convention Centre, Elder Park, Sky City Casino and Rundle Mall are all within walking distance. Most importantly, it takes under ten minutes to walk to the Adelaide Festival Centre, where you’ll head to enjoy your included performance of Aladdin. Also included in your stay is a welcome drink on arrival at the hotel and a complimentary noon check-out, allowing for a leisurely morning on your day of departure.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide City Council",
    "location_heading": "Adelaide",
    "location_subheading": "SA",
    "location_description": "The Playford Hotel 2018",
    "offer_address": "120 North Terrace, Adelaide SA 5000",
    "percentage_discount": 15.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 310.0,
    "value": 364.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PzKqAAK",
    "hero_image": "https://images.luxuryescapes.com/9lu0aidpatm4rn9j8xw8",
    "image_two": "https://images.luxuryescapes.com/ahtp3dkavo5u1s03kxil",
    "image_three": "https://images.luxuryescapes.com/z2kfj63uhc1rdec1vm5i",
    "vendor_name": "Miller Apartments Adelaide",
    "title": "Top-Rated Adelaide Apartment Stay in the Heart of Australia's Most Liveable City",
    "description": "Not all city escapes are made the same and after an ultra-stylish stay at Miller Apartments Adelaide, you’ll soon discover what an unforgettable urban escape should be. This top-rated property - currently ranked in Adelaide's top five properties on Tripadvisor - is superbly located right in the heart of Australia's (and the world's third) most liveable city, close to Adelaide Oval and Rundle Mall, making it the perfect base for couples seeking a romantic escape or groups looking to discover the city in style.\n\nSlip into the cosmopolitan rhythm of the capital as you explore the burgeoning small-bar and restaurant scene, roam through exceptional shopping precincts and get a taste for world-class cultural experiences within moments of your doorstep. When you're not discovering the likes of the Art Gallery of South Australia or Adelaide Central Market, recharge at Miller Apartments Adelaide, where you'll find a small onsite fitness centre plus complimentary access to a nearby Goodlife Gym and convenient undercover parking for day trips to the Adelaide Hills or the vine-laced Barossa Valley.\n\n**Your handpicked inclusions:**\n\n- Toast your escape with a bottle of red wine on arrival\n- Indulge your sweet side with complimentary welcome chocolates\n- Forget about parking woes with complimentary secure parking for one vehicle\n- Make the most of your stay with late 12pm checkout\n\n**Want to make your stay extra special?** Upgrade to the One-Bedroom Executive Suite or sky-high Two-Bedroom Executive Suite and receive a five-course tasting menu dinner for two with a glass of Adelaide Hills sparkling wine each at Georges on Waymouth restaurant (an additional five-course tasting menu dinner per person will need to be purchased for the third and fourth guest in the Two-Bedroom Executive Suite).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Miller Apartments Adelaide - AUG 21",
    "offer_address": "16 Hindley Street Adelaide SA 5000 Australia",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 173.0,
    "value": 302.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FaLF0YAN",
    "hero_image": "https://images.luxuryescapes.com/w6knfvmp2p5c5naawxdg",
    "image_two": "https://images.luxuryescapes.com/qseqkkgpbdjmmqsn52s",
    "image_three": "https://images.luxuryescapes.com/9omqyy91iqb4zu9tq58e",
    "vendor_name": "Hotel Alba Adelaide",
    "title": "Extended by Popular Demand: Modern Adelaide CBD Glamour with Resort-Style Pool & Daily Breakfast",
    "description": "Escape to the serene green of the city parklands from this resort-style stay right on the vibrant South Terrace. Radiating contemporary glamour, this minimalist-chic hotel blends the charm of an elegant countryside retreat with the convenience of an urban escape, with cultural and dining hotspots on your doorstep.\n\nIn between exploring Australia's 'Festival City' and its surrounds, indulge in resort-style luxuries at your inner-city retreat. Savour Mediterranean flavours at the coastal-cool Ela or bathe in the sun-soaked outdoor pool. Make the bar at Ela your first stop before a night out on the town, then return to your private oasis where a spacious balcony with park or city views awaits.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Hotel Alba Adelaide",
    "offer_address": "226 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 17,
    "price": 219.0,
    "value": 455.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fmn88AAB",
    "hero_image": "https://images.luxuryescapes.com/9ijexoa8a4bh2ir9ctz",
    "image_two": "https://images.luxuryescapes.com/scvpmb3r8q437pxdj7y",
    "image_three": "https://images.luxuryescapes.com/c6voyt4r4sytl0urgqjr",
    "vendor_name": "Hotel Alba Adelaide",
    "title": "Grand Opening: Adelaide Parklands Glamour with Resort-Style Pool, Daily Breakfast & Nightly Drink",
    "description": "Be one of the first to experience the serene green of the city parklands from the brand-new Hotel Alba Adelaide - a resort-style stay right on the vibrant South Terrace. Boasting 99 stylish guest rooms, this minimalist-chic hotel blends the charm of an elegant countryside retreat with the convenience of an urban escape, with cultural and dining hotspots on your doorstep. Head to historic Central Market for foodie delights or nearby Himeji Garden for a slice of traditional Japan in Adelaide. When it's time to venture beyond the city limits, find yourself located less than an hour's drive from the famed Barossa Valley, McLaren Vale and the sun-soaked Glenelg beach.\n\nIn between exploring Australia's festival city and its surrounds, indulge in resort-style luxuries at your inner-city retreat. Savour Mediterranean flavours at the coastal-cool Ela restaurant or bathe in the sun-soaked pool. Make the bar at Ela your first stop before a night out on the town, and return to your private oasis where a spacious balcony with park or city views awaits.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Hotel Alba Adelaide",
    "offer_address": "226 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 265.0,
    "value": 441.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxZUSAA3",
    "hero_image": "https://images.luxuryescapes.com/6ip6ynteqp9mrrvoz5vi",
    "image_two": "https://images.luxuryescapes.com/mnjcr6giemir2deqzz97r",
    "image_three": "https://images.luxuryescapes.com/ag1ddby00cr7ymu10a9l",
    "vendor_name": "TRYP by Wyndham Pulteney Street Adelaide",
    "title": "TRYP by Wyndham Adelaide CBD Stay with Daily Breakfast & Nightly Drinks",
    "description": "Escape with a luxurious stay at TRYP by Wyndham Pulteney Street Adelaide, a city oasis in South Australia's vibrant and multicultural capital. Ideally situated in the heart of the entertainment and shopping district, with Rundle Mall on its doorstep and Adelaide Oval a short walk away, this urban sanctuary invites you to spend your days exploring the city streets, enjoying a picnic in the manicured parklands or sampling a world-renowned tipple at the National Wine Centre. When it's time to venture beyond the city limits, find yourself located less than an hour's drive from the famed Barossa Valley, McLaren Vale and the sun-soaked Glenelg Beach.\n\nWhether you're an urban explorer visiting the renowned architecture and church spires, a wine-lover sampling the nearby tipples or simply drawn to the area's incredible live music and arts scene, Adelaide is the perfect destination for travellers of all persuasions - and there's simply no better place to take it all in than at TRYP by Wyndham Pulteney Street Adelaide. Enjoy a grab-and-go meal at the Z Cafe or rejuvenate body and mind at the fitness centre. Make the Z Bar your first stop before a night out on the town, and return to your tranquil abode which features everything you could need for a relaxing stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "TRYP by Wyndham Pulteney Street Adelaide",
    "offer_address": "266 Pulteney Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 209.0,
    "value": 407.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DWj0zYAD",
    "hero_image": "https://images.luxuryescapes.com/jwg58gn5xmqpw57i1wwf",
    "image_two": "https://images.luxuryescapes.com/3nmwou8r0icsrfjz060k",
    "image_three": "https://images.luxuryescapes.com/t79hzd835opzhiv1kpgg",
    "vendor_name": "Oval Hotel",
    "title": "Australia's First Stadium Hotel: Adelaide Oval Historic Stay with Daily Breakfast, Dining Credit & Nightly Drinks",
    "description": "Experience a stay like no other at Australia’s first and only stadium hotel, located within the iconic Adelaide Oval. The Oval Hotel blends world-class accommodation with the energy of a living stadium, offering an unparalleled perspective of one of Australia's most historic sporting venues.\n\nOn level three, indulge in one of Adelaide’s most remarkable dining experiences at Bespoke Wine Bar & Kitchen. Here, sweeping stadium views meet a stylish bar and lounge. At ground level, enjoy a relaxed atmosphere at the cafe overlooking the River Torrens and its scenic walking trails.\n\nPositioned moments from the city's vibrant attractions, every room is designed to showcase panoramic views of the Adelaide parklands. Guests are treated to sights of the majestic Saint Peter’s Cathedral to the north, and the sparkling city skyline and River Torrens to the south. \n\nTake advantage of exclusive access to integrated facilities across the Adelaide Oval precinct, including entry to the Next Gen Lifestyle Club, which features a fitness centre, pool and spa.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Oval Hotel",
    "offer_address": "King William Road, North Adelaide, South Australia 5006, Australia",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 279.0,
    "value": 676.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gx6m8AAB",
    "hero_image": "https://images.luxuryescapes.com/yjccrjjj9heocz176wxp",
    "image_two": "https://images.luxuryescapes.com/walw4n3xck80k5m1g41d",
    "image_three": "https://images.luxuryescapes.com/66bp86br45twp2c0gt1v",
    "vendor_name": "Frome Apartments",
    "title": "Adelaide East End Apartment Escape near Rundle Mall & Botanic Gardens",
    "description": "Immerse yourself in Adelaide's buzzy East End with a central studio escape. Just a stone's throw to Friday night drinks or morning coffee at Ebenezer Place, and walking distance to the bustling Rundle Mall strip, you're also a short journey to foodie heaven at the Adelaide Central Markets. Catch the city tram to the glistening waters of Glenelg Beach or stroll through the elegantly restored Victorian glasshouse at the nearby Botanic Gardens. With renowned wineries in every direction, bookend fun days by resting in your plush, light-filled apartment and gazing at the city lights from your Juliette balcony.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Frome Apartments",
    "offer_address": "88 Frome Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 50.0,
    "min_duration": 1,
    "max_duration": 11,
    "price": 95.0,
    "value": 191.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JTKklAAH",
    "hero_image": "https://images.luxuryescapes.com/qfnnyeqdbu45p6sycdwe",
    "image_two": "https://images.luxuryescapes.com/i6at29agtcn0rr2xr81j",
    "image_three": "https://images.luxuryescapes.com/se3bo4j0nc9idonrx5kh",
    "vendor_name": "The Playford Adelaide - MGallery",
    "title": "Award-Winning Adelaide Boutique Suite Luxury with Daily Breakfast, Nightly Drinks & Dining Credit",
    "description": "An escape to South Australia’s charming capital beckons with a sophisticated five-star suite stay at this newly refurbished boutique retreat. Inspired by the city's rich artistic heritage, this glamorous hotel dazzles with art-nouveau touches, gilded accents and bespoke hospitality unlike anywhere else.\n\nThe facilities are exceptional - savour pared-back European-inspired dishes served with modern flair at Luma Restaurant and Bar (awarded One Chef's Hat by The Australian Good Food Guide in 2024) or head to Health Club for a dip in the hotel's magnificent indoor pool.\n\nSurrounded by parks and tree-lined streets and separated from the city by the meandering River Torrens, The Playford Adelaide - MGallery provides the ultimate Adelaide escape. Its North Terrace address, just moments from Adelaide Oval and Rundle Mall, encourages effortless exploration, with nearby laneways packed with eateries, bars, boutiques and galleries.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Playford Adelaide - MGallery Collection",
    "offer_address": "120 North Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 359.0,
    "value": 711.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DS5OAAW",
    "hero_image": "https://images.luxuryescapes.com/7ptteb0kdftbtycpokrr",
    "image_two": "https://images.luxuryescapes.com/3neye165xki1bbocl2",
    "image_three": "https://images.luxuryescapes.com/0uxvr5r9j8dm94msii",
    "vendor_name": "Aurora Adelaide",
    "title": "Adelaide: Award-Winning Aurora Restaurant Six-Course Tasting Menu Experience for Two with Sparkling Wine",
    "description": "Indulge in the best of South Australian produce with a six-course tasting menu and welcome sparkling wine at Aurora Restaurant, located in Adelaide's vibrant Light Square. Founded on the pillars of sustainability, local produce and social responsibility, the team at Aurora aim to create memorable dining experiences that nourish and engage. Led by South African native, head chef Brendan Wessels, take your tastebuds on a journey that is sure to delight - think delicately smoked Kinkawooka mussels against the acidity of last-season tomatoes, or rich Lowan Park chicken cream offset by scorched onion and pickled walnut.\n\nDespite being the new kid on the block, Aurora has become somewhat of an institution in the South Australian foodie scene, with the restaurant being awarded three Gourmet Traveller Restaurant Awards in 2022, including a coveted Chef's Hat. Positioned in Adelaide's trendy West End, this beautiful open-plan restaurant combines stone surfaces, Australian flora and artful light shades to make for the perfect luxe setting for your six-course dining experience.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Aurora Adelaide",
    "offer_address": "63 Light Square, Adelaide, SA, 5000",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 211.0,
    "value": 1.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zFjhAAE",
    "hero_image": "https://images.luxuryescapes.com/iyqmrcgwxh7dy134fi",
    "image_two": "https://images.luxuryescapes.com/9rdn4glxk7ie984dxn2k",
    "image_three": "https://images.luxuryescapes.com/r7ye5bd4uny61s66lvli",
    "vendor_name": "Ibis Adelaide",
    "title": "Modern Escape in the Heart of Adelaide CBD with Daily Breakfast",
    "description": "Immerse yourself in the action with a stay in the heart of the vibrant CBD at Ibis Adelaide, ranked in the top 10% of hotels on Tripadvisor. In between exploring, relax in contemporary comfort with the latest technology at your fingertips, stop in at ibis Kitchen for all-day dining and views over Grenfell Street, or order a lavish pre-dinner cocktail at Level One Bar before hitting the town.\n\nYou’ll be perfectly placed to explore the best of the CBD from this centrally-located hotel. Shop up a storm at Rundle Mall, witness a sports game or live concert at Adelaide Oval, or sample fresh produce at Adelaide Central Market. If you feel like venturing out of the CBD, award-winning wineries await in the Adelaide Hills wine region, only a 40-minute drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "ibis Adelaide",
    "offer_address": "122 Grenfell St, Adelaide SA 5000",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 157.0,
    "value": 343.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000713DdAAI",
    "hero_image": "https://images.luxuryescapes.com/oy5km5ids6i503stsgi",
    "image_two": "https://images.luxuryescapes.com/1lmz65xvmeecshdwvx8",
    "image_three": "https://images.luxuryescapes.com/xa0wdd4ptb8z6pji8ah",
    "vendor_name": "Miller Apartments Adelaide",
    "title": "Top-Rated Apartment Stay in the Heart of Adelaide",
    "description": "Not all city stays are made equal: at the ultra-stylish Miller Apartments Adelaide, you’ll soon discover what an unforgettable urban escape should be. This top-rated property - ranked within the top 10% of properties on Tripadvisor - is superbly located right in the heart of Australia's most liveable city. Close to Adelaide Oval and Rundle Mall, it's the perfect base for couples seeking a romantic escape or groups looking to discover the city in style.\n\nSlip into the cosmopolitan rhythm of the capital as you explore the burgeoning bar and restaurant scene, roam through exceptional shopping precincts and get a taste for world-class cultural experiences within moments of your doorstep. When you're not discovering the likes of the Art Gallery of South Australia or Adelaide Central Market, recharge at Miller Apartments Adelaide, where you'll find a small onsite fitness centre plus complimentary access to a nearby Goodlife Gym and convenient undercover parking for day trips to the Adelaide Hills or the vine-laced Barossa Valley.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Miller Apartments Adelaide",
    "offer_address": "16 Hindley St, Adelaide SA 5000",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 185.0,
    "value": 341.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CXyUAAW",
    "hero_image": "https://images.luxuryescapes.com/m60olx508ebra8xdqx",
    "image_two": "https://images.luxuryescapes.com/0boqkypo7nluybsi8a65",
    "image_three": "https://images.luxuryescapes.com/d4g9a39lky5cd7dudtj",
    "vendor_name": "Adelaide Paringa",
    "title": "Heritage Escape in the Heart of Adelaide's CBD with Guaranteed Room Upgrade",
    "description": "Stay in the heart of the action at Adelaide Paringa, a heritage hotel located right in the centre of the city voted Australia's most livable for 2021. You'll have the best of Adelaide at your fingertips from this historic hub: restaurants in the vibrant East End, the flora-filled Adelaide Botanic Garden within a short drive and the National Wine Centre of Australia practically a stone's throw.\n\nAll of this and more awaits. A five-minute walk from this perfectly placed hotel is the famous Sky City Casino and Rundle Mall, while the recently renovated Adelaide Oval and Adelaide Convention Centre are both an easy 10-minute stroll away. After spending a day exploring the CBD and Adelaide’s surrounds, return to the comfort of your room where you can kick your feet up, relax and recharge.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Adelaide Paringa",
    "offer_address": "15 Hindley St, Adelaide SA 5000 Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 121.0,
    "value": 210.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CF9H0YAL",
    "hero_image": "https://images.luxuryescapes.com/279kahtyahzbtx2nec8nb",
    "image_two": "https://images.luxuryescapes.com/5qb6ldsivlfxsoercak",
    "image_three": "https://images.luxuryescapes.com/tvop7sgkjz8b7jiu3gwvn",
    "vendor_name": "Pullman Adelaide",
    "title": "Five-Star City Break in the Heart of Adelaide CBD with Daily Breakfast & Valet Parking",
    "description": "Experience one of Adelaide's finest five-star stays at this Pullman destination, boasting a sparkling new European-inspired brasserie and reimagined guestrooms.\n\nThe hotel’s positioning in Hindmarsh Square is exceptional: perfectly poised in Adelaide's trendy East End, this stylish hotel sits moments from city parklands and happening Rundle Street and Ebenezer Place - plus you'll be within easy reach of Adelaide Oval and the famed Adelaide Central Markets.\n\nFurther afield, you can find yourself sipping wine in the picturesque Barossa Valley, Adelaide Hills or Mclaren Vale wine regions, all less than an hour's drive away.\n\nPart of the acclaimed Pullman Hotels and Resorts collection, Pullman Adelaide offers guests a first-class experience through its state-of-the-art amenities and outstanding service. Treat yourself to the flavours of Europe at PARC Brasserie & Bar, indulge in locally sourced wines and stunning views at the bar or upgrade to the Junior Suite to enjoy access to the hotel's exclusive lounge, The Hindmarsh Club, with nightly drinks and canapes.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Pullman Adelaide",
    "offer_address": "16 Hindmarsh Square, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 72.0,
    "min_duration": 2,
    "max_duration": 22,
    "price": 249.0,
    "value": 874.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CRxWAAW",
    "hero_image": "https://images.luxuryescapes.com/y5m6bjtgwejh5n06acze",
    "image_two": "https://images.luxuryescapes.com/t912l17o357gdjowa8j",
    "image_three": "https://images.luxuryescapes.com/ttcasc3o9npwpow01uqa",
    "vendor_name": "Franklin Apartments",
    "title": "Stylish Central Adelaide Apartment Stay",
    "description": "Find yourself placed in Adelaide's vibrant west end when you stay at Franklin Apartments. These self-contained apartments offer a home away from home feeling, including fully equipped kitchens and laundry facilities. Adelaide Oval, Rundle Mall and the buzzing Adelaide Central Markets are all within close reach, plus the world-renowned wineries of Adelaide Hills are less than 30 minutes away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Franklin Apartments",
    "offer_address": "36 Franklin Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 14,
    "price": 99.0,
    "value": 99.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CS1dAAG",
    "hero_image": "https://images.luxuryescapes.com/40vgx5dudryc54qglrju",
    "image_two": "https://images.luxuryescapes.com/u97ilsde0e30wa8lito6",
    "image_three": "https://images.luxuryescapes.com/n3kd7o4khcr29b08rgae",
    "vendor_name": "Miller Apartments Adelaide",
    "title": "Award-Winning Stylish Serviced Apartments in the Heart of Adelaide",
    "description": "Discover an unforgettable escape at the top-rated, ultra-stylish Miller Apartments Adelaide, located right in the city centre. Each recently renovated apartment boasts a dazzling array of top-notch facilities, including fully equipped kitchens and separate living areas. Explore Adelaide's brilliant collection of bars, restaurants and galleries, roam through exceptional shopping precincts and get a taste of world-class cultural experiences - all within metres of your doorstep.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Miller Apartments Adelaide",
    "offer_address": "16 Hindley Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 95.0,
    "value": 95.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xSHyAAM",
    "hero_image": "https://images.luxuryescapes.com/ie09jslipsqtxuuis6n",
    "image_two": "https://images.luxuryescapes.com/uukomsbnpkv47t0rkr",
    "image_three": "https://images.luxuryescapes.com/fvd8ssehefxxnna2rop4",
    "vendor_name": "HotelMotel Adelaide",
    "title": "South Terrace City Break Overlooking the Adelaide Park Lands",
    "description": "Stay in a modern remake of the classic motel on the leafy fringes of the central Adelaide Park Lands at the HotelMOTEL Adelaide. Nested in the heart of the South Terrace Precinct, this escape combines hotel luxuries and motel convenience, making it the ideal launchpad for any South Australia adventure. Adelaide Oval, Rundle Mall and Adelaide Central Market are all within ten minutes of this cosy accommodation. When you're done exploring, modern amenities and contemporary comfort away in your room, where you can order food to your door from in-room dining or head to the Terrace Bar & Kitchen at the adjoining The Terrace Hotel for a sit-down feast.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "HotelMOTEL Adelaide",
    "offer_address": "216-225 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xSGvAAM",
    "hero_image": "https://images.luxuryescapes.com/9ayexzuudb78z9kyovs7",
    "image_two": "https://images.luxuryescapes.com/wzjove5ui8kfzka51vaa",
    "image_three": "https://images.luxuryescapes.com/7uiy2g7s8ez9mada3dff",
    "vendor_name": "The Terrace Hotel, Adelaide",
    "title": "Central Adelaide Escape Overlooking Park Lands",
    "description": "Stay in a leafy corner of the CBD at The Terrace Hotel Adelaide, located on the southern edge of the city centre, on the fringes of Adelaide Park Lands. This stylish hotel offers soaring views over the Park Lands, while Mount Lofty and the patchwork vineyards of the Adelaide Hills are visible in the distance. Stop for a bite to eat at Terrace Bar & Kitchen and enjoy locally produced spoils from Adelaide Hills. Venture outside and discover the outdoor wonders of Adelaide Park Lands. Beyond that, Adelaide Central Market, Adelaide Oval and the city's trendy bars and restaurants are all nearby.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Terrace Hotel Adelaide",
    "offer_address": "208 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 15,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CuwVSAAZ",
    "hero_image": "https://images.luxuryescapes.com/x5v870kfpmvst6uxz0y7",
    "image_two": "https://images.luxuryescapes.com/pal24d2r4u6lg4w5fpyl",
    "image_three": "https://images.luxuryescapes.com/jdydq8psip9r29sbunbg",
    "vendor_name": "Hotel Alba Adelaide",
    "title": "Sophisticated Adelaide Urban Charm Overlooking the South Terrace Parklands",
    "description": "Overlooking the serene green of the city’s parklands, Hotel Alba Adelaide offers guests a resort-style stay right on the vibrant South Terrace. This minimalist-chic hotel blends the charm of an elegant countryside retreat with the convenience of an urban escape, with cultural and dining hotspots right on your doorstep. Head to historic Central Market for foodie delights or base yourself here while you explore South Australia's world-famous wine regions.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Hotel Alba Adelaide",
    "offer_address": "226 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xSEBAA2",
    "hero_image": "https://images.luxuryescapes.com/f2qd8l1ayjaq0snanjf",
    "image_two": "https://images.luxuryescapes.com/zyck15uihexggdv3nfh",
    "image_three": "https://images.luxuryescapes.com/bbygyon0luh69vrc0c",
    "vendor_name": "Adina Apartment Hotel Adelaide Treasury",
    "title": "Heritage Escape in the Heart of Adelaide CBD",
    "description": "You’re perfectly placed to explore the best of Adelaide’s vibrant CBD when you stay at the lovingly restored Adina Apartment Hotel Adelaide Treasury. The hotel is housed in a heritage building, with restorations recognised by UNESCO. Refreshingly modern self-contained apartments offer a home away from home feeling, while fabulous facilities include a modern gym, heated indoor swimming pool, sauna, and spa.\n\nThe hotel overlooks Victoria Square and is minutes from Central Market and Rundle Mall. Plus, there's an abundance of wine bars and shopping all within walking distance. When you want to taste South Australia’s best drops straight from the source, Adelaide is the perfect base for day trips to the state’s premier wine regions, including the Barossa Valley, Adelaide Hills and McLaren Vale.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Adina Apartment Hotel Adelaide Treasury",
    "offer_address": "2 Flinders St, Adelaide SA 5000 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 14,
    "price": 145.0,
    "value": 145.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zKhQAAU",
    "hero_image": "https://images.luxuryescapes.com/oazh5596fys8314nwub",
    "image_two": "https://images.luxuryescapes.com/edtu8nbmadg21pke529",
    "image_three": "https://images.luxuryescapes.com/zti2uveerijz9wpcbv9",
    "vendor_name": "Rydges Adelaide",
    "title": "Central City Escape by Adelaide Park Lands",
    "description": "South Australia’s capital city is yours to explore from Rydges Adelaide, ideally positioned in the vibrant and picturesque southwestern quarter of the CBD overlooking Adelaide Park Lands. With an address to impress and plush rooms with modern amenities, this contemporary hotel will be your launchpad to this vibrant city, which boasts an incredible number of secret bars, fine-dining restaurants and cosy pubs, not to mention iconic sights including the Adelaide Oval and the lively Central Market. Whether you want to taste wines in the Adelaide Hills, chill in one of the many pubs or explore the city, Adelaide is sure to surprise you.\n\n**Your handpicked inclusions:**\n\n- Enjoy daily breakfast for two\n- Complimentary one-way shuttle service from the hotel to the airport on departure (Monday-Friday only; must be pre-booked)\n- Make the most of your final day with leisurely 12pm checkout\n- Complimentary Wi-Fi throughout your stay",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Rydges Adelaide",
    "offer_address": "1 South Tce, Adelaide SA 5000",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTmCAAW",
    "hero_image": "https://images.luxuryescapes.com/1yond11jt8u4xgqdg5vb",
    "image_two": "https://images.luxuryescapes.com/ms32jgkh9v93r5jcgrit",
    "image_three": "https://images.luxuryescapes.com/jlggivpdeq10s6hbxlvg",
    "vendor_name": "Avani Adelaide Residences",
    "title": "Adelaide CBD Escape with Rooftop Terrace & Heated Lap Pool",
    "description": "Treat yourself to a lavish city escape at the glamorous Avani Adelaide Residences, ideally placed in the heart of the CBD. This urban retreat is spectacularly located on bustling Franklin Street, allowing you to walk to cool bars, award-winning restaurants and high-end shops. Fabulous facilities include a restaurant, heated lap pool, a rooftop terrace with outdoor barbecue and lounge, a gym complete with a steam room and sauna, a cinema, a library and even a golf simulator.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "Australia",
    "location_description": "Avani Adelaide Residences",
    "offer_address": "176 Franklin St, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 129.0,
    "value": 129.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt5UAAR",
    "hero_image": "https://images.luxuryescapes.com/hh77rphk1jllaxaxa47m",
    "image_two": "https://images.luxuryescapes.com/i3xtc77kxpjhxz1t65p07",
    "image_three": "https://images.luxuryescapes.com/uo39wuwnm9rj5upxr1",
    "vendor_name": "Crowne Plaza Adelaide",
    "title": "Stylish Adelaide City Break in Heart of the Vibrant East End with Stunning Views",
    "description": "Experience style and comfort at the Crowne Plaza Adelaide - a contemporary haven located in the city's vibrant East End. Step out of your modern accommodation and explore the array of attractions on your doorstep, from the iconic Rundle Mall to the vibrant dining and entertainment found only in the East End, or venture further afield to the world-class wineries of the McLaren Vale and Barossa Valley. After a day of sightseeing, return to the hotel to take in spectacular views of the city and the famed Adelaide Hills from South Australia's tallest building. Head to the level 10 social hub to enjoy the ultra-cool alfresco bar and watch the sun go down, beat the heat in the outdoor pool or grab a bite at the acclaimed Koomo restaurant for mouthwatering fare.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Crowne Plaza Adelaide, an IHG Hotel",
    "offer_address": "27 Frome Street, Adelaide, SA, 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 89.0,
    "value": 89.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt5mAAB",
    "hero_image": "https://images.luxuryescapes.com/d17n7nvmbdov48uz15tr",
    "image_two": "https://images.luxuryescapes.com/woh4806myspm64ekn2yt",
    "image_three": "https://images.luxuryescapes.com/n1b64rii6eo9z4ej6c5",
    "vendor_name": "InterContinental Adelaide",
    "title": "Adelaide Five-Star InterContinental Escape with Award-Winning Japanese Teppanyaki Restaurant",
    "description": "Take a luxurious escape to the five-star InterContinental Adelaide, located in the heart of the CBD. Towering above the banks of the Torrens River, this sleek hotel is home to Shiki, an award-winning Japanese teppanyaki restaurant, along with a 24-hour fitness centre and glistening outdoor pool. The Adelaide Festival Centre, Convention Centre, Casino and Adelaide Oval are all just steps from your front door, with famed wineries and crystal clear beaches a short drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "Australia",
    "location_description": "Intercontinental Adelaide, an IHG Hotel",
    "offer_address": "North Terrace, Adelaide South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 100.0,
    "value": 100.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FORBOAA5",
    "hero_image": "https://images.luxuryescapes.com/1h20xkuh8bdgrpiyfiwe",
    "image_two": "https://images.luxuryescapes.com/cguwk695n9ao4t7eao6",
    "image_three": "https://images.luxuryescapes.com/iui26n78nhnezg73161n",
    "vendor_name": "TRYP by Wyndham Pulteney Street Adelaide",
    "title": "Stylish Central Adelaide Stay in the East End near Rundle Mall with Onsite Bar & Cafe",
    "description": "Indulge in a sophisticated urban escape at the chic TRYP by Wyndham Pulteney Street Adelaide, centrally located in the heart of Adelaide's CBD. This stylish retreat is a stone's throw from the city's vibrant East End, home to a cornucopia of gourmet eateries, boutique shops and the iconic Rundle Mall and Adelaide Central Market. Savour the city's unique nightlife, then unwind at the onsite Z Bar or grab a coffee at the Z Kitchen, all while embracing Adelaide's laid-back culture.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "TRYP by Wyndham Pulteney Street Adelaide",
    "offer_address": "266 Pulteney Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 76.0,
    "value": 76.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTljAAG",
    "hero_image": "https://images.luxuryescapes.com/pqayrocgqkt2hdcwndyw",
    "image_two": "https://images.luxuryescapes.com/qy4ucgvz486z1pbfkt4p",
    "image_three": "https://images.luxuryescapes.com/gk1zvp00qetkmr86tt7p",
    "vendor_name": "Oaks Glenelg Plaza Pier Suites",
    "title": "Glenelg Apartment Escape Just 20 Minutes from Adelaide CBD with Oceanfront Location",
    "description": "Treat yourself to a South Australia beachside retreat at Oaks Glenelg Plaza Pier Suites, where spectacular ocean panoramas and contemporary facilities make for a memorable escape. Just 20 minutes away from Adelaide CBD, Glenelg feels like a different world, with beachfront dining, palm-lined walkways and a thriving nightlife scene. When you're not making footprints in the sand along the beach or exploring the many eateries along the bustling Jetty Road, take a dip in your hotel's heated indoor swimming pool or soak in the bubbling jacuzzi. Afterwards, return to your apartment sanctuary, where high-end amenities create a home-away-from-home experience.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Oaks Glenelg Plaza Pier Suites",
    "offer_address": "16 Holdfast Promenade, Glenelg, SA 5045, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 98.0,
    "value": 98.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v0yOAAQ",
    "hero_image": "https://images.luxuryescapes.com/ls478h9ymqow7lcfi5xc",
    "image_two": "https://images.luxuryescapes.com/b5q7d5tajcggdfz5lyq5",
    "image_three": "https://images.luxuryescapes.com/6es8ws7oxtypm7fqu3sj",
    "vendor_name": "HotelMotel Adelaide",
    "title": "South Terrace City Break Overlooking the Adelaide Park Lands",
    "description": "Stay in a modern remake of the classic motel on the leafy fringes of the central Adelaide Park Lands at the HotelMOTEL Adelaide. Adelaide Oval, Rundle Mall and Adelaide Central Market are all within ten minutes of this cosy accommodation, and when you're done exploring, you'll find modern amenities and contemporary comfort in your room. Take it easy and order in-room dining or head to the Terrace Bar & Kitchen at the adjoining The Terrace Hotel for a sit-down feast.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "HotelMOTEL Adelaide",
    "offer_address": "216-225 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 75.0,
    "value": 75.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ecj0dAAB",
    "hero_image": "https://images.luxuryescapes.com/9bw24aybmn9nvl9u72nv",
    "image_two": "https://images.luxuryescapes.com/rinzunhjl35h6739k80d",
    "image_three": "https://images.luxuryescapes.com/6hsx0q83j9i007u53ql",
    "vendor_name": "EOS by Skycity",
    "title": "5-Star Adelaide CBD Escape at SkyCity with Rooftop Bar, Restaurants & Spa",
    "description": "Immerse yourself in the heart of Adelaide with a stay at the opulent Eos by SkyCity, a beacon of modern luxury and sophistication. This architectural masterpiece offers an unrivalled experience of grandeur, boasting a world-class casino, leisure deck and a selection of gastronomic delights at its award-winning restaurants. Explore the vibrant Central Market, the iconic Adelaide Oval, or the charming Rundle Mall, before ending your day with a glass of South Australia's finest wine at the rooftop bar.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "EOS by SkyCity",
    "offer_address": "Festival Drive, Adelaide South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 239.0,
    "value": 239.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRetSAAT",
    "hero_image": "https://images.luxuryescapes.com/1b9k1x477vux83fpk0i",
    "image_two": "https://images.luxuryescapes.com/eadc8uch1lplfycnyz7f",
    "image_three": "https://images.luxuryescapes.com/n5kiwgx86ft1ijerm1o8",
    "vendor_name": "Mantra Hindmarsh Square",
    "title": "Relaxing Adelaide CBD Escape Moments from Rundle Mall with Onsite Restaurant & Bar",
    "description": "Experience the elegance of Adelaide with this ideally located hotel as your base. Perfectly positioned in the city's East End, you'll find yourself within a five-minute stroll of Rundle Mall shopping precinct and the the vibrant Rundle Street, home to a plethora of trendy bars, restaurants and boutiques.\n\nVenture further to explore the Adelaide Botanic Garden or the Art Gallery of South Australia. Back at the hotel, head to the onsite restaurant, DJ's Diner & Bar, for American-style comfort food and a refreshing drink.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "Australia",
    "location_description": "Mantra Hindmarsh Square Adelaide",
    "offer_address": "55 67 Hindmarsh Square, Adelaide 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 80.0,
    "value": 80.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GRgYEYA1",
    "hero_image": "https://images.luxuryescapes.com/7b3n9qbp4juux2s0s8t",
    "image_two": "https://images.luxuryescapes.com/oo47g2wjy75gmaxhjxl",
    "image_three": "https://images.luxuryescapes.com/7q81fjhbgrucbdig20n4",
    "vendor_name": "Sofitel Adelaide",
    "title": "Five-Star Sofitel Stay in the Heart of Adelaide CBD with Onsite Dining & Indoor Pool",
    "description": "Experience five-star elegance at this luxurious Sofitel stay in the heart of South Australia’s vibrant capital. Located moments from the River Torrens and Rundle Mall, the hotel invites easy exploration. Discover laneways filled with top eateries, trendy boutiques and must-see galleries. Beyond the city, world-class wine regions and sandy beaches offer a change of pace.\n\nEach room features a contemporary take on French sophistication in signature Sofitel style, complemented by exceptional facilities. Savour French-inspired cuisine at Garçon Bleu, enjoy a glass of champagne at Déjà Vu or unwind in the lap pool on level five while taking in the city skyline.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "Australia",
    "location_description": "Sofitel Adelaide",
    "offer_address": "108 Currie Street, Adelaide 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 142.0,
    "value": 142.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BfwY9AAJ",
    "hero_image": "https://images.luxuryescapes.com/e3sk5hnhiatlvn7befp",
    "image_two": "https://images.luxuryescapes.com/4i27s2ss5aegvmtkix6",
    "image_three": "https://images.luxuryescapes.com/pgwuayzusaxa38gonc8",
    "vendor_name": "Stamford Plaza Adelaide",
    "title": "Five-Star Stamford Elegance in the Heart of Adelaide",
    "description": "Experience the magic of South Australia’s cosmopolitan capital with a stay at Stamford Plaza Adelaide. Let this sophisticated hotel be your elegant launchpad as you enjoy the finer things in life, with the best this vibrant city has to offer only a stone's throw away. Perfectly placed for those seeking a fun-filled escape, the hotel is within walking distance from Adelaide’s vibrant dining and entertainment scene, Adelaide Oval and Festival Centre.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Stamford Plaza Adelaide",
    "offer_address": "150 North Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 95.0,
    "value": 95.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v0xpAAA",
    "hero_image": "https://images.luxuryescapes.com/b1e6pexioez8ukye1z2d",
    "image_two": "https://images.luxuryescapes.com/09uujkslwqutv27n61n2",
    "image_three": "https://images.luxuryescapes.com/g7eok81aa9el2lgte9ie",
    "vendor_name": "Atura Adelaide Airport",
    "title": "Stylish Adelaide Airport Stay with Stunning Views",
    "description": "Step off the plane and straight into the Festival State's charming western corner with a stay at Atura Adelaide Airport, Australia’s first and only seamless integration of a hotel and airport terminal. Just 15 minutes from Rundle Mall and moments from golden West Beach and the best of Glenelg, enjoy prime surf, cute cafés and boutique shops all within close reach. When you return from your adventures, relax over a coffee at the Meeting Point Café or refuel at the Hangar Bar & Grill.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Atura Adelaide Airport",
    "offer_address": "1 Atura Circuit Adelaide Airport 5950 South Australia Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 99.0,
    "value": 99.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v0uXAAQ",
    "hero_image": "https://images.luxuryescapes.com/pr0dafhbzlmoa5zxrvf",
    "image_two": "https://images.luxuryescapes.com/7ato881woic8883uk7hc",
    "image_three": "https://images.luxuryescapes.com/tc7y1x8a2ww2fl9y3h4g",
    "vendor_name": "Oval Hotel",
    "title": "Five-Star Stay within Iconic Adelaide Oval",
    "description": "A memorable stay awaits at the Oval Hotel, a bespoke property nestled within the walls of one of the city’s most iconic landmarks - Adelaide Oval. As Australia’s first stadium hotel, Oval Hotel offers guests a distinctly South Australian, one-of-a-kind accommodation experience and places sports lovers in the heart of the action. Perfectly positioned just moments from the endless urban delights, the hotel also boasts onsite fine-dining; Bespoke Wine Bar & Kitchen and Five Regions Restaurants.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Oval Hotel",
    "offer_address": "King William Road, North Adelaide, South Australia 5006, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 115.0,
    "value": 115.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BfwX6AAJ",
    "hero_image": "https://images.luxuryescapes.com/a1bkaa4r3ppn952y7ghg",
    "image_two": "https://images.luxuryescapes.com/06f3irw4b2hb71rczzce",
    "image_three": "https://images.luxuryescapes.com/gq8v7rjxoq3ux1dvmzt",
    "vendor_name": "Stamford Grand Adelaide Hotel",
    "title": "Stamford Grand Adelaide Beachfront Escape Just 20 Minutes from Adelaide CBD",
    "description": "Experience the grandeur of the Stamford Grand Adelaide Hotel, a beachfront retreat on the shores of Adelaide's vibrant Glenelg Beach. With its unrivalled location in the heart of Glenelg, this renowned hotel offers an idyllic blend of coastal charm and city sophistication. Explore the bustling Jetty Road, brimming with boutique shops, or take a leisurely tram ride to Adelaide's city centre. After a day of exploration, retreat to the Horizon Cocktail Lounge, where you can soak in panoramic ocean views.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Stamford Grand Adelaide Hotel",
    "offer_address": "2 Jetty Road Moseley Square, Glenelg, South Australia 5045, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 100.0,
    "value": 100.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CS2gAAG",
    "hero_image": "https://images.luxuryescapes.com/nhwon4yyiffkiovqidam",
    "image_two": "https://images.luxuryescapes.com/47obtwq8082npmz86z7n",
    "image_three": "https://images.luxuryescapes.com/b5wqhst7sa6gf54yw9",
    "vendor_name": "Miller Apartments Adelaide",
    "title": "Stylish Award-Winning Apartment Escape in the Heart of Adelaide",
    "description": "Discover an unforgettable self-contained urban escape at the top-rated, ultra-stylish Miller Apartments Adelaide, superbly located right in the city centre. Each recently renovated apartment  boasts a dazzling array of top-notch facilities, including fully equipped kitchens and separate living areas. Explore Adelaide's brilliant collection of bars, restaurants and galleries, roam through exceptional shopping precincts and get a taste of world-class cultural experiences - all within metres of your doorstep.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Miller Apartments Adelaide",
    "offer_address": "16 Hindley Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 65.0,
    "value": 65.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRet3AAD",
    "hero_image": "https://images.luxuryescapes.com/660dels83lkm0gzgylc",
    "image_two": "https://images.luxuryescapes.com/4ya6ec0njmed3ht7ch1m",
    "image_three": "https://images.luxuryescapes.com/rw1plmfgqpqbr0i334mh",
    "vendor_name": "Peppers Waymouth Hotel",
    "title": "Contemporary Peppers Luxury in the Heart of Adelaide with Onsite Restaurant & Indoor Heated Pool",
    "description": "Discover South Australia’s cosmopolitan capital city as you indulge in quintessential Peppers luxury in the heart of Adelaide's CBD. Start your days at the elegant TUTTO Cucina + Bar, serving up elevated Italian cuisine and located right inside the hotel. Or, if your escape calls for relaxation, retreat to the hotel's inviting heated indoor pool with a spa and sauna for the ultimate Adelaide bliss.\n\nWhether you are a culture vulture, a foodie or a sports lover, Adelaide has it all - and Peppers Waymouth Hotel will take you right to the heart of it. Within walking distance, explore sites such as the Art Gallery of South Australia, or catch a game at Adelaide Oval. Do as the locals do, and head to Peel Street for your cocktail fix or complete your Adelaide trip with a visit to the lush Adelaide Hills.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "Australia",
    "location_description": "Peppers Waymouth Adelaide",
    "offer_address": "55 Waymouth Street, Adelaide, South Australia, Australia, 5000",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 89.0,
    "value": 89.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DH6OWAA1",
    "hero_image": "https://images.luxuryescapes.com/l5tiwpbsqf89lpzejtyb",
    "image_two": "https://images.luxuryescapes.com/nu9dflvriw0c8tipl9sb",
    "image_three": "https://images.luxuryescapes.com/kccjvzlbmawuub8y06q",
    "vendor_name": "Holiday Inn Express Adelaide City Centre",
    "title": "Sophisticated Adelaide West End Escape",
    "description": "Striking the perfect balance between sophisticated comfort and an unbeatable location, Holiday Inn Express Adelaide City Centre, an IHG Hotel, is an idyllic city break in the vibrant West End. Situated in the heart of the buzzing CBD and a short stroll from Adelaide’s premier shopping mall and historic Italianate arcades, this stylish launchpad is perfectly placed with the best wining, dining and entertainment the city has to offer at its doorstep.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "Australia",
    "location_description": "Holiday Inn Express Adelaide City Centre, an IHG Hotel",
    "offer_address": "30 Blyth Street, Adelaide, SA 5000 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 69.0,
    "value": 69.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v1IxAAI",
    "hero_image": "https://images.luxuryescapes.com/4qsrxi6valvw18zwadh6",
    "image_two": "https://images.luxuryescapes.com/9747cglzjxejbcbj8zm",
    "image_three": "https://images.luxuryescapes.com/pfefr12yfid7tf4yztg",
    "vendor_name": "The Terrace Hotel, Adelaide",
    "title": "Central Adelaide Escape Overlooking Park Lands",
    "description": "Stay in a leafy corner of the CBD at The Terrace Hotel Adelaide, located on the verdant fringes of the sprawling Adelaide Park Lands. This stylish hotel offers soaring views over the greenery, while Mount Lofty and the patchwork vineyards of the Adelaide Hills are visible in the distance. Stop for a bite to eat at Terrace Bar & Kitchen and enjoy fresh local produce from the surrounding wine regions, before venturing out to explore South Australia's vibrant capital.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Terrace Hotel Adelaide",
    "offer_address": "208 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 68.0,
    "value": 68.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CRzmAAG",
    "hero_image": "https://images.luxuryescapes.com/tnjic4x5die0foekofe9",
    "image_two": "https://images.luxuryescapes.com/8uxw41ocwmt58akwaer8",
    "image_three": "https://images.luxuryescapes.com/ppviuqmgns7jporbtbe9",
    "vendor_name": "Franklin Apartments",
    "title": "Stylish Central Adelaide Apartment Stay",
    "description": "Find yourself placed in Adelaide's vibrant west end when you stay at the homely Franklin Apartments. These self-contained apartments offer a home-away-from-home feeling, with each room offering fabulous facilities, including fully equipped kitchens and laundry services. Adelaide Oval, Rundle Mall and the buzzing Adelaide Central Markets are all within 10 minutes and the world-renowned wineries of Adelaide Hills and the picturesque shores of Glenelg are less than 30 minutes away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Franklin Apartments",
    "offer_address": "36 Franklin Street, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 71.0,
    "value": 71.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRet8AAD",
    "hero_image": "https://images.luxuryescapes.com/f44udjzm438udskebvde",
    "image_two": "https://images.luxuryescapes.com/xswjq06hv4sn54fxfgvi",
    "image_three": "https://images.luxuryescapes.com/aq38vvc7xj83jk46s9s",
    "vendor_name": "Art Series - The Watson",
    "title": "Chic Adelaide Art Series Self-Contained Suites Overlooking Adelaide Hills with Lap Pool",
    "description": "Indulge in the perfect blend of art and luxury at this boutique hotel, which champions the work of Aboriginal painter, Yannima Pikarli Tommy Watson. One of Adelaide’s coolest city-fringe pads, with the leafy Walkerville Terrace shopping precinct on its doorstep and North Terrace’s cultural boulevard, dining institutions and in-the-know boutiques within easy reach, this is the ultimate urban retreat, overlooking the majestic Adelaide Hills.\n\nAdmire the striking artwork of Watson and the vibrant colour splashes adorned on the walls, go for a swim in the lap pool, work up a sweat in the gym, or relax and unwind in your well-appointed suite or apartment. If you wish, you can venture out and explore the nearby Adelaide Botanic Garden and the bustling Adelaide Central Market, both a short drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "The Watson Adelaide - Art Series",
    "offer_address": "33 Warwick St, Walkerville, Adelaide SA 5081, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 90.0,
    "value": 90.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2ykIAC",
    "hero_image": "https://images.luxuryescapes.com/qj98eh6f909aisvt9n9",
    "image_two": "https://images.luxuryescapes.com/p2x8k8evh2wrsr5wl9on",
    "image_three": "https://images.luxuryescapes.com/4jn1u2xl67sa1310xw",
    "vendor_name": "Grosvenor Hotel Adelaide (Managed by Accor)",
    "title": "Centrally-Located Adelaide Retreat near Rundle Mall & Convention Centre",
    "description": "Find yourself in the heart of it all with an elegant stay at this chic Adelaide city oasis perfectly situated on North Terrace, mere steps from the Convention Centre and the iconic Adelaide Oval. Be it for business or leisure, take advantage of the hotel's prime location and explore the enchanting South Australian capital to the fullest.\n\nKick back and relax in the hotel's well-appointed rooms and suites, go cafe-hopping or tuck into pub classics at the famous Stonegrill. If you wish to venture further, the charming Barossa Valley and its renowned wineries are an hour away while closer to the hotel, head to Haigh's Chocolate Visitor Centre to learn all about the craft of chocolate-making and indulge in some retail therapy at Rundle Street Market.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Grosvenor Hotel Adelaide",
    "offer_address": "125 North Terrace, Adelaide 5000, South Australia, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 67.0,
    "value": 67.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DMUXAA4",
    "hero_image": "https://images.luxuryescapes.com/a8nuj1a01413mvr5fnk8",
    "image_two": "https://images.luxuryescapes.com/p2flqvsl47ng9h6oydx87",
    "image_three": "https://images.luxuryescapes.com/v1nfx3ghxe6hd1qmpfiq",
    "vendor_name": "Adina Apartment Hotel Adelaide Treasury",
    "title": "Boutique Heritage Escape in Heart of CBD near Adelaide Central Market",
    "description": "You're perfectly placed to explore the best of South Australia’s lively capital with a stay at the elegant Adina Apartment Hotel Adelaide Treasury, housed within one of the state’s most historic buildings. Refreshingly modern apartments and studios offer a welcoming home-away-from-home feeling, while the conveniences of an indoor pool, gym and onsite restaurant will elevate your stay to new levels of comfort. The location is nothing short of superb, with the famed Adelaide Central Market, Rundle Mall and an abundance of trendy wine bars and newly opened cafés all within walking distance. When you want to taste South Australia’s best drops straight from the source, Adelaide is the perfect base for day trips to the Barossa Valley, Adelaide Hills and McLaren Vale.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Adina Apartment Hotel Adelaide Treasury",
    "offer_address": "2 Flinders St, Adelaide SA 5000 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 50.0,
    "value": 50.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4o6aAAB",
    "hero_image": "https://images.luxuryescapes.com/486sald78orp41yb33bg",
    "image_two": "https://images.luxuryescapes.com/rzjv4er01zoragn0unm",
    "image_three": "https://images.luxuryescapes.com/bh1g9m5vk7axg9ndfaq",
    "vendor_name": "Vibe Hotel Adelaide",
    "title": "Sophisticated Adelaide Escape with Suspended Bridge Pool",
    "description": "Escape to South Australia's vibrant and multicultural capital with a stay at Vibe Hotel Adelaide. This stylish and modern hotel enjoys a prime position in the heart of the City of Churches, famous for being the only capital city entirely surrounded by parklands. Spend days exploring the city, tasting some of Australia's best drops in the nearby wine regions, or relaxing on golden beaches, before returning to your urban haven to enjoy brand-new facilities or relax by the innovative suspended pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Vibe Hotel Adelaide",
    "offer_address": "260 Flinders Street, Adelaide 5000, South Australia, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 100.0,
    "value": 100.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CugC9AAJ",
    "hero_image": "https://images.luxuryescapes.com/eq5zrb1ebsynqf9mxaeq",
    "image_two": "https://images.luxuryescapes.com/o8k7cg20260vj3vuccgj",
    "image_three": "https://images.luxuryescapes.com/d4ikdijivlktxd0yvfl",
    "vendor_name": "Hotel Indigo Adelaide Markets",
    "title": "Stylish Adelaide Retreat with Rooftop Bar",
    "description": "Escape to South Australia’s picturesque coastal cosmopolitan city with a stay in the eclectic Hotel Indigo Adelaide Markets, an IHG Hotel. Perfectly located in the heart of the market precinct, this retreat is the gateway to your gastronomic journey with the Adelaide Central Market right next door. Spend your days exploring, take a dip in the refreshing coastal waters, and indulge in locally sourced South Australian seafood at the sophisticated onsite restaurant and rooftop bar.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "Australia",
    "location_description": "Hotel Indigo Adelaide Markets, an IHG Hotel",
    "offer_address": "23-29 Market Street, Adelaide 5000, South Australia, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 88.0,
    "value": 88.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CvcnLAAR",
    "hero_image": "https://images.luxuryescapes.com/2r2r3px5yuarnvc9749f",
    "image_two": "https://images.luxuryescapes.com/zn70ls3mtx4ndeif4wr",
    "image_three": "https://images.luxuryescapes.com/gjf7dk0oqcwccyvst5",
    "vendor_name": "Mayfair Hotel Adelaide",
    "title": "Heritage Glamour in the Heart of Adelaide with Rooftop Bar",
    "description": "Experience grandeur, elegance and luxury in the heart of Adelaide at the Mayfair Hotel - a prestigious heritage-listed building steeped in history. The hotel boasts an unparalleled location where you can spend hours indulging in retail therapy at the nearby City Cross Mall or evenings spent meandering along Hindley Street. Or, retreat to the hotel and enjoy a glamorous High Tea at Mayflower Restaurant, or cocktails at Hennessy Rooftop Bar.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Mayfair Hotel",
    "offer_address": "45 King William Street, Adelaide 5000, South Australia, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 106.0,
    "value": 106.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GMHB0AAP",
    "hero_image": "https://images.luxuryescapes.com/hzy1fv50qd7n2r37agv",
    "image_two": "https://images.luxuryescapes.com/b4q3e6wmbxteh128318",
    "image_three": "https://images.luxuryescapes.com/19lb9hffhiao76q72dy",
    "vendor_name": "Oaks Glenelg Liberty Suites",
    "title": "Beachside Glenelg Apartment Escape Just 20 Minutes from Adelaide CBD",
    "description": "With shimmering waters stretching as far as the eye can see, and the bustling high street brimming with delicious cafes and charming boutiques -  experience the best of South Australia's coastal charm with a beachside Glenelg stay. Just 20 minutes from Adelaide CBD, Glenelg feels like a different world, with beachfront dining, palm-lined walkways and a thriving nightlife scene.\n\nWhen you're not making footprints in the sand along the beach or exploring the many eateries along the bustling Jetty Road, take a dip in your hotel's heated indoor swimming pool or soak in the bubbling jacuzzi. Afterwards, return to your apartment sanctuary, where thoughtful amenities create a home-away-from-home experience.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Oaks Glenelg Liberty Suites",
    "offer_address": "25-29 Colley Terrace, Glenelg, South Australia 5045, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 98.0,
    "value": 98.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C2rc8AAB",
    "hero_image": "https://images.luxuryescapes.com/ynqzewev333hvcffa5ni",
    "image_two": "https://images.luxuryescapes.com/gmdcw9jwzlzf6k7du5j",
    "image_three": "https://images.luxuryescapes.com/uwqu4lw2ckop99s0r3nk",
    "vendor_name": "Hotel Alba Adelaide",
    "title": "Sophisticated Adelaide City Retreat Overlooking South Terrace Parklands",
    "description": "Overlooking the serene green of the city’s rolling parklands, Hotel Alba Adelaide offers guests a resort-style stay right in the heart of the city's vibrant South Terrace. Boasting 99 stylish guest rooms, each boasting a spacious private balcony and coffee machine, this minimalist-chic hotel blends the charm of an elegant countryside retreat with the convenience of an urban escape. Head to historic Central Market for foodie delights or nearby Himeji Garden for a slice of traditional Japan in Adelaide.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Hotel Alba Adelaide",
    "offer_address": "226 South Terrace, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 88.0,
    "value": 88.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTliAAG",
    "hero_image": "https://images.luxuryescapes.com/wg7azr2bf4dkxivdzw",
    "image_two": "https://images.luxuryescapes.com/ku0pq97mrozsjvdcznn6",
    "image_three": "https://images.luxuryescapes.com/o4yy2hya1du71qq444p9",
    "vendor_name": "Oaks Adelaide Horizons Suites",
    "title": "Adelaide CBD Apartment Escape within North Terrace Culture Precinct",
    "description": "Adelaide's buzzing urban scene is bubbling with multicultural food outlets, a vibing live-music scene and a packed festival calendar - and all of this can be enjoyed from Oaks Adelaide Horizons Suites, located in the heart of the CBD. This stylish, apartment-style hotel is located along North Terrace, the hub for culture and arts. Right up the street, you'll discover the Art Gallery of South Australia, the National War Memorial, theatres, cinemas and the iconic Trinity Church. When you're not exploring Adelaide's sights, cook yourself dinner in your self-contained apartment or take a dip in the refreshing indoor swimming pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "Australia",
    "location_description": "Oaks Adelaide Horizons Suites",
    "offer_address": "104 North Terrace, Adelaide SA 5000 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 81.0,
    "value": 81.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JReuQAAT",
    "hero_image": "https://images.luxuryescapes.com/6waadu4jhjm09q8ntht3",
    "image_two": "https://images.luxuryescapes.com/daq89hwuqcuang8w9uws",
    "image_three": "https://images.luxuryescapes.com/jmjymua0ejghtnsxgsu",
    "vendor_name": "BreakFree Adelaide",
    "title": "Contemporary Adelaide Self-Contained Apartments Only Minutes from CBD",
    "description": "Experience the vibrant pulse of Adelaide with a sophisticated self-contained stay in the bustling West End. Situated a short stroll from Adelaide’s premier shopping mall and historic Italianate arcades, this stylish launchpad is perfectly placed with the best of the city at its doorstep.\n\nSpend your days exploring the city and stop by the Adelaide Central Market to sample local produce, before retreating to your cosy apartment for that home-away-from-home feeling. Each space includes fully equipped kitchens and laundry services for easy Adelaide exploring.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "Australia",
    "location_description": "BreakFree Adelaide",
    "offer_address": "255 Hindley Street, Adelaide , South Australia, 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 67.0,
    "value": 67.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlvnIAC",
    "hero_image": "https://images.luxuryescapes.com/uqn3gamztup9n4hcjau",
    "image_two": "https://images.luxuryescapes.com/nlp4btye4mwvk7cjq7cp",
    "image_three": "https://images.luxuryescapes.com/bb3kbydkp9lfcic818a",
    "vendor_name": "Pullman Adelaide",
    "title": "Modern Pullman Stay in the Heart of Adelaide CBD with European-Inspired Restaurant & Indoor Pool",
    "description": "If you’re looking for a sophisticated central Adelaide city stay, look no further than this stylish East End escape. Perfectly poised moments from the buzz of the CBD, city parklands, and the bars and boutiques of the eclectic Rundle Street and Ebenezer Place, there’s plenty to discover beyond the hotel, but this luxury oasis will entice you to stay and enjoy.\n\nPullman Adelaide offers guests a first-class experience. Treat yourself to European-inspired dining at PARC Brasserie & Bar. Enjoy the 24-hour fitness centre in addition to the restorative sauna and steam room, or start the day with some lengths in the indoor lap pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Pullman Adelaide",
    "offer_address": "16 Hindmarsh Square, Adelaide, South Australia 5000, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 100.0,
    "value": 100.0
  }
]