[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I8dwAAC",
    "hero_image": "https://images.luxuryescapes.com/92y0unzqydwmbcm7q38l",
    "image_two": "https://images.luxuryescapes.com/p9wkql7ehlqiognlfpg6",
    "image_three": "https://images.luxuryescapes.com/4zrexg2pnrn16bsaehw",
    "vendor_name": "Rosselli AX Privilege",
    "title": "Five-Star Heritage Valletta Escape with Michelin-Starred Restaurant",
    "description": "A city of history and sunshine, discover Valletta with a heritage stay at the five-star Rosselli AX Privilege. Echoing the luxury and elegance of Malta’s Baroque era, you’ll feel like royalty during your stay. Feast on a superb selection of dishes at the hotel’s Michelin-starred restaurant, order your signature cocktail at Grain Bar, enjoy a dip in the outdoor swimming pool and take in breathtaking panoramas over the entire city from the sleek rooftop terrace.\n\nThere’s a lot of history to discover in Valletta. This UNESCO World Heritage-listed city retains much of its 16th-century charm: explore the museums, fortresses, old mansions, City Gate, Parliament Building and the Opera House. When you’ve had your fill of history, head out to some of the city’s lively bars and restaurants for a fun-filled night on the town.",
    "offer_country_name": "Malta",
    "offer_country_code_alpha_2": "MT",
    "offer_geo_area_level_1": "South Eastern Region",
    "offer_geo_area_level_2": "Valletta",
    "location_heading": "Valletta",
    "location_subheading": "Malta",
    "location_description": "Rosselli AX Privilege",
    "offer_address": "167 Merchants St, Valletta VLT 1174, Malta",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 259.0,
    "value": 259.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I0SrAAK",
    "hero_image": "https://images.luxuryescapes.com/jca13axphcbq4lbvbtm",
    "image_two": "https://images.luxuryescapes.com/qwcl447fdqusduts4hto",
    "image_three": "https://images.luxuryescapes.com/1r9iecgaee5a1j2v3tvb",
    "vendor_name": "AX The Saint John",
    "title": "Boutique Malta Luxury within a 17th-Centuary Merchant's Residence in the Heart of Valletta",
    "description": "Experience urban living redefined at the boutique AX The Saint John - an ultra-luxe and characterful city pad in the heart of Malta's vibrant capital, Valletta. Enhanced by its rich heritage as a 17th-century merchant's residence, this sleek hotel combines opulence, technology and style, while staying true to its architectural roots. Thanks to the hotel's central Valletta location, you'll be at the heart of all this beautiful walled city has to offer. Admire 16th-century baroque architecture at St. John's Co-Cathedral, take in panoramic views at Upper Barrakka Gardens and dine waterside at the famed Grand Harbour.\n\nAX The Saint John is the ideal abode for the sophisticated traveller seeking minimal design with maximum service. Contemporary meets comfort in each of the elegantly appointed rooms, while handy amenities including a 24-hour reception and complimentary Wi-Fi ensure a seamless stay. Feeling peckish? Hop next door to the popular Cheeky Monkey Gastropub and indulge in sumptuous dining, from hearty breakfasts to juicy burgers, healthy options and more. Whether you're seeking a wine-and-dine city break or a top-notch launchpad for exploring Malta, AX The Saint John is the place to be.",
    "offer_country_name": "Malta",
    "offer_country_code_alpha_2": "MT",
    "offer_geo_area_level_1": "South Eastern Region",
    "offer_geo_area_level_2": "Valletta",
    "location_heading": "Valletta",
    "location_subheading": "Malta",
    "location_description": "AX The Saint John",
    "offer_address": "176, Triq Il-Merkanti Valletta VLT, 1174, Malta",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 153.0,
    "value": 153.0
  }
]