[
  {
    "link": "https://luxuryescapes.com/offer/0062y000003IAB0AAO",
    "hero_image": "https://images.luxuryescapes.com/pim8p8xmzlcgdpjvkqq",
    "image_two": "https://images.luxuryescapes.com/vc5r2mpurf2zkh5b894",
    "image_three": "https://images.luxuryescapes.com/l28pfuw7o900q04a09fb",
    "vendor_name": "Hotel Bahia Kempinski Estepona",
    "title": "Five-Star Spain Luxury Kempinski Resort on the Costa del Sol",
    "description": "Welcome to the Kempinski Hotel Bahía Estepona, one of Spain's most luxurious hotels, with an enviable beachfront location and views across the Mediterranean to the coast of Africa. Sitting on the broad, golden shores of the Costa del Sol and architect-designed by the award-wining designer Melvin Villarroel, the Kempinski Hotel Bahía's majesty has to be seen to be believed. Step into this peaceful refuge, surrounded by subtropical gardens and awash with signature terracotta colours, and enter a world of laidback southern European elegance. Service is of the utmost importance in this five-star establishment, and the high-end facilities are of the same calibre.\n\nSurrounded by the verdant trees and blossoming shrubs of the subtropical landscaped gardens, welcome the superb sea breezes on the hotel grounds or enjoy them on the private beach. Dive into one of the three remarkable swimming pools surrounded by palms or work up a sweat at the fitness centre or on the tennis court. Right at your fingertips, you’ll find the Bee Kids Club, the lavish Kempinski Spa - offering healing treatments based on traditional techniques - and a dedicated golf concierge. Other highlights include a perfect selection of restaurants and bars to satisfy even the pickiest eaters (from creative cocktails to fresh coastal produce).",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Andalusia",
    "offer_geo_area_level_2": "Estepona",
    "location_heading": "Estepona",
    "location_subheading": "Spain",
    "location_description": "Kempinski Hotel Bahía Estepona",
    "offer_address": "Carretera de Cadiz Km 159, Estepona, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 502.0,
    "value": 502.0
  }
]