[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008ghomAAA",
    "hero_image": "https://images.luxuryescapes.com/isp3ciq9dneah71njv6",
    "image_two": "https://images.luxuryescapes.com/3pdoq1uq3glcll7x4nhe",
    "image_three": "https://images.luxuryescapes.com/p4uxa8j2onb1wulzh2ha",
    "vendor_name": "The Ocean Club, a Luxury Collection Resort, Costa Norte",
    "title": "Dominican Republic Beachfront Suites on Costa Norte with Daily Breakfast, US$75 Dining Credit & US$75 Spa Credit",
    "description": "Indulge in five-star beachfront bliss at luxurious The Ocean Club, a Luxury Collection Resort - perfectly perched on the private sands of Costa Norte in the Dominican Republic. This sophisticated seafront hideaway is the ultimate sanctuary for those seeking a well-deserved escape where the facilities are nothing short of exceptional, and the shimmering ocean will be within easy reach. Admire floor-to-ceiling ocean views from your suite before stepping onto the secluded beach with private wooden cabanas or diving into one of three pools, including two reserved exclusively for adults.\n\nWhen hunger strikes, you'll be spoilt for choice with four distinct dining concepts including Baia Costa Norte, a signature restaurant inspired by local produce, Agua Azul, featuring Asian-Peruvian fusion cuisine, Rock Bar, a Mediterranean-focused outdoor restaurant, and an intimate Caribbean speakeasy called The Wine Cellar. The pinnacle of the entire resort experience however is the indulgent Ocean Club Spa by L'Occitane, boasting a range of holistic and wellness therapies inspired by local rituals.",
    "offer_country_name": "Dominican Republic",
    "offer_country_code_alpha_2": "DO",
    "offer_geo_area_level_1": "Puerto Plata",
    "offer_geo_area_level_2": "Sosua",
    "location_heading": "Costa Norte",
    "location_subheading": "Dominican Republic",
    "location_description": "The Ocean Club, a Luxury Collection Resort",
    "offer_address": "Calle Bruno Philip No, 5, Sosúa 57000, Dominican Republic",
    "percentage_discount": 34.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1649.0,
    "value": 2489.0
  }
]