[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DWmLOYA1",
    "hero_image": "https://images.luxuryescapes.com/wsv0jyw1ujg32xkjb7q",
    "image_two": "https://images.luxuryescapes.com/lluz0po1obks0ux1e144",
    "image_three": "https://images.luxuryescapes.com/o4wat0uygbbxiw7aj3bm",
    "vendor_name": "Centara Grand Island Resort & Spa Maldives",
    "title": "Maldives Ocean-View Villas with Daily Breakfast, Nightly Dinner & Seaplane Transfers",
    "description": "Find your slice of paradise at the heavenly Machchafushi Island Resort & Spa Maldives, The Centara Collection, just a short 25-minute seaplane flight from Malé. This spectacular private island retreat is surrounded by the dazzling waters of the South Ari Atoll, with exceptional snorkelling and diving opportunities in abundance.\n\nFall in love with the resort’s timber overwater walkways, sweeping golden sands and world-class facilities, including lagoonside Italian trattoria Mare Azurro, Thai-inspired jungle eatery Suan Bua and wellness sanctuary SPA Cenvaree.\n\nIf you love sun and fun, Machchafushi Island Resort & Spa Maldives, The Centara Collection has you covered, offering a broad range of excursions including snorkelling, whale shark boat trips, sunset cruises, local island explorations and sunset fishing.\n\nFamilies will also adore the resort’s expansive Kids’ Club, with separate zones for little ones and teens - and some of the region's only family-friendly overwater villas, perched fantastically over the lagoon's balmy waters.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Machchafushi",
    "location_heading": "Alifu Dhaalu Atoll",
    "location_subheading": "Maldives",
    "location_description": "Machchafushi Island Resort & Spa Maldives, The Centara Collection",
    "offer_address": "Machchafushi Island, Alifu Dhaalu Atoll, Maldives",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 2499.0,
    "value": 4733.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GdvdkAAB",
    "hero_image": "https://images.luxuryescapes.com/ucw5uoyw8wrir45lwrm",
    "image_two": "https://images.luxuryescapes.com/k80h22twhgkehg2vssoc",
    "image_three": "https://images.luxuryescapes.com/q0u9ta3jtj7zent2bb3t",
    "vendor_name": "Centara Grand Island Resort & Spa Maldives",
    "title": "Maldives Private Island Villa Paradise with All-Inclusive Daily Dining, Free-Flow Cocktails & Roundtrip Seaplane Transfers",
    "description": "Find your slice of paradise at the all-inclusive Centara Grand Island Resort & Spa Maldives, just a short 25-minute seaplane flight from Malé. This spectacular private island retreat is surrounded by the dazzling waters of the South Ari Atoll, with exceptional snorkelling and diving opportunities in abundance - it's the perfect spot to discover the countless coral-filled worlds hidden below the water's surface, including a long-sunken shipwreck. Fall in love with the resort’s timber overwater walkways, sweeping golden sands and world-class facilities, including lagoonside Italian trattoria Azzuri Mare, Thai-inspired jungle eatery Suan Bua and wellness sanctuary SPA Cenvaree.\n\nIf you love surf, sun and fun, Centara Grand Island Resort & Spa Maldives has you covered, offering a broad range of excursions including snorkelling, whale shark boat trips, sunset cruises, local island explorations and sunset fishing. Families will also adore the resort’s expansive Kids’ Club, with separate zones for little ones and teens - and some of the region's only family-friendly overwater villas, perched fantastically over the lagoon's balmy waters.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Machchafushi",
    "location_heading": "Alifu Dhaalu Atoll",
    "location_subheading": "Maldives",
    "location_description": "Machchafushi Island Resort & Spa Maldives, The Centara Collection",
    "offer_address": "Machchafushi Island, Alifu Dhaalu Atoll, Maldives",
    "percentage_discount": 40.0,
    "min_duration": 5,
    "max_duration": 22,
    "price": 2999.0,
    "value": 5025.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006z6rYAAQ",
    "hero_image": "https://images.luxuryescapes.com/b61kh6u27iaamk7w9t7",
    "image_two": "https://images.luxuryescapes.com/7z69ovbv4g125iegwhs",
    "image_three": "https://images.luxuryescapes.com/i1rxjz1ylh6hqr5qo4x",
    "vendor_name": "Centara Grand Island Resort & Spa Maldives",
    "title": "Maldives Private Island Villas with All-Inclusive Daily Dining, Unlimited Cocktails & Roundtrip Malé Seaplane Transfers",
    "description": "Find your slice of paradise at the all-inclusive Centara Grand Island Resort & Spa Maldives, only a short seaplane ride away from Malé. This gem in the ocean is surrounded by the dazzling cerulean seas of the South Ari Atoll, which is filled with technicolour coral reefs that must be seen to be believed. Fall in love with the resort’s timber overwater walkways, golden sands and range of onsite amenities, including five excellent restaurants and bars and wellness sanctuary SPA Cenvaree Maldives.\n\nIf you love surf, sun and fun, Centara Grand Island Resort & Spa Maldives has you covered, offering a broad range of excursions including snorkelling, whale shark boat trips, sunset cruises, local island explorations and sunset fishing. Families will also adore the resort’s expansive Kids’ Club, with separate zones for little ones and teens.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Machchafushi",
    "location_heading": "Alifu Dhaalu Atoll",
    "location_subheading": "Maldives",
    "location_description": "Machchafushi Island Resort & Spa Maldives, The Centara Collection",
    "offer_address": "Machchafushi Island, Alifu Dhaalu Atoll, Maldives",
    "percentage_discount": 31.0,
    "min_duration": 5,
    "max_duration": 25,
    "price": 3299.0,
    "value": 4798.0
  }
]