[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JkbwAAC",
    "hero_image": "https://images.luxuryescapes.com/ulkt4il54du0iydoc61r",
    "image_two": "https://images.luxuryescapes.com/a6djjjtytcyub4uwngr",
    "image_three": "https://images.luxuryescapes.com/qg7ttftolaw4x1ispkb4",
    "vendor_name": "The Boathouse Hotel Patonga",
    "title": "Stylish NSW Central Coast Beachfront Apartment Escape with A$50 Dining Credit",
    "description": "Swap the city grid for seaside serenity with a chilled-out stay at The Boathouse Hotel Patonga, a gorgeous boutique property from the renowned Boathouse Group just a 1.5-hour drive from Sydney, perched on the edge of Brisbane Water National Park in the historic fishing town of Patonga. Offering a range of stylish self-catering apartments together with all-day dining and water views, this charming coastal property is perfect for couples, families and groups alike. Decorated in light, airy tones with stylish colourful accents and marble-finished bathrooms, these premium apartments offer the perfect setting to holiday your way - and each come complete with a balcony overlooking the beautiful sparkling waters of Brisk Bay.\n\nKeen walkers will love the Tony Doyle Walking Trail as well as Warrah Lookout, which is well worth ascending to for breathtaking ocean views. Water-lovers can enjoy a spot of kayaking on Patonga Creek or head to the nearby beaches, with the calm waters of the bay perfect for swimming. At the end of each day, you can return to your private balcony to admire stunning water views or head to the pub on the ground floor and sample delicious Australian-inspired dishes.\n\n**Your handpicked inclusions:**\n\n- Celebrate your blissful coastal escape with a welcome bottle of wine\n- Raise a glass and enjoy one cocktail per person on arrival\n- Sample the very best Australian cuisine with A$50 food and drinks credit to use onsite\n- Stay in relaxation mode with guaranteed 12pm late checkout\n\n**Group Upgrade:** Travelling with friends or family? Upgrade to the Two-Bedroom Apartment for four people or the Three-Bedroom Apartment for the ultimate group getaway with up to six people.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Patonga",
    "location_subheading": "New South Wales",
    "location_description": "The Boathouse Hotel Patonga",
    "offer_address": "6-8 Patonga Dr, Patonga NSW 2256",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 314.0,
    "value": 621.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ct4FDQAY",
    "hero_image": "https://images.luxuryescapes.com/zsw85iosy9q96f02rhp",
    "image_two": "https://images.luxuryescapes.com/l22r44btxh9a4y0hwfxe",
    "image_three": "https://images.luxuryescapes.com/ogkrbynrhnn4mpbr82yf",
    "vendor_name": "The Boathouse Hotel Patonga",
    "title": "Central Coast Apartment Escape Less Than Two Hours from Sydney",
    "description": "Escape the city for seaside serenity on the Central Coast at The Boathouse Hotel Patonga, a gorgeous boutique property perched on the edge of Brisbane Water National Park in the historic fishing town of Patonga, overlooking Brisk Bay. Less than a two-hour drive from Sydney, this self-catering apartment escape is perfect for couples, families and groups alike. Includes a cocktail each on arrival, one complimentary bottle of wine in your apartment, A$50 food and drink credit and convenient late checkout until 12pm guaranteed.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Patonga",
    "location_subheading": "New South Wales",
    "location_description": "The Boathouse Hotel Patonga",
    "offer_address": "6-8 Patonga Dr, Patonga NSW 2256",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 309.0,
    "value": 672.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037JKLAA2",
    "hero_image": "https://images.luxuryescapes.com/8ufc12d7as41kthob5xp",
    "image_two": "https://images.luxuryescapes.com/3rgws957wos7ho98f6o",
    "image_three": "https://images.luxuryescapes.com/2zo4nltdf4fiirw07ujn",
    "vendor_name": "The Boathouse Hotel Patonga",
    "title": "Idyllic Central Coast Escape",
    "description": "Let your cares fall away on an escape to the charming Boathouse Hotel Patonga on NSW’s Central Coast, less than two hours from Sydney. Relax in a bright and breezy apartment, perfect for couples, groups and families with a beachfront location, onsite bar and restaurant, and easy access to local attractions. Enjoy the calm waters of Patonga Beach, kayak through lush Brisbane Waters National Park, hike to Warrah Lookout for stunning views over Broken Bay, or just soak up the sun on your private balcony.\n\n**Your handpicked inclusions:**\n\n- A$50 dining and drinks credit per room for The Boathouse Patonga\n- Toast your escape with a welcome drink on arrival per person\n- Stress-free 12pm checkout\n- Complimentary Wi-Fi\n\n**Travelling as a group?** Check out the apartments for up to six people.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Patonga",
    "location_subheading": "New South Wales",
    "location_description": "The Boathouse Hotel Patonga",
    "offer_address": "6-8 Patonga Dr, Patonga NSW 2256",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  }
]