[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J6MFIA0",
    "hero_image": "https://images.luxuryescapes.com/1q5m39bgc20z3equqw8",
    "image_two": "https://images.luxuryescapes.com/t1an3533rx2pbs3g313",
    "image_three": "https://images.luxuryescapes.com/s4mgbbixyj02li10qswa",
    "vendor_name": "Aarunya Nature Resort & Spa",
    "title": "Five-Star Sri Lanka Wellness Retreat with Daily Breakfast, Four-Course Lunch or Dinner & Free-Flow Drinks Hour",
    "description": "Immerse yourself in the serene beauty of Sri Lanka with a stay at this award-winning resort, nestled in the UNESCO World Heritage-listed Knuckles Mountain Range. Perched in the island's central highlands, this boutique retreat seamlessly blends wellness and luxury amidst breathtaking natural surroundings.\n\nAt the heart of this sanctuary is the Aarogya Luxury Spa, where personalised Balinese and Ayurvedic treatments await. Indulge in rejuvenation with access to an infrared sauna, yoga sessions and meditation, designed to help you achieve inner harmony. Unwind in the privacy of your villa, each offering unparalleled comfort with either a jacuzzi or plunge pool.\n\nExplore the nearby city of Kandy, home to the sacred Temple of the Tooth and the stunning Royal Botanical Gardens. Return to the resort to enjoy a refreshing dip in the infinity pool before savouring exquisite Sri Lankan cuisine at The Verandah restaurant, accompanied by sweeping views of the surrounding mountains.",
    "offer_country_name": "Sri Lanka",
    "offer_country_code_alpha_2": "LK",
    "offer_geo_area_level_1": "Central Province",
    "offer_geo_area_level_2": "මහනුවර",
    "location_heading": "Kandy",
    "location_subheading": "Sri Lanka",
    "location_description": "Aarunya Nature Resort & Spa",
    "offer_address": "100 Malgamandeniya Road, Alawatugoda, Kandy 20140, Sri Lanka",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 899.0,
    "value": 2485.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GiRQAA0",
    "hero_image": "https://images.luxuryescapes.com/sgl9k9ba880p6krbtyp",
    "image_two": "",
    "image_three": "",
    "vendor_name": "The Radh",
    "title": "Award-Winning Luxury in the Heart of Kandy with Room Upgrade & Daily Breakfast",
    "description": "Experience unsurpassed opulence and old-world charm in the heart of Kandy at The Radh - an award-winning boutique retreat ideally located on the doorstep of the breathtaking Temple of the Sacred Tooth Relic. Crowned Luxury City Hotel winner at the 2020 Luxury Hotel Awards, this architectural gem glows with Sri Lankan aristocracy through its effortlessness blend of royal grandeur and contemporary minimalism. Featuring a first-class Japanese restaurant by renowned chef and restaurateur Dharshan Munidasa, and a luxurious spa practising Ayurvedic and Javanese treatments, The Radh specialises in refined sophistication.\n\nProudly located in the cultural hub of Kandy - also known as The Hill Capital - The Radh sits in close proximity to some of the city's most splendid landmarks, including scenic Kandy Lake, the glorious Old Royal Palace and World Buddhist Museum, all less than a 10-minute stroll away. The Temple of the Sacred Tooth is Sri Lanka's most important Buddhist relic and a must-see when in Kandy, drawing tourists and devoted worshippers year-round to its eye-catching golden roof and stunningly ornate interiors.",
    "offer_country_name": "Sri Lanka",
    "offer_country_code_alpha_2": "LK",
    "offer_geo_area_level_1": "Central Province",
    "offer_geo_area_level_2": "Kandy",
    "location_heading": "Kandy",
    "location_subheading": "Sri Lanka",
    "location_description": "The Radh",
    "offer_address": "30 Colombo St, Kandy 20000, Sri Lanka",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvyZAAAZ",
    "hero_image": "https://images.luxuryescapes.com/pvt6ytekdhc6y95lbze",
    "image_two": "https://images.luxuryescapes.com/j7kuanvopfdf6tynhyl6",
    "image_three": "https://images.luxuryescapes.com/dthahu0s7h8xh5rpahy",
    "vendor_name": "Aarunya Nature Resort & Spa",
    "title": "Romantic Boutique Sri Lanka Villas with Breathtaking Views over Knuckles Mountain Range",
    "description": "Experience the tranquil beauty of Sri Lanka with a stay at this award-winning resort perched atop the island's central highlands. Escape to this oasis of opulence, where luxury intertwines seamlessly with nature's embrace. Discover the UNESCO World Heritage-listed Kandy, home to the Temple of the Tooth and the Royal Botanical Gardens, before returning to the resort to enjoy a refreshing dip in the infinity pool. Surrender to the tranquility of lush surroundings as you revel in the unmatched comfort of private villas, each featuring either a Jacuzzi or plunge pool. Savour authentic Sri Lankan cuisine at the onsite restaurant, and enjoy the resort's yoga and meditation facilities for a truly rejuvenating experience.",
    "offer_country_name": "Sri Lanka",
    "offer_country_code_alpha_2": "LK",
    "offer_geo_area_level_1": "Central Province",
    "offer_geo_area_level_2": "මහනුවර",
    "location_heading": "Kandy",
    "location_subheading": "Sri Lanka",
    "location_description": "Aarunya Nature Resort & Spa",
    "offer_address": "100 Malgamandeniya Road, Alawatugoda, Kandy 20140, Sri Lanka",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 324.0,
    "value": 324.0
  }
]