[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HnfS2YAJ",
    "hero_image": "https://images.luxuryescapes.com/4lsri7svcmcvc3370opz",
    "image_two": "https://images.luxuryescapes.com/pxff9dn9gxhiz60165a",
    "image_three": "https://images.luxuryescapes.com/da5ydzt03qb67edhsei",
    "vendor_name": "Porto Kea Suites- Kea Island",
    "title": "Idyllic Greek Island Seaside Suites with Daily Breakfast, Nightly Dinner & Two Kids Stay Free",
    "description": "Discover Cycladic charm at this seaside oasis tucked away on Greece's hidden gem island of Kea. Spend sun-drenched days lounging by the pool or indulge in authentic Greek cuisine at the hotel's traditional restaurant. Savour refreshing cocktails, mocktails and nibbles, perfect for those lazy afternoons between swims.\n\nNestled in a tranquil spot near the local port, the best of Kea is at your fingertips. Stroll to nearby sandy beaches, explore the ancient hiking trails that criss-cross the island or take a short drive to discover Ioulida, Kea's picturesque capital known for its stone-built houses and ancient stone lion.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Kea",
    "location_heading": "Kea",
    "location_subheading": "Greece",
    "location_description": "Porto Kea Suites",
    "offer_address": "Aghios Georgios Korissias, Kea 84002, Cyclades Islands, Greece",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 619.0,
    "value": 1210.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CVCVrYAP",
    "hero_image": "https://images.luxuryescapes.com/2ne6v0uysiv6l5h8l8o",
    "image_two": "https://images.luxuryescapes.com/stuafgx7rk7bz8yz427s",
    "image_three": "https://images.luxuryescapes.com/uziiyk5bh9o8s24y6lsr",
    "vendor_name": "Porto Kea Suites- Kea Island",
    "title": "Greek Island Seaside Suites with Onsite Restaurant, Pool & Spa",
    "description": "Discover laidback luxury with a dash of Cycladic charm at Porto Kea Suites, tucked away on Greece's hidden gem island, Kea. Spend sun-drenched days lounging by the pool or indulge in authentic Greek cuisine at the hotel's traditional restaurant. The dedicated bar staff offers refreshing cocktails and light bites served poolside, perfect for those lazy afternoon moments between swims.\n\nNestled in a tranquil spot near Korissia port, the best of Kea is at your fingertips. Stroll to nearby sandy beaches, explore the ancient hiking trails that crisscross the island, or take a short drive to discover Ioulida, the island's picturesque capital known for its stone-built houses and ancient stone lion, carved from a natural slab.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Kea",
    "location_heading": "Kea",
    "location_subheading": "Greece",
    "location_description": "Porto Kea Suites",
    "offer_address": "Agios Georgios Korissias, Kea (Tzia), Cyclades Islands, 84002, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 154.0,
    "value": 154.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CqIBdYAN",
    "hero_image": "https://images.luxuryescapes.com/3l9mrdjbojrz77kn8sit",
    "image_two": "https://images.luxuryescapes.com/wj9njnytcwa59qdiffsz7",
    "image_three": "https://images.luxuryescapes.com/lkmc2eb3qvohgw4ijw7g",
    "vendor_name": "Ydor Hotel & Spa- Kea Island",
    "title": "Oceanfront Hillside Greek Island Escape with Onsite Restaurant, Bar & Spa",
    "description": "Uncover the untouched beauty of Kea Island with a stay at this five-star hillside resort overlooking the Aegean Sea - perfectly positioned to explore the island's charming villages, ancient ruins and hiking trails. Savour Japanese and Mediterranean fusion at the onsite restaurant, Mizu, or indulge in a rejuvenating treatment at the world-class Cyrene Spa.\n\nThe hotel is a stone's throw from the pristine Otzias Beach, perfect for a refreshing dip in the salty ocean. As the day draws to a close, retreat to your elegantly appointed room, where floor-to-ceiling windows offer breathtaking views of the surrounding landscape.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Kea",
    "location_heading": "Kea",
    "location_subheading": "Greece",
    "location_description": "Ydor Hotel & Spa",
    "offer_address": "Vourkari 840 02, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 180.0,
    "value": 180.0
  }
]