[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CMUTbYAP",
    "hero_image": "https://images.luxuryescapes.com/2hu83dksid7zksi2yy",
    "image_two": "https://images.luxuryescapes.com/exeux18vm2p58m0yuta9",
    "image_three": "https://images.luxuryescapes.com/nc8gm08fnup0rha0u0g",
    "vendor_name": "The Lovina Bali",
    "title": "North Bali Beachfront Suites & Villas with Daily Breakfast, Massages & Nightly Cocktails",
    "description": "Embrace sun-kissed tranquillity at this secluded haven, nestled between shimmering blue waters and lush greenery in north Bali’s Lovina Beach. Boasting its very own stretch of private beach, and just moments away from famous dolphin-watching spots, this tropical resort is barefoot bliss at its finest. Take a dip in the sprawling pool, take to the water with stand-up paddleboarding or snorkelling, or keep active with morning yoga classes. Sample the region’s finest local produce at Heliconia Restaurant overlooking the local rice paddies or sip expertly crafted poolside cocktails at the Sunset Bar.\n\nBali’s northern coast beckons with a kaleidoscope of experiences waiting to be discovered, and with the hotel's complimentary shuttle service within Lovina Town, exploration is made easy. Delve into the rich tapestry of culture in the nearby Singaraja or marvel at the majestic cascades of Gitgit village’s waterfalls.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Buleleng",
    "location_heading": "Lovina Beach",
    "location_subheading": "Bali",
    "location_description": "The Lovina Bali",
    "offer_address": "Kalibukbuk, Jl. Mas Lovina, Kabupaten Buleleng, Bali 81151, Indonesia",
    "percentage_discount": 62.0,
    "min_duration": 4,
    "max_duration": 26,
    "price": 429.0,
    "value": 1122.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BedKAAS",
    "hero_image": "https://images.luxuryescapes.com/4z5gh82oofbqf7u095d",
    "image_two": "https://images.luxuryescapes.com/9u0gq5pmto3s4wzsj42p",
    "image_three": "https://images.luxuryescapes.com/nm819h4zgi4bho7czxga",
    "vendor_name": "The Lovina Bali",
    "title": "Beachfront Bali Pool Villa Escape with Daily Breakfast, Nightly Cocktails & Room Upgrade",
    "description": "Embrace sun-kissed tranquility at The Lovina Bali, a secluded haven nestled between shimmering blue waters and lush greenery in northern Bali’s Lovina Beach. This tropical resort is the perfect hideaway where you can relax, soak up the sun and recharge, all in a natural and peaceful environment. Take a dip in the outdoor pool or soak up the sun on the private beach, pausing only to order delicious cocktails from the Beach Bar. Sample the region's finest local produce at Heliconia or swap stories over cheesy slices at the pizzeria.\n\nWhen you’re ready to submit to relaxation, Body Tonic Spa will treat you to an aromatic massage, body wrap or peaceful scrub treatment. All the while, you’ll fall in love with the pristine beaches, stunning waters, tranquil environment and unforgettable activities of the prestigious Lovina Beach coastline. Whether you want to explore the arts and culture of nearby Singaraja, see the impressive waterfalls at Gitgit village or simply kick back and take it easy, The Lovina Bali will be your perfect base.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Buleleng",
    "location_heading": "Lovina Beach",
    "location_subheading": "Bali",
    "location_description": "The Lovina Bali",
    "offer_address": "Kalibukbuk, Jl. Mas Lovina, Kabupaten Buleleng, Bali 81151, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 399.0,
    "value": 889.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPSNtAAP",
    "hero_image": "https://images.luxuryescapes.com/m815n8twr55pfgwrz4q7",
    "image_two": "https://images.luxuryescapes.com/5594a3k4m6dvwn4ho1wx",
    "image_three": "https://images.luxuryescapes.com/rtygde8g2fjscmgzr1ah",
    "vendor_name": "The Lovina Bali",
    "title": "Beachfront Bali Pool Villa Escape with Daily Breakfast, Nightly Cocktails & Room Upgrade",
    "description": "Embrace sun-kissed tranquility at The Lovina Bali, a secluded haven nestled between shimmering blue waters and lush greenery in northern Bali’s Lovina Beach. This tropical resort is the perfect hideaway where you can relax, soak up the sun and recharge, all in a natural and peaceful environment. Take a dip in the outdoor pool or soak up the sun on the private beach, pausing only to order delicious cocktails from the Beach Bar. Sample the region's finest local produce at Heliconia or swap stories over cheesy slices at the pizzeria. Whether you want to explore the arts and culture of nearby Singaraja, see the impressive waterfalls at Gitgit village or simply kick back and take it easy, The Lovina Bali will be your perfect base.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Buleleng",
    "location_heading": "Lovina Beach",
    "location_subheading": "Bali",
    "location_description": "The Lovina Bali",
    "offer_address": "Kalibukbuk, Jl. Mas Lovina, Kabupaten Buleleng, Bali 81151, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 383.0,
    "value": 803.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id0aYAAR",
    "hero_image": "https://images.luxuryescapes.com/n5s9ypbehhcqi368ehkw",
    "image_two": "https://images.luxuryescapes.com/6nl3o996xvt011ojbvbh",
    "image_three": "https://images.luxuryescapes.com/sbj6j4hldgfj7jlbq1j",
    "vendor_name": "The Lovina Bali",
    "title": "North Bali Beachfront Pool Villa Oasis with Daily Breakfast, Massages & Nightly Cocktails",
    "description": "Embrace sun-kissed tranquility at this secluded haven, nestled between shimmering blue waters and lush greenery in northern Bali’s Lovina Beach. This tropical resort is the perfect hideaway for relaxing, soaking up the sun and recharging, all in a natural and peaceful environment. Take a dip in the outdoor pool, laze on the private beach or take to the water with stand-up paddleboarding, kayaking or snorkelling. Sample the region's finest local produce at Heliconia or sip on your new favourite drink at the Sunset Bar.\n\nBali's northern coast beckons with a kaleidoscope of experiences waiting to be discovered. From delving into the rich tapestry of arts and culture in nearby Singaraja to marveling at the majestic cascades of Gitgit village's waterfalls. Whether you want to explore or simply kick back and take it easy, The Lovina Bali will be your perfect base.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Buleleng",
    "location_heading": "Lovina Beach",
    "location_subheading": "Bali",
    "location_description": "The Lovina Bali",
    "offer_address": "Kalibukbuk, Jl. Mas Lovina, Kabupaten Buleleng, Bali 81151, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 599.0,
    "value": 1607.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMWhLAAX",
    "hero_image": "https://images.luxuryescapes.com/t3x1l3cjuew34rlff8as",
    "image_two": "https://images.luxuryescapes.com/55waictc1j6g6j736nf",
    "image_three": "https://images.luxuryescapes.com/mn7ar56ijilb1f99v33",
    "vendor_name": "The Lovina Bali",
    "title": "Bali Private Beachfront Oasis with Guaranteed Pool Villa Upgrade, Daily Breakfast & Nightly Cocktails",
    "description": "Embrace sun-kissed tranquillity at The Lovina Bali, a secluded haven nestled between shimmering blue waters and lush greenery in northern Bali’s Lovina Beach. This tropical resort is the perfect hideaway for relaxing, soaking up the sun and recharging, all in a natural and peaceful environment. Take a dip in the outdoor pool, laze on the private beach or take to the water with stand-up paddleboarding, kayaking or snorkelling. Sample the region's finest local produce at Heliconia or sip on your new favourite drink at the Sunset Bar. Whether you want to explore the arts and culture of nearby Singaraja, see the impressive waterfalls at Gitgit village or simply kick back and take it easy, The Lovina Bali will be your perfect base.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Buleleng",
    "location_heading": "Lovina Beach",
    "location_subheading": "Bali",
    "location_description": "The Lovina Bali",
    "offer_address": "Kalibukbuk, Jl. Mas Lovina, Kabupaten Buleleng, Bali 81151, Indonesia",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 365.0,
    "value": 1366.0
  }
]