[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EEV8jYAH",
    "hero_image": "https://images.luxuryescapes.com/ofjox2aejpvaw7aft8d8",
    "image_two": "https://images.luxuryescapes.com/5qqlnm54180q5l5122k",
    "image_three": "https://images.luxuryescapes.com/fkncrqn58cc0zuibu3",
    "vendor_name": "Marnong Estate",
    "title": "Central Victoria Vineyard Studio & Apartment Luxury with Wine Tastings, Dining Credit & Daily Breakfast",
    "description": "Escape to Marnong Estate, a luxury retreat and the ultimate haven for wine lovers, set amid 1,200 acres of breathtaking vineyards in the heart of central Victoria. Just a short drive from Melbourne, this hidden gem offers sweeping countryside views, award-winning wines and an experience that lingers long after you leave.\n\nStart your day with a freshly brewed coffee at Caffe Vista before indulging in an authentic Italian lunch at Cucina 3064. As evening falls, elevate the experience at the chef-hatted La Vètta, where the finest local ingredients are transformed into an unforgettable dining affair. At the Cellar Door, immerse yourself in a curated tasting of estate-grown, award-winning wines.\n\nWander the estate’s picturesque grounds, bask in the golden hour glow or watch the sunset paint the Macedon Ranges in warm hues from The Main Lawn. Unwind on your private balcony, where vineyard views stretch endlessly before you. Whether you're strolling through romantic vines, savouring a glass of the finest vintage or simply embracing the tranquility of the countryside, Marnong Estate is the perfect escape from the everyday.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Mickleham",
    "location_subheading": "Victoria",
    "location_description": "Marnong Estate",
    "offer_address": "2335 Mickleham Road, Mickleham, Victoria 3064, Australia",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 339.0,
    "value": 725.0
  }
]