[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Ls3gAAC",
    "hero_image": "https://images.luxuryescapes.com/f6m4c9hj54kycr94xds",
    "image_two": "https://images.luxuryescapes.com/s99ognuzeg5ffohmget",
    "image_three": "https://images.luxuryescapes.com/bqkm8a7mvalkjwiefzp",
    "vendor_name": "Qamea Resort and Spa Fiji",
    "title": "Fiji Intimate Island Haven with All-Inclusive Dining, Massages & Return Transfers",
    "description": "Cloaked in 42km of lush jungle, with palm-fringed, powder-white beaches, azure Pacific waters and a soaring backdrop of volcanic mountains, Qamea Resort and Spa Fiji is an intimate Fijian island paradise that revels in its isolation.\n\nTucked away on a private island in the northern waters of Fiji, this romantic beachfront resort features a collection of 15 luxuriously appointed bures nestled among swaying coconut palms and tropical gardens, mere steps from some of the softest sands in the South Pacific. It's also home to the award-winning Jungle Spa - a rejuvenating treetop sanctuary that invites you to submit to ultimate bliss while listening to the calls of nature. Paradise flows from the island's forested peaks to the depths of its surrounding waters, where myriad world-class dive sites await. Boasting a PADI five-star accredited dive facility, the resort is a haven for certified underwater enthusiasts, while snorkelers can explore the kaleidoscopic marine sanctuary moments from the resort's shoreline.\n\nEnjoy home-grown organic cuisine sourced from local farmers and fishermen when you dine at Bure Kalau, experience age-old customs with a traditional kava ceremony and Meke performance, or simply enjoy Qamea's natural beauty on an invigorating coastal hike, waterfall picnic or on a paddleboarding adventure.\n\n**Your handpicked inclusions:**\n\n- Indulge in fresh Fijian gourmet cuisine with all-inclusive breakfast, lunch, dinner and afternoon tea at the laid-back Bure Kalau\n- Enjoy complimentary roundtrip land and boat transfers between Taveuni Airport and the resort\n- Unwind with one 60-minute signature spa massage per person at Qamea Resort's award-winning Jungle Spa\n- Celebrate on arrival with a bottle of wine and a cheese platter for two, served in the privacy of your bure\n- Explore the underwater world off the shores of Qamea with an exciting, guided snorkelling excursion\n- Admire Qamea's stunning coastline on an exhilarating guided kayak tour\n- Enjoy resort activities including nightly entertainment, cultural performances and complimentary use of non-motorised watersport equipment\n\n**Looking for added romance?** Upgrade to the luxurious Honeymoon Bure with uninterrupted beach vistas and a private outdoor jacuzzi pool.\n\n**Extended stay bonus:** Stay for seven nights or more and enjoy FJD100 resort credit to put towards excursions, spa treatments and more.\n\n**Book with 100% Confidence**: If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Northern Division",
    "offer_geo_area_level_2": "Qamea Island",
    "location_heading": "Qamea Island",
    "location_subheading": "Fiji",
    "location_description": "Qamea Resort and Spa Fiji",
    "offer_address": "P.a.matei, Qamea Island, Fiji",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 2079.0,
    "value": 4072.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004hJfMAAU",
    "hero_image": "https://images.luxuryescapes.com/75zwelt6ik1wzigkei6",
    "image_two": "https://images.luxuryescapes.com/b6bprw4o1s5kb19wpkd",
    "image_three": "https://images.luxuryescapes.com/gl1d8zpvkub16f98o3",
    "vendor_name": "Qamea Resort and Spa Fiji",
    "title": "Adults-Only Fiji Island Paradise with Daily Breakfast",
    "description": "Indulge in peaceful and private beachfront bliss with an escape to Qamea Resort and Spa, a romantic retreat in northern Fiji. Perched on the coastline of secluded Qamea Island, this luxury low-key property is surrounded by lush gardens, palm-fringed, sugar-white sand beaches and crystal-clear waters just waiting to be explored via snorkel, dive, kayak or stand-up paddleboard.\n\nTime will stand still at Qamea Resort and Spa, with endless hours spent in the water, on the sand, in the spa or under the sun’s rays. With just 15 bures and villas spread across 42 acres of tropical gardens, privacy comes at no premium, with as much or as little interaction as you’d like. Step onto some of the softest sands in the South Pacific, or take to the azure waters to discover the striking coral reefs that live below. A five-star PADI dive shop has everything you need for underwater adventures, but if you’d rather stay above board, kayaking or stand-up paddleboarding equipment is on hand for marine exploring. End each day at the award-winning Jungle Spa, a hillside sanctuary that encourages relaxation and rejuvenation through deep-tissue massages, body wraps and oxygen facials. Sample the fresh flavours of fusion Fijian cuisine at Bure Kalau with a cocktail or two, or organise an intimate dining experience on the sand.\n\n**Luxury Escapes inclusions (select nights only):**\n\n- Indulge in a delicious **full hot breakfast every morning**\n- Unwind with a **one-time foot massage** at the award-winning Jungle Spa\n- Spend an evening sipping one **sunset** **cocktail each**\n- Embrace tranquility with a **90-minute couples' massage** (for stays of 3+ nights)\n- Travel seamlessly with **roundtrip land and boat airport transfers** (for stays of 5+ nights)\n- Explore the underworld world on a **guided premium snorkelling tour** (for stays of 7+ nights)\n- Admire the island’s stunning coastline with a **guided kayak tour** (for stays of 7+ nights)\n\n**All-Inclusive Upgrade**: Upgrade and indulge in fresh Fijian gourmet cuisine with daily breakfast, lunch, dinner and afternoon tea at the laidback Bure Kalau.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Northern Division",
    "offer_geo_area_level_2": "Qamea Island",
    "location_heading": "Qamea Island",
    "location_subheading": "Fiji",
    "location_description": "Qamea Resort and Spa Fiji",
    "offer_address": "P.a.matei, Qamea Island, Fiji",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  }
]