[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IubYIAS",
    "hero_image": "https://images.luxuryescapes.com/bc8fg7dt7r4tfbhk1bj9",
    "image_two": "https://images.luxuryescapes.com/znkxfmr7lik38lig28i",
    "image_three": "https://images.luxuryescapes.com/u3ovdf1yg7me0pdxtpi",
    "vendor_name": "Seafront Holiday Park Kangaroo Island",
    "title": "Kangaroo Island Beachfront Eco-Glamping with Daily Breakfast & Nightly Drinks",
    "description": "Swap the city for majestic landscapes, salt-licked beaches, incredible wildlife and gourmet wine scene at this deluxe glamping escape on Kangaroo Island. Constructed from only environmentally sustainable tents, each hideway is nestled in the native bushland and boasts direct access to Penneshaw Beach. \n\nEmbrace tranquillity and nature in Kangaroo Island, where you may choose to trace the trails of the magnificent Flinders Chase National Park - home to the beautiful boulders of Remarkable Rocks - or visit the Seal Bay Conservation Park, where you can walk among endangered sea lions on the beach.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Penneshaw",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Seafront Holiday Park Kangaroo Island",
    "offer_address": "8 Frenchmans Terrace, Penneshaw, South Australia 5222, Australia",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 289.0,
    "value": 471.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LryMAAS",
    "hero_image": "https://images.luxuryescapes.com/nsdhuhwoham9i3dgt1nc",
    "image_two": "https://images.luxuryescapes.com/dfnqb7y2zohmhxa6mch",
    "image_three": "https://images.luxuryescapes.com/t13imekrkxvdt2ix1ont",
    "vendor_name": "Seafront Holiday Park Kangaroo Island",
    "title": "Kangaroo Island Seafront Glamping with Daily Breakfast & Drinks",
    "description": "Experience nature without having to forgo home comforts amid Kangaroo Island’s serene beaches, stunning coastline and flourishing wildlife at Seafront Kangaroo Island. Take in the natural splendour of the Backstairs Passage while enjoying hot showers from the comfort of your eco-luxury tent.\n\nCheers to your escape with a local bottle of Kangaroo Island wine on arrival and enjoy glamping comfort a mere 300m from Hog Bay Beach and Sealink Ferry Terminal. Includes daily breakfast and a nightly drink per adult at the clifftop Penneshaw Hotel.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Penneshaw",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Seafront Holiday Park Kangaroo Island",
    "offer_address": "8 Frenchmans Terrace, Penneshaw, South Australia 5222, Australia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 350.0,
    "value": 645.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xQEuAAM",
    "hero_image": "https://images.luxuryescapes.com/stjmedvh4lc595x8z00r",
    "image_two": "https://images.luxuryescapes.com/ex51f4aw0s02fpkpxab",
    "image_three": "https://images.luxuryescapes.com/hsspu9pkwyt3fro9ysd",
    "vendor_name": "Ecopia Retreats",
    "title": "Romantic Off-Grid Kangaroo Island Eco Villas with Daily Gourmet Breakfast Hamper",
    "description": "Immerse yourself in the stunning landscapes of Kangaroo Island with a front-row seat to one of the island's most coveted wilderness escapes, the off-grid Ecopia Retreat. A luxury hideaway surrounded by 150 acres of untouched flora with intimate eco villas that offer a unique nature experience in a curated setting, where you can drink in panoramic views and enjoy the company of local flora and fauna.\n\nPowered by solar energy and a rainwater system with luxurious touches including a freestanding bathtub and a charming log wood fireplace, this private retreat - home to just two villas (and a residence) - invites you to discover the perfect balance between sustainable, eco-friendly living and romance. Tucked away within a dedicated wildlife sanctuary, you'll have exclusive access to Eleanor River and the unique opportunity to see a wide range of local critters in their natural habitat. When you're ready to explore beyond the property's acreage, head to the incredible Remarkable Rocks, make your way over to Admirals Arch, and take your beach towel to Emu Bay for a day on the white-sand beach.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Seddon",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Ecopia Retreat",
    "offer_address": "563B Gregors Rd, Seddon, Kangaroo Island, SA 5223",
    "percentage_discount": 31.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 991.0,
    "value": 1438.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csFPFQA2",
    "hero_image": "https://images.luxuryescapes.com/13qlr7jv7s2is3fkr7i",
    "image_two": "https://images.luxuryescapes.com/xnhbk7osrs6o5udgwlb",
    "image_three": "https://images.luxuryescapes.com/g8en1f3s6wcvexsudkyi",
    "vendor_name": "Sea Dragon Kangaroo Island",
    "title": "Amazing Wilderness Escape on Kangaroo Island",
    "description": "Discover the beauty of Kangaroo Island, an amazing gourmet food, wine and wildlife destination off the coast of South Australia, at Sea Dragon Lodge, a stunning oceanfront retreat overlooking Pink Bay and mainland Australia. The private beach offers glistening turquoise waters and shimmering sand with the rhythmic lapping of the waves creating a peaceful atmosphere. While on Kangaroo Island you can indulge in local produce, visit award-winning cellar doors, explore natural rock formations and spot seals basking in the sun. All eco-villas and apartments include fully equipped kitchens and offer amazing ocean views from private decks - you might even wake up to wildlife on your doorstep! Includes a daily breakfast hamper and a bottle of wine on arrival.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Sea Dragon Kangaroo Island",
    "offer_address": "2575 Cape Willoughby Road, Pink Bay, Kangaroo Island, South Australia, 5222, Australia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 3,
    "price": 553.0,
    "value": 998.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvtpOAAR",
    "hero_image": "https://images.luxuryescapes.com/s66s7bjx29ps6bnslo2d",
    "image_two": "https://images.luxuryescapes.com/54gkr8iu4gis0uqeuff",
    "image_three": "https://images.luxuryescapes.com/c95ed1m4zjmuz997od6",
    "vendor_name": "Sea Dragon Kangaroo Island",
    "title": "Kangaroo Island Oceanfront Escape with Two Island Tours, Daily Breakfast & Nightly Two-Course Dinner with Drinks",
    "description": "Serene memories await at the peaceful Sea Dragon Kangaroo Island, a stunning oceanfront retreat overlooking Pink Bay. Set on 250 acres of coastline estate, this secluded hideaway includes private access to a pristine beach, where guests can safely swim or enjoy a sun-downer. Known as Australia's answer to the Galapagos, Kangaroo Island is home to an abundance of native Australian wildlife, and many species can be glimpsed from this harmonious spot. The property works with its natural surroundings, using elements that greatly minimise its environmental footprint.\n\nThis tranquil escape offers the perfect location to indulge in local gourmet produce, visit award-winning cellar doors, and spot kangaroos outside your window. Any road trip across the island will immediately give you a taste of the strong paddock-to-plate presence that has turned Kangaroo Island into a gourmet food-lovers paradise. Your hosts can do the work of planning for you, with bespoke tour experiences that combine gastronomic adventures with stunning national park scenery and incredible wildlife encounters.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Sea Dragon Kangaroo Island",
    "offer_address": "2575 Cape Willoughby Road, Pink Bay, Kangaroo Island, South Australia, 5222, Australia",
    "percentage_discount": 23.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 2057.0,
    "value": 2681.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Hf5pIAC",
    "hero_image": "https://images.luxuryescapes.com/sx1ox7c8rxbhh3127zd",
    "image_two": "https://images.luxuryescapes.com/z67l22s4llcjzqslqjxm",
    "image_three": "https://images.luxuryescapes.com/yca1u7ir5jc97utvrzsd",
    "vendor_name": "Mercure Kangaroo Island Lodge",
    "title": "Tranquil Kangaroo Island Waterfront Escape with Daily Breakfast",
    "description": "Discover Australia's answer to the Galapagos with a relaxing stay at this waterfront resort sandwiched between American River's tranquil coves and native bushland. Featuring well-appointed accommodation with gorgeous views and an award-winning restaurant that highlights the island's exceptional regional produce, this relaxing retreat has everything you need for a comfortable stay amid nature.\n\nStretch your legs along the surrounding nature trails, then retreat to spend winter evenings by the roaring fireplace with a delicious glass of local red wine. Perfectly positioned for exploring the island's highlights from Stokes Bay to Admiral Arch, Mercure Kangaroo Island Lodge is the ideal choice for those seeking an adventurous escape or an opportunity to unwind.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "American River",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Mercure Kangaroo Island Lodge",
    "offer_address": "73 Scenic Drive, American River, Kangaroo Island, South Australia 5221, Australia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 231.0,
    "value": 581.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gWNoAAM",
    "hero_image": "https://images.luxuryescapes.com/jwu223rd4h18lwney9gj",
    "image_two": "https://images.luxuryescapes.com/ipxfrnp6oqj64wn10dnn",
    "image_three": "https://images.luxuryescapes.com/65z629jbnvtxbfz6lgzn",
    "vendor_name": "Sea Dragon Kangaroo Island",
    "title": "Kangaroo Island Oceanview Villas with Half-Day Tour, Daily Breakfast & Nightly Two-Course Dinner",
    "description": "Bask in the serenity of Kangaroo Island during your stay at Sea Dragon Kangaroo Island, a stunning oceanfront retreat overlooking Pink Bay. Set on 250 acres of seafront estate, this tranquil hideaway extends onto a pristine, secluded beach where guests can safely swim, snorkel or enjoy a sun-downer.\n\nWith its incredible ocean views and amazing eco-friendly design, you won’t ever want to leave your inviting villa. Enjoy the comfort of dining within your villa with a kitchen, lounge area and dining area, then revel in the privacy afforded by the serene bush setting, allowing you to relax in your outdoor bath on the private deck, overlooking the ocean. While on Kangaroo Island, you can indulge in gourmet local produce, visit award-winning cellar doors, explore natural rock formations and spot seals basking in the sun. This is a truly once-in-a-lifetime getaway in one of Australia’s most pristine landscapes - and this back-to-nature experience will be one to remember.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Sea Dragon Kangaroo Island",
    "offer_address": "2575 Cape Willoughby Road, Pink Bay, Kangaroo Island, South Australia 5222",
    "percentage_discount": 19.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 1942.0,
    "value": 2399.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ib5AmAAJ",
    "hero_image": "https://images.luxuryescapes.com/fpyp52stxgya8r34bhb",
    "image_two": "https://images.luxuryescapes.com/z8zmri7j4jng13h6brh6",
    "image_three": "https://images.luxuryescapes.com/ixqaimypu0a0vk80wln",
    "vendor_name": "Mercure Kangaroo Island Lodge",
    "title": "Tranquil Kangaroo Island Waterfront Escape with Daily Breakfast",
    "description": "Discover Australia's answer to the Galápagos with a relaxing stay at this contemporary waterfront oasis sandwiched between American River's tranquil coves and native bushland. Featuring well-appointed accommodation with gorgeous views and an award-winning restaurant that highlights the island's exceptional regional produce, this relaxing retreat has everything you need for a comfortable stay amid nature. Stretch your legs along the surrounding nature trails, then retreat to spend winter evenings by the roaring fireplace with a delicious glass of local red wine. Perfectly positioned for exploring the island's highlights from Stokes Bay to Admiral Arch, Mercure Kangaroo Island Lodge is the ideal choice for those seeking an adventurous escape or an opportunity to unwind off the grid.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "American River",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Mercure Kangaroo Island Lodge",
    "offer_address": "73 Scenic Drive, American River, Kangaroo Island, South Australia 5221, Australia",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 227.0,
    "value": 583.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Cw59AAAR",
    "hero_image": "https://images.luxuryescapes.com/91djl2e46avbl1lkrf4",
    "image_two": "https://images.luxuryescapes.com/l51x68a7c85nldzrv1g",
    "image_three": "https://images.luxuryescapes.com/moy7sa0f7je20hykjp0p",
    "vendor_name": "Sea Dragon Kangaroo Island",
    "title": "Tranquil Kangaroo Island Oceanfront Escape with Two Island Tours, Daily Breakfast & Nightly Two-Course Dinner",
    "description": "Serene memories await at the peaceful Sea Dragon Kangaroo Island, a stunning oceanfront retreat overlooking Pink Bay. Set on 250 acres of coastline estate, this tranquil hideaway includes private access to a secluded, pristine beach, where guests can safely swim, snorkel or enjoy a sun-downer. Known as Australia's answer to the Galapagos, Kangaroo Island is home to an abundance of native Australian wildlife, and many species can be glimpsed from this harmonious spot. The property works with its natural surroundings, utilising elements that greatly minimise its environmental footprint.\n\nThis serene escape offers the perfect location to indulge in local gourmet produce, visit award-winning cellar doors, and spot kangaroos outside your window. Any road trip across the island will immediately give you a taste of the strong paddock-to-plate presence that has turned Kangaroo Island into a gourmet food-lovers paradise. Your hosts can do the work of planning for you, with bespoke tour experiences that combine gastronomic adventures with stunning national park scenery and incredible wildlife encounters.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Sea Dragon Kangaroo Island",
    "offer_address": "2575 Cape Willoughby Road, Pink Bay, Kangaroo Island, South Australia 5222",
    "percentage_discount": 19.0,
    "min_duration": 3,
    "max_duration": 3,
    "price": 2303.0,
    "value": 2830.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zT09AAE",
    "hero_image": "https://images.luxuryescapes.com/nq430d4h45xkzu0li46r",
    "image_two": "https://images.luxuryescapes.com/44i4igbcvs5lyrdz0vv8",
    "image_three": "https://images.luxuryescapes.com/8rx68k3a268h2u8po2p",
    "vendor_name": "Seafront Holiday Park Kangaroo Island",
    "title": "Kangaroo Island Ocean-View Glamping with Daily Breakfast & Nightly Clifftop Drinks",
    "description": "Swap the city for Kangaroo Island's majestic landscapes, salt-licked beaches, incredible wildlife and gourmet scene, with a one-of-a-kind eco-luxe glamping escape at Seafront Kangaroo Island - a beautiful coastal property nestled less than a one-hour ferry ride from South Australia's Cape Jervis.\n\nPerched on the edge of Penneshaw Esplanade, wake up just metres from the beach in your very own safari-style tent - you might even spot a kangaroo or two playing around your campsite. Be immersed in eco-luxury with a welcome bottle of Kangaroo Island wine, daily breakfast at the Seafront Hotel and one nightly drink per adult at the clifftop Penneshaw Hotel.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Penneshaw",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Seafront Holiday Park Kangaroo Island",
    "offer_address": "8 Frenchmans Terrace, Penneshaw, South Australia 5222, Australia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 359.0,
    "value": 664.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zB7kAAE",
    "hero_image": "https://images.luxuryescapes.com/2i592ao6zbvkeb64oyqe",
    "image_two": "https://images.luxuryescapes.com/iai91p78krta5opsbpn",
    "image_three": "https://images.luxuryescapes.com/p9868wy6xhwrihjidxj",
    "vendor_name": "Mercure Kangaroo Island Lodge",
    "title": "Tranquil Kangaroo Island Waterfront Escape with Daily Breakfast",
    "description": "Discover Australia's answer to the Galápagos with a relaxing stay at Mercure Kangaroo Island Lodge, a contemporary waterfront oasis sandwiched between American River's tranquil coves and native bushland.\n\nFeaturing well-appointed accommodation with gorgeous views and an award-winning restaurant that highlights the island's exceptional regional produce, this relaxing retreat has everything you need for a comfortable stay amid nature. Enjoy a game of tennis on the full-size court or stretch your legs along the surrounding nature trails, then retreat to spend winter evenings by the roaring fireplace or enjoy a dip in the sparkling pool to find a reprieve from summer heat. Perfectly positioned for exploring the island's highlights, Mercure Kangaroo Island Lodge is the ideal choice for those seeking an adventurous escape or an opportunity to unwind off the grid.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "American River",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Mercure Kangaroo Island Lodge",
    "offer_address": "73 Scenic Drive, American River, Kangaroo Island, South Australia 5221, Australia",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 9,
    "price": 194.0,
    "value": 447.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EGcxKYAT",
    "hero_image": "https://images.luxuryescapes.com/t34694gpgme7py1i6cd",
    "image_two": "https://images.luxuryescapes.com/7k43ct5z9331smaaw2d",
    "image_three": "https://images.luxuryescapes.com/5mdzpev4z7fmgn5hzfn",
    "vendor_name": "Mercure Kangaroo Island Lodge",
    "title": "Boutique Kangaroo Island Waterfront Retreat with Daily Breakfast",
    "description": "Discover the natural beauty of Kangaroo Island with a stay at this waterfront retreat. Nestled between American River Bay and native bushland, it offers well-appointed accommodation with stunning views. Reflections restaurant showcases the island’s finest regional produce, while nearby nature trails offer exploration, or you can unwind by the fireplace with a glass of local red wine. With easy access to top attractions like Stokes Bay and Admiral Arch, this lodge is perfect for both adventure and relaxation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "American River",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Mercure Kangaroo Island Lodge",
    "offer_address": "73 Scenic Drive, American River, Kangaroo Island, South Australia 5221, Australia",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 227.0,
    "value": 553.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcgB9AAJ",
    "hero_image": "https://images.luxuryescapes.com/o2plwfcash1yszypuku",
    "image_two": "https://images.luxuryescapes.com/pr2ys4p83v51e70fh4ca",
    "image_three": "https://images.luxuryescapes.com/rjqwj6ivop8kxyut3l6",
    "vendor_name": "Sea Dragon Kangaroo Island",
    "title": "Tranquil Kangaroo Island Oceanfront Escape with Half-Day Tour, Daily Breakfast & Nightly Two-Course Dinner",
    "description": "Serene Kangaroo Island memories await you at the peaceful Sea Dragon Kangaroo Island, a stunning oceanfront retreat overlooking Pink Bay. Set on 250 acres of coastline estate, this tranquil hideaway includes private access to a secluded, pristine beach, where guests can safely swim, snorkel or enjoy a sun-downer. Known as Australia's answer to the Galápagos, Kangaroo Island is home to an abundance of native Australian wildlife, and many species can be glimpsed from this harmonious spot. The property works with its natural surroundings, utilising elements that greatly minimise its environmental footprint. It's the perfect location to indulge in gourmet local produce, visit award-winning cellar doors, and spot kangaroos outside your window.\n\nAny road trip across the island will immediately give you a taste of the strong paddock-to-plate presence that has turned Kangaroo Island into a gourmet food-lovers’ paradise. Your hosts can do the work of planning for you, with bespoke tour experiences that combine gastronomic adventures with stunning national park scenery and incredible wildlife encounters.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Sea Dragon Kangaroo Island",
    "offer_address": "2575 Cape Willoughby Road, Pink Bay, Kangaroo Island, South Australia 5222",
    "percentage_discount": 20.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 2009.0,
    "value": 2499.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PoddAAC",
    "hero_image": "https://images.luxuryescapes.com/j77y956cv1svvul485n",
    "image_two": "https://images.luxuryescapes.com/a3k12viqboivq5bcrfj",
    "image_three": "https://images.luxuryescapes.com/swk777ayzm1nwv4csjrj",
    "vendor_name": "Seafront Holiday Park Kangaroo Island",
    "title": "Kangaroo Island Eco-Glamping 100m from the Beach with Daily Breakfast & Nightly Clifftop Drinks",
    "description": "Swap the city for Kangaroo Island's majestic landscapes, salt-licked beaches, incredible wildlife and gourmet scene, with a one-of-a-kind eco-luxe glamping escape at Seafront Kangaroo Island - a beautiful adults-only coastal property nestled less than a one-hour ferry ride from South Australia's Cape Jervis. The property is perched on the edge of Penneshaw Esplanade, so you can wake up in your very own glamping tent just 100 metres from the beachfront - you might even spot a kangaroo or two playing around your campsite.\n\nA destination for adventures and wildlife encounters, this 540km-long stretch of rugged coastline invites you to trace the trails of the magnificent Flinders Chase National Park - home to the beautiful boulders of Remarkable Rocks. Embark on a Kangaroo Island cruise or swim alongside wild dolphins (charges apply), or visit the Seal Bay Conservation Park, where you can walk among endangered sea lions on the beach.\n\n**Your handpicked inclusions:**\n\n- Your day is off to a great start with made-to-order breakfast served at Kangaroo Island Seafront Hotel\n- Celebrate your escape with a bottle of wine on arrival from a local winery (your choice of red or white)\n- Round out each day with a nightly drink (glass of house wine, bubbles, tap beer or soft drink) per person at Penneshaw Hotel",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Penneshaw",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Seafront Holiday Park Kangaroo Island",
    "offer_address": "8 Frenchmans Terrace, Penneshaw, South Australia 5222, Australia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 365.0,
    "value": 673.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J4ByIAK",
    "hero_image": "https://images.luxuryescapes.com/zwe7j2tp1xd3g6ld86q",
    "image_two": "https://images.luxuryescapes.com/vwxdiucp0spc15jvh03h",
    "image_three": "https://images.luxuryescapes.com/us722aozucek8w1fteyh",
    "vendor_name": "Stowaway Kangaroo Island",
    "title": "Award-Winning Kangaroo Island Luxury Boutique Retreat with Self-Contained Villas & Local Breakfast Hampers",
    "description": "Kangaroo Island’s rugged coastline and lush bushland provide the perfect backdrop for a romantic getaway. Escape the city's hustle and enjoy an elevated bush living experience at the award-winning Stowaway Kangaroo Island, where you and your partner can relax in one of four exclusive private villas. \n\nEach villa, nestled on the island’s northern side, offers stunning views - either of Stokes Bay Beach, voted Australia’s Best Beach in 2023 - or the serene Lathami Conservation Park.\n\nFrom your private terrace, you can spot kangaroos and rare birds in their natural habitat, sip complimentary wine in the outdoor jacuzzi and end your day cozy by the sauna or fireplace. For the ultimate indulgence, enjoy a unique spa experience with in-villa couples’ massages, facials and full-body scrubs.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Cassini",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Stowaway Kangaroo Island",
    "offer_address": "3923 North Coast Road, Cassini, South Australia 5223, Australia",
    "percentage_discount": 29.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1359.0,
    "value": 1901.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZnoKGQAZ",
    "hero_image": "https://images.luxuryescapes.com/gfuhqgfnl3gcnaaa14h4",
    "image_two": "https://images.luxuryescapes.com/mtqn0moj93ejuit9ojbx",
    "image_three": "https://images.luxuryescapes.com/l1mnvw5vqg1ujw09qeib",
    "vendor_name": "Sea Dragon Kangaroo Island",
    "title": "Amazing Wilderness Escape on Kangaroo Island",
    "description": "Discover the beauty of Kangaroo Island, an amazing gourmet food, wine and wildlife destination off the coast of South Australia. Sea Dragon Lodge & Villas is a stunning, ocean-front, luxury retreat overlooking Pink Bay and mainland Australia. The private beach offers glistening turquoise waters and shimmering sand with the rhythmic lapping of the waves creating a peaceful atmosphere. While on Kangaroo Island you can indulge in local produce, visit award-winning cellar doors, explore natural rock formations and spot seals basking in the sun. All eco-villas and apartments include fully equipped kitchens and offer amazing ocean views from their decks - you might even wake up to wildlife on your doorstep! Includes a daily breakfast hamper and a bottle of wine on arrival.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Sea Dragon Kangaroo Island",
    "offer_address": "2575 Cape Willoughby Road, Pink Bay, Kangaroo Island, South Australia, 5222, Australia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 3,
    "price": 565.0,
    "value": 1020.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EeCikAAF",
    "hero_image": "https://images.luxuryescapes.com/st03irjsza5i3uz0ulzj",
    "image_two": "https://images.luxuryescapes.com/gm0wdy78gsxrqzejl48x",
    "image_three": "https://images.luxuryescapes.com/jiqqcitibc8x59x3mdv9",
    "vendor_name": "Seafront Holiday Park Kangaroo Island",
    "title": "Kangaroo Island Luxury Beachfront Eco-Glamping with Daily Breakfast & Nightly Clifftop Drinks",
    "description": "Swap the city for Kangaroo Island's majestic landscape, salt-licked beaches, incredible wildlife and gourmet food and wine scene, with a one-of-a-kind eco-luxe glamping escape at Kangaroo Island Seafront Holiday Park. The beautiful coastal paradise, constructed from only environmentally sustainable tents, is nestled less than a one-hour ferry from South Australia's Cape Jervis. The property is perched on the edge of Penneshaw Esplanade, so you can wake in your glamping tent to overlook the beautiful Hog Bay.\n\nEmbrace tranquillity along this stretch of rugged South Australian coastline, where you may choose to trace the trails of the magnificent Flinders Chase National Park - home to the beautiful boulders of Remarkable Rocks - or visit the Seal Bay Conservation Park, where you can walk among endangered sea lions on the beach.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Penneshaw",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Seafront Holiday Park Kangaroo Island",
    "offer_address": "8 Frenchmans Terrace, Penneshaw, South Australia 5222, Australia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 359.0,
    "value": 662.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IemZaAAJ",
    "hero_image": "https://images.luxuryescapes.com/a2fv7i20mc5jyserlyzp",
    "image_two": "https://images.luxuryescapes.com/dydyxrn0bbkgnu5w0nt",
    "image_three": "https://images.luxuryescapes.com/x35s436z8m10im2m968",
    "vendor_name": "CABN X Kangaroo Island",
    "title": "Adults-Only Kangaroo Island Off-Grid Eco-Cabin with Ocean Views & Private Sauna",
    "description": "Surround yourself with nature and disconnect in ultimate luxury with a Kangaroo Island stay that elevates eco-tourism to new heights. Light-filled, romantic and meticulously curated, each CABN X is carefully positioned with privacy in mind, offering captivating views over the rambling wilderness, and the waters of Antechamber Bay.\n\nWith a coffee machine, furnished deck with an outdoor bathtub, indoor gas fireplace, kitchenette and luxe in-cabin sauna - for your exclusive use - it has everything you need to soak up Kangaroo Island’s world-famous serenity.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "CABN X Kangaroo Island",
    "offer_address": "Cape Saint Albans, Willoughby, Kangaroo Island, South Australia 5222, Australia",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 365.0,
    "value": 762.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HIc53YAD",
    "hero_image": "https://images.luxuryescapes.com/8td5wlncjrzcxe40y68m",
    "image_two": "https://images.luxuryescapes.com/pzzx6d1bwrbvl3cyoj3e",
    "image_three": "https://images.luxuryescapes.com/qhieb438sienp5njc52y",
    "vendor_name": "CABN X Kangaroo Island",
    "title": "Adults-Only Kangaroo Island Off-Grid Eco-Cabin with Ocean Views & Private Sauna",
    "description": "Surround yourself with nature and disconnect in ultimate luxury with a Kangaroo Island stay that elevates eco-tourism to new heights. Light-filled, romantic and meticulously curated, each CABN X is carefully positioned with privacy in mind, offering captivating views over the rambling wilderness and the waters of Antechamber Bay.\n\nWith a coffee machine, furnished deck with an outdoor bathtub, indoor gas fireplace, kitchenette and luxe in-cabin sauna - for your exclusive use - this off-grid eco-cabin has everything you need to soak up Kangaroo Island’s world-famous serenity. Indulge in the perfect blend of seclusion and sophistication, where every detail has been designed to enhance your connection with nature.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "CABN X Kangaroo Island",
    "offer_address": "Cape Saint Albans, Willoughby, Kangaroo Island, South Australia 5222, Australia",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 329.0,
    "value": 740.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QCZuAAO",
    "hero_image": "https://images.luxuryescapes.com/2khwfp0a4671evwwnj81c",
    "image_two": "https://images.luxuryescapes.com/73kxuzdnsqjyxiiqzoju",
    "image_three": "https://images.luxuryescapes.com/hcrc2fmmmn83c9f5qi",
    "vendor_name": "Oceanview Eco Villas",
    "title": "Kangaroo Island Eco-Villa Luxury with Three-Course Nightly Dinner with Wine, Generously Provisioned Butler’s Pantry & One After-Dark Wildlife Experience",
    "description": "Step off the grid and immerse yourself in coastal beauty, where iconic Australian wildlife abounds and gourmet produce floods your tastebuds; experience Kangaroo Island with a five-star stay at Oceanview Eco Villas - an intimate eco-retreat that places premium luxury and environmental impact at the top of its agenda.\n\nSprawled across 500-acres of geographically blessed real estate, this solar-powered oasis invites you to drink in vistas across Nepean Bay from your private deck - with the views only interrupted by the odd kangaroo, feast on a pantry stocked with flavoursome regional delights or cosy up by the fire while you watch the sun fade across the Redbank coastline. Take the chance to explore Australia's answer to the Galapagos from this luxurious launchpad; book a bespoke tour and take in the Island's top natural sights, churn through the dunes on a sandboard or spend a leisurely afternoon sipping gin at a renowned distillery.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Nepean Bay",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Oceanview Eco Villas",
    "offer_address": "31 Point Morrison Rd Nepean Bay SA 5223 Australia",
    "percentage_discount": 23.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 2169.0,
    "value": 2821.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FijHEAAZ",
    "hero_image": "https://images.luxuryescapes.com/avazcieipfvu5chblsss",
    "image_two": "https://images.luxuryescapes.com/5ly4wm9xerc7nnw2187f",
    "image_three": "https://images.luxuryescapes.com/1zl0zfap3ky7sp1ejjce",
    "vendor_name": "CABN X Kangaroo Island",
    "title": "Grand Opening: Adults-Only Kangaroo Island Off-Grid Eco-Cabin with Ocean Views & Private Sauna",
    "description": "Surround yourself with nature and disconnect in ultimate luxury with a stay at CABN X Kangaroo Island, an adults-only biowood cabin concept that elevates eco-tourism to new heights. Light-filled, romantic and meticulously curated, each exclusive CABN X is carefully positioned with privacy in mind, offering captivating views over the rambling wilderness, white sandy beaches and the waters of Antechamber Bay. With a coffee machine, furnished deck with an outdoor bathtub, indoor gas fireplace, kitchenette and luxe in-cabin sauna - for your exclusive use only - it has everything you need to soak up Kangaroo Island’s world-famous serenity.\n\nSpend your days exploring the island’s many treasures, including Cape Willoughby Lighthouse - South Australia’s oldest operational beacon. Return to moments of repose by the fireplace and drinks on the deck.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "CABN X Kangaroo Island",
    "offer_address": "Cape Saint Albans, Willoughby, Kangaroo Island, South Australia 5222, Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 419.0,
    "value": 750.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FcXA6AAN",
    "hero_image": "https://images.luxuryescapes.com/n668dyo022fnneymb58",
    "image_two": "https://images.luxuryescapes.com/31776ssqic2ai1qwxz1r",
    "image_three": "https://images.luxuryescapes.com/nbqn2djufkhruqwwvixt",
    "vendor_name": "CABN X Kangaroo Island",
    "title": "Kangaroo Island Off-Grid Cabin with Ocean Views & Private Sauna",
    "description": "Surround yourself with nature and disconnect in ultimate luxury with a stay at CABN X Kangaroo Island. Light-filled, romantic and meticulously curated, each CABN X is carefully positioned with privacy in mind, offering captivating views over the rambling wilderness, access to a private beach and the waters of Antechamber Bay. Spend your days exploring the island’s treasures before returning to moments of repose by the fireplace and drinks on the deck.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "CABN X Kangaroo Island",
    "offer_address": "Cape Saint Albans, Willoughby, Kangaroo Island, South Australia 5222, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 363.0,
    "value": 363.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FNJWqAAP",
    "hero_image": "https://images.luxuryescapes.com/s0tuoe5jqld3rqq3khwj",
    "image_two": "https://images.luxuryescapes.com/1hpcf2l4tmc66kiyrjx",
    "image_three": "https://images.luxuryescapes.com/dvx5fvdp0hwlkz8h3b3h",
    "vendor_name": "Sea Dragon Kangaroo Island",
    "title": "Tranquil Kangaroo Island Escape Overlooking Pink Bay w. Secluded Beach",
    "description": "A serene stay awaits at Sea Dragon Kangaroo Island, a stunning retreat overlooking Pink Bay. Kangaroo Island is home to an abundance of native Australian wildlife, and many species can be glimpsed from this peaceful property. Set on 250 acres of coastal real estate, part of which is under heritage protection for its flora and fauna, this tranquil hideaway includes access to a secluded beach, where guests can safely swim, snorkel or enjoy a picnic or sun-downer.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Willoughby",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Sea Dragon Kangaroo Island",
    "offer_address": "2575 Cape Willoughby Road, Pink Bay, Kangaroo Island, South Australia, 5222, Australia",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 1048.0,
    "value": 1048.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwcIAC",
    "hero_image": "https://images.luxuryescapes.com/iynrqm4xqbxxbuu1pg0m",
    "image_two": "https://images.luxuryescapes.com/04zfyaj93zteg3fykbg",
    "image_three": "https://images.luxuryescapes.com/9k10qihh1r7epa5n3ce",
    "vendor_name": "Mercure Kangaroo Island Lodge",
    "title": "Tranquil Kangaroo Island Escape Overlooking American River Bay with Onsite Restaurant & Bar",
    "description": "Experience Australia’s version of the Galapagos at this waterfront resort in Kangaroo Island, nestled between American River’s tranquil coves and native bushland. Enjoy well-appointed accommodations with stunning views, an onsite restaurant showcasing local produce, and easy access to nature trails.\n\nSpend days relaxing by the fireplace with a glass of local red wine, swim in the outdoor saltwater pool and explore island highlights like Stokes Bay and Admiral Arch.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "American River",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Mercure Kangaroo Island Lodge",
    "offer_address": "73 Scenic Drive, American River, Kangaroo Island, South Australia 5221, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 112.0,
    "value": 112.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GN33tAAD",
    "hero_image": "https://images.luxuryescapes.com/dnhs13cjvtrbqs9sbeh",
    "image_two": "https://images.luxuryescapes.com/75ntcktgbnt6jl10jho",
    "image_three": "https://images.luxuryescapes.com/lv63el7p5cvumrdpno1",
    "vendor_name": "Southern Ocean Lodge",
    "title": "All-Inclusive Kangaroo Island Luxury Lodge with Gourmet Dining & Island-Inspired Spa",
    "description": "Frequently heralded as one of the world's top luxury lodges, Kangaroo Island's Southern Ocean Lodge has reopened with elevated luxuries, redefining the gold standard for experiential travel. Situated amidst vast geo- and biodiversity, the lodge's architectural design seamlessly melds with the natural landscape, providing breathtaking views of the rugged Southern Ocean from its exclusive cliffside perch. Whether you choose to admire the rolling Australian bushlands during a spa treatment, simply recline on the beach or venture into the wonders of Kangaroo Island and spot native wildlife on a Signature Experience, the refreshing sea spray is your companion. With coastal serenity and local bounty at your fingertips, wining and dining is a gourmet affair featuring artisan pastries in the morning and regional degustation in the evening, paired with famous South Australian varietals. This is access to the wild beauty of 'Australia's Galapagos' at its most immersive.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Karatta",
    "location_heading": "Kangaroo Island",
    "location_subheading": "South Australia",
    "location_description": "Southern Ocean Lodge",
    "offer_address": "Hanson Bay Road, Kingscote, SA 5223, Australia",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 3607.0,
    "value": 3607.0
  }
]