[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IePEfAAN",
    "hero_image": "https://images.luxuryescapes.com/hf1jalo5y5sy6oou4nll",
    "image_two": "https://images.luxuryescapes.com/1ut6xn9qa4v7dnxq5iccp",
    "image_three": "https://images.luxuryescapes.com/3yskwdhn3cogwqo6teq",
    "vendor_name": "Cabot Lodge",
    "title": "Fiordland National Park Intimate Lodge Luxury with All-Inclusive Dining, Nightly Drink & Wine Pairing & Private Spa Experience",
    "description": "There’s nothing quite like the luxurious tranquillity you'll find at the blissfully secluded Cabot Lodge, tucked in the hills above stunning Lake Manapouri and bordering UNESCO World Heritage-listed Fiordland National Park. This superb family-operated hideaway - featuring just five suites - is surrounded by over 2,000 acres of sprawling farmland and boasts exquisitely appointed communal dining and lounge areas, as well as two outdoor patios positioned perfectly for soaking up spectacular views. On days out and about, discover the famed Kepler Track within close reach and waterfall-kissed Milford Sound - the only fjord in New Zealand accessible by road - along with a bounty of trout fishing, kayaking and airborne adventures around the park.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Southland",
    "offer_geo_area_level_2": "Manapouri",
    "location_heading": "Te Anau",
    "location_subheading": "New Zealand",
    "location_description": "Cabot Lodge",
    "offer_address": "268 Hillside-Manapouri Road, Te Anau 9679, New Zealand",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 779.0,
    "value": 1228.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BdszhAAB",
    "hero_image": "https://images.luxuryescapes.com/ipnr00eadlj52wa2pkal",
    "image_two": "https://images.luxuryescapes.com/dsekb5ytvbkjcim6ao69",
    "image_three": "https://images.luxuryescapes.com/l13sf5i3varjik9890t",
    "vendor_name": "The Cinema Suites",
    "title": "Te Anau Boutique Apartment Suite above Cinema near Fiordland National Park",
    "description": "High above the iconic Fiordland Cinema rests the boutique The Cinema Suites, a spacious slice of apartment-style luxury in the heart of Te Anau - gateway to the region’s spectacular valleys, sheltered forests and mirror-bright glacial waterways. The property was purpose-built to show the renowned short film ‘Ata Whenua - Shadowland' (Fiordland on Film), celebrating the staggering natural majesty of the Fiordland. Every element of The Cinema Suites has been hand-built to reinforce this celebration, from panoramic forested wallpaper to lush moss-green wool carpets and the suite’s lantern-like lighting, enveloping guests in the spirit of the region’s epic natural beauty. It’s an unforgettable base to explore the vast silent expanses and greater mysteries of the UNESCO World Heritage-listed Fiordland National Park.\n\nWhen you’re ready to explore, there’s a whole world of possibility at your doorstop. Step outside the cinema's doors and sip your way through The Black Dog Bar's extensive range of local wines, beers and ciders, catch a film below or journey into the great beyond - the tremendous scale of the Milford Sound’s world-famous mountains, crashing cascades and legendary hiking trails can’t be missed.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Southland",
    "offer_geo_area_level_2": "Te Anau",
    "location_heading": "Te Anau",
    "location_subheading": "New Zealand",
    "location_description": "The Cinema Suites",
    "offer_address": "7 The Lane, Te Anau 9600 New Zealand",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 9,
    "price": 620.0,
    "value": 884.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zTxSAAU",
    "hero_image": "https://images.luxuryescapes.com/v0rfdxebrv97sembvap",
    "image_two": "https://images.luxuryescapes.com/h5x971oqah56v3lyuobx",
    "image_three": "https://images.luxuryescapes.com/1hme7xirnf3dc39xjooh",
    "vendor_name": "Cabot Lodge",
    "title": "New Zealand Luxe Lodge Escape with Gourmet Dining & Nightly Drinks",
    "description": "Embrace the dramatic beauty of New Zealand’s South Island with an ultra-luxe escape at the blissfully secluded Cabot Lodge. Set on 2,000 acres of farmland overlooking the glistening waters of Lake Manapouri and bordering the UNESCO World Heritage-listed Fiordland National Park, this luxurious lodge invites guests to switch off, reconnect with nature and discover the breathtaking beauty of Fiordland, including the majestic Milford Sound. With just four rooms, privacy and intimacy abound at this blissful lodge: book now to escape to where the world can't find you - availability is limited.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Southland",
    "offer_geo_area_level_2": "Manapouri",
    "location_heading": "Te Anau",
    "location_subheading": "New Zealand",
    "location_description": "Cabot Lodge",
    "offer_address": "268 Hillside-Manapouri Road, Te Anau 9679, New Zealand",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 799.0,
    "value": 1312.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GOlyAAG",
    "hero_image": "https://images.luxuryescapes.com/d4sqpl6taxxnn3npwytp",
    "image_two": "https://images.luxuryescapes.com/vmjvlk1ddk8u33khlyxr",
    "image_three": "https://images.luxuryescapes.com/nhdpgg47usk7pi9cf9se",
    "vendor_name": "Cabot Lodge",
    "title": "New Zealand Fiordland Luxury Lodge for 10 with Gourmet Dining & Nightly Drinks",
    "description": "Embrace the dramatic beauty of New Zealand’s South Island with an ultra-luxe escape for up to ten people at the blissfully secluded Cabot Lodge. Set on 2,000 acres of farmland overlooking the glistening waters of Lake Manapouri and bordering the UNESCO World Heritage-listed Fiordland National Park, this luxurious lodge invites guests to switch off, reconnect with nature and discover the breathtaking beauty of the nearby Fiordland, including the majestic Milford Sound.\n\nEnjoy exclusive use of this luxury lodge for up to ten people, with exceptional inclusions such as exquisite daily dining including made-to-order breakfast, a set menu dinner with matched wines once during your stay, evening drinks and canapés, a gourmet picnic hamper, and your choice of exciting activities around the farm, from beekeeping and feeding horses to four-wheel-drive farm tours.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Southland",
    "offer_geo_area_level_2": "Manapouri",
    "location_heading": "Te Anau",
    "location_subheading": "New Zealand",
    "location_description": "Cabot Lodge",
    "offer_address": "268 Hillside-Manapouri Road, Te Anau 9679, New Zealand",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 2599.0,
    "value": 5479.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CKjVAAW",
    "hero_image": "https://images.luxuryescapes.com/myb5qfpi2j5pcs0dd6rm",
    "image_two": "https://images.luxuryescapes.com/8ky9qkhxchua62oej5em",
    "image_three": "https://images.luxuryescapes.com/tlw81rjblo4lciwmj0wr",
    "vendor_name": "Radfords on the Lake",
    "title": "Lakeside Te Anau Self-Contained Retreat near UNESCO World Heritage-Listed Fiordland National Park",
    "description": "Embrace the dramatic beauty of New Zealand’s South Island with a blissful escape to Radfords on the Lake, a collection of five-star apartments overlooking the glistening waters of Lake Te Anau. With views extending to the UNESCO World Heritage-listed Fiordland National Park, this self-contained stay invites guests to reconnect with nature and discover the breathtaking beauty of Fiordland. The retreat ranks among 2022's top 1% of properties on Tripadvisor and serves as the perfect gateway to the majestic Milford Sound - the only fiord in New Zealand accessible by road - where you'll stand in awe at plunging cliffs and raging waterfalls. With mountain bikes available for complimentary hire, incredible hikes around every corner and contemporary amenities in every room, escape to where the world can't find you - surrounded by wilderness.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Southland",
    "offer_geo_area_level_2": "Te Anau",
    "location_heading": "Te Anau",
    "location_subheading": "New Zealand",
    "location_description": "Radfords on the Lake",
    "offer_address": "56 Lakefront Drive, Te Anau 9600, New Zealand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lfMDAAY",
    "hero_image": "https://images.luxuryescapes.com/yoe0n7bj1oof31lx3nnp",
    "image_two": "https://images.luxuryescapes.com/1me0dhbz0ncoiss0p3co",
    "image_three": "https://images.luxuryescapes.com/ibsz6zrgni5w93q97g",
    "vendor_name": "Cabot Lodge",
    "title": "Fiordland National Park Luxury Lodge Overlooking Lake Manapouri",
    "description": "There’s nothing quite like the luxurious tranquility offered by a stay at the blissfully secluded Cabot Lodge, tucked up on the hills above stunning Lake Manapouri and bordering the UNESCO World Heritage-listed Fiordland National Park. This superb hideaway offers a sophisticated way to reconnect with nature and is the perfect gateway to explore the incredible natural beauty of the region. Within close reach,  you can discover the famed Kepler Track and the waterfall-kissed Milford Sound - the only fiord in New Zealand that is accessible by road - where you'll stand in awe at plunging cliffs and raging waterfalls.\n\nWith just five impeccably styled rooms, Cabot Lodge offers unparalleled privacy and intimacy at no cost to quality. Surrounded by over 2,000 acres of sprawling farmland, the lodge boasts an exquisitely appointed communal main living area, two outdoor patios superbly positioned for guests to soak up spectacular views, and a spacious dining area and open fireplace. If you’re looking to take a well-deserved break from it all, this is the perfect place.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Southland",
    "offer_geo_area_level_2": "Manapouri",
    "location_heading": "Te Anau",
    "location_subheading": "New Zealand",
    "location_description": "Cabot Lodge",
    "offer_address": "268 Hillside-Manapouri Road, Te Anau 9679, New Zealand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008JBYPAA4",
    "hero_image": "https://images.luxuryescapes.com/c4ng0vmuxr6wajsev7z",
    "image_two": "https://images.luxuryescapes.com/vbfn8fwzb48nps5j5tem",
    "image_three": "https://images.luxuryescapes.com/htfe2zvf09ebhyuftpa3",
    "vendor_name": "Radfords on the Lake",
    "title": "Lakeside Te Anau Self-Contained Retreat near UNESCO World Heritage-Listed Fiordland National Park",
    "description": "Embrace the dramatic beauty of New Zealand’s South Island with a blissful escape to Radfords on the Lake, a collection of five-star apartments overlooking the glistening waters of Lake Te Anau. With views extending to the UNESCO World Heritage-listed Fiordland National Park, this self-contained stay invites guests to reconnect with nature and discover the breathtaking beauty of Fiordland. The retreat ranks among 2022's top 1% of properties on Tripadvisor and serves as the perfect gateway to the majestic Milford Sound - the only fiord in New Zealand accessible by road - where you'll stand in awe of plunging cliffs and raging waterfalls. With mountain bikes available for complimentary hire, incredible hikes around every corner and contemporary amenities in every room, escape to where the world can't find you - surrounded by wilderness.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Southland",
    "offer_geo_area_level_2": "Te Anau",
    "location_heading": "Te Anau",
    "location_subheading": "New Zealand",
    "location_description": "Radfords on the Lake",
    "offer_address": "56 Lakefront Drive, Te Anau 9600, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 211.0,
    "value": 211.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oLd6AAE",
    "hero_image": "https://images.luxuryescapes.com/3io8zhozcyz6dqpzck",
    "image_two": "https://images.luxuryescapes.com/vbjc6ma2wc9zaw7jlrh",
    "image_three": "https://images.luxuryescapes.com/9ly8evruh13octz5bo",
    "vendor_name": "Cabot Lodge",
    "title": "New Zealand Private Lodge Escape in Fiordland at the Gateway to Milford & Doubtful Sounds",
    "description": "Embrace the dramatic beauty of New Zealand’s South Island with an ultra-luxe escape at the blissfully secluded Cabot Lodge, stamped with a Tripadvisor 2021 Travellers' Choice Award and Qualmark Gold Five-Star Accommodation mark.\n\nSet within 2,000 acres of farmland overlooking the glistening waters of Lake Manapouri, and bordering the UNESCO World Heritage-listed Fiordland National Park, this luxurious lodge invites guests to switch off, reconnect with nature and discover the breathtaking beauty of Fiordland. The lodge is your perfect gateway to the majestic Milford Sound - the only fiord in New Zealand that is accessible by road - where you'll stand in awe at plunging cliffs and raging waterfalls. With just four suites, privacy and intimacy abound at this blissful lodge: book now to escape to where the world can't find you - surrounded by wilderness.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Southland",
    "offer_geo_area_level_2": "Manapouri",
    "location_heading": "Te Anau",
    "location_subheading": "New Zealand",
    "location_description": "Cabot Lodge",
    "offer_address": "268 Hillside-Manapouri Road, Te Anau 9679, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 542.0,
    "value": 542.0
  }
]