[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004SyHOAA0",
    "hero_image": "https://images.luxuryescapes.com/gz6o8iqd7c45t608wl5k",
    "image_two": "https://images.luxuryescapes.com/09xo9z96df11spduxjy",
    "image_three": "https://images.luxuryescapes.com/5lwdlml80phji5dtv21d",
    "vendor_name": "Shilla Monogram Quangnam Danang",
    "title": "Brand-New Five-Star Beachfront Luxury near Hội An with Decadent Dining",
    "description": "Experience historic beauty and modern opulence at the ultra-luxe Shilla Monogram Quangnam Danang, a brand-new beachfront resort gracefully located on the golden sands between Danang and the beautifully preserved historic town of Hội An. Nestled among swaying palms and perfectly manicured gardens, the brand-new Shilla Monogram is a modern retreat that prides itself on traditional hospitality. Enjoy state-of-the-art facilities, including a tranquil bamboo forest garden, soothing sauna and a lavish infinity pool with endless horizon vistas. Let the warm sea breeze brush your cheeks from the sanctuary of a poolside cabana or treat your body and mind to a rejuvenating floating yoga class. Sink your toes into the soft sands of Ha My Beach or treat your palate to locally sourced cuisine at the resort's sleek restaurant and bistro.\n\nTake a short taxi ride to the nearby UNESCO World Heritage-listed Hội An Old Town and stroll along streets lined with colourful lanterns. Choose a window seat in a quaint cafe and slurp on a famously sweet Vietnamese coffee as you watch traditional wooden boats float peacefully along the river. Find a bargain at the vibrant markets, treat yourself to a tailored suit or watch the lanterns light up historic façades as the sun sets.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Quang Nam Province",
    "offer_geo_area_level_2": "Dien Ban",
    "location_heading": "Quangnam",
    "location_subheading": "Vietnam",
    "location_description": "Shilla Monogram Quangnam Danang 2020",
    "offer_address": "Lạc Long Quân, Điện Ngọc, Điện Bàn Da nang Quảng Nam 0000",
    "percentage_discount": 44.0,
    "min_duration": 5,
    "max_duration": 12,
    "price": 679.0,
    "value": 1216.0
  }
]