[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BdtGvAAJ",
    "hero_image": "https://images.luxuryescapes.com/17dfo1f75xr7lb1qann",
    "image_two": "https://images.luxuryescapes.com/2t2c1k4f7sfn96i1e9um",
    "image_three": "https://images.luxuryescapes.com/mh0c0dzl956eersb5y9",
    "vendor_name": "Lakes Resort Toukley",
    "title": "NSW Central Coast Self-Contained Waterfront Stay just 90 Minutes from Sydney with Daily Breakfast",
    "description": "Prepare to be mesmerised by the tranquil beauty of the NSW Central Coast with a well-deserved stay Lakes Resort Toukley, perfectly set on a narrow isthmus between two shimmering lakes. Relax in style and feel right at home within these self-contained studios and apartments boasting impressive coastal views and the luxury of a fully equipped kitchen plus modern furnishings. Take a moment to recharge at the shared onsite spa and sauna before diving into the heated lap pool or exploring the golden sands of Soldiers Beach located just a few minutes away. A nearby boat ramp opens up a range of activities including sailing or canoeing down Tuggerah Lake to catch the magnificent sunset.\n\nThis secluded pocket, located just 90-minutes from Sydney, allows you to become immersed in natural beauty from all angles while providing a moment’s respite from the hustle and bustle of the city. Stroll around the Wyrrabalong National Park and marvel at the views from Norah Head Lighthouse or take the family on a fun-filled picnic at the grassy peninsula of Soldiers Point.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Toukley",
    "location_heading": "Toukley",
    "location_subheading": "NSW",
    "location_description": "Lakes Resort Toukley",
    "offer_address": "57-59 Main Rd, Toukley NSW 2263",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 234.0,
    "value": 592.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Cw3E3AAJ",
    "hero_image": "https://images.luxuryescapes.com/yjrksd4qpbhrl0szgds",
    "image_two": "https://images.luxuryescapes.com/o93o4wgjvf0o2drfngw",
    "image_three": "https://images.luxuryescapes.com/j8z19kiozw28qlxoek",
    "vendor_name": "Lakes Resort Toukley",
    "title": "Serene Lakefront Central Coast Escape North of Sydney",
    "description": "Enjoy coastal relaxation and lakeside leisure just an hour from Sydney’s North at Lakes Resort Toukley. Adventure to an idyllic escape along the Central Coast that offers both a tranquil resort-style atmosphere and close proximity to New South Wales’s best attractions and famous cities. Modern and sleek, the resort boasts high-class facilities from the heated lap pool, sauna, steam room and spa to the impeccable gardens and impressive boat ramp offering access to the lake. Relax poolside, rejuvenate in the steam room, or jump into a whole host of family fun sailing, canoeing, or paddling in Tuggerah Lake.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Toukley",
    "location_heading": "Toukley",
    "location_subheading": "NSW",
    "location_description": "Lakes Resort Toukley",
    "offer_address": "57-59 Main Rd, Toukley NSW 2263",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 59.0,
    "value": 59.0
  }
]