[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lhp7AAC",
    "hero_image": "https://images.luxuryescapes.com/ky3bw65v7nbdy31rk4wm",
    "image_two": "https://images.luxuryescapes.com/jg6cz9k0lsd7qt0lyoc",
    "image_three": "https://images.luxuryescapes.com/glkhwnfmvhu2e16ulquo",
    "vendor_name": "Fairmont Sanur Beach Bali",
    "title": "Palatial Five-Star Fairmont Suite Luxury with Daily Dining",
    "description": "Treat yourself to a luxurious getaway at the five-star Fairmont Sanur Beach Bali, an all-suite resort positioned idyllically on 200 metres of pristine beachfront and surrounded by four hectares of lush tropical gardens. Stay in a palatial 90sqm Fairmont Garden View Suite and enjoy daily breakfast, one dinner, a traditional Balinese cooking class for two, one 30-minute spa treatment for two adults, a welcome drink on arrival, daily yoga classes, complimentary bicycle hire, shuttle bus transfers into the heart of Sanur and much more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Fairmont Sanur Beach Bali",
    "offer_address": "Jl. Kusuma Sari No.8, Sanur, Beach, Kota Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 557.0,
    "value": 1505.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FN67sAAD",
    "hero_image": "https://images.luxuryescapes.com/5jiaml4w8oykihsa2lae",
    "image_two": "https://images.luxuryescapes.com/krys53lgnp2ev7so736",
    "image_three": "https://images.luxuryescapes.com/f7kvxinvdb4vzpykqubq",
    "vendor_name": "Mercure Resort Sanur",
    "title": "Relaxed Bali Beachfront Escape with Daily Breakfast, Dinners & Cocktails",
    "description": "Dive into a fun-filled-yet-relaxing Bali getaway at Mercure Resort Sanur, just steps from the sparkling beachfront and decorated with shaded sun loungers. Surrounded by five hectares of thriving tropical gardens, this chilled-out haven feels a million miles away from reality, although it's only a short walk from Sanur's buzzing resturants, bars and markets. Spend days ducking under the waves of the nearby beach, splash in the clear pools within the resort, relax with cocktails in hand at The Breeze Bar and  feast as you please at Pandawa Restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Mercure Bali Sanur Resort",
    "offer_address": "Jln. Mertasari No. 3 Sanur Bali 80228, Indonesia",
    "percentage_discount": 46.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 359.0,
    "value": 668.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Cium0YAB",
    "hero_image": "https://images.luxuryescapes.com/ii6bt0mf63uxfrx7pi2u",
    "image_two": "https://images.luxuryescapes.com/eh7bkql60bxr9joag2m",
    "image_three": "https://images.luxuryescapes.com/8op8vm2e0gaq5kgqci3c",
    "vendor_name": "The MERU Sanur",
    "title": "Sanur All-Suite Opulence with Daily Breakfast, Daily Lunch or Dinner, Massages & Butler Service",
    "description": "Unrivalled luxury awaits at this beachfront resort, set along Sanur’s pristine shores. Debuting in 2024 and now featuring even more high-end facilities - including another esteemed restaurant - The Meru Sanur has redefined resort opulence in the region.\n\nSuites are designed for indulgence, with intricate hand-carved millwork, striking traditional art, and private terraces overlooking lush Balinese gardens. A magnificent central pool sits just steps from the azure waters of Sanur Beach, while the ultra-sleek fitness centre and dedicated kids’ club cater to every type of traveller.\n\nDining takes centre stage, with Arunika Restaurant offering international cuisines and live cooking stations, while Roso Restaurant celebrates Indonesian flavours. Sutasoma Lounge doubles as a library, where expert mixologists craft cocktails.\n\nThe indulgence continues at Svasana Spa, with treatments ranging from relaxation massages to Balinese purification rituals. To top it off, there are complimentary wellness programs, including boxing, adventure cycling and sunrise yoga.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "The Meru Sanur",
    "offer_address": "Jl. Hang Tuah, Sanur Kaja, Denpasar Selatan, Kota Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 43.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 1209.0,
    "value": 2123.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FlaV6AAJ",
    "hero_image": "https://images.luxuryescapes.com/tudzp3qoo1pcrr6dyj3",
    "image_two": "https://images.luxuryescapes.com/4dsm32pyu7ervi272yrq",
    "image_three": "https://images.luxuryescapes.com/ub9sjyspo9256v4gyns",
    "vendor_name": "The Pavilions Bali",
    "title": "Bali Private Villa Haven with Massages, Daily Breakfast & Nightly Cocktails",
    "description": "Discover a tropical oasis hidden among Sanur's white-sand beaches and lush tropical surrounds at the tranquil Pavilions Bali. You’ll feel like the only guests at the resort in your private villa - truly your own slice of Bali paradise, perfect for idyllic honeymoons or adventurous family getaways alike. Positioned in a charming village, this exclusive villa complex is within easy reach of the area’s restaurants, markets and independent boutiques filled with unique artisan gifts.\n\nIf you can tear yourself away from your splendid sanctuary, there’s more to explore. Savour moments of serenity at The Pavilions Spa, where treatments combine traditional Balinese techniques with all-natural wellness rituals. Sample Sanur's finest at Jahe Restaurant, where local flavours meet international favourites, or opt for something a little more relaxed with island-inspired bites at the Poolside Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "The Pavilions Bali",
    "offer_address": "Jl. Danau Tamblingan Number 76, Sanur, Bali 80228, Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 24,
    "price": 659.0,
    "value": 1393.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ct9PiQAI",
    "hero_image": "https://images.luxuryescapes.com/8avtdxwmbbr4bkfmtzg",
    "image_two": "https://images.luxuryescapes.com/jymsawwp4c67cpdj7esh",
    "image_three": "https://images.luxuryescapes.com/on4j45mhhs4wog1ixjkf",
    "vendor_name": "The Villas at Fairmont Sanur Beach Bali",
    "title": "Five-Star Pool Villa Escape for Four Adults - Two Kids Stay Free",
    "description": "Treat the whole family to a luxury getaway at the five-star Fairmont Sanur Beach Bali, perched on 200 metres of azure beachfront and nestled amidst four hectares of lush tropical gardens. Stay in a palatial two-storey, Two Bedroom Villa with daily breakfast, dining experiences, a daily 60-minute massage each, 20% discount on surfing lessons, spa treatments and other activities, three hours of complimentary babysitting, a family cooking class, a convenient airport pick-up and more. Plus two kids aged 11 years & under can enjoy complimentary access to the Kids' Club and free meals when dining with parents.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "The Villas at Fairmont Sanur Beach, Bali",
    "offer_address": "Jalan Kusuma Sari No.8, Sanur, Denpasar Selatan, Kota Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 9,
    "price": 2134.0,
    "value": 5366.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GPLT3YAP",
    "hero_image": "https://images.luxuryescapes.com/66puw1jg7bvn1hh7avhk",
    "image_two": "https://images.luxuryescapes.com/5m04f124uprfvb7otnj",
    "image_three": "https://images.luxuryescapes.com/qn5helhbzsz7l1q7yvq",
    "vendor_name": "Sanora Villa Sanur",
    "title": "Sanur Private Pool Villas with Daily Breakfast, Two Lunches or Dinners & Nightly Cocktails",
    "description": "Answer the call of Bali's sandy beaches, aquamarine oceans and lush tropical landscapes with an idyllic retreat in these villas, set in sought-after Sanur. This secluded slice of heaven guarantees romance and serenity, with each spacious villa boasting its own sparkling pool and gorgeous tropical greenery.\n\nStart with a sumptuous breakfast before exploring laidback Sanur or lounge poolside from your private oasis. After a day of discovery, raise a glass to Bali’s magic with a cocktail. Plus, enjoy complimentary access to one of Bali’s top boutique day clubs, The Jungle Club Ubud, and dive headfirst into island fun.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Sanora Villa Sanur by iNi ViE Hospitality",
    "offer_address": "Jalan Bypass Ngurah Rai No.888A, Sanur, Denpasar Selatan, Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 412.0,
    "value": 1083.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biHScQAM",
    "hero_image": "https://images.luxuryescapes.com/kqyq9buo1zaufpygoyzl",
    "image_two": "https://images.luxuryescapes.com/jsyjfftdwnwoqemt4rvc",
    "image_three": "https://images.luxuryescapes.com/kzjxyhwuht8iksjfbhti",
    "vendor_name": "Fairmont Sanur Beach Bali",
    "title": "Five-Star Palatial Fairmont Suite Luxury with Daily Dining Inclusions",
    "description": "Treat yourself to a luxury getaway at the five-star Fairmont Sanur Beach Bali, perched on 200 metres of azure beachfront and nestled amidst four hectares of lush tropical gardens. Stay in a palatial Fairmont Garden View Suite with daily breakfast, your choice of daily lunch or nightly dinner at the on-site restaurants, a 60-minute Balinese massage, a traditional Balinese cooking class, one-way private airport pickup, welcome drink on arrival, daily yoga classes and more. Or upgrade for the full VIP treatment to enjoy 24-hour personalised butler service, six daily cocktails, a romantic sunrise beach breakfast, a welcome gift on arrival, preferential room allocation, priority check-in, late checkout and so much more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kota Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Fairmont Sanur Beach Bali - April 2019",
    "offer_address": "Jl. Kusuma Sari No.8, Sanur, Denpasar Sel., Kota Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 65.0,
    "min_duration": 6,
    "max_duration": 8,
    "price": 1267.0,
    "value": 3632.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FlaXgAAJ",
    "hero_image": "https://images.luxuryescapes.com/m3fuyhdbs8yw2dhbh2hk",
    "image_two": "https://images.luxuryescapes.com/74qmvd6ioql6ivyptdf",
    "image_three": "https://images.luxuryescapes.com/fsvnwkrb17sjz1g1s62",
    "vendor_name": "Kayumanis Sanur Private Villa & Spa",
    "title": "Sanur Five-Star Private Pool Villas with All-Day Breakfast, Daily Drinks & Butler Service",
    "description": "Welcome to Kayumanis Sanur Private Villa & Spa, a five-star slice of Balinese paradise. Positioned in the charming village of Sanur, this exclusive villa complex is within easy reach of local restaurants, vibrant nightlife, markets and independent boutiques filled with unique artisan gifts. Intimate and authentic, Kayumanis Sanur Private Villa & Spa is home to a boutique collection of just 11 one-, two- and three-bedroom villas, each nestled within the confines of a walled garden with private pools and dedicated butler service.\n\nDiscover true tranquillity at Kayumanis Spa Sanur, where treatments combine traditional Balinese techniques with modern wellness knowledge. Sample the region's finest cuisine at Gong restaurant, which combines market-fresh ingredients and seasonal delicacies infused with local herbs and spices, or opt for something a little more relaxed with beach-inspired bites at Kayumanis Seaside Sanur restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Sanur Private Villa & Spa",
    "offer_address": "Jl. Tirta Akasa No.28, Sanur, Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 699.0,
    "value": 1627.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HiIkAAK",
    "hero_image": "https://images.luxuryescapes.com/63boctl6f46smox4y2a",
    "image_two": "https://images.luxuryescapes.com/8l6bbrsyjtj72tlo5zog",
    "image_three": "https://images.luxuryescapes.com/ur2vwhefthmh4v72lw3",
    "vendor_name": "Maya Sanur Resort & Spa",
    "title": "Five-Star Sanur Beachfront Resort with Daily Breakfast, Daily Lunch or Dinner & Sunset Cocktails",
    "description": "Tap into eco-luxury along the glistening shores of Sanur's pristine beachfront at Maya Sanur Resort & Spa, a zen-inducing, five-star oasis where you can watch the sunrise over the ocean every morning and watch it melt into the horizon every evening from the beachfront bar.\n\nThis gorgeous resort - winner in the Tripadvisor Travellers' Choice 2021 Awards - is an architectural marvel and features a wide choice of accommodation to suit guests’ preferences, from nature-inspired rooms to private suites and pool retreats. Within a five-minute walk, there is a myriad of world-class restaurants, while the stylish onsite facilities offer everything you would expect from a high-end beach resort, and is distinguished by its eco-green rooftop, a tranquil spot where guests can feel at one with nature. When the day calls for a moment of indulgence and uninterrupted bliss, the award-winning spa promises holistic healing while the sunbeds surrounding the 158-metre lagoon pool - one of several glimmering resort pools - are the perfect place to while the day away.\n\n**Your handpicked inclusions:**\n\n- Start each day with a delicious breakfast for two\n- Enjoy your choice of either lunch or dinner daily for two\n- Toast to another day in paradise with one daily sunset cocktail per adult\n- Unwind in style with a minimum of one 60-minute spa treatment for two\n- Indulge with daily afternoon tea for two\n- Enjoy a convenient one-way private airport arrival or departure transfer \n- Inter-resort transfers between [Maya Ubud](https://luxuryescapes.com/offer/maya-ubud-resort-and-spa-bali-indonesia-asia/0062y000005HiIaAAK) and Maya Sanur\n- Up to two children (17 and under) stay free with daily breakfast only\n\n**Ready to uncover more of Indonesia?** Extend your stay with an escape to the tranquil [Maya Ubud](https://luxuryescapes.com/au/offer/maya-ubud-resort-and-spa-bali-indonesia-asia/0062y000005HiIaAAK) and enjoy complimentary inter-resort transfers.\n\n**Travelling with family?** Make memories with the whole family, as up to two children (17 and under) stay free with daily breakfast.\n\n**Extended stay bonus:** Stay for seven nights or more and enjoy additional massages for extra indulgence. See individual packages for more information.\n\n**Book with 100% Confidence**: If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Maya Sanur Resort & Spa",
    "offer_address": "Jalan Danau Tamblingan No.89M, Sanur, Bali 80228, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 959.0,
    "value": 1982.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Ldg0AAC",
    "hero_image": "https://images.luxuryescapes.com/xb7gug41hfyop24kcoh",
    "image_two": "https://images.luxuryescapes.com/piw4e9bnqt9j89d7uw",
    "image_three": "https://images.luxuryescapes.com/vk8ebnmruhp6nzf8pgj8",
    "vendor_name": "The Pavilions Bali",
    "title": "Private Pool Villa Bliss with Daily Butler-Served Breakfast",
    "description": "Experience your own private slice of paradise at The Pavilions Bali, located in tranquil Sanur on the island's southeast coast. Live like royalty in a large private villa - complete with a 7m pool and outdoor shower or tub - and wake up to your butler serving breakfast each morning, plus enjoy other indulgent inclusions such as Balinese dining experiences, one daily cocktail each, a 60-minute massage per person, a one-way airport transfer and more.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kota Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "The Pavilions Bali - Old",
    "offer_address": "Jl. Danau Tamblingan No.76, Sanur, Kec. Denpasar Sel., Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 779.0,
    "value": 1967.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMuIYAA1",
    "hero_image": "https://images.luxuryescapes.com/7totj0lpz6agsjb9e8c",
    "image_two": "https://images.luxuryescapes.com/8dlh7vumrtlfe4awwum4",
    "image_three": "https://images.luxuryescapes.com/elpnul5hjao5ihguvgs9",
    "vendor_name": "Seascape Resort Sanur",
    "title": "Grand Opening: Romantic Adults-Only Sanur Suites & Villas with Daily Breakfast, Nightly Cocktails & Massages",
    "description": "Be one of the first to spend a romantic sojourn at this brand-new eco-conscious resort, occupying an intimate spot near Sanur Harbour. Feel the outside world melt away within the terracotta-toned walls of your expansive suite or villa, each complete with earthy designer interiors and luxurious amenities. \n\nStepping out of your intimate hideaway, you'll find a wealth of facilities - dine at the sophisticated Tsune Restaurant and sip an aromatic cocktail on the alfresco terrace, be lulled into a state of zen at the spa or sit poolside under the shade of a cabana.\n\nYour location near the banks of Sanur puts you within minutes of renowned beaches and the harbour port, as well as the bustling Sindhu Night Market and the breathtaking historical sight of Pura Blanjong temple.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Seascape Resort Sanur by iNi Vie Hospitality",
    "offer_address": "Jalan Aruna 8A, Sanur, Denpasar, Bali 80237, Indonesia",
    "percentage_discount": 68.0,
    "min_duration": 5,
    "max_duration": 28,
    "price": 599.0,
    "value": 1877.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IeSaHAAV",
    "hero_image": "https://images.luxuryescapes.com/dvamnqokglqfspflwl2",
    "image_two": "https://images.luxuryescapes.com/gb2ju6yjen0ys32p27dp",
    "image_three": "https://images.luxuryescapes.com/80y1hk0xbihx4us78en8",
    "vendor_name": "Kayumanis Sanur Private Villa & Spa",
    "title": "Five-Star Sanur Private Pool Villas with All-Day Breakfast, Daily Drinks & Butler Service",
    "description": "Welcome to this five-star slice of Balinese paradise. Positioned in the charming village of Sanur, this exclusive villa complex is home to just 11 one-, two- and three-bedroom villas, each nestled within the confines of a walled garden with private pools and a dedicated butler service. Sitting within easy reach of local restaurants, vibrant nightlife, markets and independent boutiques filled with unique artisan gifts, Kayumanis Sanur Private Villa & Spa offers the best of both worlds.\n\nDiscover true tranquillity at Kayumanis Spa Sanur, where treatments combine traditional Balinese techniques with modern wellness knowledge. Sample the region's finest cuisine at Gong restaurant, which combines market-fresh ingredients and seasonal delicacies infused with local herbs and spices, or opt for something a little more relaxed with beach-inspired bites at Kayumanis Seaside Sanur restaurant. Or, enjoy the serenity of your villa and allow the attentive team to bring breakfast, lunch, dinner and afternoon tea to you.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Sanur Private Villa & Spa",
    "offer_address": "Jl. Tirta Akasa No.28, Sanur, Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1239.0,
    "value": 2893.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HVqPIAW",
    "hero_image": "https://images.luxuryescapes.com/zyk6pi0e7lp65q15qaj8",
    "image_two": "https://images.luxuryescapes.com/4qg8ahnen3lioyilli",
    "image_three": "https://images.luxuryescapes.com/o7j2yktt903qmis66nq",
    "vendor_name": "Sanora Villa Sanur",
    "title": "Idyllic Sanur Private Pool Villas with Daily Breakfast, Choice of Daily Lunch or Dinner & Beach Club Entry",
    "description": "Bali’s sandy beaches and aquamarine oceans are calling you - so why not answer with a stay at these idyllic villas set in sought-after Sanur. This secluded slice of heaven guarantees romance and tranquillity, with each spacious villa boasting its own sparkling pool and gorgeous tropical greenery.\n\nStart with a sumptuous breakfast before heading out to explore laidback Sanur or lounging poolside from your private oasis. Indulge with your choice of a delicious set menu lunch or dinner each day, plus a nightly cocktail to toast to blissful Bali days.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Sanora Villa Sanur by iNi ViE Hospitality",
    "offer_address": "Jalan Bypass Ngurah Rai No.888A, Sanur, Denpasar Selatan, Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 471.0,
    "value": 1150.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004hkzkAAA",
    "hero_image": "https://images.luxuryescapes.com/8im2n6wg33ow45it5d87",
    "image_two": "https://images.luxuryescapes.com/faef4ug2th3eg5cqxpy",
    "image_three": "https://images.luxuryescapes.com/zq45xwqi6gkx60h4idxj",
    "vendor_name": "Maison Aurelia",
    "title": "Boutique Bali Hideaway near Sanur Beach with Daily Breakfast & Cocktails",
    "description": "Make your sun-kissed travel dreams a reality with a stay at Maison Aurelia Sanur, a boutique hotel in the heart of Sanur, Bali, where pristine beaches, serene sunsets, fascinating cultural experiences and ancient temples are within close reach. Protected by a long string of offshore reefs, the crystal-clear warm waters of Sanur are the perfect spot for underwater exploration. Meanwhile, surfers will relish the opportunity to ride some of the best waves in the region. Sanur has no shortage of cultural attractions, nightlife and restaurants, but tends to be more tranquil than holiday hotspots Seminyak and Kuta.\n\nThis tropical haven boasts 42 breathtaking suites that each feature a unique blend of Balinese heritage and French charm. The glimmering outdoor swimming pool, enchanting gardens, fitness centre and rejuvenating spa facilities add to the experience, ensuring couples, families or groups of friends enjoy an escape to remember forever.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Maison Aurelia Sanur",
    "offer_address": "Jl. Danau Tamblingan, Sanur, Kec. Denpasar Sel. Kota Denpasar Bali 80228 Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 157.0,
    "value": 435.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070wFlAAI",
    "hero_image": "https://images.luxuryescapes.com/icr0slnetg1psoxzl0i",
    "image_two": "https://images.luxuryescapes.com/wm6ohtkc8ecw5hz76mb",
    "image_three": "https://images.luxuryescapes.com/no8dg8yjbjgyjiakcgll",
    "vendor_name": "Hyatt Regency Bali",
    "title": "Hyatt Regency Five-Star Bali Beachfront Resort with Daily Breakfast, Lunch & Dinner & Guaranteed Room Upgrade",
    "description": "Witness Bali's spectacular sunrises from Sanur's five-star beachfront resort - Hyatt Regency Bali, a serene oasis nestled beautifully among nine hectares of tropical landscape. Tucked away on the southeast shores of Indonesia's most desirable spot, this tranquil resort immaculately encapsulates the essence of traditional Balinese design blended with modern bespoke touches. The result is an authentic experience combined with all the luxuries guests have come to expect from a Hyatt resort. Featuring three beautiful swimming pools, a blissful spa and a beachside restaurant serving up authentic Italian fare, all complemented by immeasurable hospitality, this exceptional property has been perfectly designed to cater to everyone’s version of paradise.\n\nWhile this tropical escape may stir a feeling of complete seclusion, you’ll find yourself mere steps from the soft golden sands of Sanur Beach - with its gentle waves and watersport activities - as well as a myriad of restaurants, boutiques and locally owned cafés.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Hyatt Regency Bali",
    "offer_address": "Jl. Danau Tamblingan No.89, Sanur, Kec. Denpasar Sel., Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1019.0,
    "value": 2248.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000C8dmtYAB",
    "hero_image": "https://images.luxuryescapes.com/eg3x8bpw3do18kdcany8",
    "image_two": "https://images.luxuryescapes.com/qzyrwkyyc91ekvkr2t3",
    "image_three": "https://images.luxuryescapes.com/moqtdip8i783vww24cj",
    "vendor_name": "Mercure Resort Sanur",
    "title": "Sanur Beachfront Escape with Daily Breakfast, Three Lunches or Dinners & Nightly Cocktails",
    "description": "Dive into a fun-filled-yet-relaxing Bali getaway just steps from the sun lounge-filled beachfront. Surrounded by five hectares of thriving tropical gardens, this chilled-out haven feels a million miles away from reality, although it’s only a short walk from Sanur’s buzzing resturants, bars and markets.\n\nSpend days ducking under the waves of the nearby beach, splash in the clear pools within the resort, relax with cocktails in hand at The Breeze Bar or the poolside Sahadewa Bar and feast as you please overlooking the dazzling coastline at Pandawa Restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Mercure Bali Sanur Resort",
    "offer_address": "Jln. Mertasari No. 3 Sanur Bali 80228, Indonesia",
    "percentage_discount": 46.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 419.0,
    "value": 781.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UwPCcQAN",
    "hero_image": "https://images.luxuryescapes.com/uzybomioycxgm4oyew0d",
    "image_two": "https://images.luxuryescapes.com/uqhtfowjmlmrrhh5ndfj",
    "image_three": "https://images.luxuryescapes.com/tpi8ixniljkdc4iaazmj",
    "vendor_name": "The Villas at Fairmont Sanur Beach Bali",
    "title": "Palatial Pool Villa Group Getaway",
    "description": "Indulge in the ultimate luxury Balinese getaway staying in a palatial two-storey, Two-Bedroom Villa - measuring up to a huge 408sqm - with a private pool and butler service at the five-star Fairmont Sanur Beach Bali, nestled on Bali’s Sanur beachfront. Perfect for families or groups of up to five people, this incredible getaway includes daily breakfasts, return airport transfers, three-course dining experiences, a cooking class and more for the whole group. Three-Bedroom Villa upgrade available.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "The Villas at Fairmont Sanur Beach, Bali 2018*",
    "offer_address": "Jalan Kusuma Sari No.8, Sanur, Denpasar Selatan, Kota Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 6,
    "max_duration": 8,
    "price": 2521.0,
    "value": 6794.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPKupAAH",
    "hero_image": "https://images.luxuryescapes.com/i3ib51me9sun6o238mx",
    "image_two": "https://images.luxuryescapes.com/h2xqq1c9dl14vs1w7vdg",
    "image_three": "https://images.luxuryescapes.com/wd6bxo9f2j3axin04yn",
    "vendor_name": "Maya Sanur Resort & Spa",
    "title": "Five-Star Beachfront Sanur Resort with Massages, Daily Breakfast, Daily Lunch or Dinner & Nightly Sunset Cocktails",
    "description": "Experience award-winning luxury with the whole family on Bali's pristine beachfront at Maya Sanur Resort & Spa, a zen-inducing five-star oasis. This impeccably stylish resort is an architectural marvel with a wide choice of accommodation options, from nature-inspired resort rooms to expansive private suites and secluded pool retreats. Two top-notch restaurants mean you'll never have to go without, while the rooftop garden is a tranquil spot to feel at one with nature. Watch the sun rise over the ocean every morning before venturing into Sanur - Bali's serene new hotspot -  then return to this peaceful haven to watch live music performances at the beachfront bar.\n\nDesigned by Budiman Hendropurnomo with eco-friendly touches, like a whimsical grand entrance built from sand excavated during construction, this resort provides a perfect haven to let your worries drift away. When the day calls for a moment of indulgence and uninterrupted bliss, the luxurious spa promises holistic healing, while the sunbeds lining the 158-metre lagoon pool - just one of many - are the perfect place to while away the day. And with two children staying for free, the family may never want to go home.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Maya Sanur Resort & Spa",
    "offer_address": "Jalan Danau Tamblingan No.89M, Sanur, Bali 80228, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 639.0,
    "value": 1956.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ic2InAAJ",
    "hero_image": "https://images.luxuryescapes.com/o3eslibc3z0y20hp7rw",
    "image_two": "https://images.luxuryescapes.com/29vvga5mepqofdj5q48",
    "image_three": "https://images.luxuryescapes.com/d7v8077mf851fqc8udh",
    "vendor_name": "Maya Sanur Resort & Spa",
    "title": "Five-Star Beachfront Sanur Resort with Massages, Daily Breakfast, Daily Lunch or Dinner & Nightly Sunset Cocktails",
    "description": "Experience award-winning luxury with the whole family on Bali's pristine beachfront at this zen-inducing five-star oasis. With nature-inspired resort rooms, expansive private suites, secluded pool retreats and two top-notch restaurants, Maya Sanur has it all. The rooftop garden is a tranquil haven to feel at one with nature.\n\nWatch the sunrise over the ocean every morning before venturing into Sanur - Bali's serene new hotspot -  then return to this peaceful sanctuary to watch live music performances at the beachfront bar. Designed by Budiman Hendropurnomo with eco-friendly touches, this resort provides a perfect haven to let your worries drift away.\n\nWhen the day calls for a moment of indulgence and uninterrupted bliss, the luxurious spa promises holistic healing, while the sunbeds lining the 158-metre lagoon pool - just one of many - are the perfect place to while away the day. And with two children staying for free, the family may never want to go home.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Maya Sanur Resort & Spa",
    "offer_address": "Jalan Danau Tamblingan No.89M, Sanur, Bali 80228, Indonesia",
    "percentage_discount": 74.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1219.0,
    "value": 4702.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ddULHQA2",
    "hero_image": "https://images.luxuryescapes.com/pfq6ajqqzkb6s2c3v3h",
    "image_two": "https://images.luxuryescapes.com/pfme7fo9ffvnxyyoxkk",
    "image_three": "https://images.luxuryescapes.com/0s0na6njpiyfxkio80p2q",
    "vendor_name": "Fairmont Sanur Beach Bali",
    "title": "Fairmont Suite Luxury with Dining and Spa Inclusions",
    "description": "Escape to the five-star Fairmont Sanur Beach Bali, an all-suite resort positioned idyllically on 200 metres of pristine beachfront and surrounded by four hectares of lush tropical gardens. Stay in a palatial 90sqm Fairmont Garden View Suite and enjoy daily breakfast, two dinners, a Balinese cooking class for two, spa treatments, a complimentary cocktail or beer each, and much more. Kids' club access is included for those travelling with children, and ocean-view upgrades are available.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kota Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Fairmont Sanur Beach Bali November 2019",
    "offer_address": "Jl. Kusuma Sari No.8, Sanur, Beach, Kota Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 65.0,
    "min_duration": 7,
    "max_duration": 9,
    "price": 1239.0,
    "value": 3502.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuWrSAAV",
    "hero_image": "https://images.luxuryescapes.com/lu4dl39m5oe2owp0eo1",
    "image_two": "https://images.luxuryescapes.com/jgc63mgu6gtgm5ojww7i",
    "image_three": "https://images.luxuryescapes.com/j0brim1rf61e4vcxzjnc",
    "vendor_name": "Taksu Sanur Hotel",
    "title": "Bali Escape Minutes from Sanur Beach with Daily Breakfast, Airport Transfer & Nightly Cocktails",
    "description": "Discover Bali's beautiful beachside district with a stay at Taksu Sanur Hotel, just minutes from the popular Sanur Beach. This retreat offers the perfect launch pad for exploring Bali's historic temples, thriving markets and nearby islands. Take a day trip to Pantai Serangan to learn how to surf, head inland to explore Ubud's jungles or simply lounge by the resort pool before enjoying a relaxing treatment at Cakra Spa. Spend the evening dining next to the pool at Atma Restaurant, serving casual Asian and Western cuisine to keep everyone happy and well fed. Between meals, take yourself to the bar for a refreshing cocktail and unwind in tropical bliss.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Taksu Sanur Hotel",
    "offer_address": "Jl. Sudamala No.26, Sanur Kauh, Kota Denpasar, 80228, Indonesia",
    "percentage_discount": 41.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 329.0,
    "value": 560.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ab9zeAAB",
    "hero_image": "https://images.luxuryescapes.com/3zcrhhib5wjz8kgwlrat",
    "image_two": "https://images.luxuryescapes.com/xlbyi9d7sag4f1j35tqg",
    "image_three": "https://images.luxuryescapes.com/uyi49crmyl8nnr6um3er",
    "vendor_name": "Kayumanis Sanur Private Villa & Spa",
    "title": "Sanur Five-Star Private Pool Villas with Daily Breakfast, Daily Lunch or Dinner & Daily Restocked Minibar",
    "description": "Welcome to Kayumanis Sanur Private Villa & Spa, a five-star slice of Bali paradise. Positioned in the charming seaside village of Sanur, this exclusive villa complex is within easy reach of the area’s restaurants, vibrant nightlife, markets, and independent boutiques, filled with unique artisan gifts. Intimate and authentic, Kayumanis Sanur Private Villa & Spa is home to a boutique collection of just 11 one, two- and three-bedroom villas, each nestled within the confines of a walled garden with private pools and dedicated butler service.\n\nWhile leaving your sumptuous sanctuary is optional, there’s more to explore. Discover true tranquillity at Kayumanis Spa Sanur, where treatments combine traditional Balinese techniques with modern wellness knowledge. Sample the region's finest at Gong Restaurant Sanur, which combines market-fresh ingredients and seasonal delicacies infused with local herbs and spices, or opt for something a little more relaxed with beach-inspired bites at Kayumanis Seaside Sanur restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Sanur Private Villa & Spa",
    "offer_address": "Jl. Tirta Akasa No.28, Sanur, Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 671.0,
    "value": 1870.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AbA1PAAV",
    "hero_image": "https://images.luxuryescapes.com/1dgwnexsevpnc6bqtho",
    "image_two": "https://images.luxuryescapes.com/js9lmkovpnp9necv3yn",
    "image_three": "https://images.luxuryescapes.com/n68jv01o6npz7h4fj8",
    "vendor_name": "Hyatt Regency Bali",
    "title": "Five-Star Hyatt Bali Beachfront Resort with Daily Breakfast, Lunch or Dinner & Guaranteed Room Upgrade",
    "description": "Witness Bali's iconic sunrises from Sanur's five-star beachfront resort - Hyatt Regency Bali, a serene oasis tucked away on the southeast shores of Indonesia's most desirable spot. Blending the essence of  traditional Balinese design with modern bespoke touches, this tranquil resort creates an authentic experience combined with all the luxuries guests have come to expect from a Hyatt resort. Featuring three beautiful swimming pools, a blissful spa and a beachside restaurant serving up authentic Italian fare, all complemented by immeasurable hospitality, this exceptional property has been perfectly designed to cater to everyone’s version of paradise.\n\nWhile this tropical escape may stir a feeling of complete seclusion, you’ll find yourself mere steps from the soft golden sands of Sanur Beach - with its gentle waves and watersport activities - as well as a myriad of restaurants, boutiques and locally owned cafés.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Hyatt Regency Bali",
    "offer_address": "Jl. Danau Tamblingan No.89, Sanur, Kec. Denpasar Sel., Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 24,
    "price": 1055.0,
    "value": 2832.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EKBk2YAH",
    "hero_image": "https://images.luxuryescapes.com/xgn8lwigu5dk7g43fpmr",
    "image_two": "https://images.luxuryescapes.com/4qouei8ronobq05dow09",
    "image_three": "https://images.luxuryescapes.com/vnf9ngwulc2ny79si8hj",
    "vendor_name": "Seascape Resort Sanur",
    "title": "Romantic Adults-Only Bali Suites & Villas with Massages, Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Spend a romantic adults-only sojourn at this eco-conscious resort, occupying an intimate spot near Sanur Harbour. Feel the outside world melt away within the terracotta-toned walls of your expansive suite or villa, each complete with earthy designer interiors and luxurious amenities.\n\nStepping out of your intimate hideaway, you’ll find a wealth of facilities - dine at the sophisticated Tsune Restaurant and sip an aromatic cocktail on the alfresco terrace, be lulled into a state of zen at the spa or sit poolside under the shade of a cabana.\n\nYour location near the banks of Sanur puts you within minutes of renowned beaches and the harbour port, as well as the bustling Sindhu Night Market and the breathtaking historical sight of Pura Blanjong temple. Enjoy the convenience of the daily shuttle service and visit Karang Beach and central Sanur.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Seascape Resort Sanur by iNi Vie Hospitality",
    "offer_address": "Jalan Aruna 8A, Sanur, Denpasar, Bali 80237, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 28,
    "price": 569.0,
    "value": 1354.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008neUmAAI",
    "hero_image": "https://images.luxuryescapes.com/e7lg1ii8rnq9qovhfd1m",
    "image_two": "https://images.luxuryescapes.com/4ims0fmg9lqsnoo2sdch",
    "image_three": "https://images.luxuryescapes.com/dihu578zaqgjncv9u7ma",
    "vendor_name": "Kayumanis Sanur Private Villa & Spa",
    "title": "Sanur Five-Star Private Pool Villas with Daily Breakfast, Daily Lunch or Dinner & Daily Restocked Minibar",
    "description": "Welcome to Kayumanis Sanur Private Villa & Spa, a slice of Bali paradise ranked in the top five hotels in Sanur on Tripadvisor. Positioned in this charming seaside village, this exclusive villa complex is within easy reach of the area’s restaurants, vibrant nightlife, markets, and independent boutiques, filled with unique artisan gifts. Intimate and authentic, Kayumanis Sanur Private Villa & Spa is home to a collection of one, two and three-bedroom villas, each nestled within the confines of a walled garden with private pools and dedicated butler service.\n\nWhile leaving your sumptuous sanctuary is optional, there’s more to explore. Discover true tranquility at Kayumanis Spa Sanur, where treatments combine traditional Balinese techniques with modern wellness knowledge. Sample Sanur's finest at Gong Restaurant, which combines market-fresh ingredients and seasonal delicacies infused with local herbs and spices, or opt for something a little more relaxed with beach-inspired bites at Kayumanis Seaside Restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Sanur Private Villa & Spa",
    "offer_address": "Jl. Tirta Akasa No.28, Sanur, Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 5,
    "max_duration": 24,
    "price": 1129.0,
    "value": 3420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPpw7QAC",
    "hero_image": "https://images.luxuryescapes.com/ehngdekh9qcahy4y0sur",
    "image_two": "https://images.luxuryescapes.com/c5hmg60eyasxw5zxi0kr",
    "image_three": "https://images.luxuryescapes.com/ijcsk4sdbdkf4y8ewrn7",
    "vendor_name": "Sanur Resort Watu Jimbar (previously Swiss-Belresort Watu Jimbar)",
    "title": "Tropical Getaway Just Minutes from Sanur Beach",
    "description": "Swap Bali’s busier spots for a more relaxing break at Swiss-Belresort Watu Jimbar. Located a five-minute walk from Sanur’s peaceful beachfront, you’ll enjoy a daily buffet breakfast, three two-course dinners, a one-way private airport transfer, one 30-minute massage each and a leisurely 1pm check-out.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Swiss-Belresort Watu Jimbar",
    "offer_address": "Jl. Danau Tamblingan No.99A, Sanur, Denpasar Sel., Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 41.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 250.0,
    "value": 424.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ab9xwAAB",
    "hero_image": "https://images.luxuryescapes.com/a23vayb6et0w51bhks5l",
    "image_two": "https://images.luxuryescapes.com/tsd0uavh2esca2odj558",
    "image_three": "https://images.luxuryescapes.com/cty8dapajhvdw7culg9r",
    "vendor_name": "Maya Sanur Resort & Spa",
    "title": "Five-Star Beachfront Sanur Resort with Massages, Daily Dining & Nightly Sunset Cocktails",
    "description": "Experience the best in eco-luxury on Bali's pristine beachfront at Maya Sanur Resort & Spa, a zen-inducing five-star oasis. This impeccably stylish resort - ranked within the top 10% of properties on Tripadvisor - is an architectural marvel with a wide choice of accommodation from nature-inspired resort rooms to expansive private suites and secluded pool retreats. There are two top-notch restaurants and an eco-green rooftop, a tranquil spot where guests can feel at one with nature. \n\nWhen the day calls for a moment of indulgence and uninterrupted bliss, the award-winning spa promises holistic healing, while the sunbeds surrounding the 158-metre lagoon pool - one of several shimmering resort pools - are the perfect place to while the day away. Watch the sunrise over the ocean every morning before your Bali adventures begin, then return to this peaceful haven to see the vibrant transformation with live music performances at the beachfront bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Maya Sanur Resort & Spa",
    "offer_address": "Jalan Danau Tamblingan No.89M, Sanur, Bali 80228, Indonesia",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 944.0,
    "value": 2035.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPbFzQAK",
    "hero_image": "https://images.luxuryescapes.com/nip7epzzvnis8rlzvsct",
    "image_two": "https://images.luxuryescapes.com/hqroaqaaypxictebdqbz",
    "image_three": "https://images.luxuryescapes.com/nwoq3lhv0xf9kyxagvv6",
    "vendor_name": "The Villas at Fairmont Sanur Beach Bali",
    "title": "Five-Star Palatial Private Pool Villa with Daily Massages, Decadent Dining & More",
    "description": "Treat the whole family to a luxury getaway at the five-star Fairmont Sanur Beach Bali, perched on 200 metres of azure beachfront and nestled amidst four hectares of lush tropical gardens. Stay in a palatial two-storey, Two-Bedroom Villa with daily breakfast, three-course dining experiences, a daily 60-minute massage for two adults, 20% discount on surfing lessons, Spa treatments and other activities, three hours of complimentary babysitting, a family cooking class, a convenient airport pick-up and more. Plus kids aged 11 years & under get the full VIP treatment with complimentary access to the Kids' Club and free meals when dining with parents.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kota Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "The Villas at Fairmont Sanur Beach, Bali - FEB 2019",
    "offer_address": "Jalan Kusuma Sari No.8, Sanur, Denpasar Selatan, Kota Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 9,
    "price": 2189.0,
    "value": 5223.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004hdFhAAI",
    "hero_image": "https://images.luxuryescapes.com/42brjktoyx7o6gksfjsr",
    "image_two": "https://images.luxuryescapes.com/s6txvy7evr848chv0kwe",
    "image_three": "https://images.luxuryescapes.com/ffm6zi9mgqpit1lu7l9q",
    "vendor_name": "Hyatt Regency Bali",
    "title": "Hyatt Regency's Newest Five-Star Bali Beach Resort with All-Inclusive Daily Dining",
    "description": "Witness Bali's famous sunrises from Sanur's newest Bali five-star beachfront resort - Hyatt Regency Bali - a serene oasis nestled beautifully among nine hectares of tropical landscape. Tucked away on the south-west shores of Indonesia's most popular holiday hotspot, this tranquil resort immaculately encapsulates the essence of traditional Balinese design blended with modern bespoke touches. The result is an authentic experience combined with all the luxuries guests have come to expect from a Hyatt resort. Featuring three beautiful swimming pools, a blissful spa and one of the best Italian restaurants in Bali - all complemented by immeasurable hospitality - this exceptional property has been perfectly designed to cater to everyone’s version of paradise.\n\nWhile this tropical escape may stir a feeling of complete seclusion, you’ll find yourself mere steps from the soft golden sands of Sanur Beach - with its gentle waves and watersport activities - as well as myriad restaurants, boutiques and locally owned cafés that have yet to succumb to the tourist mayhem of Bali's bigger resort towns.\n\n**Your handpicked inclusions:**\n\n- Indulge with daily breakfast, lunch and dinner\n- Unwind with a 30-minute reflexology treatment per adult\n- Travel in style with a one-way private airport transfer\n- Celebrate your escape with a one-time sunset cocktail per adult\n- One child (under 6) stays free with breakfast and one-time airport transfer\n\n**Travelling with family?** Choose the Premium, Family or Regency Upgrades for up to two adults and two children (1-11).\n\n**Regency Club Upgrades:** Select a Family or Regency Suite and enjoy club benefits at the Regency Club lounge, including daily free-flow drink hours, snacks throughout the day and breakfast served in the stylish lounge.\n\n**Book with 100% Confidence:** If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Hyatt Regency Bali",
    "offer_address": "Jl. Danau Tamblingan No.89, Sanur, Kec. Denpasar Sel., Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 959.0,
    "value": 2907.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IeRSbAAN",
    "hero_image": "https://images.luxuryescapes.com/q9bklah59ic45bfa55wo",
    "image_two": "https://images.luxuryescapes.com/yadxmbd0867ocsnko85b",
    "image_three": "https://images.luxuryescapes.com/p8m6f3zbj49z8h79ruy4",
    "vendor_name": "The MERU Sanur",
    "title": "Sanur All-Suite Opulence with Daily Breakfast, Daily Lunch or Dinner, Nightly Cocktails & Massages",
    "description": "Be one of the first to discover this newly opened oasis of all-suite opulence, perfectly positioned directly on Sanur’s perfect shores. Even for a place as legendary for hospitality as the Island of the Gods, The Meru Sanur redefines five-star luxury.\n\nFind suites that dazzle with countless high-end finishes, including intricate, hand-carved millwork, showstopping pieces of traditional art and expansive private terraces boasting spectacular views over lush gardens or the shining Indian Ocean. Wander through The Meru Sanur’s estate and you’ll find a magnificent central pool and Arunika Restaurant, serving signature cocktails and authentic Balinese food into the late evening.\n\nA resort this good demands a spa to match - enter Svasana Spa, featuring a wellness menu that dances between the holistic and the spiritual, with treatments ranging from relaxation massages to traditional Balinese purification ceremonies.\n\nA complimentary wellness program offers boxing classes, adventure cycling and sunrise yoga. When you’re ready to explore, Sanur’s warm sands and calm waters offer some of Bali’s best diving and snorkelling, plus easy access to the idyllic island of Nusa Lembongan, just a 30-minute boat ride away.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "The Meru Sanur",
    "offer_address": "Jl. Hang Tuah, Sanur Kaja, Denpasar Selatan, Kota Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 1199.0,
    "value": 2342.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GBnVfYAL",
    "hero_image": "https://images.luxuryescapes.com/4vxifoy31ecoghmrilel",
    "image_two": "https://images.luxuryescapes.com/pgfdl7oikcq76b0zxc3l",
    "image_three": "https://images.luxuryescapes.com/cw9vxijntg4d7jgi9l2k",
    "vendor_name": "Kayumanis Sanur Private Villa & Spa",
    "title": "Bali Private Pool Villa Sanur Oasis with All-Day Breakfast, Nightly Dinner, Butler Service & Massages",
    "description": "Welcome to this five-star slice of Balinese paradise. Positioned in the charming village of Sanur, this exclusive villa complex is home to just 11 villas, each nestled within the confines of a walled garden with private pools and dedicated butler service.\n\nSample the region's finest cuisine at Gong Restaurant, which combines market-fresh ingredients and seasonal delicacies infused with local herbs and spices, or opt for something a little more relaxed with beach-inspired bites at Kayumanis Seaside Sanur Restaurant. Alternatively, enjoy the serenity of your villa and allow the attentive team to bring meals to you.\n\nDiscover true tranquillity at Kayumanis Spa Sanur, where treatments combine traditional Balinese techniques with modern wellness knowledge. With everything you need right at your doorstep, it's tempting to stay in - but if you venture beyond the villa, you'll find yourself within easy reach of local restaurants, vibrant nightlife, bustling markets and charming boutiques. At Kayumanis Sanur Private Villa & Spa, you truly get the best of both worlds.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Sanur Private Villa & Spa",
    "offer_address": "Jl. Tirta Akasa No.28, Sanur, Denpasar Selatan, Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 62.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1429.0,
    "value": 3805.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bQ0unQAC",
    "hero_image": "https://images.luxuryescapes.com/sldv0hbppwldzwknthip",
    "image_two": "https://images.luxuryescapes.com/wbwlwcatqplekampizdq",
    "image_three": "https://images.luxuryescapes.com/m8bk8jnzglbvlzk3ytcn",
    "vendor_name": "Kamuela Villas and Suite Sanur",
    "title": "Spacious Suite Stay Close to Sanur Beach",
    "description": "Just 30 minutes’ drive from Denpasar Airport, you’ll find serene Sanur, a calm seaside town in Bali’s Southeast. Enjoy a relaxing break at Kamuela Villas and Suites Sanur, just five minutes from Sanur Beach with daily a la carte breakfast, two three-course dinners, daily afternoon tea, a daily cocktail and more included.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Kamuela Villas and Suites Sanur",
    "offer_address": "Jl. Cemara No.33, Sanur, Denpasar Sel., Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 625.0,
    "value": 1508.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ab9xxAAB",
    "hero_image": "https://images.luxuryescapes.com/4qd0kg77m2bpi02zxiv",
    "image_two": "https://images.luxuryescapes.com/tlul84fuqik6f2s0vun",
    "image_three": "https://images.luxuryescapes.com/hprfuo04l48aqkine9xh",
    "vendor_name": "The Pavilions Bali",
    "title": "Bali Private Villa Sanur Haven with 60-Minute Massage, Daily Breakfast & Nightly Cocktails",
    "description": "Discover a tropical oasis hidden among the white-sand beaches and lush tropical surrounds of Sanur at the tranquil The Pavilions Bali. An idyllic honeymoon location or relaxed family destination, you’ll feel like the only guests at the resort in your private villa - truly your own slice of Bali paradise. Positioned in this charming village, this exclusive villa complex is within easy reach of the area’s restaurants, vibrant nightlife, markets and independent boutiques filled with unique artisan gifts.\n\nIf you can tear yourself away from your splendid sanctuary, there’s more to explore. Discover true tranquillity at The Pavillions Spa, where treatments combine traditional Balinese techniques with modern wellness knowledge. Sample Sanur's finest at Jahe Restaurant, which combines local flavours with international favourites or opt for something a little more relaxed with island-inspired bites at the Poolside Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "The Pavilions Bali",
    "offer_address": "Jl. Danau Tamblingan Number 76, Sanur, Bali 80228, Indonesia",
    "percentage_discount": 48.0,
    "min_duration": 5,
    "max_duration": 24,
    "price": 669.0,
    "value": 1290.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zUWBAA2",
    "hero_image": "https://images.luxuryescapes.com/g6mbkgcd4sqe23wuy1rs",
    "image_two": "https://images.luxuryescapes.com/6rsieuhkuxcu4f5znbb",
    "image_three": "https://images.luxuryescapes.com/em0kvzfkhbclatldx63k",
    "vendor_name": "Maya Sanur Resort & Spa",
    "title": "Five-Star Sanur Beachfront Resort with Daily Breakfast, Daily Lunch or Dinner & Nightly Sunset Cocktails",
    "description": "Experience the best in eco-luxury along the glistening shores of Bali's pristine beachfront at Maya Sanur Resort & Spa, a zen-inducing five-star oasis. Relax and watch the sunrise over the ocean every morning, then see it melt into the horizon every evening from the beachfront bar.\n\nThis impeccably stylish resort - ranked within the top 10% of properties on Tripadvisor - is an architectural marvel with a wide choice of accommodation from nature-inspired resort rooms to expansive private suites and secluded pool retreats. There are four top-notch restaurants and an eco-green rooftop, a tranquil spot where guests can feel at one with nature. When the day calls for a moment of indulgence and uninterrupted bliss, the award-winning spa promises holistic healing, while the sunbeds surrounding the 158-metre lagoon pool - one of several shimmering resort pools - are the perfect place to while the day away.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Maya Sanur Resort & Spa",
    "offer_address": "Jalan Danau Tamblingan No.89M, Sanur, Bali 80228, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 714.0,
    "value": 1723.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CgpyUYAR",
    "hero_image": "https://images.luxuryescapes.com/iim24tab6jk99jm266",
    "image_two": "https://images.luxuryescapes.com/g24inn4dz7i94l4pau",
    "image_three": "https://images.luxuryescapes.com/vs1siw63gfnoxo4qglw9",
    "vendor_name": "Bali Beach Hotel",
    "title": "Grand Reopening: Bali Beachfront Oceanview Luxury with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Newly reimagined after a multi-million-dollar renovation, this beloved five-star beachfront sanctuary is back and better than ever. Effortlessly marrying modern luxury with Balinese tradition - and boasting an unbeatable beachfront location, sprawling pool and serene onsite spa - this oasis within Indonesia's first-ever heritage hotel will leave you feeling brand-new.\n\nIn the morning, wake to the tropical breeze and elevate your day with a bountiful buffet spread at Roso, where Indonesian tradition meets international flavour. Later, indulge in Arunika's world-class array of local and international delights, perfectly positioned next to its sparkling pool.\n\nLose track of time wandering along Sanur's seemingly never-ending white-sand shore, right at the hotel’s doorstep, or visiting Bali's bliss-filled beach clubs. Head back to your hotel to welcome the balmy evening with a carefully crafted cocktail at the bar and sweeping ocean views from your room's balcony.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Bali Beach Sanur: The Heritage Collection",
    "offer_address": "Jalan Hang Tuah, Sanur Kaja, Denpasar Selatan, Kota Denpasar, Bali 80227, Indonesia",
    "percentage_discount": 40.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 929.0,
    "value": 1557.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQQ15AAH",
    "hero_image": "https://images.luxuryescapes.com/mmcop4alfak7y3wzbs5r",
    "image_two": "https://images.luxuryescapes.com/3kj9jtqyu9ox34c5lpzr5",
    "image_three": "https://images.luxuryescapes.com/wz76f7afhpqztrmad465",
    "vendor_name": "Sanora Villa Sanur",
    "title": "Idyllic Sanur Private Pool Villas with Daily Breakfast & Beach Club Entry",
    "description": "Bali’s sandy beaches and aquamarine oceans are calling - why not answer with a stay at these idyllic villas set in sought-after Sanur? This secluded slice of heaven guarantees romance and tranquillity, with each spacious villa boasting its own sparkling pool and gorgeous tropical greenery.\n\nStart with a sumptuous breakfast before heading out to explore laidback Sanur, turning things up with free entry to Tropical Temptations Beach Club in Uluwatu or lounging poolside, at home in your private oasis.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Sanora Villa Sanur by iNi ViE Hospitality",
    "offer_address": "Jalan Bypass Ngurah Rai No.888A, Sanur, Denpasar Selatan, Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 160.0,
    "value": 160.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000C3mHMYAZ",
    "hero_image": "https://images.luxuryescapes.com/zwu3qbbpbnwolyaj0s4",
    "image_two": "https://images.luxuryescapes.com/i6hi7ugsnk6ss36a292w",
    "image_three": "https://images.luxuryescapes.com/2gd504rgm5dyu4q67nlr4r",
    "vendor_name": "Seascape Resort Sanur",
    "title": "Romantic Sanur Suites & Villas Hideaway with Nightly Cocktails",
    "description": "Bask in the intimate charms and experience uninterrupted tranquillity from this Sanur oasis, tucked away in a quaint spot near the Sanur Harbour. Kindle the romance as you retreat within the terracotta-toned walls of your expansive suite or villa, each complete with earthy designer interiors and luxurious amenities.\n\nSpend your days soaking up the Balinese sun, relax in the resort's exotic outdoor pool and pamper yourself with soul-soothing massages at Svaha Spa for a truly romantic escape. Savour a myriad of Japanese delicacies, including crunchy unagi maki and toro foiegrass sashimi, at the sophisticated Tsune Restaurant and sip on delicious cocktails. If you manage to tear away from the resort, the renowned beaches of Sanur and the Sindhu Night Market are within easy reach.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Seascape Resort Sanur by iNi Vie Hospitality",
    "offer_address": "Jalan Aruna 8A, Sanur, Denpasar, Bali 80237, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 81.0,
    "value": 81.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070HU6AAM",
    "hero_image": "https://images.luxuryescapes.com/sn9v9pl1kmanxqluthig8",
    "image_two": "https://images.luxuryescapes.com/l585i3k9fsd0kqmj9wrb",
    "image_three": "https://images.luxuryescapes.com/yk1khd7pohuy7nssw",
    "vendor_name": "Kayumanis Sanur Private Villa & Spa",
    "title": "Sanur Five-Star Private Pool Villas & Spa Moments from the Beach",
    "description": "Welcome to Kayumanis Sanur Private Villa & Spa, your own slice of Bali paradise enveloped in lush tropical greenery. Positioned in the charming seaside village of Sanur, this exclusive villa complex is within easy reach of the area’s restaurants, vibrant nightlife, markets, and independent boutiques, filled with unique artisan gifts.\n\nIntimate and authentic, Kayumanis Sanur Private Villa & Spa is home to a collection of one, two and three-bedroom villas, each nestled within the confines of a walled garden, with private pools and dedicated butler service. While leaving your sumptuous sanctuary is optional, there’s more to explore. Discover true tranquility at Kayumanis Spa Sanur, where treatments combine traditional Balinese techniques with modern wellness knowledge. Sample Sanur's finest at Gong Restaurant, which combines market-fresh ingredients and seasonal delicacies infused with local herbs and spices, or opt for something a little more relaxed with beach-inspired bites at Kayumanis Seaside Restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Sanur Private Villa & Spa",
    "offer_address": "Jl. Tirta Akasa No.28, Sanur, Denpasar Selatan, Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 213.0,
    "value": 213.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HaArAAK",
    "hero_image": "https://images.luxuryescapes.com/bs1tr2qzvu2zmf89cob",
    "image_two": "https://images.luxuryescapes.com/tnvsodj54jx8rqmckyop",
    "image_three": "https://images.luxuryescapes.com/guyjpg9ynn0hveirwh2",
    "vendor_name": "The Samata Sanur, Bali",
    "title": "Secluded Wellness Escape on Bali's Serene East Coast",
    "description": "Immerse yourself in ultimate relaxation of the mind, body, and soul at The Samata by LifestyleRetreats on the island's East Coast. Designed for the health-conscious traveller, this stunning resort which featured in Tripadvisor's Traveller's Choice Awards for 2021, offers indulgent spa treatments, pilates, yoga, and meditation. If you want to get your heart rate up, there's a fully equipped gym, boxing ring and boot camp-style workouts. Take a dip in one of three stunning swimming pools, or reward yourself after a good workout with a cheeky afternoon mojito or piña colada poolside. Dine at Zenso restaurant, where organic and healthy food takes the spotlight.\n\nThe nearby seaside town of Sanur has an easygoing vibe, local bars, restaurants and picture-perfect golden sand beach. The east-facing coastline makes for a breathtaking sunrise - a must-do during your dreamy wellness escape.\n\n**Luxury Escapes inclusions (select packages):**\n\n- Wake to a delicious **daily à la carte breakfast**\n- Toast a day in paradise with **one daily drink per person**\n- Keep active with a **one-time 60-minute water pilates class or personal training session** (for stays of 3+ nights)\n- Enjoy the ease of a **roundtrip airport transfer** (for stays of 5+ nights)\n- Indulge in a delicious **private BBQ dinner** in the privacy of your own villa (for stays of 7+ nights)\n\n**Travelling with family or in a group?** Upgrade to the Two-Bedroom Villa or the ultra-luxurious three-bedroom The Samata Residence for the ultimate group holiday (for up to four guests). Both options include a private pool and sundeck with loungers.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "The Samata by LifestyleRetreats",
    "offer_address": "Tangtu, Jl. Pucuk I No.67, Kesiman Kertalangu, East Denpasar, Denpasar City, Bali 80237, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 74.0,
    "value": 74.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006ziaFAAQ",
    "hero_image": "https://images.luxuryescapes.com/zsohf9cj9n0gqx8sgva9",
    "image_two": "https://images.luxuryescapes.com/1hkgh8gbwgk1x95m0nrk",
    "image_three": "https://images.luxuryescapes.com/j793xx3uf4l6vngturri",
    "vendor_name": "The Pavilions Bali",
    "title": "Private Balinese Villa Haven in Sanur",
    "description": "Discover a tropical oasis a short stroll from white-sand beaches and the seaside town of Sanur at The Pavilions Bali, ranked within the top 10% of properties on Tripadvisor. An idyllic honeymoon location or relaxed family destination, this exclusive villa complex is within easy reach of the area’s restaurants, markets and independent boutiques, filled with unique artisan gifts.\n\nIntimate and authentic, The Pavilions Bali is home to a collection of traditional Balinese-style villas, each nestled within the confines of a walled garden, most with private pools and all with butler service. This seclusion offers a heightened sense of privacy and romance. Cool off in your private pool (villa depending), work on your tan on your sundeck or have a night of romance dining under the stars in your private garden. While leaving your sumptuous sanctuary is optional, there’s more to explore. Discover true tranquility at The Pavilions Spa, where all-natural wellness rituals and treatments will leave you with a renewed feeling of comfort and peace. Sample local specialities and international favourites at Jahe Restaurant, which combines fresh ingredients and time-tested spices to create mouth-watering dishes, or opt for something a little more relaxed with cocktails and snacks served at the Poolside Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "The Pavilions Bali",
    "offer_address": "Jl. Danau Tamblingan No.76, Sanur, Denpasar Sel., Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 134.0,
    "value": 134.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GPkWAAW",
    "hero_image": "https://images.luxuryescapes.com/rw77c8x2ypua9v54ag89",
    "image_two": "https://images.luxuryescapes.com/o263e7pb2uk2uixyfi7",
    "image_three": "https://images.luxuryescapes.com/03l0fa12rdw5t060u6k",
    "vendor_name": "Maya Sanur Resort & Spa",
    "title": "Five-Star Sanur Beachfront Eco Oasis",
    "description": "Tap into eco-luxury along the glistening shores of Sanur's pristine beachfront at Maya Sanur Resort & Spa, a zen-inducing, five-star oasis where you can watch the sunrise over the ocean every morning. Then, watch it melt into the horizon every evening from the beachfront bar.\n\nThis award-winning resort - winner of the 2020 Tripadvisor Travellers' Choice Award - is an architectural marvel with a wide choice of accommodation to suit guests’ preferences, from the nature-inspired rooms to private suites and pool retreats. Within five minutes’ walk, there is a myriad of world-class restaurants, while the swish onsite facilities offer everything you’d expect from a high-end beach resort. The award-winning spa promises holistic healing while the sunbeds surrounding the 158m lagoon pool - one of three resort pools - are the perfect place to while the day away. The resort is distinguished by its eco-green rooftop, a tranquil spot where guests can feel at one with nature. Enjoy complimentary access to the kids' club for your little ones and, in the fading hours of daylight, indulge at one of the four onsite dining venues.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Sanur",
    "location_subheading": "Bali",
    "location_description": "Maya Sanur Resort & Spa",
    "offer_address": "Jl. Danau Tamblingan, Sanur, Kec. Denpasar Sel., Kota Denpasar, Bali 80228, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 139.0,
    "value": 139.0
  }
]