[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JB5dIAG",
    "hero_image": "https://images.luxuryescapes.com/ael13ibjeu8vrnkwxer8",
    "image_two": "https://images.luxuryescapes.com/wy6vt7r23kr6kd1idx",
    "image_three": "https://images.luxuryescapes.com/p77clq19w2bfhpumnp7",
    "vendor_name": "Barrel View Luxury Cabins",
    "title": "Queensland Adults-Only Wine Barrel Retreat Overlooking the Granite Belt with Breakfast Hamper & Gourmet Picnic Box",
    "description": "Enjoy an adults-only, vino-soaked escape at this unique wine barrel retreat, perfectly positioned in the magnificent heart of Queensland's acclaimed wine country. A three-hour drive from Brisbane in the town of Ballandean, find yourself surrounded by over 50 top-shelf wineries and vineyards - this is a wine-lovers haven simply overflowing with whimsical luxury and rural charm.\n\nSettle into your boutique cabin, uniquely designed to emulate a giant oaken wine barrel, where you can savour spectacular panoramic views of the stunning Granite Belt. Spend days sipping through the region’s vineyards or touring gorgeous national parks, including Sundown's striking gorges and Girraween's colossal granite outcrops and wildflower-filled fields.\n\nPick a spot on the grounds and sit down for a gourmet picnic, then return through the rolling hills to watch sunset from your private deck and spend the evening in romantic seclusion, warmed by your private fireplace and embraced by open bushland.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Ballandean",
    "location_heading": "Ballandean",
    "location_subheading": "Queensland",
    "location_description": "Barrel View Luxury Cabins",
    "offer_address": "137 Days Road, Ballandean, Queensland 4380, Australia",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 509.0,
    "value": 717.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DOh00AAD",
    "hero_image": "https://images.luxuryescapes.com/ej06tel60j1q8em2shb",
    "image_two": "https://images.luxuryescapes.com/gum2r6ed6qsgkyrkcr9j",
    "image_three": "https://images.luxuryescapes.com/wsc81mo3eky4dt7q73xr",
    "vendor_name": "Barrel View Luxury Cabins",
    "title": "Grand Opening: Queensland Adults-Only Wine Barrel Retreat Overlooking the Granite Belt with Bubbles & Pamper Package",
    "description": "Wine lovers rejoice! Be one of the first to discover an adults-only, vino-soaked escape like no other at Barrel View Luxury Cabins, just a 2.5-hour drive from Brisbane. Perfectly positioned within the magnificent heart of Queensland's acclaimed wine country - and surrounded by over 50 top-shelf wineries and vineyards - this is a wine-lover's retreat that's simply overflowing with whimsical luxury and rural charm. Settle into your boutique cabin lodging - uniquely designed to emulate a giant oaken wine barrel - and savour spectacular panoramic views of the sprawling national parks and stunning Granite Belt beyond.\n\nSpend your days leisurely sipping your way across the region’s vineyards or touring its gorgeous national parks - including Sundown's striking gorges and Girraween's colossal granite outcrops and wildflower-filled fields, both just a short drive away. Return through the rolling hills to watch the sunset from your private deck and spend the evening in romantic seclusion, warmed by your private fireplace and surrounded by unrestricted open bushland on all sides.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Ballandean",
    "location_heading": "Ballandean",
    "location_subheading": "Queensland",
    "location_description": "Barrel View Luxury Cabins",
    "offer_address": "137 Days Road, Ballandean, Queensland 4380, Australia",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 511.0,
    "value": 1235.0
  }
]