[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ewt2cAAB",
    "hero_image": "https://images.luxuryescapes.com/2oofy8m2wsly7qt46kd",
    "image_two": "https://images.luxuryescapes.com/n2a3u6fgfgwqqa3nmt5j",
    "image_three": "https://images.luxuryescapes.com/gunb8yq2v88y4ea1sdn",
    "vendor_name": "Grand Hyatt Hong Kong",
    "title": "Grand Hyatt Hong Kong Victoria Harbour Luxury with Daily Breakfast, Dining Credit & Cathay Pacific Return Flights for Two",
    "description": "Roll into Wan Chai like a true VIP with a stay at the five-star Grand Hyatt Hong Kong, a bastion of modern elegance boasting spectacular views over Victoria Harbour’s iconic waters. Situated in Hong Kong Island’s historic heart, there are countless possibilities at your doorstep - Causeway Bay’s shining shopping malls, Central’s world-famous Peak Tram and the Star Ferry Terminal are all just a short 'ding-ding' tram ride away. The hotel offers dining beyond compare - hit up Grand Hyatt Steakhouse for prime, imported cuts of beef grilled to perfection, One Harbour Road for gleefully reimagined Cantonese dim sum or Champagne Bar for endless bubbles in one of Hong Kong’s most brilliant bars (indulgent Oscietra caviar optional, but recommended).\n\nUpgrade to a Club Access room to enjoy access to the ultra-exclusive Grand Club, located on the hotel’s 30th and 31st floors - as evening falls over the city, sip nightly complimentary cocktails and soak up spellbinding views over the neon-kissed skyline. Don’t forget to check out the hotel’s acclaimed, waterfall-hugged pool - there’s no better place than this sky-high slice of tropical paradise to sip your way through the lazy afternoon.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong Island",
    "location_subheading": "Hong Kong",
    "location_description": "Grand Hyatt Hong Kong",
    "offer_address": "1 Harbour Rd, Wan Chai, Hong Kong",
    "percentage_discount": 61.0,
    "min_duration": 4,
    "max_duration": 16,
    "price": 1628.0,
    "value": 4133.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zXGdAAM",
    "hero_image": "https://images.luxuryescapes.com/0aoy9vxd7f2i0n1pa135",
    "image_two": "https://images.luxuryescapes.com/5rzu25updc1a8s5vf9t5",
    "image_three": "https://images.luxuryescapes.com/uy86e9ro4iu5oowph3p",
    "vendor_name": "Hotel Jen Hong Kong",
    "title": "Five-Star Shangri-La Hong Kong Escape in Vibrant Western District",
    "description": "A captivating mix of traditional and contemporary create a unique atmosphere at the five-star JEN Hong Kong by Shangri-La, with the bustling Western District right on your doorstep. This city haven features elegant décor and panoramic views of Victoria Harbour, and is ideally positioned with the nearby HKU Station offering easy access to key transport junctions. Expect nothing less than decadent dining options from this Shangri-La escape.\n\nThe best vintage and modern elements of the bustling city are on display from the minute you step into the luxurious hotel. Reminiscences of the city’s history linger around the thriving commercial neighbourhoods and skyscrapers, with traditional markets and lavish restaurants side by side. Truly appreciate the modern and the classic in this blissful Shangri-La stay.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong Island",
    "location_subheading": "Hong Kong",
    "location_description": "Jen Hong Kong",
    "offer_address": "508 Queens Road West, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 111.0,
    "value": 111.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000D7ZZTYA3",
    "hero_image": "https://images.luxuryescapes.com/wbcbbnwp6pw5635ukfme",
    "image_two": "https://images.luxuryescapes.com/cdq98wew8x70o08ycw0o",
    "image_three": "https://images.luxuryescapes.com/zfjx28tl1in4ui3kxbp",
    "vendor_name": "Lanson Place Causeway Bay, Hong Kong",
    "title": "Glamorous Hong Kong Escape in the Heart of Vibrant Causeway Bay",
    "description": "Uncover a world of sparkling European sophistication just steps from Hong Kong’s vibrant Causeway Bay. As one of the most sought-after hotels in the heart of Hong Kong Island, it provides a tranquil, pastel-hued sanctuary metres from the city’s action. Discover richly styled spaces, including the hotel's chic restaurant.\n\nFlooded with natural daylight and transforming into a sophisticated nightspot by evening, Salon Lanson dishes delectable breakfasts, generous club privileges and signature cocktails curated by an in-house mixologist. Explore nearby offerings from the renowned Times Square shopping district to the lush Victoria Park. A stay at Lanson Place Causeway Bay allows you to rub shoulders with the city's trendsetters, gourmands and fashionistas.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong Island",
    "location_subheading": "Hong Kong",
    "location_description": "Lanson Place Causeway Bay",
    "offer_address": "133 Leighton Road, Causeway Bay, Hong Kong 0000, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 236.0,
    "value": 236.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zXGJAA2",
    "hero_image": "https://images.luxuryescapes.com/iop8g266e8du2if8n4r",
    "image_two": "https://images.luxuryescapes.com/uu1t3uv3l92it5y3fmfd",
    "image_three": "https://images.luxuryescapes.com/gkwwvcurpcele1g51qzp",
    "vendor_name": "Island Shangri la",
    "title": "Five-Star Hong Kong Sky-High Indulgence with Seven Award-Winning Restaurants",
    "description": "Take a moment's pause and relax at the peaceful Island Shangri-La, where signature luxury and tranquil views of the iconic Peak and Victoria Harbour make for an idyllic escape in the heart of Hong Kong. Step through the lobby doors and see the 140-year-old Banyan Tree taking up residence, a perfect greeting to this urban oasis. Seven award-winning restaurants and bars will delight foodies with a wide array of culinary delights from French fine dining at the Michelin-starred Restaurant Petrus to a bountiful buffet at cafe TOO. For artisanal cocktails, oysters and live jazz music, head to Lobster Bar for a lively night in. And when you're ready to venture out, Pacific Place Mall is just a two-minute walk away and houses many internationally renowned shopping brands, a cinema and countless food options.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong Island",
    "location_subheading": "Hong Kong",
    "location_description": "Island Shangri-La",
    "offer_address": "Supreme Ct Rd, Admiralty, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 275.0,
    "value": 275.0
  }
]