[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Ib60IAC",
    "hero_image": "https://images.luxuryescapes.com/m9qj27i53ugz9x4vb28",
    "image_two": "https://images.luxuryescapes.com/lp2ktpvkc3tytf0ojkgn",
    "image_three": "https://images.luxuryescapes.com/vdgwx3w4ygkdbyrl45",
    "vendor_name": "InterContinental Fiji Golf Resort & Spa",
    "title": "Fiji Exclusive Flight Package: Luxury Suites with Return Flights, Daily Breakfast & FJ$500 Credit",
    "description": "This incredible, not-to-be-missed Fiji resort includes return international flights, offering the perfect beach escape just a one-hour drive from Nadi Airport. Nestled on over 35 acres of lush tropical gardens, this idyllic retreat is situated on the main island of Viti Levu, along the pristine shores of Natadola Beach.\n\nAs you explore this coast-hugging resort, you'll discover three sparkling outdoor pools, an award-winning spa and a garden-facing fitness centre. Your days in Fiji are guaranteed to be full of memorable moments, with a variety of cultural activities to enjoy during your stay, including nightly torch-lighting ceremonies, traditional meke and Polynesian dancing and exciting adventures at the house reef.\n\nDining at InterContinental Fiji Golf Resort & Spa, an IHG Hotel, offers a variety of unique culinary experiences. Relish wood-fired dishes in the casual ambience of Toba Bar & Grill, then unwind with a cocktail at the lively Kama Lounge and Bar. For a buffet with stunning ocean views, head to Sanasana Restaurant, conveniently located along the sugar cane train track.\n\nGolf enthusiasts can perfect their swing at the nearby 18-hole championship course, while the little ones enjoy endless fun at the Planet Trekkers Kids' Club. For those seeking adventure, the wonders of Fiji are just waiting to be explored right at your doorstep.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Natadola",
    "location_heading": "Natadola Beach",
    "location_subheading": "Fiji",
    "location_description": "InterContinental Fiji Golf Resort & Spa, an IHG Hotel",
    "offer_address": "Maro Road, Viti Levu, Natadola 00000, Fiji",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 15,
    "price": 2089.0,
    "value": 4204.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HZtj0YAD",
    "hero_image": "https://images.luxuryescapes.com/jzpcih72bhns5r0o8ea",
    "image_two": "https://images.luxuryescapes.com/kz7ewetnlnjjbn3eiljr",
    "image_three": "https://images.luxuryescapes.com/hdfbia9lfc2kf5l990m",
    "vendor_name": "InterContinental Fiji Golf Resort & Spa",
    "title": "Fiji Coral Coast Award-Winning Suites on Natadola Beach with Lagoon Views, Daily Breakfast & FJ$500 Credit",
    "description": "Discover the height of luxury at this award-winning Fijian resort, set on 35 acres of tropical gardens along the pristine shores of Natadola Beach on Viti Levu. This exclusive, coast-hugging retreat boasts three sparkling outdoor pools, a world-class spa and a garden-facing fitness centre, plus a wealth of cultural activities to make every moment in Fiji memorable.\n\nWhen it's time to treat yourself, enjoy international favourites in the casual ambience of Toba Bar & Grill, then watch the sun melt into the horizon with a cocktail at the Kama Lounge. For a bountiful buffet spread with stunning ocean views, head to Sanasana Restaurant, and for a sweet afternoon treat, swing by Lai Lai Cafe.\n\nWith FJ$500 resort credit, curate your perfect stay - think poolside cocktails, spa time or long lunches by the sea. Then, elevate one evening with a four-course degustation at the acclaimed Navo Restaurant, where Fijian flavours are reimagined in a fine-dining setting steps from the ocean.\n\nGolf enthusiasts can perfect their swing at the resort's 18-hole championship course, while the little ones enjoy endless fun at the Planet Trekkers Kids’ Club. For those seeking adventure, the wonders of Fiji are just waiting to be explored right at your doorstep, including the spectacular underwater world of the resort’s house reef.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Natadola",
    "location_heading": "Natadola Beach",
    "location_subheading": "Fiji",
    "location_description": "InterContinental Fiji Golf Resort & Spa, an IHG Hotel",
    "offer_address": "Maro Road, Viti Levu, Natadola 00000, Fiji",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 15,
    "price": 1679.0,
    "value": 3329.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JAkdIAG",
    "hero_image": "https://images.luxuryescapes.com/r3gyxjig7vc7nqj54c",
    "image_two": "https://images.luxuryescapes.com/exfzuenqmboph4mbna3o",
    "image_three": "https://images.luxuryescapes.com/r265jd2gv4ih5l6ird",
    "vendor_name": "InterContinental Fiji Golf Resort & Spa",
    "title": "Five-Star Fiji InterContinental Retreat with Guaranteed Suite Upgrade, Daily Breakfast & FJ$500 Resort Credit",
    "description": "Nestled among white sands, swaying palm trees and 35 acres of tropical gardens, you'll find the five-starInterContinental Fiji Golf Resort & Spa, an IHG Hotel. Sitting on the shores of Natadola Beach with unbeatable views of the Pacific Ocean and dazzling turquoise lagoon, the resort features stunning interior design and architecture, heavily inspired by a traditional Fijian village\n\nAs you explore this coast-hugging resort, you'll discover three sparkling outdoor pools, an award-winning spa and a state-of-the-art fitness centre. Boredom isn’t an option in Fiji, with a variety of cultural activities to enjoy during your stay, including nightly torch-lighting ceremonies, traditional meke and Polynesian dancing and exciting adventures at the house reef.\n\nDining at InterContinental Fiji Golf Resort & Spa, an IHG Hotel, offers a variety of unique culinary experiences. Relish wood-fired dishes in the casual ambience of Toba Bar & Grill, then unwind with a cocktail at the lively Kama Lounge and Bar. For a buffet with stunning ocean views, head to Sanasana Restaurant, conveniently located along the sugar cane train track.\n\nGolf enthusiasts can perfect their swing at the nearby 18-hole championship course, while the little ones enjoy endless fun at the Planet Trekkers Kids' Club. For those seeking adventure, the wonders of Fiji are just waiting to be explored right at your doorstep.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Natadola",
    "location_heading": "Natadola Beach",
    "location_subheading": "Fiji",
    "location_description": "InterContinental Fiji Golf Resort & Spa, an IHG Hotel",
    "offer_address": "Maro Road, Viti Levu, Natadola 00000, Fiji",
    "percentage_discount": 34.0,
    "min_duration": 5,
    "max_duration": 15,
    "price": 1829.0,
    "value": 2778.0
  }
]