[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CbIxAAK",
    "hero_image": "https://images.luxuryescapes.com/msp01rzhyulojpq1nqn",
    "image_two": "https://images.luxuryescapes.com/3ir1xs8nwjfrjanlzt",
    "image_three": "https://images.luxuryescapes.com/b4xvivk326z9t8n5ahlf",
    "vendor_name": "Active Escapes",
    "title": "Maldives: 7-Night Yacht Fitness Retreat with All-Inclusive Onboard Meals, Daily Fitness Classes, Unlimited Watersports & Roundtrip Malé Transfers",
    "description": "Set sail on a week-long wellness journey unlike any other with Active Escapes, set on a luxurious yacht gliding through the incredible Maldives. Step aboard this magnificent three-level yacht in Malé and cut through the glass-like waters of the Indian Ocean, while enjoying a rejuvenating schedule of wellness activities. With only 10 guest cabins on board, enjoy an intimate retreat focused on your fitness and wellbeing in the ultimate peaceful and relaxing setting. Plus, enjoy three healthy meals daily with a focus on nutrition through fresh, organic ingredients.\n\nUnique onboard fitness facilities mean daily workouts come with incredible views, while unlimited surfing, stand-up paddleboarding and snorkelling are included in your package. Staying active definitely won't be a challenge on this escape, with velvety white sands to stroll and shimmering underwater worlds to explore. This is a once-in-a-lifetime opportunity that is guaranteed to rejuvenate and refresh, as you dedicate a week to prioritising your overall health and wellbeing.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Hulhulé",
    "location_heading": "Yacht Cruise",
    "location_subheading": "Maldives",
    "location_description": "Maldives Yacht Escape",
    "offer_address": "Maldives",
    "percentage_discount": 32.0,
    "min_duration": 7,
    "max_duration": 7,
    "price": 3695.0,
    "value": 5452.0
  }
]