[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004T9HLAA0",
    "hero_image": "https://images.luxuryescapes.com/k75hn6h1mmh26fwkuvc8",
    "image_two": "https://images.luxuryescapes.com/ylazdlwsr9ai3lznppb",
    "image_three": "https://images.luxuryescapes.com/l3sw1deq5odzl5rpphcl",
    "vendor_name": "Abode Murrumbateman",
    "title": "Sophisticated Canberra Wine Country Escape in Yass Valley",
    "description": "Tap into the 160-year-old winemaking heritage of Canberra’s cool climate wine country with a stay at the effortlessly sleek Abode Murrumbateman. Less than a 40-minute drive from the heart of the city, where you’ll find attractions including the National Gallery of Australia and Parliament House, this boutique apartment-style hotel is the perfect destination for a wine-fuelled escape in the luscious Yass Valley.\n\nNeighbouring highly acclaimed, world-class wineries and producers, and only a few minutes’ walk to local bakeries, cafés and parks, this former gold-mining village delivers up a feast for the senses with over 140 vineyards, 20 cellar doors, a plethora of restaurants serving Southern Tablelands delights and rich market flavours. After a day frolicking among the vines, return to your boutique room, decked out with a TV with STAYCAST streaming. There’s also the convenient Abode Pantry - stocked with healthy frozen meals, drinks and more - a sleek communal lounge with a cosy fireplace and fully equipped kitchen, complimentary parking, and a foyer lined with retro-inspired bikes - perfect for a day hopping from vineyard to cellar door.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Murrumbateman",
    "location_heading": "Murrumbateman",
    "location_subheading": "New South Wales",
    "location_description": "Abode Murrumbateman",
    "offer_address": "57 Rose St New South Wales 2582 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 81.0,
    "value": 81.0
  }
]