[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000C9AdyYAF",
    "hero_image": "https://images.luxuryescapes.com/pi2us70zonnnapjag0sn",
    "image_two": "https://images.luxuryescapes.com/m99e2on6t90x92lylgsj",
    "image_three": "https://images.luxuryescapes.com/l3zw5rv705jpf6qpy0qe",
    "vendor_name": "Crowne Plaza Hawkesbury Valley",
    "title": "Hawkesbury Valley Boutique Estate with Daily Breakfast, Nightly Drinks & Dining Credit",
    "description": "Reconnect with nature at this boutique retreat hidden among eight hectares of landscaped gardens. A backdrop of the jaw-dropping Blue Mountains sets the tone for your extravagant escape, just an hour's drive from Sydney’s bright lights.\n\nWhen you’re ready to feast on the region’s finest produce, stop by Harvest Restaurant for seasonal menus, an extensive wine list and glorious lakeside garden views. Savour barista-made coffee in the sun-drenched courtyard at Gazebo Restaurant and sample award-winning gin with garden views at Barracks Bar.\n\nFor a dose of relaxation, indulge in a decadent wellness ritual at the spa and swim in the indoor pool, heated for year-round dips. Only 30 minutes away, the breathtaking Blue Mountains await, filled with limestone caves, scenic hiking trails and cascading waterfalls ready to be explored.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Windsor",
    "location_subheading": "New South Wales",
    "location_description": "Crowne Plaza Hawkesbury Valley, an IHG Hotel",
    "offer_address": "61 Hawkesbury Valley Way, Windsor, New South Wales 2756, Australia",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 279.0,
    "value": 538.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt5kAAB",
    "hero_image": "https://images.luxuryescapes.com/7fh9okb7uij1x19ccqxh",
    "image_two": "https://images.luxuryescapes.com/g26tpu2p8hkabl6wi6q",
    "image_three": "https://images.luxuryescapes.com/5arm7b2yi5k2iuv3b162",
    "vendor_name": "Crowne Plaza Hawkesbury Valley",
    "title": "Luxurious Hawkesbury River Boutique Estate with Sydney's Largest Day Spa",
    "description": "Reconnect with nature at Crowne Plaza Hawkesbury Valley, an IHG Hotel, a boutique retreat hidden among eight hectares of landscaped gardens. A backdrop of jaw-dropping Blue Mountains views set the tone for your extravagant escape, just 45 minutes from Sydney's bright lights. When you're ready to feast on the region's finest produce, make a reservation at Harvest Restaurant for seasonal menus, an extensive wine list and glorious lakeside garden views. For a dose of relaxation, head to The Villa Thalgo Day Spa, Sydney's largest day spa.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Windsor",
    "location_subheading": "NSW",
    "location_description": "Crowne Plaza Hawkesbury Valley, an IHG Hotel",
    "offer_address": "61 Hawkesbury Valley Way, Windsor, NSW, 2756, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 99.0,
    "value": 99.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GRmSMYA1",
    "hero_image": "https://images.luxuryescapes.com/x0u9225snmwplqejfz8",
    "image_two": "https://images.luxuryescapes.com/kakg81chmt5fxzhr5t6",
    "image_three": "https://images.luxuryescapes.com/32hzbl6vasdzmuz3ue2n",
    "vendor_name": "Fairmont Windsor Park",
    "title": "Heritage Windsor Countryside Elegance with Spa, Pool, Seven Restaurants & Bars",
    "description": "Discover the grandeur of the English countryside with a stay at this grand hotel surrounded by 40 acres of greenery and a tranquil lake. This lavish retreat offers a serene escape from the everyday, inviting you to unwind in an atmosphere of timeless elegance. Near the historic Windsor Great Park and Windsor Castle, enjoy the perfect base to explore heritage and charm in country house luxury.\n\nIndulge in the hotel's top-notch facilities, from a sparkling swimming pool to a spa that promises rejuvenating treatments. With seven onsite restaurants and bars, this destination is a feast for the senses in breathtaking scenery.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Egham",
    "location_heading": "Windsor",
    "location_subheading": "United Kingdom",
    "location_description": "Fairmont Windsor Park",
    "offer_address": "Bishopsgate Road, Englefield Green, Egham, Windsor TW20 0YL, United Kingdom",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 370.0,
    "value": 370.0
  }
]