[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EeSKAA0",
    "hero_image": "https://images.luxuryescapes.com/w3obbvka1x56t95hbneg",
    "image_two": "https://images.luxuryescapes.com/g8hrgvwbffjgw1yzwgc",
    "image_three": "https://images.luxuryescapes.com/atmdkrkoibhh1dtavpt",
    "vendor_name": "Cape Wickham Golf Links, King Island",
    "title": "King Island Stay on Australia’s #1 Golf Course with Daily Dining & Unlimited Golf",
    "description": "Experience the windswept green pastures and dramatic coastal views of King Island at Cape Wickham Golf Links. Ranked Australia’s #1 Public Golf Course by Golf Australia and rated #24 in the world by GolfDigest, this is an immaculate stretch of green where every hole has views over the ocean. Enjoy daily à la carte breakfast, your choice of daily two-course lunch or dinner, a welcome platter of King Island cheese, a bottle of Tasmanian red or white wine on arrival, and return airport transfers with early and late checkout (subject to availability). \n\nYou'll also have the chance to play unlimited, all-day golf at Cape Wickham with golf-cart hire for one round per day, and take advantage of an exclusive one-time offer to play 18 holes at the acclaimed Ocean Dunes Golf Course with golf cart hire for just A$310 per couple.\n\n**Getting there is easy:** It is just a short 50-minute flight from Melbourne to King Island with Rex or Sharp Airlines (departs Essendon), with many private charters also operating throughout the year. Regular flights are also available to/from Launceston.\n\n**This deal has no surcharges**: Travel freely with zero surcharges.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Wickham",
    "location_heading": "King Island",
    "location_subheading": "Tasmania",
    "location_description": "Cape Wickham Golf Links - King Island",
    "offer_address": "Cape Wickham Road, King Island, Tasmania 7256, Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 839.0,
    "value": 1452.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000G9vlpYAB",
    "hero_image": "https://images.luxuryescapes.com/kehhhug8xop846a38na",
    "image_two": "https://images.luxuryescapes.com/9z9f1z3prunu0tm66qrk5",
    "image_three": "https://images.luxuryescapes.com/xb452tsm6dhyrd52dl5",
    "vendor_name": "Cape Wickham Golf Links, King Island",
    "title": "Tasmania: King Island Award-Winning Cape Wickham Golf Retreat with Daily Breakfast & Nightly Dinner",
    "description": "Tee off at the edge of the world on an award-winning championship links course, where the rugged King Island coastline frames every fairway with jaw-dropping beauty. Consistently ranked among the best courses on the planet and named Australia's top green by Golf Digest, Cape Wickham is a masterpiece of design with coastal winds that will keep you on your toes.\n\nWith two rounds of golf included each day, you’ll have plenty of time to tackle the exclusive fairways that make this course so legendary. Exquisite, all-inclusive dining at Cape Wickham Clubhouse is there to fuel days on the green, with a menu highlighting King Island's bountiful produce from proteins to exceptional wines.\n\nMake the most of your time on the coast with an early morning swim at Victoria Cove, or sharpen up for rounds ahead on the 12-hole putting course. After you've hit your last putt, put your feet up in a villa-like room with expansive ocean vistas that make it impossible to miss a shot at relaxation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Wickham",
    "location_heading": "King Island",
    "location_subheading": "Tasmania",
    "location_description": "Cape Wickham Golf Links - King Island",
    "offer_address": "Cape Wickham Road, King Island, Tasmania 7256, Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 1029.0,
    "value": 1778.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xxxMAAQ",
    "hero_image": "https://images.luxuryescapes.com/g8pv3mmtulir7srz6lr",
    "image_two": "https://images.luxuryescapes.com/8cvvcbm7gdsma5kx3cl",
    "image_three": "https://images.luxuryescapes.com/d03kzctse8ceei2w1ak",
    "vendor_name": "Ettrick Rocks",
    "title": "Tasmania Luxe Self-Contained King Island Hideaway with Gourmet Breakfast Provisions, Cheeseboard & Wine",
    "description": "Feel worlds away from everything with a stay at Ettrick Rocks, a luxurious retreat overlooking the great Southern Ocean, on King Island’s wild coastline. Three stunning self-contained retreats are positioned to ensure maximum privacy while enjoying jaw-dropping ocean views from floor-to-ceiling panoramic windows. From every room in your retreat, you will be treated to some of Tasmania’s most sublime coastal landscapes - with a pair of binoculars provided, so you can gaze out at distant fishing boats or soaring birdlife. Feel at home cooking up a storm in the kitchen, complete with state-of-the-art appliances and a mirrored splashback reflecting the rugged surrounds. Gather for meals around the dining table, watching as wallabies hop across the scrub right outside your window, and wake up to the sounds of the ocean, visible via a stunning picture window in your bedroom.\n\nIt will be tempting to spend the whole time inside your retreat, but just outside your door, the wonders of King Island await. An array of secret sandy coves and rockpools, including Ettrick Beach and Millers Bay, are just a hop and skip away. Golfing enthusiasts have two world-renowned courses to choose from - Cape Wickham and Ocean Dunes - while foodies can’t pass up a visit to King Island Dairy (only a 20-minute drive away). Meanwhile, iconic attractions including Seal Rocks, Calcified Forest and Cape Wickham Lighthouse are all within easy driving distance.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Nugara",
    "location_heading": "King Island",
    "location_subheading": "Tasmania",
    "location_description": "Ettrick Rocks",
    "offer_address": "660 South Road, Nugara, TAS, 7256, Australia",
    "percentage_discount": 27.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 1859.0,
    "value": 2536.0
  }
]