[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IayuEAAR",
    "hero_image": "https://images.luxuryescapes.com/f2ccdue5hf4fq28e408",
    "image_two": "https://images.luxuryescapes.com/9pwrdp76e8nryjfaoaq",
    "image_three": "https://images.luxuryescapes.com/5yooic3f5h3d6u1yisp",
    "vendor_name": "Oatlands Park Hotel",
    "title": "Historic Surrey Country Manor Escape on Former Tudor Palace Grounds with Onsite Restaurant & Bar",
    "description": "Unwind in an elegant manor fit for royalty in the Surrey countryside, on the original site of the Royal Tudor Palace. Once home to royals and other notable figures in history, this gorgeous property is a history-lovers dream, set among idyllic manicured gardens. Enjoy classic British fare at the onsite Mulberry Restaurant with everything from fine-dining dinner to decadent afternoon tea. For a tipple or two, Bar 1509 serves up a selection of lavish cocktails and lighter bites.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Weybridge",
    "location_heading": "Surrey",
    "location_subheading": "United Kingdom",
    "location_description": "Oatlands Park Hotel",
    "offer_address": "146 Oatlands Drive, Weybridge, Surrey KT13 9HB, United Kingdom",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zYLtAAM",
    "hero_image": "https://images.luxuryescapes.com/lfjoah7sfsg2lvwu0gqb",
    "image_two": "https://images.luxuryescapes.com/b4iq66afnos2o7dwfe6q",
    "image_three": "https://images.luxuryescapes.com/rz3t6v94pg1y8ze63f9h",
    "vendor_name": "Oatlands Park Hotel",
    "title": "Heritage English Countryside Manor on Outskirts of London",
    "description": "Set among lush, manicured grounds is a luxurious countryside stay at Oatlands Park Hotel, an elegant manor fit for royalty overlooking picturesque Surrey countryside. Forget the hustle and bustle of city life in this gorgeous property on the original site of the grand royal palace, built by Henry VIII. \n\nClassic British fare is on the menu at the outstanding Mulberry Restaurant: indulge in a fine-dining dinner, sip and savour a range of teas and decadent desserts during an afternoon tea and partake in a traditional Sunday roast with all the trimmings. For a tipple or two, Bar 1509 serves up a selection of lavish cocktails and lighter bites. All this less than one hour from London.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Weybridge",
    "location_heading": "Surrey",
    "location_subheading": "United Kingdom",
    "location_description": "Oatlands Park Hotel",
    "offer_address": "146 Oatlands Drive, Weybridge, Surrey KT13 9HB, United Kingdom",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GmD1AAK",
    "hero_image": "https://images.luxuryescapes.com/gql3th4uixushn9n5r2",
    "image_two": "https://images.luxuryescapes.com/z56u75pgucdmantyrdag",
    "image_three": "https://images.luxuryescapes.com/vgutlwvkibtrdpsbsci8",
    "vendor_name": "The Runnymede on Thames",
    "title": "Surrey Elegance on the Thames with Daily Breakfast",
    "description": "Enjoy a peaceful break from everyday life with a stay at The Runnymede on Thames, located in picturesque Surrey, just a 40-minute drive from central London. Make the most of staying on the banks of the River Thames by hiring a boat from the hotel’s private jetty, relaxing on the riverside lawns with a drink from the Airstream Trailer bar, fishing or walking and running along the picturesque Thames Path. It's under 20 minutes' drive to beautiful Windsor, where you can visit the famous Windsor Castle, St George's Chapel, Frogmore House and Gardens and Royal Windsor Racecourse.\n\nThis elegant hotel is a popular break for Londoners or a perfect spot for anyone who wants to visit the capital without staying in the middle of the action. Indulge in award-winning treatments at the onsite spa, holder of the prestigious Guinot Crown Elite accolade, afforded to just 20 salons across the UK and Ireland. You’ll also have access to a swimming pool, whirlpool bath, infrared cabin, sauna and eucalyptus steam room for endless pampering. If you want to stay active, try out the tennis courts, gym and fitness classes. Foodies will feel at home among the refined interiors of Leftbank Restaurant and the river-view The Lounge, serving freshly prepared seasonal dishes and decadent afternoon tea.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Egham",
    "location_heading": "Surrey",
    "location_subheading": "UK",
    "location_description": "The Runnymede on Thames",
    "offer_address": "Windsor Rd, Egham TW20 0AG",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  }
]