[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G4nkxAAB",
    "hero_image": "https://images.luxuryescapes.com/fmsjhl4yh9gl4d8ohigo",
    "image_two": "https://images.luxuryescapes.com/swgqgawloh0odyysvg7k",
    "image_three": "https://images.luxuryescapes.com/pvnabhi6i8ey5rbntjx",
    "vendor_name": "The Sebel Yarrawonga",
    "title": "Murray River Award-Winning Lakeside Escape near Black Bull Golf Course with Daily Breakfast & Nightly Drinks",
    "description": "Surrounded by river red gums and Lake Mulwala’s gentle waters, award-winning lakeside luxury awaits on the south bank of the Murray River. Every element has been carefully handpicked to complement the region’s otherworldly bushland beauty - swim, boat or fish the day away before returning to the resort's Stock & Barrel restaurant for country-inspired plates and handpicked spirits or Elizabeth's for pared-back fine dining with a uniquely Yarrawonga twist.\n\nSlip into a sunchair by the resort’s heated infinity Sunset pool and watch as the sun falls beneath Lake Mulwala’s ghostly, sunken eucalyptus trees, igniting the horizon in a blaze of colour as evening descends - it’s an experience that can't be missed. Those who golf together will adore the Black Bull 18-hole championship golf course - consistently rated one of the country’s best - while a trip to SOL Wellness, offering holistic treatments drawing on foraged Australian active ingredients, is highly recommended.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Yarrawonga",
    "location_heading": "Murray River",
    "location_subheading": "Victoria",
    "location_description": "The Sebel Yarrawonga Silverwoods",
    "offer_address": "40 Silverwoods Boulevard, Yarrawonga, Victoria 3730, Australia",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 329.0,
    "value": 618.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EyKaAAAV",
    "hero_image": "https://images.luxuryescapes.com/sfj4xi6elabr6ytm2ze",
    "image_two": "https://images.luxuryescapes.com/mreu7n7v47g9a8qabu",
    "image_three": "https://images.luxuryescapes.com/xwnh9muxugoqhgwtte",
    "vendor_name": "The Sebel Yarrawonga",
    "title": "Murray River Award-Winning Lakeside Escape with Daily Breakfast, Nightly Drinks & Welcome Hamper",
    "description": "On the south bank of the Murray River, surrounded by river red gums and Lake Mulwala’s gentle waters, award-winning lakeside luxury awaits at The Sebel Yarrawonga Silverwoods. Every element has been carefully handpicked to complement the region’s otherworldly bushland beauty - swim, boat or fish the day away before returning to the resort's Stock & Barrel restaurant for country-inspired plates and handpicked spirits or Elizabeth's for pared-back fine dining with a uniquely Yarrawonga twist. Slip into a sunchair by the resort’s heated infinity pool and watch as the sun falls beneath Lake Mulwala’s ghostly, sunken eucalyptus, igniting the horizon in a blaze of colour as evening descends - it’s an experience that can't be missed.\n\nThose who golf together will adore the Black Bull 18-hole championship golf course - consistently rated one of the country’s best - while a trip to SOL Wellness, offering holistic treatments drawing on foraged Australian active ingredients, is highly recommended.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Yarrawonga",
    "location_heading": "Murray River",
    "location_subheading": "Victoria",
    "location_description": "The Sebel Yarrawonga Silverwoods",
    "offer_address": "40 Silverwoods Boulevard, Yarrawonga, Victoria 3730, Australia",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 335.0,
    "value": 744.0
  }
]