[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lIw4AAE",
    "hero_image": "https://images.luxuryescapes.com/nqzxcsbtpymvys2982k",
    "image_two": "https://images.luxuryescapes.com/yswiti532eohd4nj8gf7",
    "image_three": "https://images.luxuryescapes.com/izoxj0ekjrdda56atk",
    "vendor_name": "Woodstock Inn & Resort",
    "title": "Elegant New England Countryside Escape in the Heart of Woodstock",
    "description": "Discover quintessential New England charm at Woodstock Inn & Resort, Vermont. Part of the prestigious Preferred Hotels & Resorts brand, this elegant property embraces the vision of Laurance and Mary Rockefeller, who established the original inn. Guests can enjoy a selection of cosy restaurants, including the award-winning The Red Rooster and Richardson's Tavern, and the seasonal Fairway Grill and Perley's Pourhouse. Hit the Athletic Club for a round of tennis, take a swing on the golf course, then visit The Spa for restorative treatments.\n\nExplore the area's covered bridges, the Ottauquechee River, Quechee Gorge, Marsh-Billings-Rockefeller National Historical Park and surrounding picturesque New England countryside. A wonderful collection of country stores, boutiques, bookstores and art galleries line the village, enticing visitors to wander its charming streets. In winter, the area becomes a paradise for skiers and snow sports enthusiasts, who head to the family-friendly Saskadena Six Ski Area, which welcomes skiers and snowboarders of all abilities, or to the Nordic Center, which boasts more than 45 km of groomed trails.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Vermont",
    "offer_geo_area_level_2": "Woodstock",
    "location_heading": "Vermont",
    "location_subheading": "USA",
    "location_description": "Woodstock Inn & Resort",
    "offer_address": "14 The Green, Woodstock, VT 05091, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 325.0,
    "value": 325.0
  }
]