[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G4XkuAAF",
    "hero_image": "https://images.luxuryescapes.com/5gyzwqxcw7h4lug83hj",
    "image_two": "https://images.luxuryescapes.com/we2t3fdbys8thrv6seh",
    "image_three": "https://images.luxuryescapes.com/10rxhhcx97b5jitcsbmm",
    "vendor_name": "Maia Resort Quy Nhon",
    "title": "Coastal Vietnam Pool Villas with Daily Breakfast, Daily Lunch or Dinner & Massages",
    "description": "Tucked between picturesque beaches and tropical forest, you'll find the secluded tropical paradise of Maia Resort Quy Nhon, a wellness-focused escape designed to provide an authentic taste of the rich local culture. Spend your days working through your flow on the yoga mat, clearing your mind with a guided meditation or exploring the area via stand-up paddleboard. Tailor-made treatments at Vela Spa relieve invigorated muscles, while local delicacies await at on-site restaurants, Vi and Ad Hoc.\n\nBe prepared to pamper your tastebuds with interactive cooking classes, chef's table dining and beachside culinary experiences, or simply sit back and relax on your sunlounger by your private pool or on the sand. Whether working up a sweat, or slowing right down, expect to depart Maia Resort Quy Nhon feeling both rejuvenated and relaxed.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Dinh Province",
    "offer_geo_area_level_2": "Phu Cat",
    "location_heading": "Quy Nhon",
    "location_subheading": "Vietnam",
    "location_description": "Maia Resort Quy Nhon",
    "offer_address": "Nhon Hoi Economic Zone, Cat Tien Ward, Phu Cat District, Binh Dinh Province 820000, Vietnam",
    "percentage_discount": 37.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 719.0,
    "value": 1144.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4TrjAAF",
    "hero_image": "https://images.luxuryescapes.com/l2ex66v6egoryqd470pl",
    "image_two": "https://images.luxuryescapes.com/sn1wkr9bq7rppyce1zjg",
    "image_three": "https://images.luxuryescapes.com/wlzp1fk03c37gjgyzc3c",
    "vendor_name": "Maia Resort Quy Nhon",
    "title": "Vietnam Coastal Pool Villas with Daily Breakfast, Daily Lunch or Dinner & 60-Minute Massages",
    "description": "Tucked between picturesque beachside and tropical forest, you'll find the refined and secluded tropical paradise of Maia Resort Quy Nhon, a property crafted to provide an authentic taste of Quy Nhon's rich culture and appreciation for health and wellness. A collection of tranquil and spacious villas await, each equipped with a private infinity pool and lush garden. Ultimate relaxation awaits with tailor-made treatments at Vela Spa and delicious cusine onsite at Vi and Ad Hoc restaurants. Maia Resort Quy Nhon has a strong desire to guide you on your wellness journey with rejuvenating complimentary activities, ranging from guided meditations, several forms of power, breathing and flowing yoga, badminton, morning jogs and aqua fitness or SUP excursions.\n\nBe prepared to pamper your tastebuds with high-quality interactive cooking classes, chef's table dining and beachside culinary experiences available for guests to embrace the magic of Vietnamese hospitality and cuisine. There is no doubt you will fall in love with this special part of the world, known for its warm welcomes, idyllic beaches and fresh produce, as you journey to a luxurious and rejuvenating escape you'll be talking about for years to come.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Dinh Province",
    "offer_geo_area_level_2": "Phu Cat",
    "location_heading": "Quy Nhon",
    "location_subheading": "Vietnam",
    "location_description": "Maia Resort Quy Nhon",
    "offer_address": "Nhon Hoi Economic Zone, Cat Tien Ward, Phu Cat District, Binh Dinh Province 820000, Vietnam",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 1169.0,
    "value": 2141.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcZiwAAF",
    "hero_image": "https://images.luxuryescapes.com/sy2hjy92sso28sw68wxl",
    "image_two": "https://images.luxuryescapes.com/7qpbgcxon4pz6vzyvpn",
    "image_three": "https://images.luxuryescapes.com/v4336gdxq8grsi7tmwcg",
    "vendor_name": "AVANI Quy Nhon Resort & Spa",
    "title": "Idyllic Vietnam Private Beach Retreat with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Discover an oasis of tropical bliss hugged by soaring cliffs and nestled along a sheltered stretch of golden sands, perfectly positioned in the heart of coastal Quy Nhon. Regale in the luxury of spacious, well-appointed rooms adorned with medieval Vietnamese decor, each offering breathtaking views of the turquoise ocean. Lounge by the sparkling outdoor pool, cool off with a tiki cocktail at the happening poolside bar, Gio, or sink your toes in the powder-soft sands of the private beach and feast your eyes on epic sunsets.\n\nIndulge in cliffside dining at the bamboo-clad Tre restaurant, where you can sample a variety of Vietnamese delicacies and international flavours. If you wish to venture out, the 11th-century Cham towers and the vibrant local markets of Quy Nhon are situated mere moments away. After a day of tropical fun and exploration, take a moment to destress at the jungle-enveloped Anantara Spa, where soothing massages are enjoyed in cliffside treatment pavilions.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Dinh Province",
    "offer_geo_area_level_2": "Quy Nhon",
    "location_heading": "Quy Nhon",
    "location_subheading": "Vietnam",
    "location_description": "Avani Quy Nhon Resort",
    "offer_address": "Ghenh Rang, Bai Dai Beach, Quy Nhơn, Bình Định, Vietnam",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 599.0,
    "value": 1389.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EcjaLYAR",
    "hero_image": "https://images.luxuryescapes.com/l29f494932r9lg8jww86",
    "image_two": "https://images.luxuryescapes.com/y5j8epom6g4co10718oi",
    "image_three": "https://images.luxuryescapes.com/wb84dqu56ss6vrgz56zy",
    "vendor_name": "Maia Resort Quy Nhon",
    "title": "Coastal Vietnam Private Pool Villas with Daily Dining, Nightly Drinks & Daily Massages",
    "description": "Tucked between Nha Trang and Hoi An, you'll find a paradise built for wellness seekers, romantics and families alike. Spend your days working through your flow on the yoga mat, relieving invigorated muscles at Vela Spa or exploring the area via stand-up paddleboard.\n\nLocally sourced delicacies await at on-site restaurants Vi and Ad Hoc, with interactive cooking classes, chef's table dining and beachside culinary experiences to your taste. For your fill of sundowners, head to the open-air Pool Bar, complete with enticing decor and a tranquil beachside setting.\n\nBeyond the resort, uncover Quy Nhon - a less-frequented gem still brimming with its original Vietnamese beauty. Swim the turquoise waters of Ky Co Beach, enjoy the sumptuous seafood of Hon Kho Island or take a short drive to the centre of this pristine port city where culture abounds.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Dinh Province",
    "offer_geo_area_level_2": "Phu Cat",
    "location_heading": "Quy Nhon",
    "location_subheading": "Vietnam",
    "location_description": "Maia Resort Quy Nhon",
    "offer_address": "Nhon Hoi Economic Zone, Cat Tien Ward, Phu Cat District, Binh Dinh Province 820000, Vietnam",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 519.0,
    "value": 1897.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000Nxno4AAB",
    "hero_image": "https://images.luxuryescapes.com/xj79twaqkmlrlwfkca0u",
    "image_two": "https://images.luxuryescapes.com/qqiodjq1h9ximkuu5mwf",
    "image_three": "https://images.luxuryescapes.com/ifldvok8jhcxtint84sd",
    "vendor_name": "AVANI Quy Nhon Resort & Spa",
    "title": "All-Inclusive Private Beach Indulgence",
    "description": "Venture off the beaten path to Vietnam’s stunning south-central coastline where you’ll uncover tropical serenity at its finest. Spend six days/five nights at AVANI Quy Nhon Resort & Spa with all-inclusive dining, two 60-minute spa treatments, nightly cocktail each, return airport transfers, early 10am check-in, super late 6pm checkout and complimentary Wi-Fi for two.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Dinh Province",
    "offer_geo_area_level_2": "Quy Nhon",
    "location_heading": "Quy Nhon",
    "location_subheading": "Vietnam",
    "location_description": "Avani Quy Nhon Resort",
    "offer_address": "Ghenh Rang, Bai Dai Beach, Quy Nhơn, Bình Định, Vietnam",
    "percentage_discount": 67.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 446.0,
    "value": 1333.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009C7FDAA0",
    "hero_image": "https://images.luxuryescapes.com/jpumbfjah5ns2qzy1dzk",
    "image_two": "https://images.luxuryescapes.com/mwdchqgc3oolsajb163",
    "image_three": "https://images.luxuryescapes.com/kwitde1caywkt5vzcmp",
    "vendor_name": "Anantara Quy Nhon",
    "title": "Five-Star Oceanfront Quy Nhon Haven Overlooking Private Cove",
    "description": "Revel in a stay at Anatara Quy Nhon, a sanctuary ensconced in lush foliage and rugged mountains, set on the emerald Quy Nhon Bay. Whether you seek action-packed adventures or lazy sun-drenched days, it's all on offer from this escape, with easy access to ancient ruins, unexplored beaches and quaint fishing villages. Unwind at your own pace as you feast on Vietnamese delights at Sea.Fire.Salt, luxuriate with a treatment at Antara Spa or indulge in a cocktail at the poolside bar.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Dinh Province",
    "offer_geo_area_level_2": "Quy Nhon",
    "location_heading": "Quy Nhon",
    "location_subheading": "Vietnam",
    "location_description": "Anantara Quy Nhon Villas",
    "offer_address": "Cau Bai Dai, Ghenh Rang, Thanh pho Qui Nhon, Bình Dinh, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 487.0,
    "value": 487.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009C7FwAAK",
    "hero_image": "https://images.luxuryescapes.com/p7sqcvjkendeykiguf2",
    "image_two": "https://images.luxuryescapes.com/k90dyi3dei8mb6r7b2wb",
    "image_three": "https://images.luxuryescapes.com/bxhnmeydhiinwad28eiw",
    "vendor_name": "AVANI Quy Nhon Resort & Spa",
    "title": "Boutique Quy Nhon Private Beach Indulgence with Cliff-Top Restaurant",
    "description": "The perfect blend of lush green hillside, pristine golden sand beaches and crystal blue waters, Avani Quy Nhon Resort boasts one of the most picturesque positions on Vietnam’s coastline. Bask on sun-soaked beaches, dive into crystal clear waters and observe sublime sunsets with a cool cocktail in hand from the rooftop Tre Restaurant. Indulge in a treatment at the spa or explore the local region - whatever you choose, Avani promises a serene tropical hideaway.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Dinh Province",
    "offer_geo_area_level_2": "Quy Nhon",
    "location_heading": "Quy Nhon",
    "location_subheading": "Vietnam",
    "location_description": "Avani Quy Nhon Resort",
    "offer_address": "Bai Dai Area, Ghenh Rang Ward, Quy Nhon City, Binh Dinh Province, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 137.0,
    "value": 137.0
  }
]