[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IXftFYAT",
    "hero_image": "https://images.luxuryescapes.com/t0prvsmughpks34c814",
    "image_two": "https://images.luxuryescapes.com/d7r0j2x8qbwktrrs1xd",
    "image_three": "https://images.luxuryescapes.com/ms0gha1o9sfbfrkv11c",
    "vendor_name": "Park Ridge Retreat",
    "title": "Extended by Popular Demand: NSW South Coast Beach Escape Just Two Hours from Sydney with Welcome Wine",
    "description": "Set between the waters of the South Pacific Ocean and the landscapes of Gerringong sits Park Ridge Retreat - the perfect weekend escape from bustling Sydney. Take some time to unwind in peaceful surroundings, share a meal at the outdoor BBQ area or spend a day at Werri Beach, just a short stroll from your retreat.\n\nThe hotel is the ideal base to discover the many attractions of nearby Berry and Kiama, including the Kiama Blowhole, Coast Walk, picturesque wineries and opportunities for whale-watching. If you're a fan of ocean pools, find yourself near some of the most beautiful in the area, including Ourie Pool and Boat Harbour Rock Pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Gerringong",
    "location_heading": "Gerringong",
    "location_subheading": "New South Wales",
    "location_description": "Park Ridge Retreat",
    "offer_address": "139 Belinda Street, Gerringong, New South Wales 2534, Australia",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 170.0,
    "value": 279.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gnPUAAY",
    "hero_image": "https://images.luxuryescapes.com/r0olqrpdsbdi4dnom09g",
    "image_two": "https://images.luxuryescapes.com/baumpl8v5p476g0y99ok",
    "image_three": "https://images.luxuryescapes.com/sqmt9ej8u3o54c125ym",
    "vendor_name": "Mercure Gerringong Resort",
    "title": "Boutique NSW South Coast Beach Escape Just 90 Minutes from Sydney with Massages & Daily Breakfast",
    "description": "Whether you're looking for a romantic escape or family fun, the beautiful Mercure Gerringong Resort, just 90-minutes south of Sydney, is everything you've dreamed of. Embrace beach bliss in the only award-winning resort in the area, set in the charming coastal town of Gerringong, just 900-metres from the famous Werri Beach.\n\nSpend lazy days lounging on the sands or by the hotel's two pools, or set out to discover the attractions of Berry and Kiama, including the Kiama Blowhole and Coast Walk, picturesque wineries and more. When you're ready to relax, head back to the resort to indulge at Bella Char Restaurant & Wine Bar, dream your cares away at the newly-renovated spa, or practise your hits on the onsite tennis court.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Gerringong",
    "location_heading": "Gerringong",
    "location_subheading": "New South Wales",
    "location_description": "Mercure Gerringong Resort",
    "offer_address": "1 Fern St, Gerringong 2534, New South Wales, Australia",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 259.0,
    "value": 439.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HH0rAAG",
    "hero_image": "https://images.luxuryescapes.com/b3ohdytck7a1wmmaawm",
    "image_two": "https://images.luxuryescapes.com/rkfymlyvvnk90rjqu8pi",
    "image_three": "https://images.luxuryescapes.com/bd0v980usr3hd9rwfa",
    "vendor_name": "Mercure Gerringong Resort",
    "title": "NSW South Coast Beach Escape near Sydney with Breakfast Credit & Welcome Wine",
    "description": "Whether you're looking for a romantic vacation or a fun holiday with your family, the beautiful Mercure Gerringong Resort, just two hours south of Sydney, is everything you've dreamed of. Embrace coastal chill in the only award-winning resort in the area, set in the charming beach town of Gerringong, five minutes from the famous Werri Beach. Spend lazy days on the beach or lounging by the hotel's two pools, or set out to discover the attractions of Kiama, including the Kiama Blowhole and Kiama Coast Walk, picturesque wineries and more. When you're ready to relax, head back to the resort to indulge in world-class dining, dream your cares away at the onsite spa, or simply enjoy some me-time in your sun-drenched room.\n\n**Your handpicked inclusions:**\n\n- Every morning, use your A$25 breakfast credit per room at Bella Char Restaurant\n- Toast your escape with a complimentary bottle of red or white wine on arrival\n- Every night, use your 20% discount on dinner and drinks at Bella Char Restaurant\n- Unwind with a 15% discount on massages and facials at Bella Day Spa",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Gerringong",
    "location_heading": "Gerringong",
    "location_subheading": "New South Wales",
    "location_description": "Mercure Gerringong Resort 2021",
    "offer_address": "1 Fern St, Gerringong NSW 2534, Australia",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 211.0,
    "value": 317.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DRIGuAAP",
    "hero_image": "https://images.luxuryescapes.com/x5thf99ywc34nm15tvr",
    "image_two": "https://images.luxuryescapes.com/2ftqxk4aqheo7wteurtc",
    "image_three": "https://images.luxuryescapes.com/1xdxbttmefdtz6tdspf",
    "vendor_name": "Mercure Gerringong Resort",
    "title": "NSW South Coast Beach Escape just 90 Minutes from Sydney with Daily Breakfast",
    "description": "Set between the blue waters of the South Pacific Ocean and the gorgeous landscapes of Gerringong, Mercure Gerringong Resort is the perfect weekend escape from bustling Sydney. Embrace beach bliss at this dreamy resort in the charming coastal town of Gerringong. Practise your serve at the onsite tennis court, spend lazy days lounging by the resort’s two sparkling swimming pools, or head to the ultimate paradise for surfers, the stunning Werri Beach, a short walk away. When you're ready to relax, head to the onsite Bella Char Restaurant & Wine Bar and indulge with their seasonal menu of delicious dishes showcasing local produce, or dream your cares away at Bella Spa with a nourshing massage or facial followed by a glass of wine in the lounge.\n\nThe resort is the ideal base to discover the many attractions of nearby Berry and Kiama, including the Kiama Blowhole, Coast Walk, picturesque wineries and opportunities for whale-watching. If you're a fan of ocean pools, find yourself in close proximity to some of the most beautiful in the area, including Ourie Pool and Boat Harbour Rock Pool. Shop for local arts and crafts at the Kiama Seaside Market, or head out of town to the leafy tranquility of the Minnamurra Rainforest Centre.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Gerringong",
    "location_heading": "Gerringong",
    "location_subheading": "New South Wales",
    "location_description": "Mercure Gerringong Resort",
    "offer_address": "1 Fern St, Gerringong 2534, New South Wales, Australia",
    "percentage_discount": 26.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 255.0,
    "value": 345.0
  }
]