[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006R4EgAAK",
    "hero_image": "https://images.luxuryescapes.com/b7tt1u9jrjcsejz75h",
    "image_two": "https://images.luxuryescapes.com/oxlcab6q77c6vbdp03nh",
    "image_three": "https://images.luxuryescapes.com/8zul62a8hcdrt0lv0un4v",
    "vendor_name": "Tuileries at De Bortoli Rutherglen",
    "title": "Boutique Rutherglen Vineyard Escape",
    "description": "Immerse yourself in the superb beauty of one of Australia's oldest wine regions with a boutique stay at Tuileries at De Bortoli Rutherglen, just an hours' drive from The King Valley wine region and iconic Prosecco Road. Located in the heart of the historic township and named after the historic gardens in Paris, this charming accommodation is set among  De Bortoli's perfectly manicured gardens with views of the lush onsite vineyard. This is the ideal base for days of countryside exploration; immerse yourself in over 150 years of winemaking history, with an abundance of dining choices including award-winning restaurants, cafés, and unmissable small boutiques. Nearby, you could explore the Great Alpine Road, cycle the Murray to Mountains Rail Trail to take in the superb grandeur of the mighty river while enjoying regional hospitality along the way, or trace the Sculpture Trail to discover the creative talents of local artists.\n\nWhen the time calls to rest and recharge at the hotel, you can choose to relax in one of just 16 spacious rooms to soak up the relaxed ambience, or spend time on the tennis court, swimming pool or gym. Wine buffs and foodies will love spending time at the well-respected onsite restaurant, where Australian-inspired cuisine with a regional twist is served alongside a selection of local wines and boutique beers.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Rutherglen",
    "location_heading": "Rutherglen",
    "location_subheading": "Victoria",
    "location_description": "Hotel Tuileries at De Bortoli Rutherglen",
    "offer_address": "13-35 Drummond St, Rutherglen VIC 3685",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006R4GXAA0",
    "hero_image": "https://images.luxuryescapes.com/9rxx5lrmkttwawem4s7a",
    "image_two": "https://images.luxuryescapes.com/he35146qnrtliatuv1pg",
    "image_three": "https://images.luxuryescapes.com/1q2rb2gv6r81siat2w2",
    "vendor_name": "Tuileries at De Bortoli Rutherglen",
    "title": "De Bortoli Vineyard Retreat in the Heart of Rutherglen Wine Country",
    "description": "Leave the city behind and explore one of Australia's oldest wine regions during a well-deserved escape at Hotel Tuileries at De Bortoli Rutherglen, just an hour's drive from Victoria's King Valley and iconic Prosecco Road. Located in the heart of the historic township, and named after the historic gardens in Paris, this charming accommodation is set among De Bortoli's perfectly manicured grounds with views of the lush onsite vineyard. Countryside exploration begins here, as you immerse yourself in over 150 years of winemaking history. Relax in one of 16 spacious rooms or spend time on the tennis court, at the swimming pool or gym. Wine buffs and foodies are taken care of at the well-respected onsite Tuileries Restaurant, where Australian-inspired cuisine with a regional twist is served alongside a selection of local wines and boutique beers.\n\nWhen you're not dining onsite, discover an abundance of award-winning restaurants, wineries, cafés and unmissable small boutiques within close reach. Hit the nearby Great Alpine Road, cycle the Murray to Mountains Rail Trail to take in the superb grandeur of the mighty river, or trace the Sculpture Trail to discover the creative talents of local artists.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Rutherglen",
    "location_heading": "Rutherglen",
    "location_subheading": "Victoria",
    "location_description": "Hotel Tuileries at De Bortoli Rutherglen",
    "offer_address": "13-35 Drummond St, Rutherglen VIC 3685",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]