[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HG99AAG",
    "hero_image": "https://images.luxuryescapes.com/jie94gf91vi35g7ssv4p",
    "image_two": "https://images.luxuryescapes.com/jyzmf3819tp5lh89vzq",
    "image_three": "https://images.luxuryescapes.com/kwyc0zl3avq1otmisn",
    "vendor_name": "Manuallaya - The Resort Spa in the Himalayas",
    "title": "Himalaya-View Manali Escape with Decadent Dining & Daily Cocktails",
    "description": "Overlooking resplendent snowcapped Himalayan peaks and apple orchards in India's 'honeymoon capital', Manali, Manuallaya - The Resort Spa in the Himalayas is a luxurious retreat waiting to be discovered. A perfect blend of nature and luxury, this charming resort welcomes you with signature hospitality, sophisticated accommodation and incredible amenities. Located an hour's drive from Kullu-Manali Airport and a 12-hour drive from Delhi, Manuallaya - The Resort Spa in the Himalayas lets you experience nirvana in the lap of the spellbinding Himalayas. Whether you are looking for a relaxing break, craving a romantic escape or some family time, don't look beyond this magical resort.\n\n**Your handpicked inclusions:**\n\n- Begin every day with buffet or set-menu breakfast at Café Jardin\n- Enjoy one buffet or three-course dinner per stay at Café Jardin\n- Toast your escape with one daily cocktail per adult at Library Bar (one drink per adult)\n- Make the most of your stay with a 20% discount on soft drinks and dining\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** Two children (five years and under) stay free on existing bedding with all inclusions except alcohol.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Manali",
    "location_heading": "Manali",
    "location_subheading": "India",
    "location_description": "Manuallaya - The Resort Spa in the Himalayas",
    "offer_address": "Sunny Side, Chadiyari, Manali, Himachal Pradesh 175131",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 151.0,
    "value": 229.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZnhkvQAB",
    "hero_image": "https://images.luxuryescapes.com/gbz5lcvrt0c0av0xsecj",
    "image_two": "https://images.luxuryescapes.com/q7beap3rcujlehjj5von",
    "image_three": "https://images.luxuryescapes.com/egpwc8n3vfu5zdg3bqhm",
    "vendor_name": "The Himalayan",
    "title": "Experience Victorian Luxury Staying in a Gothic Castle in the Himalayas",
    "description": "With write-ups in some of the world’s most luxurious magazines-including Conde Nast Traveller India, National Geographic Traveller India, Harper’s Bazaar India and Robb Report India-The Himalayan takes old-world luxury to new heights. Perched 2,003 metres above sea level, The Himalayan showcases premier luxury in the North-western area of the Indian Himalayas. Enjoy a high-end getaway including daily a la carte breakfast, one three-course lunch for two, one three-course dinner for two and one welcome bottle of wine on arrival.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Manali",
    "location_heading": "Manali",
    "location_subheading": "India",
    "location_description": "The Himalayan",
    "offer_address": "Kullu Valley, Hadimba Temple Rd, Manali, Himachal Pradesh 175131, India",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 294.0,
    "value": 539.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DHHNVAA5",
    "hero_image": "https://images.luxuryescapes.com/t49ys8nvbpnrin40plr2",
    "image_two": "https://images.luxuryescapes.com/cdn7nfjz2lgao6qjsrbh",
    "image_three": "https://images.luxuryescapes.com/3kpljrcc0h9e7xuixr3d",
    "vendor_name": "Tiaraa hotels",
    "title": "Grand Opening: Manali Five-Star Hill Station Escape with Daily Breakfast & Dining Discount",
    "description": "Manali's newest luxury address for all travel enthusiasts looking for a mountain escape has swung its doors open to a serene utopian wonderland at Tiaraa Hotels & Resorts. Walk into a handsome architectural delight with elegant furnishings and hospitality that warms you up to your toes. A scenic 12-hour drive from Delhi, this location is perfect for solitude seekers as well as explorers who want to venture in the streets of Manali. Relish Himachali cuisine in the Fusion Restaurant or test your culinary skills with a Himachali cooking class (select packages only) before unwinding in your comfortable, tastefully designed room or bundling up to explore Manali's delights. \n\nHead to Solang Valley and try your hand at adventure sports like paragliding while you click photographs of the scintillating scenery, see water cascading down a steep hillside with a visit to the nearby Jogini waterfall, or wander through the ancient caves of the Hidimba Devi Temple. Modern, comfortable and relaxing, this is a hill escape that takes you one step closer to nature.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Manali",
    "location_heading": "Manali",
    "location_subheading": "India",
    "location_description": "Tiaraa Hotels & Resorts",
    "offer_address": "Left Bank Of Beas River, Naggar Rd, Prini, Manali, Himachal Pradesh 175143, India",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 116.0,
    "value": 286.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004V3xxAAC",
    "hero_image": "https://images.luxuryescapes.com/i7twgfexdkiyb6p4qt5m",
    "image_two": "https://images.luxuryescapes.com/spmm8y65spa5ouojqh6pk",
    "image_three": "https://images.luxuryescapes.com/gb6vg0xm5hk5x32h6dji",
    "vendor_name": "WelcomHeritage Urvashi's Retreat",
    "title": "Tranquil Manali Hill Station Escape with Panoramic Himalaya Views & Gourmet Dining",
    "description": "It's time to leave the world behind and escape to the pristine Himalayan resort town of Manali with a stay at the breathtaking WelcomHeritage Urvashi's Retreat. Nestled in the scenic Bipasha Valley, garlanded by stunning snow-capped mountains and lush forests, this Himachal retreat might just be the therapy you've been craving. Part of ITC's WelcomHeritage brand, this cosy lodge-style resort offers sweeping views of the Himalayan peaks and apple orchards, homey rooms with wooden interiors and access to plenty of adventurous experiences. \n\nWhether you're a nature-lover or an adventure enthusiast, WelcomHeritage Urvashi's Retreat has something for everyone. Stay active with adrenaline-fuelled activities such as rock climbing, trekking and paragliding or simply take it easy as you snuggle up in your cosy lodge-style accommodation.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Himachal Pradesh",
    "offer_geo_area_level_2": "Manali",
    "location_heading": "Manali",
    "location_subheading": "India",
    "location_description": "WelcomHeritage Urvashi's Retreat",
    "offer_address": "Shanag Road, P.O. Bahang, Manali, Himachal Pradesh 175103",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 101.0,
    "value": 276.0
  }
]