[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QmAlAAK",
    "hero_image": "https://images.luxuryescapes.com/d5vl9wsk4mqgxf3fo6ag",
    "image_two": "https://images.luxuryescapes.com/a4jprsa0rlgm94ssybx",
    "image_three": "https://images.luxuryescapes.com/ufhd0m5z9sqr71lk8kir",
    "vendor_name": "Sal Salis Ningaloo Reef",
    "title": "All-Inclusive Safari-Style Luxury Tents on the Shores of Ningaloo Reef",
    "description": "Get off the grid and into a life of barefoot luxury with a secluded all-inclusive escape to the breathtaking Sal Salis Ningaloo Reef (limited to 30 guests at any one time). Here, a handful of safari-style tents sit on a stretch of pristine land, only 50 metres from the UNESCO World Heritage-listed Ningaloo Reef. You have the wonders of the reef at your fingertips: head out on a snorkelling adventure through the vibrant coral and seek out the flash of an orange clownfish or the graceful movements of a manta ray or sea turtle. For a truly unforgettable experience, venture into deeper waters and watch out for a breaching humpback whale, the gentle giants of the sea (seasonal and cannot be guaranteed).\n\nWith no Wi-Fi, phone reception or television available, time appears to stand still. This gift of slow living is to be savoured: read that book you’ve been meaning to get through in your tent’s private hammock, listening to the whoosh of waves crashing in the distance (just 300 metres away). Paddle across crystal-clear waters in a kayak, feeling the sea breeze on your skin. Or head inland and enter the ancient lands of Cape Range National Park, where hiking trails guide you past limestone formations, bushland and gorges.\n\n**Your handpicked inclusions:**\n\n- Each day is a gourmet affair with all-inclusive, chef-prepared breakfast, lunch, dinner and snacks\n- Enjoy access to a self-service open bar from a select menu of Western Australian wines, regional beers, spirits, juices and soft drinks\n- From guided hikes to snorkelling and kayaking, there’s never a dull moment with a range of activities on offer\n\n**Need transfers?** Upgrade your package to include roundtrip transfers from Exmouth's Learmonth Airport (LEA).\n\n**This deal has NO peak surcharges:** Travel any time for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Cape Range National Park",
    "location_heading": "Cape Range National Park",
    "location_subheading": "Western Australia",
    "location_description": "Sal Salis Ningaloo Reef AUG21",
    "offer_address": "Yardie Creek Rd, Cape Range National Park WA 6707",
    "percentage_discount": 28.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 2439.0,
    "value": 3400.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pRAFAA2",
    "hero_image": "https://images.luxuryescapes.com/qmm0dr4rjxaq8sta2i8h",
    "image_two": "https://images.luxuryescapes.com/yjbsroby3l40rm5frtzu",
    "image_three": "https://images.luxuryescapes.com/mlrqzdrcsuyr0nru9ysg",
    "vendor_name": "Sal Salis Ningaloo Reef",
    "title": "Safari-Style Glamping on the Shores of Ningaloo Reef with All-Inclusive Dining, Drinks & Activities.",
    "description": "Get off the grid and into a life of barefoot luxury with a secluded, all-inclusive escape to the breathtaking Sal Salis Ningaloo Reef (limited to 30 guests at any one time) and ranked within the top 10% of properties on Tripadvisor. Here, a handful of safari-style tents sit on a stretch of pristine land, only 50 metres from the UNESCO World Heritage-listed Ningaloo Reef. \n\nHead out on a snorkelling adventure through the vibrant coral and seek out the graceful movements of a manta ray or sea turtle, paddle across crystal-clear waters in a kayak, or enter the ancient lands of Cape Range National Park, where hiking trails guide you past limestone formations, bushland and gorges. With no Wi-Fi, phone reception, or television available, time appears to stand still. This gift of slow living is to be savoured. Read that book you’ve been meaning to get through in your tent’s private hammock, listening to the sounds of waves crashing in the distance. Spend your evening gazing at bright stars in a sky free of the pollution of civilised light. All the while, you’ll take in the rich wildlife and unique landscapes of the area while relaxing in complete comfort inside your well-appointed private tent.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Cape Range National Park",
    "location_heading": "Cape Range National Park",
    "location_subheading": "Western Australia",
    "location_description": "Sal Salis Ningaloo Reef",
    "offer_address": "Yardie Creek Road, Cape Range National Park, Exmouth, Western Australia 6707, Australia",
    "percentage_discount": 28.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 2519.0,
    "value": 3512.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000C8ZrJYAV",
    "hero_image": "https://images.luxuryescapes.com/plgym40k3dwrt721fxm",
    "image_two": "https://images.luxuryescapes.com/1yqatnkd8qmr9f2szk",
    "image_three": "https://images.luxuryescapes.com/hpdfuj0asnwc5wpw83m8",
    "vendor_name": "Sal Salis Ningaloo Reef",
    "title": "Iconic Safari-Style Glamping on the Pristine Shores of Ningaloo Reef with All-Inclusive Dining, Drinks & Activities",
    "description": "Get off the grid and into a life of barefoot luxury with a secluded, all-inclusive escape to this breathtaking and exclusive property, limited to 32 guests at any one time. Here, a handful of safari-style wilderness tents sit on a stretch of pristine land, only 50 metres from UNESCO World Heritage-listed Ningaloo Reef.\n\nBook now for 2025 as you prepare to head out on a snorkelling adventure through the vibrant coral and seek out the graceful movements of a manta ray or sea turtle, paddle across crystal-clear waters in a kayak or enter the ancient lands of Cape Range National Park, where hiking trails guide you past limestone formations, bushland and gorges.\n\nWith no Wi-Fi, phone reception or television available, time appears to stand still. Spend your evening gazing at bright stars in a sky free of the pollution of civilised light. All the while, take in rich wildlife and unique landscapes while relaxing in the complete comfort of your well-appointed private tent.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Cape Range National Park",
    "location_heading": "Cape Range National Park",
    "location_subheading": "Western Australia",
    "location_description": "Sal Salis Ningaloo Reef",
    "offer_address": "Yardie Creek Road, Cape Range National Park, Exmouth, Western Australia 6707, Australia",
    "percentage_discount": 21.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 2369.0,
    "value": 2988.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMcg4AAD",
    "hero_image": "https://images.luxuryescapes.com/ibx1is3rqbdb2i1z65a",
    "image_two": "https://images.luxuryescapes.com/8m9bl5lyaae7scigpody",
    "image_three": "https://images.luxuryescapes.com/kcda4nouooid88ojrhko",
    "vendor_name": "Sal Salis Ningaloo Reef",
    "title": "Iconic Safari-Style Glamping on the Pristine Shores of Ningaloo Reef with All-Inclusive Dining, Drinks & Activities",
    "description": "Get off the grid and into a life of barefoot luxury with a secluded, all-inclusive escape to the breathtaking Sal Salis Ningaloo Reef, an exclusive property limited to 30 guests at any one time. Here, a handful of safari-style tents sit on a stretch of pristine land, only 50 metres from UNESCO World Heritage-listed Ningaloo Reef. Head out on a snorkelling adventure through the vibrant coral and seek out the graceful movements of a manta ray or sea turtle, paddle across crystal-clear waters in a kayak, or enter the ancient lands of Cape Range National Park, where hiking trails guide you past limestone formations, bushland and gorges.\n\nWith no Wi-Fi, phone reception, or television available, time appears to stand still. This gift of slow living is to be savoured. Read that book you’ve been meaning to get through in your tent’s private hammock, listening to the sounds of waves crashing in the distance. Spend your evening gazing at bright stars in a sky free of the pollution of civilised light. All the while, take in rich wildlife and unique landscapes while relaxing in the complete comfort of your well-appointed private tent.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Cape Range National Park",
    "location_heading": "Cape Range National Park",
    "location_subheading": "Western Australia",
    "location_description": "Sal Salis Ningaloo Reef",
    "offer_address": "Yardie Creek Road, Cape Range National Park, Exmouth, Western Australia 6707, Australia",
    "percentage_discount": 21.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 3899.0,
    "value": 4920.0
  }
]