[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcberAAB",
    "hero_image": "https://images.luxuryescapes.com/8zwd8nzttkbk3af8mttd",
    "image_two": "https://images.luxuryescapes.com/q3d3cgasphvdzs50do4g",
    "image_three": "https://images.luxuryescapes.com/5l0h2xxtrslt1jyrzll",
    "vendor_name": "Munduk Moding Plantation Nature Resort",
    "title": "North Bali Luxury Nature Retreat with Jungle-Top Infinity Pool, Daily Breakfast, Daily Lunch or Dinner & Cocktails",
    "description": "Northern Bali is a world away from worlds, a space laced with tropical jungles, ancient temples and rugged mountains, designed for ultimate relaxation in nature. Eco-travel and five-star luxury marry seamlessly at this jungle-top resort, where nature becomes art and birds chirping becomes music. The resort is home to the Munduk Organic Coffee Plantation, growing and serving specialty coffee just waiting to be enjoyed by the heated infinity pool or jacuzzi overlooking the panoramic green of the valley. Food is the language of love here, with MiMPi restaurant introducing Indonesian flavours to international favourites, and Warung Bongkot restaurant highlighting the beauty of North Balinese cuisine using homegrown produce.\n\nExplore the tree-lined region with a bicycle tour, hiking expedition or horse-riding experience organised by the resort. The hotel is close to all four of Bali's famed lakes - including Lake Bratan, home to the spectacular Ulun Danu Beratan Temple - or curate your itinerary and savour the region's majestic waterfalls, centuries-old temples and secret waterways at your own pace. At the end of each adventure, return to the serenity of the resort to stroll through the vegetable gardens, luxuriate with a treatment at Bamboo Spa and retreat to the privacy of your luxury villa.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Gobleg",
    "location_heading": "Buleleng",
    "location_subheading": "Bali",
    "location_description": "Munduk Moding Plantation Nature Resort",
    "offer_address": "Jl. Asah Gobleg, Gobleg, Kec. Banjar, Kabupaten Buleleng, Bali 81152, Indonesia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 27,
    "price": 399.0,
    "value": 784.0
  }
]