[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DP952AAD",
    "hero_image": "https://images.luxuryescapes.com/7tmqtc66hjp17r8of8hq",
    "image_two": "https://images.luxuryescapes.com/l6fsdvlps9mtcz1z6v6",
    "image_three": "https://images.luxuryescapes.com/2lduruahpamd17uclyo8",
    "vendor_name": "The Sands Resort at Yamba",
    "title": "Tranquil Beachfront Apartment Stay on New South Wales' North Coast",
    "description": "Gather your closest friends and family and unwind at The Sands Resort at Yamba, a self-contained beachfront escape on New South Wales' North Coast, just moments from stunning Pippi Beach. Spend warm days lounging by one of two serene swimming pools, lap up the coastal lifestyle with a hit of tennis on one of the courts, or stroll 100 metres to the beachfront for surf, sand and sea. After a day of relaxation or exploration, return to the comfort of your beautifully equipped self-contained abode.\n\nOnly 1.5 hours from Byron Bay, Yamba is your gateway to myriad outdoor pursuits with plentiful beaches and nature trails. Explore uncrowded shorelines and untouched coastal trails, experience some of Australia’s best surfing waters, as well as deep-sea fishing, and keep an eye out for the pods of dolphins and whales migrating through Pippi Beach (seasonal).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Yamba",
    "location_heading": "Yamba",
    "location_subheading": "New South Wales",
    "location_description": "The Sands Resort at Yamba",
    "offer_address": "1 The Blvd, Yamba NSW 2464",
    "percentage_discount": 27.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 319.0,
    "value": 435.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006RNf7AAG",
    "hero_image": "https://images.luxuryescapes.com/asmk0w5e7ghmoekpqd7",
    "image_two": "https://images.luxuryescapes.com/egnh6oe4e1j80z0c104a",
    "image_three": "https://images.luxuryescapes.com/bqlzfypx4qqk3osz5rs",
    "vendor_name": "The Stella Yamba",
    "title": "Grand Opening: Retro-Inspired Yamba Seaside Escape on New South Wales' North Coast",
    "description": "Spectacular beaches, rolling surf, fresh seafood and year-round sun; experience it all with a luxe stay at The Stella Yamba - a newly opened, freshly refurbished, retro-inspired retreat overflowing with relaxed coastal vibes on the northern shores of New South Wales.\n\nSitting proudly on the highest peak of Yamba Hill, overlooking the sparkling ocean, this contemporary abode beautifully blends comfort and style with a splash of seaside charm. Convenient facilities include a BBQ area, laundry, pool table and complimentary Wi-Fi.\n\nThe Stella Yamba's enviable position makes it perfect for exploring the very best of Yamba, a laidback beach town often regarded as one of Australia's top holiday destinations. Several restaurants serving local seafood are just a short walk away, while popular recreational activities - from fishing to kayaking, surfing, boating and more - are within easy reach.\n\n**Your** **handpicked inclusions:**\n\n- Celebrate on arrival with a chilled bottle of sparkling wine\n- Kick-start days in paradise with a daily coffee and pastry or muffin each\n- Extend that holiday feeling with guaranteed 12pm early check-in and 12pm late checkout\n\n**Ocean-View Upgrade:** Enjoy sweeping coastal vistas spanning from Yamba Main Beach to Angourie when you upgrade to a gorgeous Ocean-View Room.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Yamba",
    "location_heading": "Yamba",
    "location_subheading": "New South Wales",
    "location_description": "The Stella Yamba",
    "offer_address": "17 Clarence St, YAMBA 2464 NSW, 17 Clarence St",
    "percentage_discount": 22.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 154.0,
    "value": 198.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000QbNhqAAF",
    "hero_image": "https://images.luxuryescapes.com/riupyuc1jy6kbuaa15wq",
    "image_two": "",
    "image_three": "",
    "vendor_name": "Angourie Resort & Spa",
    "title": "Experience Endless Summer in Yamba - Australia's No.1 Beach Town",
    "description": "Escape to one of Australia's favourite holiday hotspots: sunny, summery Yamba - located just 90 minutes' drive from Byron Bay. Spend four days/three nights at Angourie Resort and enjoy daily continental breakfasts, complimentary bike hire, dining credits, spa vouchers and late checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Clarence Valley Council",
    "location_heading": "Yamba",
    "location_subheading": "Australia",
    "location_description": "Angourie Rainforest Resort 2017",
    "offer_address": "166 Angourie Road, Yamba NSW",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 259.0,
    "value": 566.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UwYk4QAF",
    "hero_image": "https://images.luxuryescapes.com/oyctaiub45a6vianvuk4",
    "image_two": "https://images.luxuryescapes.com/r58ecladgw5ewhgkyeak",
    "image_three": "https://images.luxuryescapes.com/pzhzfnwosputysfspizy",
    "vendor_name": "The Sands Resort at Yamba",
    "title": "Beachfront Stay in Sunny Yamba",
    "description": "Soak up the sun, the sea and the sand in New South Wales’ charming town of Yamba and stay just 10 metres from the pristine Pippi Beach-one of four beaches within walking distance of The Sands Resort at Yamba. Great for a family holiday or a group getaway, stay in a two or three-bedroom oceanfront apartment just steps from the beach.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Yamba",
    "location_heading": "Yamba",
    "location_subheading": "New South Wales",
    "location_description": "The Sands Resort at Yamba",
    "offer_address": "1 The Blvd, Yamba NSW 2464",
    "percentage_discount": 38.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 351.0,
    "value": 563.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ec9Z2AAJ",
    "hero_image": "https://images.luxuryescapes.com/3eo8w0ah1ngpjnfugj9",
    "image_two": "https://images.luxuryescapes.com/z3jaudvv4p2cdxcx366t",
    "image_three": "https://images.luxuryescapes.com/0jw3hju9rd7dwwv83k9l",
    "vendor_name": "The Cove Yamba",
    "title": "Laidback NSW Coastal Charm Steps from Idyllic Yamba Main Beach",
    "description": "Explore the sheer charm of one of coastal New South Wales’ most tranquil towns with a relaxing stay at The Cove Yamba. Whether you’re swimming, surfing, or fishing, the big blue backyard offers something to entertain all guests. With the crashing waves of Yamba Main Beach just a short stroll from your front door, come to and from the vibrant beach area within minutes to relax in your very own oasis. Experience laidback living in a spacious room or apartment, each designed with a private balcony overlooking the ocean or the hotel's gardens.\n\nUnwind in the resort’s spectacular outdoor swimming pool or heated spa after days spent surfing down at the beach or even try your hand at a friendly hit of tennis at the nearby The Beachside Leisure Centre. From the sandy shores to the inviting town just minutes away, it’s easy to feel calm and rested with a stay at this pristine destination.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Yamba",
    "location_heading": "Yamba",
    "location_subheading": "New South Wales",
    "location_description": "The Cove Yamba",
    "offer_address": "4 Queen St, Yamba, NSW 2464, Australia",
    "percentage_discount": 34.0,
    "min_duration": 3,
    "max_duration": 6,
    "price": 353.0,
    "value": 531.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QCanAAG",
    "hero_image": "https://images.luxuryescapes.com/4vz6podub625yset1axq",
    "image_two": "https://images.luxuryescapes.com/81lsoir7dn0m7m8evkxb",
    "image_three": "https://images.luxuryescapes.com/uxtv3ujbxp9k75w6of",
    "vendor_name": "The Sands Resort at Yamba",
    "title": "Tranquil Beachfront Family Apartments on New South Wales' North Coast",
    "description": "Gather your closest friends and family and unwind at The Sands Resort at Yamba, a self-contained beachfront escape on New South Wales' North Coast, just moments from the stunning shores of Pippi Beach.\n\nSpend warm days lounging by one of two serene swimming pools, lap up the coastal lifestyle with a hit of tennis on one of the courts, or stroll 100 metres to the beachfront for surf, sand and sea. After a day of relaxation or exploration, return to the comfort of your beautifully equipped two or three-bedroom self-contained abode.\n\nOnly 1.5 hours from Byron Bay, Yamba is your gateway to myriad outdoor pursuits with plentiful beaches and nature trails. Explore uncrowded shorelines and untouched coastal trails, experience some of Australia’s best surfing waters, as well as deep-sea fishing, and keep an eye out for the pods of dolphins and whales migrating through Pippi Beach (seasonal).\n\n**Your** **handpicked inclusions:**\n\n- Celebrate on arrival with a bottle of wine to share\n- Swing into your escape with complimentary tennis court, ball and racquet hire\n- Make the most of your beachfront location with daily surfboard hire\n\n**Travelling as a large family or group?** Upgrade to a three-bedroom apartment, villa or penthouse and enjoy a coastal escape for up to six guests.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Yamba",
    "location_heading": "Yamba",
    "location_subheading": "New South Wales",
    "location_description": "The Sands Resort at Yamba",
    "offer_address": "1 The Blvd, Yamba NSW 2464",
    "percentage_discount": 41.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 384.0,
    "value": 652.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005IQz9AAG",
    "hero_image": "https://images.luxuryescapes.com/op8ksts77a4s4rzbxg29",
    "image_two": "https://images.luxuryescapes.com/p1oucpcwowangyzv8pdn",
    "image_three": "https://images.luxuryescapes.com/n8rkm4erosb8ech6psw",
    "vendor_name": "Angourie Resort & Spa",
    "title": "Northern NSW Rainforest Retreat with Spa & Dining Credits",
    "description": "Lovers of surf, sand, sun and all things nature: delight in a relaxing stay at Angourie Resort & Spa, a charming rainforest retreat in Yamba, NSW. Yamba was declared by CSIRO as having the best climate in the world to work, live and play in - and surrounded by 600 acres of lush, subtropical rainforest with an abundance of pristine beaches within easy reach, it’s easy to see why.\n\nThe resort is all about inviting the outside world in, with airy apartments and villas featuring outdoor dining areas so you can spend balmy evenings eating alfresco under the stars. When you don’t feel like cooking, onsite Cunjevoi Restaurant serves up the region’s freshest seafood and other mouthwatering meals. The lagoon-style swimming pool is the perfect place to while away an afternoon, while a separate kids' pool and playground provide endless fun for little ones. Yamba is considered the jewel on NSW’s northern coast, with over 11 spectacular beaches to suit all, from keen surfers to shallow-end swimmers, sunbathers and everyone in between. Further inland, scenic walking and bike tracks criss-cross the rainforest, ready to be explored.\n\n**Your handpicked inclusions:**\n\n- Take your tastebuds on a journey with A$30 dining credit per package\n- Get pampered with two A$25 credits per package towards Essential Elements Day Spa\n- Explore Yamba with ease thanks to daily bicycle hire\n- Relax up until the last moment with guaranteed 11am late checkout\n\n**Travelling with family?** Upgrade to the Two-Bedroom Villa package for two adults and two children (14 and under).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Yamba",
    "location_heading": "Yamba",
    "location_subheading": "New South Wales",
    "location_description": "Angourie Resort & Spa",
    "offer_address": "166 Angourie Road Yamba NSW 2464 Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 223.0,
    "value": 397.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mxq1AAA",
    "hero_image": "https://images.luxuryescapes.com/ipxkj5hamo5oka4p97yk",
    "image_two": "https://images.luxuryescapes.com/b5lnj16d2tr800pvj0zc",
    "image_three": "https://images.luxuryescapes.com/5kr3vew2bebr3tpykc2",
    "vendor_name": "Angourie Resort & Spa",
    "title": "Northern NSW Self-Contained Rainforest Retreat with Spa, Food & Drink Credit",
    "description": "Lovers of surf, sand, sun and all things nature - delight in a relaxing stay at Angourie Resort, a charming rainforest retreat in Yamba, NSW. The resort is all about inviting the outside world in, with airy apartments and villas featuring outdoor dining areas, so you can spend balmy evenings eating alfresco under the stars. When you don’t feel like cooking, onsite Cunjevoi Restaurant serves up fresh seafood and other mouthwatering meals. The lagoon-style swimming pool is the perfect place to while away an afternoon, while a separate kids' pool and playground provide endless fun for little ones.\n\nYamba is considered a jewel on NSW’s northern coast, with over 11 spectacular beaches to suit all, from keen surfers to shallow-end swimmers, sunbathers and everyone in between. Further inland, scenic walking and bike tracks criss-cross the rainforest, ready to be explored. Yamba was declared by CSIRO as having the best climate in the world to work, live and play in; surrounded by 600 acres of lush, subtropical rainforest with an abundance of pristine beaches within easy reach, it’s easy to see why.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Yamba",
    "location_heading": "Yamba",
    "location_subheading": "New South Wales",
    "location_description": "Angourie Resort & Spa",
    "offer_address": "166 Angourie Road Yamba NSW 2464 Australia",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 241.0,
    "value": 462.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IKmkIAG",
    "hero_image": "https://images.luxuryescapes.com/ala5qc17vb50c7w1ruui",
    "image_two": "https://images.luxuryescapes.com/fljmkcuj4k9o9gkmhgxu",
    "image_three": "https://images.luxuryescapes.com/2npx6h734k7zw3e38immg",
    "vendor_name": "Angourie Resort & Spa",
    "title": "Northern NSW Self-Contained Rainforest Retreat near Angourie Point Surf Beach with Onsite Day Spa & Dining Credit",
    "description": "Lovers of surf, sand, sun and all things nature - delight in a relaxing stay at this charming rainforest retreat in Yamba, New South Wales. The resort is all about inviting the outside world in, with airy apartments and villas featuring outdoor dining areas, so you can spend balmy evenings eating alfresco under the stars.\n\nWhen you don’t feel like cooking, onsite Cunjevoi Restaurant serves up fresh seafood and other mouthwatering meals. The lagoon-style swimming pool and Essential Elements Day Spa are the perfect place to while away an afternoon, while a separate kids' pool and playground provide endless fun for little ones.\n\nYamba is considered a jewel on NSW’s northern coast, with over 11 spectacular beaches to suit all, from keen surfers to shallow-end swimmers, and everyone in between. Further inland, scenic walking and bike tracks criss-cross the rainforest, ready to be explored.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Yamba",
    "location_heading": "Yamba",
    "location_subheading": "New South Wales",
    "location_description": "Angourie Resort and Spa",
    "offer_address": "166 Angourie Road, Yamba, New South Wales 2464, Australia",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 199.0,
    "value": 300.0
  }
]