[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ex8DZAAZ",
    "hero_image": "https://images.luxuryescapes.com/v1571uhrkh5dunyiw90w",
    "image_two": "https://images.luxuryescapes.com/h1ybmp38mlxctxrgfqja",
    "image_three": "https://images.luxuryescapes.com/15lo3xele9z1nni1i0c",
    "vendor_name": "Banyan Tree Bintan",
    "title": "Indonesia: Bintan Island Banyan Tree Private Pool Villas with Daily Breakfast & Gourmet Dining",
    "description": "Leave the rest of the world behind for the magic of Indonesia’s gorgeous Riau Islands with a tropical private pool villa stay at Banyan Tree Bintan. This breathtaking resort offers laidback luxury in abundance just a short ferry ride from Singapore. Surrounded by virgin rainforest and a private beach, this dreamy resort is the perfect place to hide away in luxury. Stay in a Balinese-style villa built into the hillside, accessible from the thatched-roof lobby by golf buggy. Indulge in signature dining experiences at three incredible resort restaurants, serving everything from modern European to Thai cuisine. Relax in style with two refreshing swimming pools and the blissful Banyan Tree Spa for traditional Balinese massages with homemade oils.\n\nJust beyond the resort’s perimeter, keen golfers will delight in the Greg Norman-designed 18-hole Laguna Bintan Golf Club, boasting breathtaking ocean views from the green. Bintan's white-sand beaches, tropical rainforests, monkey-filled mangrove forests and sacred temples invite exploration in between lounging poolside with a cocktail in hand.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Bintan",
    "location_heading": "Bintan Island",
    "location_subheading": "Indonesia",
    "location_description": "Banyan Tree Bintan",
    "offer_address": "Laguna Bintan Resort, Jalan Teluk Berembang, Sebong Lagoi, Tlk. Sebong, Kabupaten Bintan, Kepulauan Riau, 29155, Indonesia",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 22,
    "price": 809.0,
    "value": 1150.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070DOOAA2",
    "hero_image": "https://images.luxuryescapes.com/1n9s5yujttlhgy8pe379",
    "image_two": "https://images.luxuryescapes.com/pkofakl82p243e6h4ue7",
    "image_three": "https://images.luxuryescapes.com/3bu4e5c07w9rgc49wjr",
    "vendor_name": "Banyan Tree Bintan",
    "title": "Bintan Island Ocean-View Villa Paradise with Daily Breakfast & Daily Lunch or Nightly Dinner",
    "description": "Leave the rest of the world behind for the magic of Indonesia’s gorgeous Riau Islands, with a tropical villa stay at Banyan Tree Bintan. This breathtaking resort is currently ranked in the top five hotels on Bintan Island and is the winner of a Tripadvisor Travellers’ Choice 2021 award - and it's not hard to see why. Surrounded by virgin rainforest and a private beach, this dreamy resort is the perfect place to hide away in luxury.\n\nStay in a Balinese-style villa built into the hillside, accessible from the thatched-roof lobby by golf buggy. Fabulous facilities include three incredible restaurants serving everything from modern European dishes to Thai cuisine, two refreshing swimming pools when you’d like to cool off, and the blissful Banyan Tree Spa for traditional Balinese massages with homemade oils. Just beyond the resort’s perimeter, keen golfers will delight in the Greg Norman-designed 18-hole Laguna Bintan Golf Club, boasting breathtaking ocean views from the green. Bintan's white-sand beaches, tropical rainforests, monkey-filled mangrove forests and sacred temples invite exploration in between lounging poolside with a cocktail in hand.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Bintan",
    "location_heading": "Bintan Island",
    "location_subheading": "Indonesia",
    "location_description": "Banyan Tree Bintan",
    "offer_address": "Laguna Bintan Resort, Jalan Teluk Berembang, Sebong Lagoi, Tlk. Sebong, Kabupaten Bintan, Kepulauan Riau, 29155, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 1009.0,
    "value": 2337.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G3nMWAAZ",
    "hero_image": "https://images.luxuryescapes.com/2vthghj8aafpl4c8bowb",
    "image_two": "https://images.luxuryescapes.com/1pkzi5pjjeai0vwqefec",
    "image_three": "https://images.luxuryescapes.com/fvjo9y47dlkuh6td6bpm",
    "vendor_name": "Cassia Bintan",
    "title": "Bintan Island Apartment Escape 40 Minutes from Singapore with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Venture to where the lush Indonesian forest meets the sea with a relaxing retreat at beachfront beauty, Cassia Bintan - a 40-minute ferry trip from Singapore's bright lights. Sip on refreshing cocktails at Bintan Island's only beach club as you watch the tide roll in. Test your swing at the resort's own 18-hole golf course or the tennis courts, or explore the world beyond the shore with a snorkelling, canoeing, jetskiing or fishing adventure in the blue South China Sea waters. Experience decadence in the form of pampering with a rejuvenating treatment at Banyan Tree Spa Bintan (offsite) and stay nourished throughout the day with delicious meals and quick bites from Vista Cafe.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Bintan",
    "location_heading": "Bintan Island",
    "location_subheading": "Indonesia",
    "location_description": "Cassia Bintan",
    "offer_address": "Jalan Teluk Berembang, Laguna Bintan, Lagoi, Bintan Island 29155, Indonesia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 20,
    "price": 449.0,
    "value": 886.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UNYhAAO",
    "hero_image": "https://images.luxuryescapes.com/g08bb50luo671q722cri",
    "image_two": "https://images.luxuryescapes.com/q9zmnmppfj8v1caf7i2",
    "image_three": "https://images.luxuryescapes.com/gw6f6bvi2lqio5mkk9qv",
    "vendor_name": "Angsana Resort Bintan",
    "title": "Bintan Island Ocean-View Bliss with Private Beach",
    "description": "Venture to a one-of-a-kind oasis, where lush rainforest terrain and stunning views of the South China Sea take centre stage, at Angsana Bintan - a peaceful oasis in Indonesia's Riau Islands archipelago, a short ferry ride from Singapore. \n\nSpend your days exploring Bintan's cultural heart in the island's largest town, Tanjung Pinang, or retreat to the comfort of the secluded resort, where a private beach with stunning white sands and towering coconut trees acts as the perfect backdrop to recharge. Make the most of the exquisite onsite facilities: slip into the expansive swimming pool, drop into the Marine Centre and book a variety of adventures, including canoeing, windsurfing, snorkelling, jet skiing and fishing. Get active and sweat it out at the gym or take it down a notch and visit Angsana Spa, where skilled therapists are on hand to pamper you. As for dining options, you’ll be spoiled for choice. Take a seat at Lotus Café for all-day local and international dining, swing by XANA Beach Club for a cocktail, or head to Veranda Lobby Lounge for small bites and refreshments.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Bintan",
    "location_heading": "Bintan Island",
    "location_subheading": "Indonesia",
    "location_description": "Angsana Bintan",
    "offer_address": "Jalan Teluk Berembang, Sebong Lagoi, Tlk. Sebong, Kabupaten Bintan, Kepulauan Riau Kabupaten Bintan 29155",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]