[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECfEgAAL",
    "hero_image": "https://images.luxuryescapes.com/uaesxu20sjeyxwwvkgg",
    "image_two": "https://images.luxuryescapes.com/c7cl52dy2qyxb5a8vz8",
    "image_three": "https://images.luxuryescapes.com/3pbd4gqo8bnq1f9jbn",
    "vendor_name": "Grecotel Kos Imperial Thalasso",
    "title": "Five-Star Greek Island Retreat with Daily Breakfast & Nightly Dinner",
    "description": "Discover island bliss at Grecotel LUXME Kos Imperial, Greece, superbly located within arms reach of the dazzling blue waters of the Aegean Sea. This elegant haven delivers five-star luxury on the grandest scale: enjoy a pretty pebble beach, six pools laced with waterfalls and lazy rivers, six exquisite dining venues - including standout The Finicia, which offers degustation menus and delectable views - and the transplendent Elixir Spa.\n\nThe third-largest Greek Island, Kos is a sun-drenched paradise with a rich cultural history and dramatic Mediterranean landscapes to explore. Walk in ancient footsteps at Asklepieion, soak in the thermal springs at Agios Fokas, wander the cobbled streets of Kos Town or dive below the surrounding surf to spot kaleidoscopic sea life swimming in the iridescent waters.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Kos",
    "location_heading": "Kos",
    "location_subheading": "Greece",
    "location_description": "Grecotel LUXME Kos Imperial",
    "offer_address": "Psalidi, Kos 85300, Greece",
    "percentage_discount": 0.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 349.0,
    "value": 1.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csEDmQAM",
    "hero_image": "https://images.luxuryescapes.com/855rq5djq5zd2u16igvk",
    "image_two": "https://images.luxuryescapes.com/oejmk0686b7ot9q1i3p",
    "image_three": "https://images.luxuryescapes.com/s8exjn2ibf9sq4de5h17",
    "vendor_name": "Hermes Hotel",
    "title": "Relaxing Greek Island Escape",
    "description": "Dreaming of a tranquil Greek island escape for you and your better half? The picturesque island of Kos is home to gorgeous beaches, incredible history, traditional towns and fantastic restaurants. Embark on the perfect island holiday with a stay at Hermes Hotel, a charming family-run hotel perfect for a laidback getaway. Enjoy nightly dinners, daily breakfast, a welcome drink on arrival and more.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Kos",
    "location_heading": "Kos",
    "location_subheading": "Greece",
    "location_description": "Hermes Hotel",
    "offer_address": "Kefalos 853 01, Greece",
    "percentage_discount": 47.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 307.0,
    "value": 582.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FtFnPYAV",
    "hero_image": "https://images.luxuryescapes.com/ssuazp9kcoz3krk1tvm4",
    "image_two": "https://images.luxuryescapes.com/px6qa4ij0urhn4c9vmn",
    "image_three": "https://images.luxuryescapes.com/mvc6pcxwhhcsepig38l",
    "vendor_name": "Ammos Luxury Resort KOS",
    "title": "All-Inclusive Greek Island Oasis with Free-Flow Cocktails, Unlimited Ice Cream & One Child Stays Free",
    "description": "Step into true Grecian luxury with a retreat to this all-inclusive hideaway, nestled on the tranquil shores of Kos island. Overlooking the Aegean Sea, this peaceful resort offers the perfect blend of relaxed island living and seaside adventures, with the choice of a crystalline lap pool, an indulgent jacuzzi or the pristine beachfront sitting right at your doorstep.\n\nKick back with a refreshing cocktail from the poolside bar while the kids enjoy unlimited ice cream and endless fun at the resort’s dedicated mini club. Savour authentic local flavours at the open-air Corali Restaurant, or simply enjoy the refreshing sea breeze from your private balcony - it's all about relaxation here.\n\nBeyond the resort, the island's natural beauty and rich history are ready to be discovered. Visit the ancient healing sanctuary of the Asclepion, explore the laidback village of Mastihari or experience one of the island's most stunning sunsets at Agios Theologos beach.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Kos",
    "location_heading": "Kos",
    "location_subheading": "Greece",
    "location_description": "Ammos Luxury Resort",
    "offer_address": "Mastichari Village, Kos 85302, Greece",
    "percentage_discount": 69.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 599.0,
    "value": 1925.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gv0mHAAR",
    "hero_image": "https://images.luxuryescapes.com/og4fgwsszixk8dk4wz7n",
    "image_two": "https://images.luxuryescapes.com/qhqkrdykabdim5qr8her",
    "image_three": "https://images.luxuryescapes.com/sj862bf6wvjuwuy669ax",
    "vendor_name": "Grecotel Kos Imperial Thalasso",
    "title": "Greek Islands: Five-Star Kos Beachfront Retreat with Seaview Room Upgrade, Daily Breakfast & Nightly Dinner",
    "description": "Discover Greek Island bliss at Grecotel LUXME Kos Imperial, superbly located within arm's reach of the dazzling blue waters of the Aegean Sea. This elegant haven delivers five-star luxury on the grandest scale: enjoy a pretty pebble beach, six pools laced with waterfalls and lazy rivers, six exquisite dining venues - including standout The Finicia, which offers degustation menus and delectable views - and the transplendent ELIXIR SPA.\n\nKos is a sun-drenched paradise with a rich cultural history and dramatic Mediterranean landscapes to explore. Walk in ancient footsteps at the ruins of Asklepieion, soak in the thermal springs at Agios Fokas, wander the cobbled streets of Kos Town or dive below the surrounding surf to spot kaleidoscopic sea life swimming in iridescent waters.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Kos",
    "location_heading": "Kos",
    "location_subheading": "Greece",
    "location_description": "Grecotel LUXME Kos Imperial",
    "offer_address": "Psalidi, Kos 85300, Greece",
    "percentage_discount": 73.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 699.0,
    "value": 2625.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IIhTxYAL",
    "hero_image": "https://images.luxuryescapes.com/nrt5gnrnzb4wb6zlsbk",
    "image_two": "https://images.luxuryescapes.com/p65spt43vq99iw1bjel",
    "image_three": "https://images.luxuryescapes.com/ke1qcbqmp689z8171b3",
    "vendor_name": "The Ritual, A wellness retreat - Kos",
    "title": "Adults-Only Greek Island Wellness Suites with Daily Breakfast, A La Carte Dinner & Nightly Cocktails",
    "description": "Tucked away on sun-kissed Kos, this Epic Hotel Group gem flips the script on traditional R&R, transforming your precious downtime into quality uptime through Greek-inspired wellness. Days drift between dips in the pool (sunbed and cocktail within reach), sunrise yoga sessions and slow lunches at the poolside restaurant.\n\nFrom the moment the concierge team learns your name to the turndown service that perfectly fluffs your pillow, this hotel is obsessively guest-focused. Whether you're working it out in the gym, perfecting your warrior pose against the Aegean backdrop or enjoying a premium sunbed, The Ritual, A Wellness Retreat, ensures you'll leave recharged, realigned and ready to conquer real life again.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Kos",
    "location_heading": "Kos",
    "location_subheading": "Greece",
    "location_description": "The Ritual, A Wellness Retreat",
    "offer_address": "Kos 85300, Greece",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 549.0,
    "value": 1840.0
  }
]