[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI68rAAD",
    "hero_image": "https://images.luxuryescapes.com/zbgxf7lsvsz0olgrfjn",
    "image_two": "https://images.luxuryescapes.com/fqbak6vlopfk4u55a2wj",
    "image_three": "https://images.luxuryescapes.com/ocsew062nwc9z1llr2u",
    "vendor_name": "Holiday Inn Express Bristol City Centre",
    "title": "Contemporary City Stay in the Heart of Bristol with Onsite Cafe & Bar",
    "description": "In the pumping heart of buzzing Bristol lies the Holiday Inn Express Bristol City Centre, an IHG Hotel. After a day of boutique shopping, cathedral-hunting and general gawking at this art-fuelled city, you'll be pleased to return home to comfort and a delicious pizza and refreshing pint in the modern, onsite Express Cafe & Bar. Your choice of breakfast from the well-stocked buffet will have you energised and ready to do it all again the next day.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Bristol",
    "location_heading": "Bristol",
    "location_subheading": "United Kingdom",
    "location_description": "Holiday Inn Express Bristol City Centre, an IHG Hotel",
    "offer_address": "South End, Temple Gate House, Redcliffe, Bristol BS1 6PL, United Kingdom",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 64.0,
    "value": 64.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI5yfAAD",
    "hero_image": "https://images.luxuryescapes.com/etpbdsp5qdo225wqa98j",
    "image_two": "https://images.luxuryescapes.com/e905xcgswf3vr513bs9",
    "image_three": "https://images.luxuryescapes.com/z9n30uz3obs4p77cuai5",
    "vendor_name": "Holiday Inn Bristol City Ctr",
    "title": "Central Bristol Stylish City Stay with Restaurant & Bar",
    "description": "For a chic escape right in the heart of Bristol’s lively business district, Holiday Inn Bristol City Centre, an IHG Hotel is the ideal destination. Relax the day away with a coffee or cocktail of choice in the stunning glass-fronted lounge, or catch your favourite game on one of the wall-mounted TVs. Serving all your favourites for breakfast, lunch and dinner, fuel up for full days of exploring with a delicious classic British feed at The Spot Kitchen and Bar.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Bristol",
    "location_heading": "Bristol",
    "location_subheading": "United Kingdom",
    "location_description": "Holiday Inn Bristol City Centre, an IHG Hotel",
    "offer_address": "Bond Street, Bristol BS1 3LE, United Kingdom",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 78.0,
    "value": 78.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UpMFAA0",
    "hero_image": "https://images.luxuryescapes.com/83i8zmr1dtbjpcos9eff",
    "image_two": "https://images.luxuryescapes.com/vppuzesd8f0h71jhu8s",
    "image_three": "https://images.luxuryescapes.com/3aoj0zfa65fnqlc54md7",
    "vendor_name": "Berkeley Suites",
    "title": "Award-Winning Heritage Suite Stay in the Heart of Bristol",
    "description": "Experience old-world glamour and modern luxury touches with a lavish stay at Berkeley Suites, Bristol. Housed in a Grade II-listed redbrick building - an 18-century architectural masterpiece - and set on an exquisite Georgian crescent in the vibrant UK city, this Condé Nast 2021 Johansens Award for Excellence-winning hotel is a distinguished retreat steeped in character and history. Stay within walking distance of the city’s independent and alternative attractions, with the Clifton Suspension Bridge, Bristol Shopping Quarter, Bristol Zoo Gardens and Brunel’s SS Great Britain all within a 30-minute walk.\n\nBehind the grand Georgian façade, you’ll find a collection of just five tastefully renovated and individually designed suites. Each suite boasts a mid-century feel and modern conveniences, including a mini-kitchen cleverly concealed inside a wardrobe, state-of-the-art cinema projector and luxe lounge area. As a guest, you can enjoy complimentary membership at the exclusive Square Members Club, based in the Berkeley Square Hotel, where you can also treat yourself to an exquisite meal at the award-winning Square Kitchen. Guests looking to work out will benefit from complimentary access to the nearby Nuffield Health, Fitness & Wellbeing Centre.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Bristol",
    "location_heading": "Bristol",
    "location_subheading": "UK",
    "location_description": "Berkeley Suites",
    "offer_address": "6 Berkeley Cres, Bristol BS8 1HA, United Kingdom",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 22,
    "price": 162.0,
    "value": 162.0
  }
]