[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nFLzAAM",
    "hero_image": "https://images.luxuryescapes.com/pb1jl1v8ujfvjeq2d4c",
    "image_two": "https://images.luxuryescapes.com/g3l4kp91np9b6rvqpzen",
    "image_three": "https://images.luxuryescapes.com/j5giatfx56f05k5tg079u",
    "vendor_name": "Aethos Ericeira",
    "title": "Clifftop Surf Retreat along Portugal's Silver Coast with Heated Saltwater Pool",
    "description": "Enjoy an unbeatable location in Europe’s surfing ‘mecca’ when you stay at Aethos Ericeira. Part of Aethos' contemporary European brand - which includes designer properties in Milan, Corsica and soon-to-be Mallorca - the hotel boasts an innovative and elegant vibe, perfectly paired with modern furnishings, large windows and designer décor that draws inspiration from the surrounding landscape. With a firm focus on physical and mental well-being, a clifftop location overlooking the Atlantic Ocean and a luxurious heated saltwater pool, Aethos Ericeira's renowned experiential offerings serve all travellers.\n\nThe relaxing Ocean Spa promises a range of healing treatments, along with a traditional hamman and limestone hot slab. Meanwhile, ONDA - the hotel's restaurant - delivers locally sourced produce served from the sea right to the table. Combined with wellness offerings designed to heal your mind, body and soul and the world-class waves that crash onto the golden sand, this is the perfect launchpad to explore some of the best and most beautiful beaches in Europe.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Lisbon District",
    "offer_geo_area_level_2": "Mafra",
    "location_heading": "Ericeira",
    "location_subheading": "Portugal",
    "location_description": "Aethos Ericeira",
    "offer_address": "Rue da Estalagem, 2640-255 Encarnação, Portugal",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 327.0,
    "value": 327.0
  }
]