[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EduEAAS",
    "hero_image": "https://images.luxuryescapes.com/l7l295bzg5sv6gypvd48",
    "image_two": "https://images.luxuryescapes.com/fvgjaswstbkz906fqk4",
    "image_three": "https://images.luxuryescapes.com/ic2vinh8mn535ur4ir",
    "vendor_name": "Bannisters Port Stephens",
    "title": "Boutique Waterfront Escape with Daily Breakfast",
    "description": "Escape to one of Australia’s leading boutique hotels, Bannisters Port Stephens, only 2.5 hours from Sydney. Boasting stunning ocean views, a sun-drenched infinity pool and a Rick Stein flagship restaurant, this boutique haven is the ideal location for the ultimate luxury getaway.\n\nYour package includes daily continental breakfast, A$100 hotel credit per room to spend on spa treatments or dining experiences (at celebrity chef Rick Stein's onsite restaurant, Terrace Bar or the Cheeky Dog), one-time complimentary minibar with soft drinks and snacks and a guaranteed checkout at 11am.\n\n**Travelling with family?** Check out the Family Upgrade below.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Soldiers Point",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Bannisters Port Stephens",
    "offer_address": "147 Soldiers Point Road, Soldiers Point, New South Wales 2317, Australia",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 269.0,
    "value": 438.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LnE8AAK",
    "hero_image": "https://images.luxuryescapes.com/b4bk1qctolf6kcbow8pa",
    "image_two": "https://images.luxuryescapes.com/kf8g0j7f5apb43gxu3a",
    "image_three": "https://images.luxuryescapes.com/odzhxr5b9rj1q8ux18",
    "vendor_name": "Bannisters Port Stephens",
    "title": "Boutique Waterfront Bannisters Escape with Gourmet Dining",
    "description": "Escape to one of Australia’s leading boutique hotels, Bannisters Port Stephens, only three hours' drive from Sydney and 30 minutes from Newcastle Airport. Boasting stunning ocean views, a sun-drenched infinity pool and a Rick Stein flagship restaurant, this boutique haven is the ideal location for the ultimate luxury escape.\n\nYour package includes daily continental buffet breakfast at celebrity chef Rick Stein's on-site restaurant, one sourdough pizza with a drink each at the new Cheeky Dog pub, A$50 hotel credit per room to spend on spa treatments or dining experiences, a cocktail each during Happy Hour at the Terrace Bar, one-time complimentary minibar with soft drinks and snacks, a glass of sparkling on arrival and guaranteed checkout at 11am.\n\nTravelling with family? Check out the Family Upgrade below.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Soldiers Point",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Bannisters Port Stephens",
    "offer_address": "147 Soldiers Point Road, Soldiers Point, New South Wales 2317, Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 269.0,
    "value": 479.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HqvXIAS",
    "hero_image": "https://images.luxuryescapes.com/tm3gqan03z15f0okytg",
    "image_two": "https://images.luxuryescapes.com/kllmxaxhrivc3lxli304",
    "image_three": "https://images.luxuryescapes.com/l7g1diq1dfa06m91yp5",
    "vendor_name": "Oaks Port Stephens Pacific Blue Resort",
    "title": "Idyllic Oaks Resort Studio Stay in the Heart of Port Stephens with Tropical Lagoon Pool",
    "description": "Escape to an idyllic haven on New South Wales' coastline in Salamander Bay. This prime location offers a relaxing getaway, perfect for experiencing the tranquil bay and laidback coastal lifestyle of Port Stephens.\n\nAfter busy days exploring the region's best, retreat to your light-filled room and make a splash in the resort's impressive lagoon pool, one of the largest in Australia. When it's time to pamper yourself, head to the Japanese-inspired steam room or keep up your wellness routine at the onsite fitness centre.\n\nJust 2.5 hours from Sydney and less than an hour from Newcastle, Port Stephens is known for its spectacular natural scenery, dramatic sand dunes, crystal-clear aquamarine waters and vibrant dining and shopping culture.\n\nEmbark on an unforgettable swimming experience with dolphins in the open ocean, glide across the calm waters of the bay on a sunset cruise or in the winter months spot humpback whales migrating from Antarctica, a spectacular natural show.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Salamander Bay",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Port Stephens Pacific Blue Resort",
    "offer_address": "265 Sandy Point Road, Salamander Bay, New South Wales 2317, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 189.0,
    "value": 379.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcBPfAAN",
    "hero_image": "https://images.luxuryescapes.com/w4n6xtwcu4jxi019ob6",
    "image_two": "https://images.luxuryescapes.com/7nlwiau6ijxyv8e25yqw",
    "image_three": "https://images.luxuryescapes.com/os7qh1c1dau0udjkin5",
    "vendor_name": "Bannisters Port Stephens",
    "title": "Port Stephens Boutique Waterfront Escape with Daily Breakfast, Rick Stein Two-Course Dinner & Masterclass",
    "description": "Escape it all for azure waters, powdery sands and koalas lazing in the trees at one of Australia’s leading boutique hotels: Bannisters Port Stephens. Less than three hours' drive from Sydney, this seaside haven boasts light and airy decor complemented by stunning ocean views in one of the East Coast's most sought-after destinations. Lounge beside the glittering heated infinity pool overlooking the bay, learn mouthwatering recipes during a culinary masterclass at the signature Rick Stein restaurant and indulge in a two-course ocean-fresh dinner during your gourmet stay.\n\nMelt away with treatments at the luxurious Spa Bannisters - with spaces curated by esteemed designer, Romy Alwill, in light pink tones and coastal textures. With an extensive range of treatments and massages on offer, you are sure to achieve ultimate relaxation. If you can tear yourself away from the hotel, spectacular natural beauty awaits on your doorstep, from coastal walks to sandboarding at Stockton Sand Dunes.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Soldiers Point",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Bannisters Port Stephens",
    "offer_address": "147 Soldiers Point Road, Soldiers Point, New South Wales 2317, Australia",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 359.0,
    "value": 756.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hNOzAAM",
    "hero_image": "https://images.luxuryescapes.com/wh954fc1e9yndoxa2of",
    "image_two": "https://images.luxuryescapes.com/kwkhv27fktb19r8uitn",
    "image_three": "https://images.luxuryescapes.com/a82uo9hofvpx50z7x6b",
    "vendor_name": "Oaks Port Stephens Pacific Blue Resort",
    "title": "Idyllic Oaks Resort Stay in the Heart of Port Stephens with Serene Lagoon Pool",
    "description": "Escape to the most idyllic spot on New South Wales' coastline with a relaxing stay at Oaks Port Stephens Pacific Blue Resort - a convenient self-catering retreat with resort-style facilities, including an impressive lagoon pool. Enjoy a prime position to experience the region's tranquil bay, stunning natural surroundings, beautiful beaches and laidback coastal lifestyle.\n\nLocated a 2.5-hour drive from Sydney and less than an hour from Newcastle, Port Stephens is blessed with everything you need for a relaxing escape with family and friends. Renowned for its spectacular natural scenery, white sand beaches, dramatic sand dunes plunging into clear aquamarine waters, as well as restaurants and boutiques, this laid-back town promises something for everyone. Embark on an unforgettable swimming experience with dolphins in the ocean, glide across the calm waters of the bay on a sunset cruise, or in the winter months, spot humpback whales migrating from Antarctica - a spectacular natural show.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Salamander Bay",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Port Stephens Pacific Blue Resort",
    "offer_address": "265 Sandy Point Rd, Salamander Bay NSW 2317, Australia",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 151.0,
    "value": 224.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000MNhmeAAD",
    "hero_image": "https://images.luxuryescapes.com/gxxmo4jcqgrmhaemgff5",
    "image_two": "https://images.luxuryescapes.com/hm3jlfylfapqz2x7jblx",
    "image_three": "https://images.luxuryescapes.com/bxzx7hg9xp22zgjeautc",
    "vendor_name": "Anchorage Port Stephens",
    "title": "Five-Star Hamptons-Style Luxury in Port Stephens",
    "description": "Be one of the first to experience the stunning multimillion-dollar refurbishment of The Anchorage in Port Stephens - only 2.5 hours’ drive north of Sydney and be automatically upgraded to an Anchorage Room with ocean views. Plus you’ll receive a daily gourmet breakfast, welcome drink, a complimentary bottle of wine over two courses when dining at one of our in-house restaurants, unlimited in-house movies, late midday checkout and discounts on local experiences for two.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Port Stephens Council",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Anchorage Port Stephens 2018*",
    "offer_address": "Corlette Point Rd, Corlette NSW 2315",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 299.0,
    "value": 650.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000G5CyeYAF",
    "hero_image": "https://images.luxuryescapes.com/7y9s87gxpmg9x2k9bktd",
    "image_two": "https://images.luxuryescapes.com/mti490oyxlht2t144oyxv",
    "image_three": "https://images.luxuryescapes.com/3u0yi9elen253pi4w6",
    "vendor_name": "Bannisters Port Stephens",
    "title": "Port Stephens Boutique Waterfront Escape with Daily Breakfast & Rick Stein Restaurant Masterclass",
    "description": "Escape it all for azure waters, powdery sands and koalas lazing in the trees at one of Australia’s leading boutique hotels. Less than three hours’ drive from Sydney, this seaside haven boasts light and airy decor complemented by stunning ocean views in one of the East Coast's most sought-after destinations.\n\nLounge beside the glittering heated infinity pool overlooking the bay, then learn mouthwatering recipes during a culinary masterclass at the signature Rick Stein at Bannisters restaurant. Spectacular natural beauty awaits on your doorstep, from coastal walks to sandboarding at Stockton Sand Dunes.\n\nMelt away with treatments at the luxurious Spa Bannisters - with spaces curated by esteemed designer, Romy Alwill, in light pink tones and coastal textures. With an extensive range of treatments and massages on offer, you are sure to achieve ultimate relaxation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Soldiers Point",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Bannisters Port Stephens",
    "offer_address": "147 Soldiers Point Road, Soldiers Point, New South Wales 2317, Australia",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 299.0,
    "value": 553.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LsFIAA0",
    "hero_image": "https://images.luxuryescapes.com/bupo5vk21ugjloynuhfi",
    "image_two": "https://images.luxuryescapes.com/xomkmqpu4q1h2e40bkeq",
    "image_three": "https://images.luxuryescapes.com/1b5k1mhvwp1sh0a0wirs",
    "vendor_name": "Oaks Port Stephens Pacific Blue Resort",
    "title": "Stylish Apartment Escape in the Heart of Port Stephens",
    "description": "Discover New South Wales' most idyllic spot, Port Stephens, staying at Oaks Port Stephens Pacific Blue Resort. Enjoy all the convenience of a self-catering escape with resort-style facilities, located in a prime position to experience Port Stephens' tranquil bay, stunning natural surrounds, beautiful beaches and laidback coastal lifestyle. Your relaxing escape includes a bottle of wine on arrival, complimentary Wi-Fi and a leisurely late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Salamander Bay",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Port Stephens Pacific Blue Resort",
    "offer_address": "265 Sandy Point Rd, Salamander Bay NSW 2317, Australia",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 192.0,
    "value": 373.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2lZkQAJ",
    "hero_image": "https://images.luxuryescapes.com/nog9lsrzkkgwraxm4bhs",
    "image_two": "https://images.luxuryescapes.com/hcwclypymhwqbktepsmr",
    "image_three": "https://images.luxuryescapes.com/njip2pmrmgxrxl6q1kfy",
    "vendor_name": "Anchorage Port Stephens",
    "title": "Hamptons-Style Waterfront Luxury, Five-Star Dining and Daily Signature Sparkling Wine Breakfasts",
    "description": "Experience breezy waterfront style at its finest, with luxurious accommodation and decadent dining options, overlooking what is arguably one of the world’s most beautiful ports, at The Anchorage Port Stephens. This idyllic, Hamptons-style resort is a haven of five-star excellence offering spacious waterfront guest rooms and mezzanine-style loft suites. You’ll enjoy daily signature sparkling wine breakfasts with full hot and cold buffet, a gourmet two-course dinner including a house beer, wine or sparkling each at The Galley Kitchen, two AU$25 spa vouchers to world-class onsite Spa Lucca, and a leisurely 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Port Stephens Council",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "The Anchorage Port Stephens - Feb 2019",
    "offer_address": "Corlette Point Rd, Corlette NSW 2315",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 317.0,
    "value": 719.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005Hp1VAAS",
    "hero_image": "https://images.luxuryescapes.com/f5qdakxhwaguts9aq0us",
    "image_two": "https://images.luxuryescapes.com/mlo4ip1sap7vz22j3o5r",
    "image_three": "https://images.luxuryescapes.com/5r1jsqdycqnst19kerc",
    "vendor_name": "Bannisters Port Stephens",
    "title": "Boutique Port Stephens Waterfront Escape with Daily Breakfast & Gourmet Rick Stein Two-Course Dinner",
    "description": "Escape it all for azure waters, powdery sands and koalas lazing in the trees at one of Australia’s leading boutique hotels: Bannisters Port Stephens. Just a 2.5-hour drive from Sydney, this seaside haven welcomes you with sweeping ocean views in one of the east coast’s most sought-after destinations.\n\nRelax amid light and airy décor with retro touches, lounge beside the glittering infinity pool overlooking the bay, melt away with treatments at the luxurious Spa Bannisters and indulge in freshly-caught seafood at the signature Rick Stein at Bannisters restaurant. If you can tear yourself away from the hotel, spectacular natural beauty awaits on the doorstep, with everything from coastal walks to sandboarding at Stockton Sand Dunes on offer.\n\n**Your handpicked inclusions:**\n\n- Daily continental breakfast at Rick Stein at Bannisters\n- Return to Rick Stein at Bannisters for an indulgent two-course, set-menu seafood dinner for two\n- Relax over a delicious two-course lunch for two beside the bay at the Terrace Bar \n- A glass of sparkling wine on arrival each at the Terrace Bar\n\n**Want to wake to serene water views?** Upgrade to an Ocean Deck Lower-Level Room with a balcony overlooking the glittering waters of the bay through the trees.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Soldiers Point",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Bannisters Port Stephens",
    "offer_address": "147 Soldiers Point Road, Soldiers Point, New South Wales 2317, Australia",
    "percentage_discount": 14.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 419.0,
    "value": 488.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdI7RAAV",
    "hero_image": "https://images.luxuryescapes.com/impob8ztnx81it40e1fxd",
    "image_two": "https://images.luxuryescapes.com/x782k724ndfzdbdcqmf",
    "image_three": "https://images.luxuryescapes.com/s92skfnbfkl8lxlw3mpb",
    "vendor_name": "Anchorage Port Stephens",
    "title": "Hamptons-Style Port Stephens Waterfront Escape with Daily Sparkling Wine Breakfast & Two-Course Lunch",
    "description": "Discover bayfront beauty in abundance when you stay at this idyllic Hamptons-style resort. The Anchorage Hotel & Spa is a true haven of luxury, exuding breezy waterfront style from its beautifully appointed rooms and suites, and with direct access to the beach. Kick your feet up in coastal-inspired interiors and bask in panoramic marina views as you search the glistening waters of Australia’s dolphin capital for signs of aquatic wildlife.\n\nThe heart of the hotel's opulent offerings lies at Spa Lucca, a revered retreat spa providing top-to-toe treatments using purely Australian ingredients. Enjoy award-winning food at The Galley Kitchen, or try a selection of fine whiskeys and cocktails at Moby's Bar, named after the great whale. But if kicking back is more your style, just sip the day away at the Poolside Bar and enjoy the ambience of the sparkling infinity pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Corlette",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "The Anchorage Hotel & Spa",
    "offer_address": "26 Corlette Point Road, Corlette 2315, NSW, Australia",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 359.0,
    "value": 550.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GR9xAAG",
    "hero_image": "https://images.luxuryescapes.com/bji31lfsiu0o8q05wz7",
    "image_two": "https://images.luxuryescapes.com/5iqbeil1qipux2lhwx",
    "image_three": "https://images.luxuryescapes.com/qvbwp0ishvekpul3ex",
    "vendor_name": "Winning Holidays",
    "title": "Port Stephens Waterfront Apartment with Direct Beach Access for up to 8 Guests",
    "description": "Wake up to the sound of the ocean and step straight from your apartment onto the golden sands of Wanda Beach when you stay at Panarea, Port Stephens. This waterfront apartment in Salamander Bay offers three bedrooms and sleeps up to eight guests, making it ideal for families or small groups of friends. \n\nAdmire the sunrise from your private outdoor area, furnished with couches, sunbeds and a gas BBQ. Right here is the perfect place to enjoy your complimentary twin pack of wine. Your escape also includes a dolphin spotting and sandboarding experience for two and a 12pm late checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Salamander Bay",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Panarea",
    "offer_address": "1/197 Soldiers Point Road, Salamander Bay, NSW 2317",
    "percentage_discount": 29.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 1139.0,
    "value": 1604.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dZYTcQAO",
    "hero_image": "https://images.luxuryescapes.com/t7n5y91f4k7djqrq3lh",
    "image_two": "https://images.luxuryescapes.com/amwnin9r8p34c2j4pepp",
    "image_three": "https://images.luxuryescapes.com/jf4auvc2fdtwid27v8cku",
    "vendor_name": "Anchorage Port Stephens",
    "title": "Hamptons-Style Waterfront Luxury with Daily Sparkling Wine Breakfast",
    "description": "Experience breezy waterfront style at its finest at The Anchorage Port Stephens, home to luxurious accommodation and regional NSW’s Best Seafood Restaurant (as named by the 2019 Savour Restaurant & Catering Awards for Excellence), The Wild Herring, overlooking one of the world’s most beautiful ports. This Hamptons-style resort features heated family and adults-only pools and a decadent day spa - Spa Lucca - described by Harper’s Bazaar as one of the 'world’s most insanely luxurious spas' and is a seaside haven of five-star excellence, offering spacious waterfront guestrooms and mezzanine-style loft suites in an idyllic location.\n\nEnjoy indulgent daily hot-and-cold buffet breakfast with free-flow sparkling wine, an A$100 food and drink credit per room, a welcome drink per person, A$25 spa credit per person to spend at the world-class Spa Lucca on 60-minute treatments, and a leisurely 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Corlette",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "The Anchorage Hotel | Spa - Don't Use",
    "offer_address": "Corlette Point Rd, Corlette NSW 2315",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 304.0,
    "value": 725.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GeE8kAAF",
    "hero_image": "https://images.luxuryescapes.com/k4psll1a85kr4ug2ay",
    "image_two": "https://images.luxuryescapes.com/c6qrleiet5j2649fsum8",
    "image_three": "https://images.luxuryescapes.com/ezhxpu85911cxtflbsd",
    "vendor_name": "Oaks Port Stephens Pacific Blue Resort",
    "title": "Idyllic Oaks Resort Studio Stay in the Heart of Port Stephens with Tropical Lagoon Pool",
    "description": "Escape to the most idyllic spot on New South Wales' coastline with a relaxing stay at Oaks Port Stephens Pacific Blue Resort, located in a prime position to experience Port Stephens' tranquil bay and laidback coastal lifestyle. After busy days exploring the wonders of the region, retreat to your stylish self-contained accommodation and dip in the impressive lagoon pool or enjoy a friendly tennis match at the onsite courts. When it's time to pamper yourself, head to the Japanese-style steam room or keep up your wellness routine at the onsite fitness centre.\n\nJust 2.5 hours from Sydney and less than an hour from Newcastle, Port Stephens is known for its spectacular natural scenery, white sand beaches and dramatic sand dunes plunging into clear aquamarine waters, as well as restaurants and boutique shops. Embark on an unforgettable swimming experience with dolphins in the open ocean, glide across the calm waters of the bay on a sunset cruise, or in the winter months, spot humpback whales migrating from Antarctica - a spectacular natural show.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Salamander Bay",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Port Stephens Pacific Blue Resort",
    "offer_address": "265 Sandy Point Road, Salamander Bay, New South Wales 2317, Australia",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 207.0,
    "value": 379.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070cqOAAQ",
    "hero_image": "https://images.luxuryescapes.com/mqbdlcfgqq26ckpybfe",
    "image_two": "https://images.luxuryescapes.com/3nw1hstyin4fc0088js",
    "image_three": "https://images.luxuryescapes.com/9ak3e1y70nb8hu9ljazn",
    "vendor_name": "Bannisters Port Stephens",
    "title": "Port Stephens Boutique Waterfront Escape with Daily Breakfast, A Two-Course Lunch & Rick Stein Two-Course Dinner",
    "description": "Escape it all for azure waters, powdery sands and koalas lazing in the trees at one of Australia’s leading boutique hotels: Bannisters Port Stephens. Just a 2.5-hour drive from Sydney, this seaside haven - stamped with a Tripadvisor Travellers' Choice 2021 award - welcomes you to one of the East Coast’s most sought-after destinations.\n\nRelax amid light and airy décor with retro touches, lounge beside the glittering infinity pool overlooking the bay, melt away with treatments at the luxurious Spa Bannisters and indulge in freshly caught seafood at the signature Rick Stein restaurant. If you can tear yourself away from the hotel, spectacular natural beauty awaits on the doorstep; from coastal walks to sandboarding at Stockton Sand Dunes.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Soldiers Point",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Bannisters Port Stephens",
    "offer_address": "147 Soldiers Point Road, Soldiers Point, New South Wales 2317, Australia",
    "percentage_discount": 21.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 409.0,
    "value": 518.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gx5sFAAR",
    "hero_image": "https://images.luxuryescapes.com/bg7dpa9astbhe1tr29cg",
    "image_two": "https://images.luxuryescapes.com/zv7im28jtscuwq2p3wr",
    "image_three": "https://images.luxuryescapes.com/n9tkfyyurak78bd5pj7f",
    "vendor_name": "Bannisters Port Stephens",
    "title": "Port Stephens Boutique Waterfront Escape with Daily Breakfast, Rick Stein Two-Course Dinner & Cooking Masterclass",
    "description": "Escape it all for azure waters, powdery sands and koalas lazing in the trees at one of Australia’s leading boutique hotels: Bannisters Port Stephens. Less than three hours' drive from Sydney, this seaside haven boasts light and airy decor complemented by stunning ocean views in one of the East Coast's most sought-after destinations. Lounge beside the glittering heated infinity pool overlooking the bay, learn mouthwatering recipes during a culinary masterclass at the signature Rick Stein restaurant and indulge in a two-course ocean-fresh dinner during your gourmet stay.\n\nMelt away with treatments at the luxurious Spa Bannisters - with spaces curated by esteemed designer, Romy Alwill, in light pink tones and coastal textures. With an extensive range of treatments and massages on offer, you are sure to achieve ultimate relaxation. If you can tear yourself away from the hotel, spectacular natural beauty awaits on your doorstep, from coastal walks to sandboarding at Stockton Sand Dunes.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Soldiers Point",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Bannisters Port Stephens",
    "offer_address": "147 Soldiers Point Road, Soldiers Point, New South Wales 2317, Australia",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 359.0,
    "value": 594.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eK7s5QAC",
    "hero_image": "https://images.luxuryescapes.com/vkudrrupc3s8ltv58liu",
    "image_two": "https://images.luxuryescapes.com/xy976hmxl78c1qxnxwuw",
    "image_three": "https://images.luxuryescapes.com/h9za0n0uffzb6fpmnhd",
    "vendor_name": "Bannisters Port Stephens",
    "title": "Boutique Waterfront Escape with Gourmet Inclusions",
    "description": "Escape to one of Australia’s leading boutique hotels, Bannisters Port Stephens, only two-and-a-half hours from Sydney. Boasting stunning ocean views, a sun-drenched infinity pool and a Rick Stein flagship restaurant, this boutique haven is the ideal location for the ultimate luxury getaway. Your escape includes daily continental buffet breakfast at celebrity chef Rick Stein's on-site restaurant, an AU$100 hotel credit to spend on spa treatments or dining experiences, a daily replenished minibar with soft drinks and snacks and a glass of sparkling on arrival.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Soldiers Point",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Bannisters Port Stephens",
    "offer_address": "147 Soldiers Point Road, Soldiers Point, New South Wales 2317, Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 297.0,
    "value": 526.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C3SDZAA3",
    "hero_image": "https://images.luxuryescapes.com/rotw5k04ey55cv3ih4ma",
    "image_two": "https://images.luxuryescapes.com/wfmqzfz43xjau8mrcld",
    "image_three": "https://images.luxuryescapes.com/60qzv6k8wcjykmh1sl9",
    "vendor_name": "Bannisters Port Stephens",
    "title": "Port Stephens Boutique Waterfront Escape with Daily Breakfast, Two-Course Lunch & Rick Stein Two-Course Dinner",
    "description": "Escape it all for azure waters, powdery sands and koalas lazing in the trees at one of Australia’s leading boutique hotels: Bannisters Port Stephens. Just a 2.5-hour drive from Sydney, this seaside haven welcomes you to one of the East Coast’s most sought-after destinations. Boasting stunning ocean views, this sun-drenched boutique haven is the ideal location for the ultimate luxury escape. Relax amid light and airy decor with retro touches, lounge beside the glittering infinity pool overlooking the bay,  and indulge in freshly caught seafood at the signature Rick Stein restaurant. \n\nMelt away with treatments at the luxurious Spa Bannisters - with spaces curated by esteemed designer Romy Alwill in light pink tones and coastal textures. A place to unwind, the day spa offers an extensive range of facials and treatments to achieve ultimate relaxation. If you can tear yourself away from the hotel, spectacular natural beauty awaits on the doorstep; from coastal walks to sandboarding at Stockton Sand Dunes.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Soldiers Point",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Bannisters Port Stephens",
    "offer_address": "147 Soldiers Point Road, Soldiers Point, New South Wales 2317, Australia",
    "percentage_discount": null,
    "min_duration": 2,
    "max_duration": 3,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EgX9AAK",
    "hero_image": "https://images.luxuryescapes.com/kozg3ecg9zak8iyrz3i",
    "image_two": "https://images.luxuryescapes.com/p4kymwry2r5iderxiozp",
    "image_three": "https://images.luxuryescapes.com/hvqmqrhntdwbskmwdlvm",
    "vendor_name": "Winning Holidays",
    "title": "Port Stephens Waterfront Stay with Direct Beach Access for up to 8 Guests",
    "description": "Stay in unparalleled style with a boutique coastal escape at Delphini 1 Salamander Bay - an ultra-modern stay in Port Stephens, sleeping up to eight guests. Surrender to the laidback charms of the Hunter Region, New South Wales in this waterfront property complete with four plush bedrooms, three bathrooms, a fully-equipped kitchen, a spectacular outdoor area with uninterrupted views over Port Stephens headlands and direct beach access from the private garden.\n\nYour stylish beach retreat includes two bottles of wine on arrival, a dolphin cruise and sandboarding experience for two adults and a leisurely 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Salamander Bay",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Delphini 1 Salamander Bay",
    "offer_address": "1/189 Soldiers Point Road, Salamander Bay, NSW, 2317",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 839.0,
    "value": 1522.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cq6rHQAQ",
    "hero_image": "https://images.luxuryescapes.com/qczeleg2ywql8cfq7ha9",
    "image_two": "https://images.luxuryescapes.com/ruf2y1t55vxllgygp8y",
    "image_three": "https://images.luxuryescapes.com/if7gakve5dlp35s9bhi",
    "vendor_name": "Oaks Port Stephens Pacific Blue Resort",
    "title": "Stylish Apartment Escape in the Heart of Port Stephens",
    "description": "Discover New South Wales' most idyllic holiday spot, Port Stephens. Staying at Oaks Pacific Blue Resort puts in you in a prime position to experience this tranquil bay, stunning natural surrounds, beautiful beaches and laidback coastal lifestyle. Enjoy a bottle of wine on arrival, complimentary Wi-Fi and a leisurely late 12pm check out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Port Stephens Council",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Pacific Blue Resort 2019",
    "offer_address": "265 Sandy Point Rd, Salamander Bay NSW 2317, Australia",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 204.0,
    "value": 395.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EgWaAAK",
    "hero_image": "https://images.luxuryescapes.com/p4k3nrfs8cg61gn019do",
    "image_two": "https://images.luxuryescapes.com/w5b7hczjamqsr5xbdbho",
    "image_three": "https://images.luxuryescapes.com/avsd0zd1zqkk8ex224o",
    "vendor_name": "Winning Holidays",
    "title": "Boutique Port Stephens Villa Escape with Direct Beach Access for up to 8 Guests",
    "description": "Soak up spectacular views over dreamy Corlette Point with a boutique stay at Maggie’s Place Holiday House Port Stephens - a fabulous, brand-new beachfront villa sleeping up to eight guests.\n\nStay in style in this ultra-modern villa with four plush bedrooms, three bathrooms, a fully equipped kitchen, spectacular outdoor space with some of the best views in the area, and direct beach access from the private garden. Discover the charms of idyllic Port Stephens and find yourself a stone’s throw from the Hamptons-style Anchorage Marina.\n\nYour villa escape includes two bottles of wine on arrival, a dolphin cruise and sandboarding experience for two adults and a leisurely 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Corlette",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Maggie's Place Holiday House Port Stephens",
    "offer_address": "46B Danalene Parade, Corlette",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 1019.0,
    "value": 1894.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FLo77AAD",
    "hero_image": "https://images.luxuryescapes.com/kkfrmxegrjin71a5jaom",
    "image_two": "https://images.luxuryescapes.com/ejawyw8qphg8571h0cqe",
    "image_three": "https://images.luxuryescapes.com/zxcj2gfobb8sconezge",
    "vendor_name": "Anchorage Port Stephens",
    "title": "Hamptons-Style Port Stephens Waterfront Escape with Daily Signature Sparkling Wine Breakfast",
    "description": "Discover bayfront beauty in abundance overlooking one of the world’s most beautiful ports with a tranquil stay at The Anchorage Hotel & Spa. This idyllic, Hamptons-style resort is a haven of luxury - oozing breezy waterfront style from its beautifully appointed rooms and suites to the ultra-indulgent day spa. Nudging the water’s edge at Corlette Point, kick your feet up in heavenly coastal-inspired interiors and bask in panoramic marina views as you search the glistening waters of Australia’s dolphin capital for signs of aquatic wildlife.\n\nThe heart of the hotel’s opulent offerings lies at Spa Lucca, a revered retreat providing top-to-toe treatments using purely Australian ingredients. Enjoy some of the region’s best dining experiences at award-winning The Gallery Kitchen - serving up fresh meals and bright flavours daily - and Moby’s Bar, which slings a selection of fine whiskeys and cocktails. Discover lavish experiences like the High Tea by the Sea, or if kicking back is more your style, sip the day away at the poolside bar and enjoy the relaxed ambiance of the sparkling infinity pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Corlette",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "The Anchorage Hotel & Spa",
    "offer_address": "26 Corlette Point Road, Corlette 2315, NSW, Australia",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 335.0,
    "value": 507.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4sV8AAJ",
    "hero_image": "https://images.luxuryescapes.com/xw7xwk6ly6h1gz6pc61",
    "image_two": "https://images.luxuryescapes.com/3bftn4zptexg9pnzm3i",
    "image_three": "https://images.luxuryescapes.com/zlhf7o4py08asfj3oyq",
    "vendor_name": "Oaks Port Stephens Pacific Blue Resort",
    "title": "Idyllic Oaks Resort Studio Stay in the Heart of Port Stephens with Tropical Lagoon Pool",
    "description": "Escape to the most idyllic spot on New South Wales' coastline with a relaxing stay at Oaks Port Stephens Pacific Blue Resort, located in a prime position to experience Port Stephens' tranquil bay and laidback coastal lifestyle. After busy days exploring the wonders of the region, retreat to your stylish self-catering accommodation and dip in the impressive lagoon pool, dine at the onsite restaurant or enjoy a friendly tennis match at the onsite courts. When it's time to pamper yourself head to the Japanese-style steam room or keep up your wellness routine at the onsite fitness centre.\n\nJust 2.5 hours from Sydney and less than an hour from Newcastle, Port Stephens is known for its spectacular natural scenery, white sand beaches and dramatic sand dunes plunging into clear aquamarine waters, as well as restaurants and boutique shops. Embark on an unforgettable swimming experience with dolphins in the open ocean, glide across the calm waters of the bay on a sunset cruise, or in the winter months, spot humpback whales migrating from Antarctica - a spectacular natural show.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Salamander Bay",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Port Stephens Pacific Blue Resort",
    "offer_address": "265 Sandy Point Rd, Salamander Bay NSW 2317, Australia",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 144.0,
    "value": 233.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I4bdAAC",
    "hero_image": "https://images.luxuryescapes.com/w2uhmguqx26p3yhn36t",
    "image_two": "https://images.luxuryescapes.com/ty3m6pbc9jh9dbqrzvvr",
    "image_three": "https://images.luxuryescapes.com/quwrdgfh66qddrpuw4o",
    "vendor_name": "Oaks Port Stephens Pacific Blue Resort",
    "title": "Idyllic Oaks Resort Studio Stay in the Heart of Port Stephens",
    "description": "Escape to the most idyllic spot on New South Wales' coastline with a relaxing stay at Oaks Port Stephens Pacific Blue Resort - a convenient self-catering retreat with resort-style facilities, including an impressive lagoon pool. Enjoy a prime position to experience the region's tranquil bay, stunning natural surrounds, beautiful beaches and laidback coastal lifestyle.\n\nLocated a 2.5-hour drive from Sydney and less than an hours’ drive from Newcastle, Port Stephens is blessed with everything you need for a relaxing escape with family and friends. Renowned for its spectacular natural scenery, white sand beaches, dramatic sand dunes plunging into clear aquamarine waters, as well as restaurants and boutique shops, this laid-back town promises something for everyone. Embark on an unforgettable swimming experience with dolphins in the open ocean, glide across the calm waters of the bay on a sunset cruise, or in the winter months, spot humpback whales migrating from Antarctica - a spectacular natural show.\n\n**Your handpicked inclusions:**\n\n- Celebrate your escape with a welcome bottle of wine on arrival\n- Stay connected with complimentary Wi-Fi throughout your stay\n- Relax for longer with leisurely late 12pm checkout\n\n**Apartment Upgrade:** Enjoy the luxury of a kitchen and laundry facilities when you upgrade to a One-Bedroom Lagoon Apartment for two.\n\n**Group Upgrade:** If you are travelling with friends and family, the Two-Bedroom Lagoon Apartment, valid for up to four guests, is perfect for you.\n\n**Ultra-Luxe Upgrade:** If you're looking for added space and luxury for up to six guests, upgrade to a Three-Bedroom Plunge Pool apartment.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Salamander Bay",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Port Stephens Pacific Blue Resort",
    "offer_address": "265 Sandy Point Rd, Salamander Bay NSW 2317, Australia",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 6,
    "price": 223.0,
    "value": 486.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FPS25YAH",
    "hero_image": "https://images.luxuryescapes.com/txwo0b16jcrovxqr46nh",
    "image_two": "https://images.luxuryescapes.com/2wvqho1fszamhc5qiy",
    "image_three": "https://images.luxuryescapes.com/wz6fmmj0v3b2kyryzpc",
    "vendor_name": "Anchorage Port Stephens",
    "title": "Hamptons-Style Port Stephens Waterfront Escape with Daily Sparkling Wine Breakfast & Two-Course Lunch",
    "description": "Discover bayfront beauty in abundance when you stay at this idyllic Hamptons-style resort with direct access to the beach. The Anchorage Hotel & Spa is a serene seaside retreat overlooking one of the world’s most stunning marinas. This waterfront haven features elegant rooms and mezzanine suites designed to showcase the beauty of the coastline. \n\nUnwind in coastal-inspired interiors with uninterrupted marina views in a sanctuary renowned as one of the finest havens for dolphin and whale watching. At its heart is The Galley Kitchen and Moby's Bar, offering a seasonal menu with the finest local produce, alongside two swimming pools - including an adults-only infinity pool - and the indulgent Spa Lucca for pure relaxation. \n\nWhether relaxing on your balcony, enjoying the poolside oasis or curling up by the fire in the guest lounge, The Anchorage invites you to unwind and recharge in effortless elegance.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Corlette",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "The Anchorage Hotel & Spa",
    "offer_address": "26 Corlette Point Road, Corlette 2315, NSW, Australia",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 369.0,
    "value": 525.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LgtNAAS",
    "hero_image": "https://images.luxuryescapes.com/9pvyoaq1jt76eba339y",
    "image_two": "https://images.luxuryescapes.com/7hlxeq3m0p1lzdvmg8pj",
    "image_three": "https://images.luxuryescapes.com/jgv65uian0hv0ophgta",
    "vendor_name": "Anchorage Port Stephens",
    "title": "Hamptons-Style Waterfront Villa Escape with Daily Sparkling Wine Breakfast",
    "description": "Experience breezy waterfront style at its finest overlooking one of the world’s most beautiful ports at The Anchorage Hotel | Spa. This idyllic, Hamptons-style resort is a haven of luxury - and you will be staying in the resort’s crowning jewel: the palatial, two-bedroom Luxe Villa, sat on the water’s edge on Corlette Point.\n\nYour lavish villa escape includes daily signature sparkling wine breakfast, four A$50 food and drink credits to spend at The Galley Kitchen, a charcuterie plate at Moby’s Bar, a bottle of sparkling wine on arrival, an A$25 spa credit per person for the world-class Spa Lucca and a leisurely late 11am checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Corlette",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "The Anchorage Hotel | Spa - Don't Use",
    "offer_address": "Corlette Point Rd, Corlette NSW 2315",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 1177.0,
    "value": 1901.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECvGTAA1",
    "hero_image": "https://images.luxuryescapes.com/fo6j4sy5td5k0gq8swozi",
    "image_two": "https://images.luxuryescapes.com/vli8a5mefeyrrqos5oe",
    "image_three": "https://images.luxuryescapes.com/blo6nxfpkf9ca75093x",
    "vendor_name": "Ingenia Holidays One Mile Beach",
    "title": "Picturesque Port Stephens Beachfront Oasis with Onsite Swimming Pool, Tennis Courts & Beach Access",
    "description": "Relax with ease in coastal charm with a comfortable beachfront stay at Ingenia Holidays One Mile Beach, a holiday park situated near stunning Port Stephens boasting a collection of fully furnished and spacious cabins and villas. Experience a world away from the everyday with the property's 1.6-kilometre stretch of coastline, perfect for splashing around in the white-capped waters, tranquil morning swims and sunset sandboarding down the dunes. Discover relaxation beyond the crashing waves with a hit of tennis at the onsite courts, a round of mini golf or a refreshing drink on your private patio. Ideal for a fun-filled family stay, take advantage of the outdoor BBQ areas, let little ones run free on the playground or wade into the calm waters of the swimming pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "One Mile",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Ingenia Holidays One Mile Beach",
    "offer_address": "426 Gan Gan Rd, One Mile NSW 2316 Australia",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 117.0,
    "value": 270.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z3wuAAA",
    "hero_image": "https://images.luxuryescapes.com/i4kx2aj4tnbp7d3dhtq",
    "image_two": "https://images.luxuryescapes.com/tb9rkabv8qzw4g8bzcu",
    "image_three": "https://images.luxuryescapes.com/btyxiaweqo913h0nydr",
    "vendor_name": "Anchorage Port Stephens",
    "title": "Hamptons-Style Port Stephens Escape",
    "description": "Experience breezy waterfront style at its finest overlooking one of the world’s most beautiful ports at The Anchorage Hotel | Spa. This idyllic, Hamptons-style resort is a haven of luxury, home to one of the ‘most insanely luxurious spas in the world’, according to Harper’s Bazaar. You’ll want for nothing when staying at The Anchorage Hotel | Spa, with two beautiful pools, glamorous restaurants The Wild Herring and The Galley Kitchen, stylish Moby's Bar, an onsite gym and endless water views. Enjoy a privileged position on Port Stephens' waterfront and easy access to Gan Gan Lookout, Tomaree National Park and Nelson Bay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Corlette",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "The Anchorage Hotel | Spa - Don't Use",
    "offer_address": "Corlette Point Rd, Corlette NSW 2315",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DeW2RAAV",
    "hero_image": "https://images.luxuryescapes.com/q7gf1i5vrq6092b4txxg",
    "image_two": "https://images.luxuryescapes.com/927739ivasyna10tc9vt",
    "image_three": "https://images.luxuryescapes.com/ud4oc3h6txpc8n5rz9yl",
    "vendor_name": "Anchorage Port Stephens",
    "title": "Hamptons-Style Waterfront Luxury in Serene Port Stephens",
    "description": "Experience Hamptons-style luxury at its finest at The Anchorage Port Stephens Hotel & Spa, a breezy seaside haven overlooking one of the world’s most beautiful ports. Featuring spacious waterfront guestrooms and mezzanine-style suites in an idyllic location, the resort is home to The Galley Kitchen restaurant, serving a seasonal menu of local produce, two swimming pools, including an adults-only infinity pool, and a decadent day spa - Spa Lucca.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Corlette",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "The Anchorage Hotel & Spa",
    "offer_address": "26 Corlette Point Road, Corlette 2315, NSW, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 168.0,
    "value": 168.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BU6MAAW",
    "hero_image": "https://images.luxuryescapes.com/5jmbghqg7thtqrzvfxj",
    "image_two": "https://images.luxuryescapes.com/jkczp1qtno5pgertv3ce",
    "image_three": "https://images.luxuryescapes.com/78lcw0gfogz6axo69ipe",
    "vendor_name": "Oaks Port Stephens Pacific Blue Resort",
    "title": "Port Stephens Oaks Resort Stay with Serene Lagoon Pool",
    "description": "Escape to the most idyllic spot on New South Wales' coastline with a relaxing stay at Oaks Port Stephens Pacific Blue Resort - a convenient retreat with resort-style facilities, including an impressive lagoon pool, onsite restaurant, tennis courts, Japanese-style steam room and gym. Enjoy a prime position to experience the region's tranquil bay, stunning natural surroundings, beautiful beaches and laidback coastal lifestyle. Located a 2.5-hour drive from Sydney and less than an hour from Newcastle, Port Stephens is blessed with everything you need for a relaxing escape with family and friends. Renowned for its spectacular natural scenery, white sand beaches, dramatic sand dunes plunging into clear aquamarine waters, as well as restaurants and boutiques, this laid-back town promises something for everyone.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Salamander Bay",
    "location_heading": "Port Stephens",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Port Stephens Pacific Blue Resort",
    "offer_address": "265 Sandy Point Road, Salamander Bay, New South Wales 2317, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 89.0,
    "value": 89.0
  }
]