[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdKlVAAV",
    "hero_image": "https://images.luxuryescapes.com/ko1qlnuxajxbkrcb811d",
    "image_two": "https://images.luxuryescapes.com/l9g95zqqdclws2f0dys",
    "image_three": "https://images.luxuryescapes.com/2ncvgj4re4qhf55es4hrd",
    "vendor_name": "Le Meridien Ile Maurice",
    "title": "Mauritius All-Suite Oceanfront Paradise with Daily Breakfast, Lunch & Dinner",
    "description": "Nowhere rivals the majestic allure of the northern coast of Mauritius - a realm where crystal-clear waters caress pristine, sun-kissed shores, while verdant palm-studded vistas paint a picture of opulence. Enveloped in this paradisiacal setting rests Le Méridien Ile Maurice, offering an unrivalled sanctuary of five-star luxury amidst the tranquil embrace of the Indian Ocean.\n\nIndulge your palate in the tantalising flavours of local cuisine at the esteemed onsite Nomad restaurant, or partake in the ritual of savouring exceptional coffee at Latitude 20. For moments of rejuvenation, surrender to the pampering rituals of Explore Spa by Le Méridien, where ancient traditions meld seamlessly with modern luxury.\n\nFor those in pursuit of serenity, Waves, the resort's illustrious beachfront eatery, offers an idyllic haven to unwind. Here, amidst the symphony of crashing waves and the caress of gentle sea breezes, relish in the artistry of mixology as you sip on exquisite cocktails, all while basking in the ethereal glow of the setting sun as it dips below the horizon.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Pamplemousses",
    "offer_geo_area_level_2": "Pointe Aux Piments",
    "location_heading": "Pointe aux Piments",
    "location_subheading": "Mauritius",
    "location_description": "Le Méridien Ile Maurice",
    "offer_address": "Village Hall Lane, Pointe aux Piments 21304, Mauritius",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 1889.0,
    "value": 3877.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gv2bnAAB",
    "hero_image": "https://images.luxuryescapes.com/gs09c0308dll8kl0k7k",
    "image_two": "https://images.luxuryescapes.com/jt9qyogmt8p8gxncc2u7",
    "image_three": "https://images.luxuryescapes.com/ahaykp8wluyvpvfnp0o",
    "vendor_name": "Le Meridien Ile Maurice",
    "title": "Mauritius Oceanfront Bliss with Daily Breakfast, Nightly Dinner & US$100 Dining Credit",
    "description": "Nowhere rivals the majestic allure of the northern coast of Mauritius - a realm where crystal-clear waters caress pristine, sun-kissed shores, while verdant palm-studded vistas paint a picture of opulence. Enveloped in this paradisiacal setting rests Le Méridien Ile Maurice, offering an unrivalled sanctuary of five-star luxury amidst the tranquil embrace of the Indian Ocean. Indulge your palate in the tantalizing flavours of local cuisine at the esteemed onsite Nomad, or partake in the ritual of savouring exceptional coffee at Latitude 20.\n\nFor moments of rejuvenation, surrender to the pampering rituals of Explore Spa by Le Méridien, where ancient traditions meld seamlessly with modern luxury. For those in pursuit of serenity, Waves, the resort's illustrious beachfront eatery, offers an idyllic haven to unwind. Here, amidst the symphony of crashing waves and the caress of gentle sea breezes, relish in the artistry of mixology as you sip on exquisite cocktails, all while basking in the ethereal glow of the setting sun as it dips below the horizon.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Pamplemousses",
    "offer_geo_area_level_2": "Pointe Aux Piments",
    "location_heading": "Pointe aux Piments",
    "location_subheading": "Mauritius",
    "location_description": "Le Méridien Ile Maurice",
    "offer_address": "Village Hall Lane, Pointe aux Piments 21304, Mauritius",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 869.0,
    "value": 2335.0
  }
]