[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxtY0AAJ",
    "hero_image": "https://images.luxuryescapes.com/6uf3dkuiccctt52eiw0i8",
    "image_two": "https://images.luxuryescapes.com/mgxth6wsuu7ix148hji",
    "image_three": "https://images.luxuryescapes.com/0dh4eorrzuuoqz4n3lj",
    "vendor_name": "Château de Fiac Hôtel & Spa",
    "title": "Adults-Only Boutique Chateau Escape 45 Minutes from Toulouse with Daily Breakfast & EUR50 Spa Credit",
    "description": "Step back in time and discover countryside tranquillity with an escape to Château de Fiac Hôtel & Spa - an imposing 19th-century castle nestled within the picturesque village of Fiac. Surrounded by three hectares of lush parkland, beautifully kept gardens and manicured lawns, this boutique chateau exudes elegance: from the grand chandeliers and lofty ceilings to the natural stone, warm timber accents and decorative artwork that lines the walls. Rejuvenate throughout your stay by the relaxing outdoor, heated infinity pool, head to the wellness-focused Spa REVIVO at Chateau de Fiac complete with a sauna and hammam, and sample sumptuous fare showcasing locally sourced produce at Renaissance Restaurant.\n\nOutside this charming retreat, find yourself in the rolling hillsides of France's southern Occitanie region, home to the city of Toulouse. Countryside wonders await; there are the verdant surrounding hinterlands and picturesque neighbouring villages to explore, plus you're never too far from a medieval castle, winery or local boulangerie.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Occitanie",
    "offer_geo_area_level_2": "Fiac",
    "location_heading": "Fiac",
    "location_subheading": "France",
    "location_description": "Château de Fiac Hôtel & Spa",
    "offer_address": "51 Rue Chaminade, 81500 Fiac, France",
    "percentage_discount": 28.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 579.0,
    "value": 800.0
  }
]