[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DpgCKAAZ",
    "hero_image": "https://images.luxuryescapes.com/t5qwkqjmw0he3ay7kfh",
    "image_two": "https://images.luxuryescapes.com/i93dhww9rr9w4fsvwmi",
    "image_three": "https://images.luxuryescapes.com/p39gw47jzeu1jiqfwdk",
    "vendor_name": "Bari Kothi Azimganj",
    "title": "Heritage West Bengal Riverside Mansion Stay with Daily Breakfast, One Dinner & Heritage Tour",
    "description": "Portraying a rich blend of history, heritage and conscious luxury, the 250-year-old Bari Kothi Azimganj is a rare gem along the banks of the Ganges River. From its sunset yellow walls to the Doric and Corinthian columns and chandelier-lit corridors, the restored palatial abode takes you back in time and makes for a unique cultural and historical retreat. A scenic six-hour drive from Kolkata’s Netaji Subhas Chandra Bose International Airport, the grandeur of the heritage mansion is tempered with the heartwarming hospitality of the locals who curate an authentic immersive experience. Recognised as 'The First Grand Heritage Hotel of East India', this multiple-award-winning property offers a unique vegetarian Sheherwali cuisine, tranquil boat rides, inspiring cultural experiences and opulent rooms to unwind in.\n\nLying close to Murshidabad, the erstwhile capital of Bengal during initial colonial rule, Bari Kothi Azimganj is surrounded by a plethora of historical sites. Showcasing remnants of its Nawabi yesteryear, the grand opulence of the region can be seen in local attractions such as Hazarduari Palace, Kathgola Palace, the awe-inspiring Fauti Mosque and Katra Mosque, all within an hour’s drive from the property. With a refreshing mix of Jain and Marwari traditions and Bengali culture, Bari Kothi Azimganj embraces every guest like their own kin and forges everlasting bonds.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "West Bengal",
    "offer_geo_area_level_2": "Murshidabad",
    "location_heading": "West Bengal",
    "location_subheading": "India",
    "location_description": "Bari Kothi Azimganj",
    "offer_address": "Bari Kothi, Jain Patty, Murshidabad, Azimganj West Bengal 742122 India",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 274.0,
    "value": 385.0
  }
]