[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zpP7AAI",
    "hero_image": "https://images.luxuryescapes.com/y3oa00i0z2cs75jip8j4",
    "image_two": "https://images.luxuryescapes.com/vwn4a23ifj9yma4r4495",
    "image_three": "https://images.luxuryescapes.com/149wwvk0wfbf68hxsmw",
    "vendor_name": "Welcomhotel by ITC Katra",
    "title": "Grand Opening: Luxurious Katra Escape near Vaishno Devi with Daily Breakfast & One Dinner",
    "description": "Attention, spiritual seekers. If you are craving a soul-searching and life-affirming voyage in the hills, there's no better place than Welcomhotel By ITC Hotels, Katra, a new resort nestled in the foothills of Trikuta Parvat in Jammu's Katra.\n\nConveniently located less than five kilometres from Ban Ganga, the starting point of Vaishno Devi pilgrimage, the hotel is ideal for those on their journey to one of India's most popular pilgrimage sites. Overlooking the glistening city of Katra, this five-star retreat makes for a perfect gateway to the region's other major attractions, including Patnitop and Chenab river. Less than 50 kilometres from Jammu Airport, this lavish resort is also easily accessible from the major cities of Delhi and Chandigarh. Apart from the spiritual aspect, the hotel also holds the promise of luxurious accommodation, contemporary amenities and multiple dining sites making it the perfect paradise for families and couples.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Jammu and Kashmir",
    "offer_geo_area_level_2": "Katra",
    "location_heading": "Jammu and Kashmir",
    "location_subheading": "India",
    "location_description": "Welcomhotel By ITC Hotels, Katra",
    "offer_address": "9, Shrine view SMVD Chowk, Katra, Katra, Jammu and Kashmir 182301",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 220.0,
    "value": 619.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EyP8tAAF",
    "hero_image": "https://images.luxuryescapes.com/0bysu7tj6chjwksdm6vr",
    "image_two": "https://images.luxuryescapes.com/0i8igm9eowkychcjsgcc",
    "image_three": "https://images.luxuryescapes.com/u8ldwe7v8f57zkc2jkkp",
    "vendor_name": "WelcomHeritage Grand Srinagar",
    "title": "Grand Opening: Serene Srinagar Escape with Daily Breakfast, Evening Tea & One Candlelight Dinner",
    "description": "Experience chic grandeur at the newly opened WelcomHeritage Grand Srinagar, a haven of luxury located in the heart of the ‘Switzerland of India’.  The hotel, which is 20 minutes' drive from Srinagar International Airport (SXR), flawlessly combines modern conveniences with old-world hospitality from Kashmir. The picturesque hotel offers an authentic Kashmiri cultural experience, from handwoven carpets, traditional decorations, and woodwork to the perfume of freshly brewed kahwah, all against a backdrop of chinars.  Make your paradisiacal escape memorable by relaxing in the opulently built rooms, treating your palette to rich flavours at the Samavar restaurant, unwinding in the Kahwa Lounge, or adding a dash of romance with a candlelight meal outside.\n\nSrinagar’s charm lies not only in its picturesque attractions but also in the warmth of its people. The Mughal Gardens, the Dal Lake, and the revered Dargah Hazratbal Shrine are all within 30 minutes of the hotel, so take advantage of them and let your inner poet come alive.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Jammu and Kashmir",
    "offer_geo_area_level_2": "Srinagar",
    "location_heading": "Jammu and Kashmir",
    "location_subheading": "India",
    "location_description": "WelcomHeritage Grand Srinagar",
    "offer_address": "Parraypora, Airport Rd, Baghat, Srinagar, Jammu And Kashmir 190005 India",
    "percentage_discount": 21.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 342.0,
    "value": 432.0
  }
]