[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nHN2AAM",
    "hero_image": "https://images.luxuryescapes.com/1boq34goq6pabmazboe",
    "image_two": "https://images.luxuryescapes.com/10g76s1apgqjsdkn3xu",
    "image_three": "https://images.luxuryescapes.com/8hlfd6ym6hzkkx93rob",
    "vendor_name": "Ryne",
    "title": "Melbourne: Six-Course French-Inspired Degustation for Two with Welcome Champagne & Chef Commentary",
    "description": "Savour a flawless European escape on a plate at Ryne, a relaxed yet modern French dining experience in Melbourne’s ultra-cool Fitzroy North. Be captivated by the gourmet wizardry of renowned chef Donovan Cooke and his talented team and taste your way through six carefully curated courses with this bespoke dinner experience that celebrates timeless classics from the old world and new.\n\nOn arrival, you’ll be warmly met with a glass of champagne, before being introduced to your guide and commentator for the evening, Chef Patron Donovan Cooke himself, and Ryne’s stable of brilliant chefs. Six spectacular courses will follow, each of them a bright supernova of flavour and prepared with painstaking technique and impeccable care. Begin with dishes that may include a tartare of langoustine, served with shellfish consommé and caviar, before moving to a truffle-crusted finger of John Dory on asparagus. The next course may include a slow-roasted crayfish with pine mushrooms, chestnuts and vin jaune, followed by a delectable pastry of Muscovy duck and foie gras and roasted venison loin accompanied by a devilish chocolate sauce. Dessert may feature a chestnut brûlée with prune and Armagnac ice cream, apple and honey biscuit. But that’s not all - each experience also includes a special memento for you to keep, immortalizing one of the best meals of your life.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Fitzroy",
    "location_subheading": "Melbourne",
    "location_description": "Ryne",
    "offer_address": "203 St Georges Road, Fitzroy North, VIC, 3068",
    "percentage_discount": 14.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 381.0,
    "value": 442.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cqyYxQAI",
    "hero_image": "https://images.luxuryescapes.com/06r75q6v4b5gi0hqcoxm",
    "image_two": "https://images.luxuryescapes.com/swrbk7on58vtt2t4uhfr",
    "image_three": "https://images.luxuryescapes.com/pf8ek1j3zk3xutm5nqd6m",
    "vendor_name": "District Fitzroy",
    "title": "Urban Escape in Melbourne’s Coolest District",
    "description": "Explore the most vibrant part of Melbourne at District Fitzroy, perfectly located between buzzing Brunswick Street and foodie destination Smith Street. Live like a local in a spacious One-Bedroom Executive Apartment and enjoy an urban city escape with the best of Melbourne on your doorstep.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Fitzroy",
    "location_subheading": "Melbourne, Victoria",
    "location_description": "District Fitzroy",
    "offer_address": "160 Argyle St, Fitzroy VIC 3065",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 176.0,
    "value": 316.0
  }
]