[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRyr1AAD",
    "hero_image": "https://images.luxuryescapes.com/sty5rjwg3mxvj64wr2o",
    "image_two": "https://images.luxuryescapes.com/yddpcy127ms0sggatk5",
    "image_three": "https://images.luxuryescapes.com/rulqsd5522gskz0gfuntc",
    "vendor_name": "Essence Peregian Beach",
    "title": "Sunshine Coast Designer Beach Houses 15 Minutes from Noosa with Two Resort-Style Pools",
    "description": "Experience bespoke beachside luxury in the heart of the Sunshine Coast, just 15 minutes from Noosa, in a boutique designer beach house. This is the holiday escape you've been dreaming of - refined coastal design meets high-end resort living, where guests have access to two heated pools, one with an exclusive bar, all while staying in supreme luxury.\n\nTake a family holiday or plan your next group getaway with a collection of architecturally designed and chic three, four and five bedroom beach houses offering well-appointed kitchens, outdoor entertainment areas and even a private pool in select homes. Every detail is finely curated, from signature bathroom products to private landscaped gardens.\n\nWith a backdrop of Noosa’s verdant UNESCO-listed Biosphere Reserve, a short walk from the white sands of Peregian Beach and a 15-minute drive from Noosa's Hastings Street, this is laidback coastal living at its best.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Peregian Beach",
    "location_subheading": "Queensland",
    "location_description": "Essence Peregian Beach - Boutique Hotel & Holiday Homes",
    "offer_address": "1 Sunset Lane, Peregian Beach, Queensland 4573, Australia",
    "percentage_discount": 59.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1239.0,
    "value": 3041.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DJfWEYA1",
    "hero_image": "https://images.luxuryescapes.com/nclnjw4mklzqnwfh04y",
    "image_two": "https://images.luxuryescapes.com/44pkoykang7qci13w1s",
    "image_three": "https://images.luxuryescapes.com/z73nfqrtpl5pwfs0ghoo",
    "vendor_name": "Essence Peregian Beach",
    "title": "Ultra-Chic Sunshine Coast Resort 15 Minutes from Noosa with Boutique Studios & Suites + A$100 Credit",
    "description": "Experience a new era of bespoke beachside luxury in the heart of the Sunshine Coast, just 15 minutes from Noosa, in this collection of boutique studios and suites. This is the holiday escape you’ve been dreaming of - coastal design meets high-end resort living, where guests have access to two heated pools, one with an exclusive bar, all while staying in supreme luxury.\n\nEscape to a trendy studio with someone special where no stylistic stone has been left unturned, or take the family to an ultra-spacious two-bedroom suite complete with a balcony for enjoying the tropical breeze. With a backdrop of Noosa’s UNESCO-listed Biosphere Reserve, a short walk from the white sands of Peregian Beach and a 15-minute drive from Noosa’s Hastings Street, this is laidback coastal living at its best.\n\nEvery detail is finely curated, from signature bathroom products to specially designed bathrobes and minibars fully stocked with everything you need to create your perfect cocktail. From the bespoke bar to the to-die-for decor, find comfort, ease and enjoyment hidden around every corner at this brand-new, exclusive resort.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Peregian Beach",
    "location_subheading": "Queensland",
    "location_description": "Essence Peregian Beach - Boutique Hotel & Holiday Homes",
    "offer_address": "1 Sunset Lane, Peregian Beach, Queensland 4573, Australia",
    "percentage_discount": 41.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 439.0,
    "value": 747.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRyqdAAD",
    "hero_image": "https://images.luxuryescapes.com/68cb38dgpprmupvorvzg",
    "image_two": "https://images.luxuryescapes.com/kan8fsu1fr3qiwem0dmn",
    "image_three": "https://images.luxuryescapes.com/1tp7f0giquk7vdwgf67q6",
    "vendor_name": "Essence Peregian Beach",
    "title": "Ultra-Chic Sunshine Coast Resort 15 Minutes from Noosa with Boutique Studios & Suites + A$100 Minibar Credit",
    "description": "Experience a new era of bespoke beachside luxury in the heart of the Sunshine Coast, just 15 minutes from Noosa, in this collection of boutique studios and apartments. This is the holiday escape you've been dreaming of: refined coastal design meets high-end resort living, where guests have access to two heated pools, one with an exclusive bar, all while staying in supreme luxury.\n\nEscape to a trendy boutique studio with someone special where no stylistic stone has been left unturned - from the rich textures to the streamlined design - or take a family holiday in a high-end two-bedroom apartment complete with a balcony for enjoying the tropical breeze. With a backdrop of Noosa’s verdant UNESCO-listed Biosphere Reserve, a short walk from the white sands of Peregian Beach and a 15-minute drive from Noosa's Hastings Street, this is laidback coastal living at its best.\n\nEvery detail is finely curated, from signature bathroom products to specially designed bathrobes and minibars fully stocked with everything you need to create your perfect cocktail. From the bespoke bar to the to-die-for decor, find comfort, ease and enjoyment hidden around every corner at this exclusive resort.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Peregian Beach",
    "location_subheading": "Queensland",
    "location_description": "Essence Peregian Beach - Boutique Hotel & Holiday Homes",
    "offer_address": "1 Sunset Lane, Peregian Beach, Queensland 4573, Australia",
    "percentage_discount": 41.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 439.0,
    "value": 747.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuXotAAF",
    "hero_image": "https://images.luxuryescapes.com/5mjz7roiqq039lv2ezlk",
    "image_two": "https://images.luxuryescapes.com/lo3s1le5c414a1t5g5n",
    "image_three": "https://images.luxuryescapes.com/efdwlyau8ne0yto2z7mf",
    "vendor_name": "Essence Peregian Beach",
    "title": "Ultra-Chic Sunshine Coast Resort 15 Minutes from Noosa with Boutique Studios & Beach Houses",
    "description": "Experience bespoke beachside luxury in the heart of the Sunshine Coast just 15 minutes from Noosa in a collection of boutique studios, suites and designer beach houses at Essence Peregian Beach. This is the holiday escape you've been dreaming of: refined coastal design meets high-end resort living, where guests have access to two heated pools, one with an exclusive bar, all while staying in supreme luxury. Escape to a boutique studio with someone special, take a family holiday in a high-end two-bedroom suite or plan your next group getaway with a collection of architecturally designed three-, four- and five-bedroom beach houses offering well-appointed kitchens, outdoor entertainment areas and even a private pool in select homes.\n\nWith a backdrop of Noosa’s verdant UNESCO-listed Biosphere Reserve, a short walk from the white sands of Peregian Beach and a 15-minute drive from Noosa's Hastings Street, this is laidback coastal living at its best. Every detail is finely curated, from signature bathroom products to specially designed bathrobes and minibars fully stocked with everything you need to create your perfect cocktail. From the bespoke bar to the to-die-for decor, find comfort, ease and enjoyment hidden around every corner at this exclusive resort.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Peregian Beach",
    "location_subheading": "Queensland",
    "location_description": "Essence Peregian Beach - Boutique Hotel & Holiday Homes",
    "offer_address": "1 Sunset Lane, Peregian Beach, Queensland 4573, Australia",
    "percentage_discount": 38.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 419.0,
    "value": 675.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fms1wAAB",
    "hero_image": "https://images.luxuryescapes.com/nrp2habk9ghqqigzgc2v",
    "image_two": "https://images.luxuryescapes.com/ob4u0yf3h9s3heknss57",
    "image_three": "https://images.luxuryescapes.com/6se1zfm06b34mirimbc",
    "vendor_name": "Essence Peregian Beach",
    "title": "Grand Opening: Sunshine Coast Three-Bedroom Designer Beach Houses 15 Minutes from Noosa with Two Resort-Style Pools",
    "description": "Be one of the first to experience bespoke beachside luxury in the heart of the Sunshine Coast, just 15 minutes from Noosa, in a boutique designer beach house at Essence Peregian Beach. This is the holiday escape you've been dreaming of - refined coastal design meets high-end resort living, where guests have access to two heated pools, one with an exclusive bar, all while staying in supreme luxury. Take a family holiday or plan your next group getaway with a collection of architecturally designed and chic three, four and five bedroom beach houses offering well-appointed kitchens, outdoor entertainment areas and even a private pool in select homes.\n\nWith a backdrop of Noosa’s verdant UNESCO-listed Biosphere Reserve, a short walk from the white sands of Peregian Beach and a 15-minute drive from Noosa's Hastings Street, this is laidback coastal living at its best. Every detail is finely curated, from signature bathroom products to private landscaped gardens. From the bespoke bar to the to-die-for decor, find comfort, ease and enjoyment hidden around every corner at this brand-new, exclusive resort.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Peregian Beach",
    "location_subheading": "Queensland",
    "location_description": "Essence Peregian Beach - Boutique Hotel & Holiday Homes",
    "offer_address": "1 Sunset Lane, Peregian Beach, Queensland 4573, Australia",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1179.0,
    "value": 2823.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMkd8AAD",
    "hero_image": "https://images.luxuryescapes.com/sgb0q7hqhb8p9u5df6jn",
    "image_two": "https://images.luxuryescapes.com/p5nzopvu08f8ygwi56im",
    "image_three": "https://images.luxuryescapes.com/uwjjy51fa4xttwjpxfk",
    "vendor_name": "Essence Peregian Beach",
    "title": "Grand Opening: Ultra-Chic Sunshine Coast Resort 15 Minutes from Noosa with Boutique Studios & Houses plus A$100 Dining Credit",
    "description": "Be one of the first to experience bespoke beachside luxury in the heart of the Sunshine Coast, just 15 minutes from Noosa, in a collection of brand-new boutique studios, apartments and designer beach houses at Essence Peregian Beach. This is the holiday escape you've been dreaming of: refined coastal design meets high-end resort living, where guests have access to two heated pools, one with an exclusive bar, all while staying in supreme luxury. Escape to a boutique studio with someone special, take a family holiday in a high-end two-bedroom apartment or plan your next group getaway with a collection of architecturally designed three-, four- and five-bedroom beach houses offering well-appointed kitchens, outdoor entertainment areas and even a private pool in select homes.\n\nWith a backdrop of Noosa’s verdant UNESCO-listed Biosphere Reserve, a short walk from the white sands of Peregian Beach and a 15-minute drive from Noosa's Hastings Street, this is laidback coastal living at its best. Every detail is finely curated, from signature bathroom products to specially designed bathrobes and minibars fully stocked with everything you need to create your perfect cocktail. From the bespoke bar to the to-die-for decor, find comfort, ease and enjoyment hidden around every corner at this brand-new, exclusive resort.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Peregian Beach",
    "location_subheading": "Queensland",
    "location_description": "Essence Peregian Beach - Boutique Hotel & Holiday Homes",
    "offer_address": "1 Sunset Lane, Peregian Beach, Queensland 4573, Australia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 426.0,
    "value": 1022.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DX954YAD",
    "hero_image": "https://images.luxuryescapes.com/pfd9c1qu5s4yk64rdq8e",
    "image_two": "https://images.luxuryescapes.com/nc8f8iq4bpwbbasaakk",
    "image_three": "https://images.luxuryescapes.com/rqr63kj1mat29j3977a",
    "vendor_name": "Essence Peregian Beach",
    "title": "Sunshine Coast Designer Beach Houses 15 Minutes from Noosa with Resort-Style Pools",
    "description": "Experience bespoke beachside luxury in the heart of the Sunshine Coast, just 15 minutes from Noosa, in a boutique designer beach house. This is the holiday escape you’ve been dreaming of - refined coastal design meets high-end resort living, where guests can access two heated pools, one with an exclusive bar, all while staying in supreme luxury.\n\nTake a family holiday or plan your next group getaway with a collection of architecturally designed and chic three-, four- and five-bedroom beach houses offering well-appointed kitchens, outdoor entertainment areas and a private pool in select homes. Every detail is finely curated, from signature bathroom products to private landscaped gardens.\n\nWith a backdrop of Noosa’s verdant UNESCO-listed Biosphere Reserve, a short walk from the white sands of Peregian Beach and a 15-minute drive from Noosa’s Hastings Street, this is laidback coastal living at its best.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Peregian Beach",
    "location_subheading": "Queensland",
    "location_description": "Essence Peregian Beach - Boutique Hotel & Holiday Homes",
    "offer_address": "1 Sunset Lane, Peregian Beach, Queensland 4573, Australia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 749.0,
    "value": 1770.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I8hnIAC",
    "hero_image": "https://images.luxuryescapes.com/kozb6utliehozrp3vtke",
    "image_two": "https://images.luxuryescapes.com/el5xn2lujmx782qc5ejs",
    "image_three": "https://images.luxuryescapes.com/5kmrtpzbj1g9fe9atcn",
    "vendor_name": "Glen Eden Beach Resort",
    "title": "Sunshine Coast Beachside Two- & Three-Bedroom Townhouses with Ocean Views & Direct Beach Access",
    "description": "Boasting easy access to the glistening Peregian Beach and a 10-minute drive to glamorous Noosa, these stylish townhouses are perfectly poised for coastal relaxation.\n\nYour two- or three-bedroom home is fitted with spacious, sun-soaked living areas, glorious ocean views, modern appliances and easy access to the wider resort facilities. Swim in the outdoor heated lap pool, cook up a storm in the communal BBQ area, relax in the sauna and go head-to-head in the games room.\n\nWhen you're not relaxing on the beach, walk into the bustling Peregian Village and wander the charming boutiques, stop for lunch at a cafe and join in on a yoga class, or take a short drive to Noosa for luxury shopping and more sparkling beaches.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Peregian Beach",
    "location_subheading": "Queensland",
    "location_description": "Glen Eden Beach Resort",
    "offer_address": "388 David Low Way, Peregian Beach, Queensland 4573, Australia",
    "percentage_discount": 39.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 679.0,
    "value": 1116.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FmMsoAAF",
    "hero_image": "https://images.luxuryescapes.com/94shi32e8dvz94ysfkb",
    "image_two": "https://images.luxuryescapes.com/h4x7nxpi9168oyya79r",
    "image_three": "https://images.luxuryescapes.com/hbrhww4r5atkxswkb98h",
    "vendor_name": "Essence Peregian Beach",
    "title": "Boutique Sunshine Coast Beach Escape 15 Minutes from Noosa with Two Resort-Style Pools",
    "description": "Experience bespoke beachside luxury in the heart of the Sunshine Coast, just 15 minutes from Noosa, in a designer beach house or studio at Essence Peregian Beach. Refined coastal design meets high-end resort living, where guests have access to two heated pools, one with an exclusive bar, all while staying in supreme luxury. With a backdrop of Noosa’s verdant UNESCO-listed Biosphere Reserve and mere meters from Peregian Beach, this is laidback coastal living at its best.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Sunshine Coast",
    "location_heading": "Peregian Beach",
    "location_subheading": "Sunshine Coast",
    "location_description": "Essence Peregian Beach",
    "offer_address": "215 David Low Way, Peregian Beach, QLD 4573, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 139.0,
    "value": 139.0
  }
]