[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FipuQAAR",
    "hero_image": "https://images.luxuryescapes.com/tb4cv4kjib9gqd7jzrc",
    "image_two": "https://images.luxuryescapes.com/ktyhc4a9ua4f16nitjh",
    "image_three": "https://images.luxuryescapes.com/fuqgff0vpj65wzr5oa2",
    "vendor_name": "COMO Cocoa Island",
    "title": "Award-Winning COMO Maldives Villa Luxury with Daily Breakfast, Nightly Dinner, Drinks & Speedboat Transfers",
    "description": "Escape to the Maldives and discover a slice of pure paradise at the five-star Como Cocoa Island resort, located on a secluded private island. Awake each morning to the gentle sounds of the endless Indian Ocean lapping the champagne shores and savour halcyon days filled with inimitable luxury. Experience authentic Maldivian beachside dining at Ufaa serving up fresh South Indian flavours in light curries, seafood and salads, before sipping exquisite cocktails at the beachfront Faru Bar. Spend evenings admiring spectacular sunsets from the comfort of your lavishly furnished overwater villa - exquisitely crafted to mimic the gentle curves of the local dhoni fishing boats.\n\nSoak in the magical blues of the sky and sea from this award-winning resort globally renowned for tremendous hospitality. This luxurious oasis celebrates relaxation and restoration with refined wellness treatments, a state-of-the-art fitness centre and romantic private dining. Each day brings adventure with exceptional snorkelling, restorative wellness activities and moving nature experiences, while evenings are spent with your toes in the sand as you marvel at the majesty of sun-soaked days turning to starlit nights.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Makunufushi",
    "location_heading": "Makunufushi",
    "location_subheading": "Maldives",
    "location_description": "COMO Cocoa Island",
    "offer_address": "Makunufushi, South Male Atoll 20109, Maldives",
    "percentage_discount": 54.0,
    "min_duration": 5,
    "max_duration": 23,
    "price": 4699.0,
    "value": 10184.0
  }
]