[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvJZqAAN",
    "hero_image": "https://images.luxuryescapes.com/rpyk3xx8iry8czoa2fu5",
    "image_two": "https://images.luxuryescapes.com/vxjz5mfmhke21lc3wwwj",
    "image_three": "https://images.luxuryescapes.com/zkkwh24o59bd5m89cuv",
    "vendor_name": "Villa Eden - The Private Retreat",
    "title": "North Italy Eco-Luxury Retreat with Fine Dining, Mountain-View Pool & Wellness Spa",
    "description": "Nestled in the Alpine town of Merano, Villa Eden is a historic 19th-century villa featuring just 25 suites inspired by the elegance of the Belle Époque. Surrounded by a sprawling, century-old park with majestic cedar trees and a serene lily-covered pond, this property has welcomed the likes of Barbara Streisand and Diego Maradona, earning its place as a member of the Leading Hotels of the World.\n\nThe resort is a masterpiece of holistic indulgence. The Marvel Spa provides bespoke wellness experiences with deep massages and nourishing treatments, while the innovative Tasting Room - helmed by culinary maestro Marcello Corrado - turns dining into a sensory journey. An organic garden, private park and spectacular pool make every moment an encounter with absolute luxury.\n\nPerched in the province of Bolzano, Villa Eden is an oasis of rejuvenation embraced by the majestic South Tyrolean peaks, rolling vineyards and the Adige Valley. Whether dining al fresco on the terrace, exploring the cultural treasures of Merano or wandering the two-hectare private park, its location is a carefully orchestrated symphony of natural beauty.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Trentino-Alto Adige",
    "offer_geo_area_level_2": "Merano",
    "location_heading": "Merano",
    "location_subheading": "Italy",
    "location_description": "Villa Eden - The Private Retreat",
    "offer_address": "Via Winkel 68/70, Merano, Bolzano 39012, Italy",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 496.0,
    "value": 496.0
  }
]