[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbpXnAAJ",
    "hero_image": "https://images.luxuryescapes.com/0xd40j0yjwdkfo7y1fm",
    "image_two": "https://images.luxuryescapes.com/8ae0dmyn3nx3ycfz3xz2",
    "image_three": "https://images.luxuryescapes.com/if244uecbvitxcs28ga",
    "vendor_name": "Tiwi Island Retreat",
    "title": "Northern Territory Off-Grid Tiwi Islands Paradise with All-Inclusive Dining, Free-Flow Drinks & Boat Adventure",
    "description": "Leave the tech gear at home and soak up all the shades of nature's beauty with this off-grid experience like no other. Tucked away on Bathurst Island, off the coast of the Northern Territory's mainland, this unique resort places you in the heart of an unspoilt tropical paradise teeming with Indigenous tradition and culture. Famed for its desert landscapes and home to a lifestyle that is entirely removed from modern influences, this beautiful destination will open your eyes to a nature-filled and community-centred way of life. Savour authentic ocean-to-plate cuisine curated by an award-winning chef with all-inclusive dining at the onsite restaurant and bar, and soak up the sun beside the pool before exploring all that this secluded haven has to offer.\n\nAppreciate the island's untouched beauty over scenic sunset canapes and cocktails each night, and switch off from the outside world as you huddle around a cosy beach bonfire. Explore the local estuary and wildlife with a guided boat adventure, discover the sprawling, serene beaches on the beach buggy ride included in your stay and try your hand at blue water fishing to experience true Tiwi culture.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Bathurst Island",
    "location_heading": "Tiwi Islands",
    "location_subheading": "Northern Territory",
    "location_description": "Tiwi Island Retreat",
    "offer_address": "Port Hurd, Bathurst Island, Northern Territory 0822, Australia",
    "percentage_discount": 24.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 1199.0,
    "value": 1584.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQocQAAT",
    "hero_image": "https://images.luxuryescapes.com/bd9ldcr3fhv2hwpd0t1b",
    "image_two": "https://images.luxuryescapes.com/e57sujays1krzr7og9",
    "image_three": "https://images.luxuryescapes.com/b26jua9y95fjf4hmhzkc",
    "vendor_name": "Tiwi Island Retreat",
    "title": "Off-Grid Tiwi Islands All-Inclusive Retreat with Picnic Buggy Tour",
    "description": "Leave the tech gear at home and soak up all the shades of nature's beauty at the secluded Tiwi Island Retreat. Tucked away on Bathurst Island, off the coast of the Northern Territory's mainland, this resort takes you off-grid and places you in the heart of a tropical paradise. Enjoy a picnic along spectacular Five Mile Beach, or join a fishing expedition in search of barramundi and golden snapper, then retire to your luxury accommodation and laze away the afternoon.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Bathurst Island",
    "location_heading": "Tiwi Islands",
    "location_subheading": "Northern Territory",
    "location_description": "Tiwi Island Retreat",
    "offer_address": "Port Hurd, Bathurst Island, Northern Territory 0822, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1634.0,
    "value": 1634.0
  }
]