[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LnouAAC",
    "hero_image": "https://images.luxuryescapes.com/q2tdfcq554et5qwa8mga",
    "image_two": "https://images.luxuryescapes.com/6xabncc1prdg6iy5uba",
    "image_three": "https://images.luxuryescapes.com/kf9mwgfdu915avl6le9",
    "vendor_name": "Staypineapple, An Artful Hotel, New York",
    "title": "Boutique Luxury in the Heart of Midtown Manhattan with Sparkling Wine",
    "description": "Discover the bright lights, bustling avenues and famed streets of New York City from the heart of Midtown Manhattan at Staypineapple, an Artful Hotel New York. This art-inspired hotel is only a few minutes walk to iconic landmarks including Grand Central Terminal, Central Park, Chelsea Markets, the High Line and the Empire State Building. Your stay includes daily Grab & Go breakfast (coffee and pastry), a welcome amenity featuring a bottle of sparkling wine and box of Godiva Truffles, daily hotel amenity fee, complimentary WiFi and guaranteed 2pm late checkout.\n\n⏱**Buy now, choose dates later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York County",
    "location_heading": "New York City",
    "location_subheading": "USA",
    "location_description": "Staypineapple, an Artful Hotel New York 2020",
    "offer_address": "337 W 36th St, New York, NY 10018",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 239.0,
    "value": 387.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eMV74QAG",
    "hero_image": "https://images.luxuryescapes.com/ghbwyma67tp3bs53xum0b",
    "image_two": "https://images.luxuryescapes.com/l22fp49zhhlp59ild1",
    "image_three": "https://images.luxuryescapes.com/f7a2nxvbav7q7ni4wy19",
    "vendor_name": "Hotel 50 Bowery New York",
    "title": "Stay in One of New York City's Top Hotels Right in the Heart of Downtown",
    "description": "Topping the New York City list in the 2019 Travel + Leisure World’s Best Awards, the views alone from the rooftop bar of Hotel 50 Bowery are worth the stay. Situated above the pulsing Bowery, within walking distance of SoHo and Lower East Side, you’ll experience the vibrancy of the world's most exciting city with a luxury stay in the heart of downtown Manhattan - a stone’s throw from street-spilling bars, bustling cafes, trendy galleries and iconic sights. This designer boutique stay includes daily buffet breakfast, a rooftop cocktail each, a guaranteed late 2pm checkout and an included resort amenity fee which gives guests access to daily morning coffee, Wi-Fi, fitness centre, local calls and more.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York County",
    "location_heading": "New York City",
    "location_subheading": "USA",
    "location_description": "Hotel 50 Bowery Dec 2019",
    "offer_address": "50 Bowery, New York, NY 10013, USA",
    "percentage_discount": 56.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 495.0,
    "value": 1137.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y1xukQAB",
    "hero_image": "https://images.luxuryescapes.com/usjvdav1rnhkazaefmkq",
    "image_two": "https://images.luxuryescapes.com/x5hsuud5fpojv16raxbt",
    "image_three": "https://images.luxuryescapes.com/kigrvdrwy5cx5crs17ta",
    "vendor_name": "Hotel 50 Bowery New York",
    "title": "Stay in one of New York City's Top Hotels with Nightly Rooftop Cocktails",
    "description": "Topping the New York City list in the 2018 Travel + Leisure World’s Best Awards, the views alone from the rooftop bar of Hotel 50 Bowery are worth the international flight. Situated above the pulsing Bowery in trendy Chinatown, you’ll experience the vibrancy of the liveliest city in the world with a luxury stay in the heart of New York City’s downtown Manhattan - a stone’s throw from street-spilling bars, bustling cafes, trendy galleries and iconic sights. This designer boutique stay includes three buffet or a la carte breakfasts, nightly rooftop cocktails boasting 180-degree views of the spectacular skyline, the resort amenity fee which gives guests access to daily morning coffee, Wi-Fi, fitness centre access, local calls and more.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York County",
    "location_heading": "New York City",
    "location_subheading": "USA",
    "location_description": "Hotel 50 Bowery - October 2018",
    "offer_address": "50 Bowery, New York, NY 10013, USA",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 928.0,
    "value": 2136.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DdvN7YAJ",
    "hero_image": "https://images.luxuryescapes.com/yg4zyngrthrrm7a71lao",
    "image_two": "https://images.luxuryescapes.com/ru61nnriuncm6p7sog25o",
    "image_three": "https://images.luxuryescapes.com/v81onqzvou5fh40n4h42",
    "vendor_name": "33 Hotel New York Seaport",
    "title": "NYC Boutique Seaport Escape with Daily Breakfast & Cocktails",
    "description": "Industrial chic meets nautical nostalgia at this hotel, emerging as one of Manhattan's most magnetic urban sanctuaries. Anchored in the Seaport District, this boutique retreat boasts breathtaking views of the East River and Brooklyn Bridge.\n\nWhen you need a break from The Big Apple's buzz, look no further than Urban Cove Society & Kitchen for elevated yet laid-back modern American cuisine, with global influences. End the night with an expertly crafted cocktail at The Alcove Bar & Lounge, before retreating to your private oasis - one of just 66 guest rooms and suites, some with private terraces.\n\nSituated where the Seaport's storied past meets the pulse of Manhattan, 33 Hotel is your ideal base for exploring New York’s waterfront and beyond. Just a 15-minute drive away is the trendy neighbourhood of Dumbo, where cobblestone streets lined with boutiques, high-end restaurants and art galleries await.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York City",
    "location_subheading": "United States",
    "location_description": "33 Hotel New York City Seaport",
    "offer_address": "33 Peck Slip, New York City, New York 10038, United States",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 19,
    "price": 659.0,
    "value": 2025.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjrsAAC",
    "hero_image": "https://images.luxuryescapes.com/ck8tk3488fur0841d15r",
    "image_two": "https://images.luxuryescapes.com/uizzgz31xgqcvi880l1g",
    "image_three": "https://images.luxuryescapes.com/o6borippinfpgz7gf8e",
    "vendor_name": "The Wagner Hotel",
    "title": "Stylish Manhattan Escape with Spectacular City Views & Daily Breakfast",
    "description": "Skip the Midtown madness and discover New York City from the tranquillity of Manhattan's Battery Park at The Wagner Hotel. This iconic neighbourhood sits at the southernmost tip of Manhattan, offering award-winning bars, an abundance of culinary venues and incredible harbour views - including vistas of the Statue of Liberty herself.\n\nEnjoy high-end contemporary luxury at its best with daily American breakfast, a welcome cocktail per person and a leisurely 2pm late checkout. Resort fees are included in your escape, offering complimentary Wi-Fi and 24-hour access to the state-of-the-art fitness centre.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York County",
    "location_heading": "New York City",
    "location_subheading": "USA",
    "location_description": "The Wagner Hotel 2018",
    "offer_address": "2 West St, New York, NY 10004, USA",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 539.0,
    "value": 1613.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GrdUAAS",
    "hero_image": "https://images.luxuryescapes.com/9snd6r3zzkma6ese8pl",
    "image_two": "https://images.luxuryescapes.com/7ksztaugphlmqa89op4c",
    "image_three": "https://images.luxuryescapes.com/xwn95vfv9dx5036vaoo",
    "vendor_name": "Hotel 50 Bowery New York",
    "title": "Award-Winning Boutique New York Stay in Downtown Manhattan with Rooftop Bar & Cocktails",
    "description": "Marvel at New York's striking skyline with a cocktail in hand at the designer Hotel 50 Bowery - a boutique New York retreat in the heart of Downtown Manhattan, crowned with a stylish rooftop terrace.\n\nStanding at the cultural crossroads of the city's iconic Lower East Side, this luxury launchpad captures the energy of NYC through its eclectic interiors and vibrant art collection. Each room and suite features striking interior design showcasing original art pieces, floor-to-ceiling windows that frame the bustling streets and ultra-plush bedding that ensures a restful night's sleep after a day of exploring. A favourite of travellers and locals alike, it's little wonder that the hotel was a recipient of a Tripadvisor Travellers' Choice Award - Best of the Best 2020.\n\nLocated in the vibrant Chinatown neighbourhood - only a stone’s throw from street-spilling bars, bustling cafes, trendy galleries and world-famous sights - and within walking distance of SoHo, Little Italy and Nolita, the Hotel 50 Bowery's enviable location makes exploring The Big Apple a breeze.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York City",
    "location_subheading": "USA",
    "location_description": "Hotel 50 Bowery",
    "offer_address": "50 Bowery, New York, NY 10013, USA",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 18,
    "price": 319.0,
    "value": 1070.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3Nr1QAF",
    "hero_image": "https://images.luxuryescapes.com/oevizbb5vi8qhgzt0bzl",
    "image_two": "https://images.luxuryescapes.com/ol8mfabo0cs5emurgevv",
    "image_three": "https://images.luxuryescapes.com/l0roswgicl6lsvnuplth",
    "vendor_name": "The Wagner Hotel",
    "title": "Statue of Liberty Views in Five-Star Manhattan Luxury with Nightly Cocktails and Daily Breakfast",
    "description": "Skip the Midtown madness and discover New York City from a new location - the Financial District. Quickly becoming the new capital of cool, this iconic Manhattan neighbourhood sits at the southernmost tip of the island; alongside award-winning bars, an abundance of culinary venues and incredible waterfront views - with vistas of the famed Lady Liberty herself. Enjoy high-end contemporary luxury at its best with a four or seven-night stay at The Wagner at the Battery and indulge in daily a la carte breakfast, nightly cocktails for two and much more.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York County",
    "location_heading": "New York City",
    "location_subheading": "USA",
    "location_description": "The Wagner Hotel 2018",
    "offer_address": "2 West St, New York, NY 10004, USA",
    "percentage_discount": 68.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 842.0,
    "value": 2647.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003HfixAAC",
    "hero_image": "https://images.luxuryescapes.com/0t4mdl2661etz9fkwf5",
    "image_two": "https://images.luxuryescapes.com/n02en0t5douhuzpwutn6",
    "image_three": "https://images.luxuryescapes.com/4gunjkqe1iz2ibjvx9",
    "vendor_name": "Minthouse at 70 Pine",
    "title": "Top-Rated New York Art Deco Elegance near Wall Street",
    "description": "Discover 1930s grandeur and Art Deco elegance in the architectural darling of New York City, the glamorous Mint House at 70 Pine. Elegantly refurbished, this stylish hotel pays homage to its 1932 roots as the Cities Service Building, the third-tallest building in the world at the time of its construction, and is only a short walk from Wall Street, the Statue of Liberty, and the Brooklyn Bridge.\n\nThis prestigious hotel is ranked among the top 1% worldwide on Tripadvisor and has featured in USA Today's list of '10 apartment hotels to make you feel right at home'. With Crown Shy restaurant at its centre - the hotel’s stylish vibes are complemented by facilities including the City Acres market, a 1,950 square meter fitness center, a full-length bowling alley, and a screening room to watch your favourite TV shows and movies. Meanwhile, Manhattan with its art, culture, restaurants, galleries, and a famed music scene that rivals any other, is just waiting to be explored.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York City",
    "location_subheading": "USA",
    "location_description": "Mint House at 70 Pine",
    "offer_address": "70 Pine St, New York, NY 10005, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 1083.0,
    "value": 1083.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lrlDAAQ",
    "hero_image": "https://images.luxuryescapes.com/nzvs3r8kto29aw6ulsfd",
    "image_two": "https://images.luxuryescapes.com/xpmr9uoi7wdbz2wkvfvk",
    "image_three": "https://images.luxuryescapes.com/r3pskv4b6q3qbqh3w75f",
    "vendor_name": "Smyth Tribeca",
    "title": "New York Ultra-Cool Loft-Style Escape in the Heart of Tribeca",
    "description": "The downtown area of Tribeca, stomping ground for effortlessly cool New Yorkers, is yours to experience with a stylish stay at the newly opened, loft-style Smyth Tribeca. This chic hotel opened its doors in 2021 and enjoys a superb location in a quiet residential area, just off the main thoroughfare. You'll be in easy reach of New York City's world-class restaurants, art galleries, designer boutiques, parks and cultural attractions. \n\nUnwind in minimalist spaces that offer a tranquil oasis away from the buzz of the city. Spend the time between exploring sweating it out at the shiny state-of-the-art gym, grabbing a bite to eat at the onsite restaurant or ordering a cosmopolitan at the glamorous lobby bar.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York City",
    "location_subheading": "USA",
    "location_description": "Smyth Tribeca",
    "offer_address": "85 W Broadway, New York, NY 10007, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 307.0,
    "value": 307.0
  }
]