[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gunw1AAB",
    "hero_image": "https://images.luxuryescapes.com/2oyfgthsjc71kqb3u5jw",
    "image_two": "https://images.luxuryescapes.com/7q10r94nzcrixa7x7ma",
    "image_three": "https://images.luxuryescapes.com/7iwyfo3gnzypxgojug",
    "vendor_name": "Green Island Resort",
    "title": "Queensland Green Island Private Eco-Retreat with Daily Breakfast, Nightly Drinks & Full-Day Great Barrier Reef Cruise",
    "description": "Dive into the underwater mysteries of the UNESCO World Heritage-listed Great Barrier Reef when you stay at Queensland's magnificent Green Island Resort. Just 45 minutes off the coast of balmy Cairns, this idyllic, eco-certified hideaway - accessible only by boat or helicopter - is draped in lush rainforest with a fringe of sun-kissed coastline. Cast away for a laidback retreat hidden on a millennia-year-old, jungle-clad coral cay - the only one of its kind within this precious marine park - and spend your days exploring the kaleidoscopic marine life shimmering beneath the largest coral reef system in the world, walking the nature trails covering the island or soaking up serenity on the resort's postcard-perfect beach.\n\nWhen you're not snorkelling or kayaking through Green Island's spectacularly blue waters, laze by the resort's mirage-like swimming pool or savour each glorious sunset as it falls beneath the verdant rainforest. Visit the resort's signature dining venue, Emeralds, for locally sourced plates showcasing the flavours of Australia, savour barista-made brews at Lite Bites, head to The Canopy Grill for informal lunchtime dining the whole family will enjoy or organise private beach dining to bring a flair of romance to your escape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Green Island",
    "location_heading": "Green Island",
    "location_subheading": "Queensland",
    "location_description": "Green Island Resort",
    "offer_address": "Green Island, Queensland 4871, Australia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 839.0,
    "value": 1802.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMkACAA1",
    "hero_image": "https://images.luxuryescapes.com/p4ubr11gamjwju2j461c",
    "image_two": "https://images.luxuryescapes.com/sj41h61vk7vwmxphp38q",
    "image_three": "https://images.luxuryescapes.com/6ca2njq0ip1xyk2yy1",
    "vendor_name": "Green Island Resort",
    "title": "Queensland Green Island Private Eco-Retreat with Daily Breakfast, Nightly Drinks & Full-Day Great Barrier Reef Cruise",
    "description": "Dive into the underwater mysteries of the UNESCO World Heritage-listed Great Barrier Reef when you stay at Queensland's magnificent Green Island. Just 45 minutes off the coast of balmy Cairns, this idyllic, eco-certified hideaway - accessible only by boat or helicopter - is draped in lush rainforest with a fringe of sun-kissed coastline. Cast away for a laidback retreat hidden on a millennia-year-old, jungle-clad coral cay - the only one of its kind within this precious marine park - and spend your days exploring the kaleidoscopic marine life shimmering beneath the largest coral reef system in the world, walking the nature trails covering the island or soaking up serenity on the resort's postcard-perfect beach.\n\nWhen you're not snorkelling or kayaking through Green Island's spectacularly blue waters, laze by the resort's mirage-like swimming pool or savour each glorious sunset as it falls beneath the verdant rainforest. Visit the resort's signature dining venue, Emeralds, for locally sourced plates showcasing the flavours of Australia, savour barista-made brews at Lite Bites, head to The Canopy Grill for informal lunchtime dining the whole family will enjoy or organise private beach dining to bring romantic flair to your escape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Green Island",
    "location_heading": "Green Island",
    "location_subheading": "Queensland",
    "location_description": "Green Island Resort",
    "offer_address": "Green Island, Queensland 4871, Australia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 839.0,
    "value": 1802.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007ozXhAAI",
    "hero_image": "https://images.luxuryescapes.com/rcjqdariiqepu1y8g6h",
    "image_two": "https://images.luxuryescapes.com/64jjul9jirphxqqbhgc",
    "image_three": "https://images.luxuryescapes.com/7sffaamn19jc116x5ih",
    "vendor_name": "Green Island Resort",
    "title": "Luxe Queensland Private Green Island Retreat with Full-Day Great Barrier Reef Cruise",
    "description": "Discover the vast underwater world of the UNESCO World Heritage-listed Great Barrier Reef when you escape to Queensland's luxurious Green Island Resort. Just 45 minutes off the coast of balmy Cairns, this idyllic, eco-certified hideaway is only accessible by boat or helicopter and draped in lush rainforest with a fringe of sun-kissed coastline. Cast away for a laid-back retreat hidden on a 6,000-year-old, rainforest-covered coral cay (the only one of its kind within this precious marine park). Spend your days exploring the kaleidoscopic marine life shimmering beneath the largest coral reef system in the world, walk the nature trails covering the island or simply laze on the postcard-perfect beach.\n\nWhen you're not making the most of your unique resort experience with use of the resort's snorkels, canoes and kayaks, retreat to your stylish room featuring a private balcony overlooking the verdant rainforest, laze by the two swimming pools or enjoy a cocktail at the poolside bar.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Green Island",
    "location_heading": "Green Island",
    "location_subheading": "Queensland",
    "location_description": "Green Island Resort - Sep 22",
    "offer_address": "Green Island QLD 4871",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 937.0,
    "value": 2039.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CsBduYAF",
    "hero_image": "https://images.luxuryescapes.com/zhlqj84szouldrielkul",
    "image_two": "https://images.luxuryescapes.com/0yc1gqbm36yccngngr",
    "image_three": "https://images.luxuryescapes.com/mtjquiw72r2dm9ne5sn9",
    "vendor_name": "Green Island Resort",
    "title": "Queensland Green Island Private Eco-Suites with Daily Breakfast, Drinks & Great Barrier Reef Cruise",
    "description": "Dive into the underwater mysteries of the UNESCO World Heritage-listed Great Barrier Reef when you stay at Queensland's magnificent Green Island. Just 45 minutes off the coast of balmy Cairns, this idyllic, eco-certified hideaway - accessible only by boat or helicopter - is draped in lush rainforest with a fringe of sun-kissed coastline.\n\nCast away for a laidback retreat hidden on a rainforest-clad coral cay - the only one of its kind within this precious marine park - and spend your days exploring the kaleidoscopic marine life shimmering beneath the largest coral reef system in the world, walking the nature trails covering the island or soaking up serenity on the resort's postcard-perfect beach.\n\nWhen you're not snorkelling or kayaking through Green Island's spectacularly blue waters, laze by the resort's mirage-like swimming pool or savour each glorious sunset as it falls beneath the verdant rainforest.\n\nVisit the resort's signature dining venue, Emeralds, for locally sourced plates showcasing the flavours of Australia, savour barista-made brews at Lite Bites, head to The Canopy Grill for informal lunchtime dining the whole family will enjoy or organise private beach dining to bring romantic flair to your escape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Green Island",
    "location_heading": "Green Island",
    "location_subheading": "Queensland",
    "location_description": "Green Island Resort",
    "offer_address": "Green Island, Queensland 4871, Australia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 769.0,
    "value": 1828.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006Q0vwAAC",
    "hero_image": "https://images.luxuryescapes.com/zdw13gih4kgwja7ioj6b",
    "image_two": "https://images.luxuryescapes.com/i25xe31i8i9z3wue1fm4",
    "image_three": "https://images.luxuryescapes.com/5jhq21iwxmeio2zzj0j",
    "vendor_name": "Green Island Resort",
    "title": "Luxe Green Island Retreat with Full-Day Great Barrier Reef Cruise",
    "description": "Discover the vast underwater world of the UNESCO World Heritage-listed Great Barrier Reef when you escape to Queensland's luxurious Green Island Resort. Just 45 minutes off the coast of balmy Cairns, this idyllic, eco-certified hideaway is only accessible by boat or helicopter and draped in lush rainforest with a fringe of sun-kissed coastline. Cast away for a laid-back retreat hidden on a 6,000-year-old, rainforest-covered coral cay (the only of its kind within this precious marine park). Spend your days exploring the kaleidoscopic marine life shimmering beneath the largest coral reef system in the world, walk the nature trails covering the island or simply laze on the postcard-perfect beach.\n\n**Your handpicked inclusions:**\n\n- Wake in paradise to an incredible daily breakfast\n- Dive into the Great Barrier Reef with a full-day cruise, snorkelling and onboard lunch\n- Roundtrip scheduled catamaran transfers from Cairns Reef Fleet Terminal\n- A$50 dining credit per suite to use at Emeralds Restaurant & Bar\n- Cheers to your escape with a nightly sunset drink per adult\n- Complimentary glass-bottom boat tour to see the wonders of the Great Barrier Reef\n- Complimentary use of snorkels, canoes, kayaks, windsurfing gear and more on selected days\n- Fish-feeding presentations on selected days throughout the week\n- 20% discount on any introductory or certified diving experiences\n- 25% discount on a 10-minute scenic helicopter flight\n\n**Travelling with family?** Up to two children (14 and under) stay free with all inclusions as per package purchased, including the full-day cruise to the Great Barrier Reef. Plus, children eat free from the kids' menu per adult purchasing a main meal from the à la carte menu at Emeralds Restaurant & Bar for dinner only. \n\n**Longer-stay bonus:** Extend your stay to 6+ nights to receive A$100 total dining credit for Emeralds Restaurant & Bar per package.\n\n**Please note**: Until further notice, catamaran transfers from Cairns to Green Island are subject to change on a monthly basis. See fine print for the latest schedule.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Green Island",
    "location_heading": "Green Island",
    "location_subheading": "Queensland",
    "location_description": "Green Island Resort - Sep 22",
    "offer_address": "Green Island QLD 4871",
    "percentage_discount": 61.0,
    "min_duration": 4,
    "max_duration": 10,
    "price": 929.0,
    "value": 2375.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cIlRLQA0",
    "hero_image": "https://images.luxuryescapes.com/uohvceinhhl6izhe3hug",
    "image_two": "https://images.luxuryescapes.com/8tf388pi1fd6xh3blqtr",
    "image_three": "https://images.luxuryescapes.com/z9uv4hgrqhmus7qnpdx",
    "vendor_name": "Green Island Resort",
    "title": "Island Paradise in the Heart of the Great Barrier Reef",
    "description": "Immerse yourself in the tropical playground of the Great Barrier Reef at Green Island Resort, located on a coral island on the Great Barrier Reef, just 45 minutes off the coast of Cairns. Explore one of the world's seven natural wonders staying in an Island Suite with daily breakfast, nightly sunset drinks, an AU$50 dining credit at the resort's restaurant, a Great Barrier Reef day tour for the whole family with on board meals included, a glass bottom boat trip, daily fish feeding presentations, guided nature walks, complimentary kayaking and snorkeling, scuba diving lesson discounts, return catamaran transfers from Cairns and more. Perfect for a family holiday like no others, as two kids aged 14 years and under stay, play and eat free!",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Cairns Regional",
    "location_heading": "Green Island",
    "location_subheading": "Queensland",
    "location_description": "Green Island Resort 2019",
    "offer_address": "Green Island, QLD",
    "percentage_discount": 62.0,
    "min_duration": 4,
    "max_duration": 8,
    "price": 953.0,
    "value": 2529.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DR2cTAAT",
    "hero_image": "https://images.luxuryescapes.com/ut51eq81bbdybf77nwge",
    "image_two": "https://images.luxuryescapes.com/wxo4dghp9nvj3vkq2v5",
    "image_three": "https://images.luxuryescapes.com/4cfavhsp77txwfeh1p7",
    "vendor_name": "Green Island Resort",
    "title": "Queensland Private Green Island Suite Eco-Retreat with Daily Breakfast, Nightly Drinks & Full-Day Great Barrier Reef Cruise",
    "description": "Dive into the underwater mysteries of the UNESCO World Heritage-listed Great Barrier Reef with a boutique suite stay at Queensland's magnificent Green Island Resort. Just 45 minutes off the coast of balmy Cairns, this idyllic, eco-certified hideaway is only accessible by boat or helicopter and draped in lush rainforest with a fringe of sun-kissed coastline. Cast away for a laidback retreat hidden on a millennia-year-old, jungle-clad coral cay - the only one of its kind within this precious marine park - and spend your days exploring the kaleidoscopic marine life shimmering beneath the largest coral reef system in the world, walking the nature trails covering the island or soaking up serenity on the resort's postcard-perfect beach.\n\nWhen you're not snorkelling or kayaking through Green Island's spectacularly blue waters, laze by the resort's two mirage-like swimming pools or savour each glorious sunset as it falls beneath the verdant rainforest. Visit the resort's signature dining venue, Emeralds Restaurant & Bar, for locally sourced plates showcasing the flavours of Australia, savour barista-made brews at The Cafe, head to The Canopy Grill for informal lunchtime dining the whole family will enjoy or organise private beach dining to bring a flair of romance to your escape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Green Island",
    "location_heading": "Green Island",
    "location_subheading": "Queensland",
    "location_description": "Green Island Resort",
    "offer_address": "Green Island, Queensland 4871, Australia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 825.0,
    "value": 1823.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxOuAQAV",
    "hero_image": "https://images.luxuryescapes.com/qwq7qfniobrcnlvwu4fd",
    "image_two": "https://images.luxuryescapes.com/d4ahgvf6ogrvb6pql4o2",
    "image_three": "https://images.luxuryescapes.com/dwvmlst7jtqtdpicckah",
    "vendor_name": "Green Island Resort",
    "title": "Island Paradise in the Heart of the Great Barrier Reef",
    "description": "Immerse yourself in the tropical playground of the Great Barrier Reef at Green Island Resort, located on a coral island on the Great Barrier Reef, just 45 minutes off the coast of Cairns. Explore one of the world's seven natural wonders staying in an Island Suite with daily breakfast, nightly sunset drinks, a $50 dining credit at the resort's restaurant, a Great Barrier Reef day tour for the whole family with on board meals included, a glass bottom boat trip, daily fish feeding presentations, guided nature walks, complimentary kayaking and snorkeling, scuba diving lesson discounts, return catamaran transfers from Cairns and more. Perfect for a family holiday like no others, as two kids aged 14 years and under stay, play and eat free!",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Cairns Regional",
    "location_heading": "Green Island",
    "location_subheading": "Queensland",
    "location_description": "Green Island Resort - 2018",
    "offer_address": "Green Island, QLD",
    "percentage_discount": 60.0,
    "min_duration": 4,
    "max_duration": 8,
    "price": 959.0,
    "value": 2381.0
  }
]