[
  {
    "link": "https://luxuryescapes.com/offer/0062y000003dSiFAAU",
    "hero_image": "https://images.luxuryescapes.com/yb19y77bwmpt3xiwdj3g",
    "image_two": "https://images.luxuryescapes.com/bo4ojyufpusavewc4xjg",
    "image_three": "https://images.luxuryescapes.com/ccb06cj6es2lltgevhpo",
    "vendor_name": "Lotte Hotel Moscow",
    "title": "Award-Winning Five-Star Central Moscow Luxury with 24-Hour Butler Service & Wellness Facilities",
    "description": "Discover the unique allure of Russia's vibrant capital from the unparalleled luxury of Lotte Hotel Moscow. A Leading Hotels of the World member, this five-star architectural beauty sits pretty on Novinskiy Boulevard, just a short drive from the Red Square and Moscow Kremlin. These iconic attractions and many more - including the colourful St. Basil's Cathedral, Bolshoi Theatre and Lenin's Mausoleum - are all within easy reach of the hotel, whether by metro, foot or cab ride.\n\nLotte Hotel Moscow's 300 rooms and suites are designed with the discerning traveller in mind and offer some of the most spacious accommodation in the city. Consistently rated among the top hotels in Moscow and winner of a Tripadvisor Travellers' Choice 2020 award, this inner-city sanctuary satisfies foodies with its distinctive onsite dining outlets - MENU Breakfast Restaurant, contemporary Italian eatery OVO, Japanese fusion experience MEGUmi and The Lounge, a modern bar serving handcrafted premium drinks. \n\nRejuvenate after a day in the city with the hotel's wellness facilities, including Mandara Spa, a state-of-the-art fitness centre and 21-metre swimming pool. Then, retire to your luxurious room or suite, knowing your personal butler is on hand 24/7 to fulfil any requests, from helping you make a dinner reservation to serving drinks.",
    "offer_country_name": "Russian Federation",
    "offer_country_code_alpha_2": "RU",
    "offer_geo_area_level_1": "Moscow",
    "offer_geo_area_level_2": "Moscow",
    "location_heading": "Moscow",
    "location_subheading": "Russia",
    "location_description": "Lotte Hotel Moscow",
    "offer_address": "Novinskiy Boulevard, 8, Стр. 2, Moskva, Russia, 121099",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 22,
    "price": null,
    "value": null
  }
]