[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvqwAAAR",
    "hero_image": "https://images.luxuryescapes.com/gq67r2c2bmbnnc3cumt",
    "image_two": "https://images.luxuryescapes.com/nci7zluutzst61d0bn",
    "image_three": "https://images.luxuryescapes.com/g3w71xeowfaterd461w",
    "vendor_name": "Atzavara Hotel",
    "title": "Five-Star Costa Brava Beachfront Escape near Barcelona with Rooftop Pool Club & Daily Breakfast",
    "description": "Escape the city bustle and bask in the Mediterranean sun at this five-star resort and luxury spa near Barcelona. Perched along the captivating Costa Brava shoreline, this beachfront haven is perfectly located to explore nearby villages and pristine beaches. When you're not lounging by one of the hotel's six pools or enjoying a rejuvenating treatment at the onsite spa, savour local flavours at one of four onsite restaurants including Bamboo Pool Club & Restaurant. With a dreamy terrace and infinity pool overlooking the Mediterranean Sea, it's the perfect option before a drink alongside live shows and music at the Verbena Theatre Club.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalonia",
    "offer_geo_area_level_2": "Santa Susanna",
    "location_heading": "Costa Brava",
    "location_subheading": "Spain",
    "location_description": "Atzavara Hotel & Spa",
    "offer_address": "16 Carrer del Pla de la Torre, Santa Susanna, Barcelona 08398, Spain",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 399.0,
    "value": 1598.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gw3rFAAR",
    "hero_image": "https://images.luxuryescapes.com/wmusp8j8pc1u6z4td3g",
    "image_two": "https://images.luxuryescapes.com/y799mjxkdnl3otl7ss",
    "image_three": "https://images.luxuryescapes.com/tosxojh5ki4t1u7m3kq5",
    "vendor_name": "The 15th boutique hotel",
    "title": "Boutique Costa Brava Escape near Barcelona with Daily Breakfast & Nightly Dinner",
    "description": "Experience the magic of Costa Brava with an idyllic stay at The 15th Boutique Hotel, a chic sanctuary nestled in the heart of Lloret de Mar, moments from the golden sands of Lloret Beach. Pastel hues and sun-soaked spaces set the tone in this eco-friendly boutique hotel, encouraging guests to soak up every second of their escape through slow travel. Savour Mediterranean cuisine at the onsite restaurant or sip on a refreshing cocktail at the bar; take a dip in the sparkling outdoor pool or curl up with a book on a sun lounger. Should you fancy venturing outside, soak up the captivating Renaissance sights at the Santa Clotilde Gardens, beach hop in peace or explore further afield, with Barcelona just an hour's drive away.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalonia",
    "offer_geo_area_level_2": "Lloret de Mar",
    "location_heading": "Costa Brava",
    "location_subheading": "Spain",
    "location_description": "The 15th Boutique Hotel",
    "offer_address": "Carrer de Vicenç Bou 15, Lloret de Mar, Girona 17310, Spain",
    "percentage_discount": 70.0,
    "min_duration": 4,
    "max_duration": 21,
    "price": 289.0,
    "value": 979.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMVxHAAX",
    "hero_image": "https://images.luxuryescapes.com/wgm3xx4kwwowrlq55bb",
    "image_two": "https://images.luxuryescapes.com/uo7b2kk4se3qv4lrin",
    "image_three": "https://images.luxuryescapes.com/8gptzq0eso6l5fiz472",
    "vendor_name": "AQUA Hotel Promenade & Spa",
    "title": "Grand Opening: Beachfront Costa Brava Retreat near Barcelona with Daily Breakfast & Cocktails",
    "description": "Perched along the picturesque Costa Brava just north of Barcelona, this brand-new hotel offers the ideal seaside escape, with the Mediterranean Sea and Catalonia's verdant countryside as the backdrop. \n\nOpened in May 2024, this vibrant resort offers easy access to watersports and nature activities, along with deluxe onsite facilities. Indulge in sumptuous Italian at MALA PEKORA Pizzeria & Trattoria, unwind with a cocktail in hand at the trendy Coffee Bar, or enjoy the main restaurant's sunny terrace overlooking the sparkling pool. \n\nBe one of the first to stop by the new Wellness & Spa, boasting its own pool, sauna and steam room, before soaking up the sun by the outdoor pool. When you're ready to explore the Costa Brava and all it has to offer, spend the day beach hopping or visit one of the nearby towns, such as popular Tossa de Mar.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalonia",
    "offer_geo_area_level_2": "Pineda de Mar",
    "location_heading": "Costa Brava",
    "location_subheading": "Spain",
    "location_description": "AQUA Hotel Promenade & Spa",
    "offer_address": "Passeig Marítim 7, 08397 Pineda de Mar, Barcelona, Spain",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 209.0,
    "value": 661.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FUyvlYAD",
    "hero_image": "https://images.luxuryescapes.com/vpa0ie9unkm8vi4n33x",
    "image_two": "https://images.luxuryescapes.com/1ru7fi4h9bl97aoi8w8",
    "image_three": "https://images.luxuryescapes.com/2udeza67bkgp9pliuaaa",
    "vendor_name": "Elisabeth by the Sea",
    "title": "Grand Opening: Seaside Spanish Serenity 60 Minutes from Barcelona with Daily Breakfast",
    "description": "Live out your Mediterranean dreams at this five-star retreat, perched along northern Spain's breathtaking Costa Brava coastline. Situated between rugged cliffs and azure waters, this boutique haven offers panoramic sea views throughout, blurring the line between indoor comfort and coastal paradise.\n\nSteps from medieval streets and golden sands, Elisabeth by the Sea Hotel is an intimate gateway to Costa Brava's magic. Dive into the rooftop pool suspended between sky and sea, or indulge in an afternoon cocktail at Pique Nique rooftop bar. Whether strolling through cobbled streets or soaking up the Spanish sun, your Mediterranean adventure starts here.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalonia",
    "offer_geo_area_level_2": "Tossa de Mar",
    "location_heading": "Costa Brava",
    "location_subheading": "Spain",
    "location_description": "Elisabeth by the Sea Hotel",
    "offer_address": "53 Passeig Mossen Cinto Verdaguer, Tossa de Mar, Girona, Catalunya 17320, Spain",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 19,
    "price": 519.0,
    "value": 1420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I3O0IAK",
    "hero_image": "https://images.luxuryescapes.com/59pkmf18pjana50uy6ld",
    "image_two": "https://images.luxuryescapes.com/yics7ip64n6ba53voyfd",
    "image_three": "https://images.luxuryescapes.com/86t7ahwi4qyayvpc1pek",
    "vendor_name": "Atzavara Hotel",
    "title": "Costa Brava Five-Star Beach Escape with Rooftop Pool Club, Room Upgrade & Daily Breakfast",
    "description": "Escape the city bustle and bask in the Mediterranean sun at this five-star resort and luxury spa. Perched along the captivating Costa Brava shoreline, this beachfront haven is perfectly located to explore nearby villages and pristine beaches.\n\nWhen you’re not lounging by one of the hotel’s six pools or enjoying a rejuvenating treatment at the onsite spa, savour local flavours at one of four onsite restaurants, including Bamboo Pool Club & Restaurant. With a dreamy terrace and infinity pool overlooking the Mediterranean Sea, it’s the perfect option before a drink alongside live shows and music at the Verbena Theatre Club.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalonia",
    "offer_geo_area_level_2": "Santa Susanna",
    "location_heading": "Costa Brava",
    "location_subheading": "Spain",
    "location_description": "Atzavara Hotel & Spa",
    "offer_address": "16 Carrer del Pla de la Torre, Santa Susanna, Barcelona 08398, Spain",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 329.0,
    "value": 1028.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdKyFAAV",
    "hero_image": "https://images.luxuryescapes.com/fgb0xa63fmhez4bh5c6",
    "image_two": "https://images.luxuryescapes.com/479x1a41sr5nswbg1th7",
    "image_three": "https://images.luxuryescapes.com/jv36xlwpbdbs6zmrnjn",
    "vendor_name": "Hotel Peralada Wine Spa & Golf",
    "title": "Five-Star Golf Retreat in Costa Brava with Daily Breakfast & Wine Spa Therapy",
    "description": "Escape to Spain's Costa Brava and embrace a new type of healthy hedonism at this five-star retreat within two hours of Barcelona. Spend your days teeing off at the Peraleda Golf Club, sipping on Spanish wines at the Peralada Winery or luxuriating in the Wine Spa, with treatments inspired by the surrounding vineyards. Come evening, choose between various dining options, including the Michelin-starred Castell Peralada Restaurant.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalonia",
    "offer_geo_area_level_2": "Perelada",
    "location_heading": "Costa Brava",
    "location_subheading": "Spain",
    "location_description": "Hotel Peralada Wine Spa & Golf",
    "offer_address": "Rocabertí, S/N, Perlada, Girona 17491, Spain",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 499.0,
    "value": 926.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GDezLYAT",
    "hero_image": "https://images.luxuryescapes.com/g8takmrjxsm4g1kgcgln",
    "image_two": "https://images.luxuryescapes.com/8xj9xynhlcla90u8x9f6",
    "image_three": "https://images.luxuryescapes.com/eopoy5c8gbm4i66c5pc",
    "vendor_name": "The 15th boutique hotel",
    "title": "Costa Brava Boutique Hideaway near Barcelona with Daily Breakfast & Nightly Dinner",
    "description": "Uncover Spain's picturesque Costa Brava with an idyllic stay at this chic sanctuary nestled in the heart of Lloret de Mar, moments from golden sands and aquamarine waters. Pastel hues and sun-soaked spaces set the tone in this eco-friendly retreat, encouraging guests to soak up every second of their escape and embrace slow travel.\n\nSavour Mediterranean cuisine at the stylish restaurant or sip on cocktails at the bar before dipping into the sparkling pool or curling up on a sun lounger. Beyond your trendy coastal haven, soak up the captivating Renaissance sights at the Gardens of Santa Clotilde, hop between Costa Brava's secluded beaches and coves, or explore further afield, with Barcelona just an hour away.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalonia",
    "offer_geo_area_level_2": "Lloret de Mar",
    "location_heading": "Costa Brava",
    "location_subheading": "Spain",
    "location_description": "The 15th Boutique Hotel",
    "offer_address": "Carrer de Vicenç Bou 15, Lloret de Mar, Girona 17310, Spain",
    "percentage_discount": 69.0,
    "min_duration": 4,
    "max_duration": 21,
    "price": 389.0,
    "value": 1242.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006Q5VuAAK",
    "hero_image": "https://images.luxuryescapes.com/6pvuqc0k26prohr1iq5i",
    "image_two": "https://images.luxuryescapes.com/vhqxjy5fbg0a0ptwkul7",
    "image_three": "https://images.luxuryescapes.com/9timk6phfp5df9ly21",
    "vendor_name": "Hostal de La Gavina",
    "title": "Spain Five-Star Oceanfront Luxury in the Heart of Costa Brava",
    "description": "Escape to the sun-kissed Costa Brava for a luxurious stay at Hostal de La Gavina, an elegant private estate sandwiched between pristine beaches and rolling waves at the tip of a picturesque peninsula. Featuring a collection of beautifully appointed rooms and suites offering blissful garden and ocean views, this Spanish sanctuary is the epitome of opulence - confirmed by its status as a Leading Hotels of the World member. Swing into your stay with a hit on the tennis court, choose from a range of beauty treatments at the lavish spa with hammam and hot tub, or take in the lovely landscaped gardens and sweeping ocean views from the outdoor pool.\n\nSpend days strolling the beautiful Costa Brava, filling your time with visits to Salvador Dalí House Museum, the stunning Cathedral of Girona or tranquil Jardins de Santa Clotilde. When it's time to dine, head back to the hotel and enjoy a snack at the poolside Garbí restaurant or dinner at the romantic Candlelight, featuring an intimate terrace. Located only 100 metres from the gorgeous shores of S'Agaro Beach, this oceanfront oasis has everything you need for a relaxing stay.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalonia",
    "offer_geo_area_level_2": "Castell-Platja d'Aro",
    "location_heading": "Costa Brava",
    "location_subheading": "Spain",
    "location_description": "Hostal de La Gavina",
    "offer_address": "Pza. Rosaleda, s/n, 17248 S'Agaró, Girona, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 367.0,
    "value": 367.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006RJngAAG",
    "hero_image": "https://images.luxuryescapes.com/gp4qv20sr443pw6mc7i",
    "image_two": "https://images.luxuryescapes.com/m7g81nu9qdv49xjfhh",
    "image_three": "https://images.luxuryescapes.com/6t8ajpivlxmvzcrd3gux",
    "vendor_name": "Hotel Empordà Golf",
    "title": "Spain Luxury Golf Escape in the Heart of Costa Brava",
    "description": "Swing into a luxurious stay at Hotel Terraverda, a breathtaking retreat tucked between two of the Costa Brava's best golf courses - Empordà Links and Empordà Forest - and moments from some of Spain's top beaches and medieval towns.\n\nBordered by a verdant landscape of mountain-backed countryside and rolling dunes, this stylish property is ideal for golfing aficionados and those seeking respite from the modern world without forgoing its comforts. From open-air concerts and sunset DJs to yoga classes and cheese tastings, the resort has it all; including two exceptional restaurants offering charcoal-grilled dishes and flexi-vegan cuisine, a sun-kissed outdoor pool and in-house masseuses. When you're not taking advantage of the two championship golf courses on your doorstep, take a scenic five-minute drive to Costa Brava's golden coastline for a kitesurfing or sailing lesson, or simply soak up the Spanish rays with your toes in the turquoise waves.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalonia",
    "offer_geo_area_level_2": "Gualta",
    "location_heading": "Costa Brava",
    "location_subheading": "Spain",
    "location_description": "Hotel Terraverda",
    "offer_address": "Crtra. de Torroella de Montgrí a Palafrugell, km 345, 17257 Gualta, Girona, Spain",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JGpLAAW",
    "hero_image": "https://images.luxuryescapes.com/zzkh4qo6xfonj6cqm82r",
    "image_two": "https://images.luxuryescapes.com/3lv6jn8opmnm4w56jio",
    "image_three": "https://images.luxuryescapes.com/ffevsgo7w075v908c",
    "vendor_name": "Hotel El Convent Begur",
    "title": "Spain Boutique 17th-Century Costa Brava Stay in a Former Convent",
    "description": "Find yourself surrounded by towering pines and blissful gardens when you escape to Hotel El Convent, a beautifully restored 17th-century Spanish convent located moments from the golden shores of the Costa Brava ranked within the top 10% of properties on Tripadvisor.\n\n One of the area's best-kept secrets, this charming retreat features a unique collection of elegantly appointed rooms, a sunlit swimming pool set among extensive private gardens, and the Mediterranean-inspired La Rectoria restaurant. Dine on a seasonal menu showcasing fresh seafood and organic vegetables sourced from local farmers, and sip delicious Empordà wines without even leaving your boutique hotel. A truly relaxing stay awaits in this quaint corner of Costa Brava. When you're not enjoying the serenity of the landscaped grounds, you can take the five-minute drive to the golden sands of Platja de Sa Riera, stroll through Begur's charming medieval villages, or swing into your escape with a round at one of the region's top golf courses.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Catalonia",
    "offer_geo_area_level_2": "Girona",
    "location_heading": "Costa Brava",
    "location_subheading": "Spain",
    "location_description": "Hotel El Convent",
    "offer_address": "Passatge Racó, 2, 17255 Begur, Girona, Spain",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]