[
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GMNNAA4",
    "hero_image": "https://images.luxuryescapes.com/z0a8xhasz56q085gva",
    "image_two": "https://images.luxuryescapes.com/1qbnd8tzw9l81emfwe1o",
    "image_three": "https://images.luxuryescapes.com/rp2n0qetg3bkepy51pb",
    "vendor_name": "Torre del Marqués",
    "title": "Five-Star Spanish Countryside Retreat",
    "description": "Right in the heart of Spain's Monroyo countryside, surrounded by rolling hills dotted by vineyards and olive trees, lies the luxurious Torre del Marqués, part of the Small Luxury Hotels of the World collection. Promising guests a serene escape from the hustle and bustle of busy Spanish cities, Torre del Marqués in Teruel sits amid one of the country’s most untouched rural regions, two hours' drive east of Barcelona. Housed in a beautifully restored 18th-century tower, overlooking the verdant hills, the hotel offers a collection of just 18 minimalist rooms - making this a hidden retreat for those in the know, surrounded by nature.\n\nContemporary, elegant and eco-conscious, the hotel boasts luxurious rooms and exquisite facilities, including a sauna and jacuzzi, and a light-filled restaurant offering Mediterranean fare crafted only with local, organic produce. When you can tear yourself away from the hotel's blissful swimming pool, the Spanish countryside is yours to explore: from olive oil tasting to horse riding, the possibilities are endless in beautiful Monroyo.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Aragon",
    "offer_geo_area_level_2": "Monroyo",
    "location_heading": "Teruel",
    "location_subheading": "Spain",
    "location_description": "Torre del Marqués",
    "offer_address": "Carretera Fuentespalda a Ráfales, Km 2,2 Paraje Torre del Marqués de, 44652, Teruel, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 303.0,
    "value": 303.0
  }
]