[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CuywAAC",
    "hero_image": "https://images.luxuryescapes.com/v0o9u412iq6lwt6ti3m9",
    "image_two": "https://images.luxuryescapes.com/kobq24x24fjetssbtvn",
    "image_three": "https://images.luxuryescapes.com/f8a7rjs56l2mmtax2gq",
    "vendor_name": "Taumeasina Island Resort",
    "title": "Secluded Samoa Private Island Retreat with Massages, Fia Fia Dining Experience, Daily Breakfast & Nightly Cocktails",
    "description": "Do as much or as little as you like at the idyllic Taumeasina Island Resort, a private island paradise conveniently connected to Samoa's capital, Apia. Breathtaking views of the surrounding turquoise lagoon, Pacific Ocean and Upolu mountains await, and the private white sand beaches provide the perfect spot to recharge and disconnect from the everyday. Families or couples can indulge at one of three restaurants onsite, take a dip in the cascading swimming pool, enjoy a moment of bliss at the Fofo Spa & Sauna or be immersed in Polynesian culture with traditional fire-dancing evenings.\n\nWhen you're ready to explore beyond the resort, visit Moata'a Village, go in search of Samoa's refreshing waterfalls and unrivalled spots, or set your sights on the To-Sua Ocean Trench, a picturesque swimming hole trimmed with verdant greenery on the southeast coast of Upolo Island.",
    "offer_country_name": "Samoa",
    "offer_country_code_alpha_2": "WS",
    "offer_geo_area_level_1": "Tuamasaga",
    "offer_geo_area_level_2": "Apia",
    "location_heading": "Taumeasina Island",
    "location_subheading": "Samoa",
    "location_description": "Taumeasina Island Resort",
    "offer_address": "Matautu St, Apia, Samoa",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 971.0,
    "value": 2449.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HPsaAAG",
    "hero_image": "https://images.luxuryescapes.com/dsfrklrporsxuq8ls1k",
    "image_two": "https://images.luxuryescapes.com/dbvv3cufvs17deq9j54q",
    "image_three": "https://images.luxuryescapes.com/1pca4mn9r9sp0dlcsjtp",
    "vendor_name": "Taumeasina Island Resort",
    "title": "Secluded Samoa Private Island Escape with Decadent Dining & Massages",
    "description": "Escape it all and embrace the tropical paradise of Samoa, a jewel in the Pacific Ocean. Soak up breathtaking mountain and ocean views from Taumeasina Island Resort, nestled on its own private island, just off the coast of the mainland - only a five-minute drive from the vibrant capital of Apia.\n\nIndulge at one of three restaurants onsite, take a dip in the cascading swimming pool, treat yourself at Fofo Spa & Sauna and immerse yourself in Polynesian culture with traditional fire-dancing evenings. When you're ready to explore beyond the resort, go in search of Samoa's waterfalls and the To-Sua Ocean Trench, a picturesque swimming hole trimmed with verdant greenery on the southeast coast of Upolo Island.\n\n**Your handpicked inclusions:**\n\n- Fuel up for a fun-filled day with daily breakfast at Lapita Restaurant\n- Embark on a delicious culinary adventure with one poolside lunch for two\n- Enjoy a one-time romantic two-course dinner for two\n- Celebrate with a special one-time buffet dinner and fiafia fire dance show for two\n- Let yourself truly indulge with one delicious buffet dinner for two\n- Transcend into total bliss with eight relaxing 30-minute massages per package\n- Toast your stay with a daily cocktail or beer per adult at Sunset Bar\n- Arrive in style with roundtrip airport transfers\n- Stay connected with unlimited Wi-Fi for up to three devices\n\n**Travelling with family?** Select a Double Room with two double beds, and up to two children (11 years and under) stay free, with daily breakfast and transfers included.\n\n**Need more room?** The Waterfront Two-Bedroom Villa package for four guests is perfect for groups. Enjoy direct access to the resort’s private beach, a fully equipped kitchen, two bedrooms, one bathroom, a living room and private balcony overlooking the lagoon and mountains of Upolu Island.\n\n**Book with 100% Confidence:** If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Samoa",
    "offer_country_code_alpha_2": "WS",
    "offer_geo_area_level_1": "Tuamasaga",
    "offer_geo_area_level_2": "Apia",
    "location_heading": "Taumeasina Island",
    "location_subheading": "Samoa",
    "location_description": "Taumeasina Island Resort",
    "offer_address": "Matautu St, Apia, Samoa",
    "percentage_discount": 69.0,
    "min_duration": 5,
    "max_duration": 12,
    "price": 829.0,
    "value": 2637.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R9GM6QAN",
    "hero_image": "https://images.luxuryescapes.com/l0i7lo778ieg9zb45rt",
    "image_two": "https://images.luxuryescapes.com/c8qof3lx4ohi6zs09n4vb",
    "image_three": "https://images.luxuryescapes.com/pb2j8h63emd7srrpduxp",
    "vendor_name": "Taumeasina Island Resort",
    "title": "Secluded Island Oasis with Luxurious Massages and Dining Experiences",
    "description": "A tropical paradise awaits at Taumeasina Island Resort, Samoa’s only island resort. Located on a turquoise lagoon the resort boasts a private beach while only being a five-minute drive from the vibrant capital of Apia. Reaching paradise is easy thanks to included airport transfers, plus you'll enjoy daily breakfast, an exotic Samoan dining experience, one buffet dinner, two 30-minute massages each and a daily house cocktail per adult. Two children aged 11 years and under stay free with complimentary transfers and breakfast!",
    "offer_country_name": "Samoa",
    "offer_country_code_alpha_2": "WS",
    "offer_geo_area_level_1": "Tuamasaga",
    "offer_geo_area_level_2": "",
    "location_heading": "Taumeasina Island",
    "location_subheading": "Samoa",
    "location_description": "Taumeasina Island Resort - 2019",
    "offer_address": "Matautu St, Apia, Samoa",
    "percentage_discount": 58.0,
    "min_duration": 6,
    "max_duration": 8,
    "price": 983.0,
    "value": 2318.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eKdFmQAK",
    "hero_image": "https://images.luxuryescapes.com/2cz54y0e67y439xub3bf",
    "image_two": "https://images.luxuryescapes.com/742tz8ltywpccojn418",
    "image_three": "https://images.luxuryescapes.com/6zf0zst2gl07xo1uzytx",
    "vendor_name": "Taumeasina Island Resort",
    "title": "Secluded Samoa Island Oasis with Indulgent Dining & Massages",
    "description": "Escape it all and embrace the tropical paradise of Samoa, a jewel in the Pacific Ocean. Soak up breathtaking mountain and ocean views from Taumeasina Island Resort, nestled on its own island with a private beach just off the coast of the mainland - and only a five-minute drive from the vibrant capital of Apia.\n\nEnjoy incredible dining including daily breakfast, a poolside lunch, a romantic two-course dinner, two buffet dinners (one with a Fia Fia fire dance performance), plus eight relaxing 30-minute massages to share, convenient return airport transfers, a daily cocktail or beer each and more.\n\n**Travelling with family?** Two children aged 11 years and under stay free with daily breakfast and transfers (see Fine Print for details). This deal has no surcharges, travel freely when it suits you.",
    "offer_country_name": "Samoa",
    "offer_country_code_alpha_2": "WS",
    "offer_geo_area_level_1": "Tuamasaga",
    "offer_geo_area_level_2": "",
    "location_heading": "Taumeasina Island",
    "location_subheading": "Samoa",
    "location_description": "Taumeasina Island Resort - 2020",
    "offer_address": "Matautu St, Apia, Samoa",
    "percentage_discount": 66.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 779.0,
    "value": 2321.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4UhBAAV",
    "hero_image": "https://images.luxuryescapes.com/nikpfdr7nwnjv4x36htp",
    "image_two": "",
    "image_three": "",
    "vendor_name": "Taumeasina Island Resort",
    "title": "Taumeasina Island Resort LPC",
    "description": "x",
    "offer_country_name": "Samoa",
    "offer_country_code_alpha_2": "WS",
    "offer_geo_area_level_1": "Tuamasaga",
    "offer_geo_area_level_2": "Apia",
    "location_heading": "Taumeasina Island",
    "location_subheading": "Samoa",
    "location_description": "Taumeasina Island Resort",
    "offer_address": "Matautu St, Apia, Samoa",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]