[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009FMBRAA4",
    "hero_image": "https://images.luxuryescapes.com/4o2pf15ax9f0x14zo3xq",
    "image_two": "https://images.luxuryescapes.com/567tnev8vduise5mk51uo",
    "image_three": "https://images.luxuryescapes.com/r8gxegebfc042yoa2hmh",
    "vendor_name": "Pulau Private Charters",
    "title": "Bali Private Yacht Charter Experience for up to 10 Guests with Seafood BBQ Lunch",
    "description": "Island-hopping through Indonesia's endless emerald jewels on a private yacht was once a pastime reserved for the select few - now, you too can experience the ultimate in sailing luxury with a four-hour voyage onboard the 22-metre dual hull cruise catamaran Haruku for up to 10 guests. Escape the hustle and bustle and be the captain of your own adventure: kick back and take in the impossible beauty of Bali's sensational beaches, dramatic mountain backdrops, and extraordinary landscapes at your own pace.\n\nPlunge into the aquatic heart of breathtaking Bali as you snorkel through its crystal-clear waters, marvel at the kaleidoscopic world below and leave lasting memories on the sun-kissed sands of remarkable islands. Featuring private vessel to shore tenders, onboard dining, complimentary use of non-motorised watersports equipment and much more, relax in comfort as your yacht is expertly navigated around the coastline by an onboard crew and certified skipper.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Denpasar",
    "location_subheading": "Bali",
    "location_description": "Pulau Private Charters",
    "offer_address": "Melasti Beach, Jl. Tukad Punggawa, Serangan, Denpasar Selatan, Kota Denpasar, Bali 80229, Indonesia",
    "percentage_discount": 8.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 1565.0,
    "value": 1696.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009FMEzAAO",
    "hero_image": "https://images.luxuryescapes.com/tacpffjgxqnk86q9uev8",
    "image_two": "https://images.luxuryescapes.com/mdghskrn7lquoxpnt5s",
    "image_three": "https://images.luxuryescapes.com/v4wt64tlmsaugefao43c",
    "vendor_name": "Pulau Private Charters",
    "title": "Bali Private Yacht Charter Experience for up to Seven Guests with Seafood BBQ Lunch",
    "description": "Island-hopping through Indonesia's endless emerald jewels on a private yacht was once a pastime reserved for the select few - now, you too can experience the ultimate in sailing luxury with a four- or eight-hour voyage for up to seven guests aboard the 13-metre dual-hull cruise catamaran, Jemme. Relax as your yacht is expertly navigated around the coastline by an onboard crew and certified skipper, then plunge into the aquatic heart of breathtaking Bali as you snorkel through its crystal-clear waters and marvel at the kaleidoscopic world below, with complimentary non-motorised watersports and private vessel-to-shore tenders.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Denpasar",
    "location_subheading": "Bali",
    "location_description": "Pulau Private Charters",
    "offer_address": "Melasti Beach, Jl. Tukad Punggawa, Serangan, Denpasar Selatan, Kota Denpasar, Bali 80229, Indonesia",
    "percentage_discount": 8.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 1087.0,
    "value": 1178.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009FM1CAAW",
    "hero_image": "https://images.luxuryescapes.com/0labtqdy1nzsyhnp9nne",
    "image_two": "https://images.luxuryescapes.com/ioaq4kxnxmvymazyyqu",
    "image_three": "https://images.luxuryescapes.com/qmh9kz3jbn8exj5eqwvp",
    "vendor_name": "Pulau Private Charters",
    "title": "Bali Boutique Private Yacht Charter Experience for up to Five Guests with Seafood BBQ Lunch",
    "description": "Island-hopping through Indonesia's endless emerald jewels on a private yacht was once a pastime reserved for the select few - now, you too can experience the ultimate in sailing luxury with a four-hour voyage onboard the Burjuman Motor Yacht for up to five guests. Escape the hustle and bustle and be the captain of your own adventure: kick back and take in the impossible beauty of Bali's sensational beaches, dramatic mountain backdrops, and extraordinary landscapes at your own pace.\n\nPlunge into the aquatic heart of breathtaking Bali as you snorkel through its crystal-clear waters, marvel at the kaleidoscopic world below and leave lasting memories on the sun-kissed sands of remarkable islands. Featuring private vessel to shore tenders, onboard dining, complimentary use of non-motorised watersports equipment and much more, relax in comfort as your yacht is expertly navigated by an onboard crew and certified skipper.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Denpasar",
    "location_subheading": "Bali",
    "location_description": "Pulau Private Charters",
    "offer_address": "Melasti Beach, Jl. Tukad Punggawa, Serangan, Denpasar Selatan, Kota Denpasar, Bali 80229, Indonesia",
    "percentage_discount": 8.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 1954.0,
    "value": 2120.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GQ8P7AAL",
    "hero_image": "https://images.luxuryescapes.com/dx1cdgzyshwqx11ge749",
    "image_two": "https://images.luxuryescapes.com/7n272zmuwqx2o0kt2xiu",
    "image_three": "https://images.luxuryescapes.com/y50ueoiug3tptrtdu73j",
    "vendor_name": "Inna Sindhu Beach Hotel & Resort",
    "title": "Bali Beachfront Escape with Sunrise Views & Beach Restaurant",
    "description": "Unwind in the tranquillity of Bali's coastline with a stay at Inna Sindhu Beach Hotel & Resort, nestled on the golden sands of Sindhu Beach. Experience the local culture with a visit to the nearby Sindhu Market, or partake in a Paon Sindhu cooking lesson with an experienced chef who will demonstrate traditional flavour combinations and techniques. Dine on authentic Indonesian cuisine at Bubu Chill and Grill restaurant, located on the shoreline, and enjoy a refreshing dip in the resort pool.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Denpasar",
    "location_subheading": "Bali",
    "location_description": "Inna Sindhu Beach Hotel & Resort",
    "offer_address": "Jl. Pantai Sindhu No. 14 Banjar Sindhu Kaja, Sanur, Denpasar City, Bali 80228, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 60.0,
    "value": 60.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CNQJXAA5",
    "hero_image": "https://images.luxuryescapes.com/gaz00qn6rh7mltirczql",
    "image_two": "https://images.luxuryescapes.com/i9b5mtagznd48lwzdje",
    "image_three": "https://images.luxuryescapes.com/xv3l81qluau2s6ogpz6q",
    "vendor_name": "InterContinental Bali Sanur",
    "title": "Bali Five-Star Beachfront Sanur Suites with Four Onsite Restaurants",
    "description": "Escape to the lush tropical gardens of InterContinental Bali Sanur Resort, an IHG Hotel for a tranquil break by the sea. Savour a delicious meal alongside fresh ocean breezes at the open-air Layang Layang Restaurant, take a break in the Lobby Lounge or escape the heat with a refreshing dip in the pool. Later, explore the golden sands of Sanur Beach or barter and buy at nearby markets and boutiques before retreating to the secluded shelter of tropical foliage to enjoy some well-earned rest.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Denpasar",
    "location_heading": "Denpasar",
    "location_subheading": "Bali",
    "location_description": "InterContinental Bali Sanur Resort, an IHG Hotel",
    "offer_address": "Jl.Kusuma Sari No.8, Sanur, Denpasar Selatan, Bali 80227 Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 195.0,
    "value": 195.0
  }
]