[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DoyTbAAJ",
    "hero_image": "https://images.luxuryescapes.com/mc9um1j6o6jqbx0sv4l",
    "image_two": "https://images.luxuryescapes.com/3x32lq148srttn8zd8w5j",
    "image_three": "https://images.luxuryescapes.com/cjd644d91ialj4v8x5",
    "vendor_name": "Stok Palace Leh",
    "title": "Idyllic Leh Palace Escape with Daily Breakfast, One Ladakhi Meal & Mountain Bike Experience",
    "description": "Perched majestically on a hill overlooking the Indus Valley, the 200-year-old Stok Palace Leh is a royal paradise waiting to be discovered. Intricately designed by Ladakhi craftsmen, this ancient palace was once the royal abode of the Namgyal dynasty and has now opened its doors for guests to experience the dynasty's regal culture. This four-storied historical property also houses a museum and is a 25-minute drive from Kushok Bakula Rimpochee Airport in Leh. Luxuriate in the Royal Suite, located in the palace’s Heritage Wing or enjoy a blissful escape in the Chulli Bagh Villa, nestled within the gorgeous apricot orchards of the palace. The choice is yours. \n\nWhile staying at Stok Palace Leh, you can enjoy Ladakhi meals, go on thrilling mountain bike tours, or discover the property’s royal history. Plus, the resort is close to some of Ladakh's most popular tourist attractions, including the monasteries of Hemis and Thiksey and Shanti Stupa. What more could you want?",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Ladakh",
    "offer_geo_area_level_2": "Leh",
    "location_heading": "Ladakh",
    "location_subheading": "India",
    "location_description": "Stok Palace Leh",
    "offer_address": "Post Box #8, Stok, Ladakh - 194101 Leh Post Box #8, Stok 194101 India",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 515.0,
    "value": 918.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dp96DAAR",
    "hero_image": "https://images.luxuryescapes.com/5ht5jxz2qhrpm3teztg",
    "image_two": "https://images.luxuryescapes.com/0qpnt9o2bo5s746r708",
    "image_three": "https://images.luxuryescapes.com/bdphiabt5on7wd4she0u",
    "vendor_name": "Panah The Earthen Retreat",
    "title": "Nubra Valley Eco-Friendly Stay with Daily Breakfast, Daily Lunch or Dinner & Hammam Experience",
    "description": "At the magnificent Panah - The Earthen Retreat in the tranquil Hunder village of Nubra Valley, Ladakh, embrace Mother Nature. Welcome to an eco-friendly retreat that offers the full Himalayan experience, using the artistic talent and contributions of the locals in every detail. This serene paradise is less than four hours from Leh Airport and is surrounded by beautiful silver sand dunes, apricot trees, and the heady scent of wild lavender. You can stay in earthen villas that truly capture the spirit of Ladakh here, and you'll get top-notch service that meets all of your demands. Your escape is among the most tranquil in the entire valley thanks to the Turkish hammams, bonfire areas, modern conveniences, and locally painted rooms that purify the air inside.\n\nWhile staying at Panah - The Earthen Retreat, you may take advantage of some one-of-a-kind experiences including breakfast by the river, village walks, camel petting sessions, and dining under the stars (additional charges apply).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Ladakh",
    "offer_geo_area_level_2": "Leh",
    "location_heading": "Ladakh",
    "location_subheading": "India",
    "location_description": "Panah - The Earthen Retreat",
    "offer_address": "Village Hunder, Nubra Valley, Leh Ladakh, Ladakh 194401 India",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 445.0,
    "value": 907.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gdQqAAI",
    "hero_image": "https://images.luxuryescapes.com/hngah4yoloitdsid39nh",
    "image_two": "https://images.luxuryescapes.com/s5sno1pmas2xmk3g4z",
    "image_three": "https://images.luxuryescapes.com/g191un5rmnjz21b9q8p6",
    "vendor_name": "Panah The Earthen Retreat",
    "title": "Nubra Valley Eco-Friendly Hill Station Escape with Daily Breakfast, Daily Lunch or Dinner & Stargazing Session",
    "description": "In the heart of the Himalayas rests a nature-loving edifice - Panah - The Earthen Retreat, engulfed by silver sand dunes, apricot trees and the sweet smell of wild lavender. Located in the quaint Hunder village of the Nubra Valley, this gem of a property is approximately 120km from Leh Airport. Giving Mother Nature utmost importance, the property has adopted sustainable practices, including the use of solar panels, using local soil to paint rooms (the soil is rich in oxygen and purifies the room naturally) and strictly following a no-plastic policy. The gorgeous sanctuary has been built in a traditional Ladakhi style, with luxurious villas that offer an earthy vibe while ensuring contemporary comforts are provided - including a Turkish-style hammam in every villa.\n\nExcellent hospitality and warmth, mouthwatering meals and the company of the alluring Karakoram mountains round out this relaxing stay. Plus, discover unique experiences such as dining under the stars, village walks and riverside breakfast (extra charges apply), which will make this a holiday to remember.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Ladakh",
    "offer_geo_area_level_2": "Leh",
    "location_heading": "Ladakh",
    "location_subheading": "India",
    "location_description": "Panah - The Earthen Retreat",
    "offer_address": "Village Hunder, Nubra Valley, Leh Ladakh, Ladakh 194401 India",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 557.0,
    "value": 1047.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcBXUAA3",
    "hero_image": "https://images.luxuryescapes.com/1e6s5lvvnihad8f1qr",
    "image_two": "https://images.luxuryescapes.com/ibyxbq7za4e7s8sydha",
    "image_three": "https://images.luxuryescapes.com/6kobag7kmn13bbqy52il",
    "vendor_name": "Chamba Camp Thiksey",
    "title": "India Himalayan Glamping Opulence near Breathtaking Leh",
    "description": "Unveil the extraordinary at Chamba Camp Thiksey, offering unrivalled opulence near Ladakh's ancient city of Leh, surrounded by the untamed beauty of the mighty Himalayas. These lavish tents blend seamlessly with the region's legendary otherworldly beauty - spend your days meditating with local Buddhist monks or biking through spectacular terrain before returning to your spacious, luxury glamping tent, boasting a private bathroom and terrace with soaring views.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Ladakh",
    "offer_geo_area_level_2": "Leh",
    "location_heading": "Ladakh",
    "location_subheading": "India",
    "location_description": "Chamba Camp Thiksey",
    "offer_address": "Thiksey Naga, near Government School Ladakh, India",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcBXVAA3",
    "hero_image": "https://images.luxuryescapes.com/6qgws00mwhuizeb3x8",
    "image_two": "https://images.luxuryescapes.com/nzac65uf8pevwr6yp1b4",
    "image_three": "https://images.luxuryescapes.com/oiiyhn98edpy7jao9qxr",
    "vendor_name": "Chamba Camp Diskit",
    "title": "Colonial-Style Luxury Glamping in the Indian Wilderness Overlooking Nubra Valley",
    "description": "Discover timeless elegance and Indian wildnerness with a stay at Chamba Camp Diskit, a luxury glamping site nestled in the heart of the Nubra Valley. Experience the allure of the ancient Silk Route, with the majestic Diskit Monastery and ethereal white sand dunes just a stone's throw away. Indulge in authentic Ladakhi cuisine under a canopy of stars, or embark on a thrilling camel safari -  a blend of adventure and opulence, set against the backdrop of the awe-inspiring Himalayas.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Ladakh",
    "offer_geo_area_level_2": "Leh",
    "location_heading": "Ladakh",
    "location_subheading": "India",
    "location_description": "Chamba Camp Diskit",
    "offer_address": "Tsokra, P.O Diskit, Nubra, Leh Ladakh 194401, India",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]