[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008JDDnAAO",
    "hero_image": "https://images.luxuryescapes.com/c5taeyt1and6uzese5ug",
    "image_two": "https://images.luxuryescapes.com/zks5zyrqnbzd07yx1c6o",
    "image_three": "https://images.luxuryescapes.com/78pfq6xf7llkbkxkm24o",
    "vendor_name": "Rosewood Retreat Bhimtal",
    "title": "Tranquil Bhimtal Hill-Station Escape with Daily Breakfast, Welcome Cookie Platter & Daily Coffee or Tea",
    "description": "Overlooking the pristine Bhimtal Lake and nearby mountains, Rosewood Retreat Bhimtal is the perfect destination for a tryst with nature in lavish grandeur. Located in the Nainital district of Uttarakhand, in a quaint town called Bhimtal, the hill-station retreat offers 30 world-class rooms and suites that have exquisite interiors and striking views. The gorgeous deck is no less than a slice of heaven when the rays of a rising sun light it up while unveiling nature's marvels. \n\nRenowned chefs are always eager to create gastronomical wonders to tease your palate with distinct flavours of the land embellished with global tastes. Here, you can enjoy various experiences like canoeing, hiking, archery and much more (extra charges apply) if you feel like constantly staying engaged on your holiday. If you feel like doing nothing at all, you can just laze by a bonfire and witness time stand still as the mountains and shimmering lake call out to you.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Nainital",
    "location_heading": "Bhimtal",
    "location_subheading": "India",
    "location_description": "Rosewood Retreat Bhimtal",
    "offer_address": "Rosewood Retreat Bhimtal, 3, TRH Road Bhimtal, Uttarakhand, India 263136",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 150.0,
    "value": 289.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008ggI1AAI",
    "hero_image": "https://images.luxuryescapes.com/osby0xwzoq74xjnfh6j9",
    "image_two": "https://images.luxuryescapes.com/6qd7yxx5henamcnnho2",
    "image_three": "https://images.luxuryescapes.com/qn2mu4mtmr2zvhime3m",
    "vendor_name": "Rosefinch Sarovar Portico, Bhimtal",
    "title": "Family-Friendly Retreat Near Bhimtal Lake with Daily Breakfast, Daily Mocktails & Dining Discount",
    "description": "Soak in the lakefront tranquillity of Bhimtal at Rosefinch Sarovar Portico, an utterly gorgeous hideaway just six and a half hours from Delhi. Nestled in the beautiful Nainital region of Uttarakhand and overlooking the serene Bhimtal Lake, this hilly retreat is just what you need right now.\n\nConveniently located on the Haldwani-Nainital highway, Rosefinch Sarovar Portico lets you experience nature in all its glory. Breathe in the fresh mountain air, let the lush greenery calm your mind and simply embrace serenity at this idyllic hotel. Reflecting contemporary architectural styles, the hotel ensures that very little comes between you and Mother Nature. Wake up to uninterrupted views of Bhimtal Lake, savour delicious meals and create long-lasting memories with your loved ones.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Nainital",
    "location_heading": "Bhimtal",
    "location_subheading": "India",
    "location_description": "Rosefinch Sarovar Portico, Bhimtal",
    "offer_address": "June Estate Rd, Bhimtal, Uttarakhand 263136 India",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 172.0,
    "value": 254.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EWnvlAAD",
    "hero_image": "https://images.luxuryescapes.com/cd1qunvmlartgosv3p",
    "image_two": "https://images.luxuryescapes.com/iaf4txg8michp41g5xb5",
    "image_three": "https://images.luxuryescapes.com/mg8yj3oy0t0pv2cfxqvj",
    "vendor_name": "Rosefinch Sarovar Portico, Bhimtal",
    "title": "Serene Family-Friendly Escape Near Bhimtal Lake with Daily Breakfast, One Lunch/Dinner & Daily Mocktails",
    "description": "Bask in serenity in the lap of nature at Rosefinch Sarovar Portico, Bhimtal, a breathtaking sanctuary a mere six-hour journey from New Delhi. Nestled in the picturesque Nainital region of Uttarakhand, this hillside haven overlooks the tranquil Bhimtal Lake, offering an oasis of calm perfect for family retreats. Strategically positioned on the Haldwani-Nainital highway, Rosefinch Sarovar Portico allows you to fully embrace the splendour of nature. Breathe in the crisp mountain air, let the verdant surroundings soothe your senses, and bask in the peaceful ambiance of this idyllic retreat. With its modern architecture seamlessly blending with the natural landscape, wake up to the uninterrupted vistas of Bhimtal Lake, indulge in delectable cuisine, and create unforgettable memories with your loved ones.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Nainital",
    "location_heading": "Bhimtal",
    "location_subheading": "India",
    "location_description": "Rosefinch Sarovar Portico, Bhimtal",
    "offer_address": "June Estate Rd, Bhimtal, Uttarakhand 263136 India",
    "percentage_discount": 31.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 221.0,
    "value": 320.0
  }
]