[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ai23BQAQ",
    "hero_image": "https://images.luxuryescapes.com/h3abgvhpohccpc4ztjst",
    "image_two": "https://images.luxuryescapes.com/zu6c3erio6trxykzfv3q",
    "image_three": "https://images.luxuryescapes.com/mw2qvm6qk27zotwyyi6c",
    "vendor_name": "Ruby Gold Coast by CLLIX",
    "title": "Stylish and Brand-New Apartment Resort in Surfers Paradise - Perfect for Couples & Families",
    "description": "Experience a Gold Coast resort like no other with a stay at the brand-new The Ruby Apartments, located just a two-minute walk from Surfers Paradise beach. Luxe apartment living meets all the amenities of a first-class resort, with modern, self-contained units, an array of on-site dining destinations, a 21-metre splash pool with shallow entry and a huge range of activities for all ages - from cocktail making and wine and cheese tasting for the adults, to cupcake decorating, teddybear workshops and a waterpark for younger guests. Included in your escape is a daily continental buffet breakfast, AUD$100 resort credit, one nightly cocktail each, undercover parking for one vehicle and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "The Ruby Apartments - 2019",
    "offer_address": "9 Norfolk Ave, Surfers Paradise QLD 4217",
    "percentage_discount": 62.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 562.0,
    "value": 1463.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000KUTCMYA5",
    "hero_image": "https://images.luxuryescapes.com/666obsq99fbqyc3y8fd",
    "image_two": "https://images.luxuryescapes.com/4yzkhmv5ieq83p4kitwu",
    "image_three": "https://images.luxuryescapes.com/xibnkivtprbi7dquvzpg",
    "vendor_name": "Mantra Towers of Chevron",
    "title": "Family-Friendly Gold Coast Apartment Stay Close to Surfers Paradise Beach",
    "description": "Find everything you need for an easy family break right in the heart of Surfers Paradise. These self-contained apartments give you space to stretch out and settle in, with full kitchens, laundry facilities and roomy living areas. Positioned above the Chevron Renaissance precinct, you’ll be just steps from casual eateries, supermarkets and everyday essentials, with Surfers Paradise beach a short walk away.\n\nThere's plenty to fill the days between beach outings and sightseeing - the sprawling 'Beaches in the Sky' area boasts a huge lagoon pool fringed by palms and shaded lawns. Indoor and outdoor lap pools, a gym and a sauna mean there's always something to do, while the on-site theatre beckons quiet nights in.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Mantra Towers of Chevron Surfers Paradise",
    "offer_address": "23 Ferny Ave, Surfers Paradise QLD 4217, Australia",
    "percentage_discount": 72.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 499.0,
    "value": 1791.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008fYRyAAM",
    "hero_image": "https://images.luxuryescapes.com/prnf8evoswe0npappl",
    "image_two": "https://images.luxuryescapes.com/fehevoo7cbpdpfrzlah",
    "image_three": "https://images.luxuryescapes.com/h790gndyscmcsjtbuac",
    "vendor_name": "Novotel Surfers Paradise Hotel",
    "title": "Stylish Novotel Surfers Paradise Escape with Daily Breakfast, Room Upgrade & Daily Drinks",
    "description": "Experience the epitome of Gold Coast sophistication and take in impressive views from all angles at Novotel Surfers Paradise. This high-rise hotel puts the sand and sunshine on your doorstep, with the famed sandy stretches just metres away, and the lively atmosphere of Cavill Avenue within easy reach. Exceptional facilities, including a gleaming pool, jet-powered spa and tennis courts are sure to impress, and the newly refurbished Deluxe Rooms ensure blissful relaxation with a stylish twist. To round out your day, fire up the BBQ facilities for a family-friendly feast or enjoy the ambience of The Restaurant or BLVD Café & Bar for a well-deserved drink or delicious bite to eat.\n\nWhether you want to get up close to adventure at the nearby theme parks just a short drive away, lounge on the shores of the Gold Coast’s most iconic beachfront or get lost among 400 retail stores at Pacific Fair, this contemporary hotel is a relaxing retreat where you can unwind after exciting days of discovery.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Novotel Surfers Paradise",
    "offer_address": "3105 Surfers Paradise Boulevard, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 300.0,
    "value": 788.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgILTQA2",
    "hero_image": "https://images.luxuryescapes.com/a9wwckmsya4qpc25dpca",
    "image_two": "https://images.luxuryescapes.com/gysaidersvtuora2nmcu",
    "image_three": "https://images.luxuryescapes.com/w16ebzu1wyi1kfejeqj8",
    "vendor_name": "Q1 Resort and Spa Gold Coast",
    "title": "Iconic Q1 Resort & Spa Escape in the Heart of the Gold Coast",
    "description": "Experience the glamorous Gold Coast with an iconic, award-winning getaway at the AAA-rated Q1 Resort & Spa. Tower over popular Surfers Paradise, staying in a sleek One-Bedroom Spa Apartment, sleeping up to four adults. Travelling with friends and family? Two-Bedroom Spa Apartments (sleeping up to six) are also available. An apartment on the tenth floor or higher is guaranteed, promising spectacular hinterland and canal views, with Ocean-View Upgrades available. Enjoy premium sparkling wine and chocolates on arrival, SkyPoint Observation Deck access for two with one drink each at the SkyPoint Bistro and Bar, two AU$25 spa vouchers and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Q1 Resort & Spa - Mar 2019",
    "offer_address": "9 Hamilton Ave, Surfers Paradise QLD 4217",
    "percentage_discount": 48.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 499.0,
    "value": 951.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003H6T8AAK",
    "hero_image": "https://images.luxuryescapes.com/zsj2wwmngcwkdyljz1k7",
    "image_two": "https://images.luxuryescapes.com/ydb7iospb914xm5bopo9",
    "image_three": "https://images.luxuryescapes.com/itc1l86s52utugwid",
    "vendor_name": "Novotel Surfers Paradise Hotel",
    "title": "Ocean-View Surfers Paradise Escape with Daily Breakfast & Drinks",
    "description": "Experience the epitome of Gold Coast relaxation and sophistication with some of the best views on the coast at Novotel Surfers Paradise. This high-rise hotel puts the sand and sunshine on your doorstep, with the golden stretch of Surfers Paradise Beach just metres away and the vibrant nightlife of Caville Avenue within minutes. Make memories to last a lifetime with a guaranteed upgrade to a newly refurbished Deluxe Ocean-View Room, meaning you'll wake up to one of the most iconic sights in the Gold Coast.\n\nYour sun-soaked escape includes daily breakfast, one daily glass of house wine, beer or soft drink per person, a cheese platter to share and leisurely 12pm checkout.\n\n**Travelling with family?** Choose a Deluxe Ocean-View Twin Room with two double beds. Two children (aged 11 years and under) stay free with daily breakfast and complimentary meals when dining with a paying adult.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Novotel Surfers Paradise",
    "offer_address": "3105 Surfers Paradise Boulevard, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 389.0,
    "value": 727.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JjzcHYAR",
    "hero_image": "https://images.luxuryescapes.com/arp3m36diq8im2vr2ws",
    "image_two": "https://images.luxuryescapes.com/bc0jkjotxirgtqz5hmo",
    "image_three": "https://images.luxuryescapes.com/bch20onlkk3w9y3cv1ci",
    "vendor_name": "Mantra Towers of Chevron",
    "title": "Family-Friendly Surfers Paradise Apartment Stay with Unlimited Dreamworld Entry & SkyPoint Access",
    "description": "Find everything you need for an easy family break right in the heart of Surfers Paradise. These self-contained apartments give you space to stretch out and settle in, with full kitchens, laundry facilities and roomy living areas. Positioned above the Chevron Renaissance precinct, you’ll be just steps from casual eateries, supermarkets and everyday essentials, with Surfers Paradise Beach a short walk away.\n\nYour package also includes entry to two of the Gold Coast’s best-loved attractions! Spend the day riding rollercoasters and meeting Australian wildlife at Dreamworld, then take in panoramic coastal views from the SkyPoint Observation Deck, perched high above Surfers Paradise in one of the city’s most recognisable towers.\n\nThere's plenty to fill the days between thrilling outings and sightseeing - the sprawling 'Beaches in the Sky' area boasts a huge lagoon pool fringed by palms and shaded lawns. Indoor and outdoor lap pools, a gym and a sauna mean there's always something to do, while the on-site theatre beckons quiet nights in.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Mantra Towers of Chevron Surfers Paradise",
    "offer_address": "23 Ferny Ave, Surfers Paradise QLD 4217, Australia",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 659.0,
    "value": 1791.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I5wOIAS",
    "hero_image": "https://images.luxuryescapes.com/aimbv103ju80cor95pf7",
    "image_two": "https://images.luxuryescapes.com/cili5x5v7449y0bgsj",
    "image_three": "https://images.luxuryescapes.com/7hdbnxtzc812cul7s3r",
    "vendor_name": "Paradise Resort Gold Coast",
    "title": "Fun-Filled Gold Coast Escape at Australia's Best Family Resort with Daily Breakfast & Unlimited Water Park Access",
    "description": "Treat your family to the ultimate getaway at this award-winning resort, a paradise of fun featuring an ice-skating rink, Kids' Club and a thrilling three-storey water park packed with slides, water cannons and climbing frames.\n\nVoted Australia's Best Family Resort for 12 consecutive years by Holidays with Kids magazine, this action-packed destination - just minutes away from Surfers Paradise's spectacular beaches - makes for the ultimate family adventure. And you'll be all set to savour it, with daily breakfast for two adults and two children included in your escape, plus unlimited access to Kidz Zone Waterpark, one Kids' Club session per child, a 50% discount when purchasing additional Kids' Club sessions and more.\n\nRelax in an upgraded Captain's Superior Resort Room, conveniently located near the water park, and enjoy endless family fun with a variety of activities, live entertainment and premium facilities, like a jungle gym and climbing wall. This resort, known as 'heaven for kids, paradise for parents,' lets the little ones explore while you unwind.\n\nDive into the outdoor heated lagoon and sip on poolside daiquiris, enjoy hassle-free daily housekeeping and satisfy even the pickiest eaters with a variety of onsite dining options.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Paradise Resort Gold Coast",
    "offer_address": "122 Ferny Avenue, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 369.0,
    "value": 747.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvDttAAF",
    "hero_image": "https://images.luxuryescapes.com/04zt7lqh9abs50bt7r1",
    "image_two": "https://images.luxuryescapes.com/ht5nigo7wkcn0yc5ejn",
    "image_three": "https://images.luxuryescapes.com/di1r4i27n6vp2rurf5pf",
    "vendor_name": "Hilton Surfers Paradise Hotel & Residences",
    "title": "Surfers Paradise Hilton Two-Bedroom Luxury Residences with Ocean Views, Daily Breakfast & A$150 Dining Credit",
    "description": "Live out your five-star dreams at Hilton Surfers Paradise Hotel & Residences, the elegant jewel in the Gold Coast's shimmering crown. Enjoy all the perks of a luxury hotel whilst feeling at home in your modern two-bedroom oasis, with enough room for the whole family. A mere block from one of Queensland’s most famous stretches of sand, the stylish resort puts the Sunshine State at your fingertips, with gourmet dining, boutiques and lively bars just seconds away. Enjoy a bountiful breakfast at Catch and make use of your dining credit at the ultra-glamorous Ms Margot’s or The Deck Bar.\n\nBreathtaking views form the backdrop to every part of your stay, from your spacious private balcony to The Deck Bar or splashing around in one of the four pools - take in the gorgeous hinterland, the vibrant city and the Gold Coast's signature sand beaches. Two fitness centres and the blissful eforea spa are the cherries on top, making for an incredibly indulgent escape. Whether you're travelling with friends or family, explore the glimmering Gold Coast and seize the chance to recharge in splendour.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Hilton Surfers Paradise Hotel & Residences",
    "offer_address": "6 Orchid Avenue, Surfers Paradise 4217, Queensland, Australia",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 12,
    "price": 1199.0,
    "value": 2252.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cppd5QAA",
    "hero_image": "https://images.luxuryescapes.com/kj3hqev6tlit5zybu6h",
    "image_two": "https://images.luxuryescapes.com/y5sshe9tcnx0k9roh6oj",
    "image_three": "https://images.luxuryescapes.com/pke83k6qs8278nctn0um",
    "vendor_name": "Hilton Surfers Paradise Hotel & Residences",
    "title": "Five-Star Luxury with Ocean Views at the Hilton Surfers Paradise",
    "description": "Explore Queensland's most famous beach town staying at the five-star Hilton Surfers Paradise on the Gold Coast. Conveniently located close to Surfers Paradise beach you’ll enjoy daily buffet breakfast, AU$100 food and beverage credit, a welcome bottle of wine and two beers on arrival, daily on-site parking and 25% off treatments at the on-site spa. Want even more luxury? Upgrade to an Executive Room with stunning ocean views and access to the Executive Lounge and its benefits including nightly drinks and canapes, and all-day tea and coffee.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Hilton Surfers Paradise 2019",
    "offer_address": "Gold Coast, 6 Orchid Ave, Surfers Paradise QLD 4217",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 433.0,
    "value": 822.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvmkRQAR",
    "hero_image": "https://images.luxuryescapes.com/ts7d6nhrdd2mvcn7pgn8",
    "image_two": "https://images.luxuryescapes.com/rweev55fge7esmrdrrlb",
    "image_three": "https://images.luxuryescapes.com/ri4pmpc5pcxu9diulxnf",
    "vendor_name": "Hilton Surfers Paradise Hotel & Residences",
    "title": "Five-Star Hilton Surfers Paradise Apartment-Style Escape",
    "description": "Experience the beaches, bars, rainforests and theme parks of one of Australia’s most famous beach towns with a five-star, three-night stay at the iconic Hilton Surfers Paradise. Invite friends and family for a luxurious minibreak staying in an apartment-style residence for up to four guests and enjoy a cheese platter, bottle of wine and beers on arrival, AU$150 dining credit, spa and tour discounts, and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Gold Coast",
    "location_description": "Hilton Surfers Paradise - June 2018",
    "offer_address": "Gold Coast, 6 Orchid Ave, Surfers Paradise QLD 4217",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 646.0,
    "value": 1410.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GukQUAAZ",
    "hero_image": "https://images.luxuryescapes.com/duayhkazwpx88pcq7mm2",
    "image_two": "https://images.luxuryescapes.com/z6exi5t768qyqzlne5d",
    "image_three": "https://images.luxuryescapes.com/07kzyxdumn8td12y1yv",
    "vendor_name": "Hilton Surfers Paradise Hotel & Residences",
    "title": "Elevated Surfers Paradise Hilton Retreat with A$100 Dining Credit, Daily Breakfast & Room Upgrade",
    "description": "Live out your five-star dreams at Hilton Surfers Paradise Hotel & Residences, the elegant jewel in the Gold Coast's shimmering crown. Just one block back from one of Queensland’s most famous stretches of sand, the stylish resort puts the best of the Sunshine State at your fingertips, with gourmet dining, local boutiques and lively bars just seconds away. Be captured by your stay as soon as you enter the coastal-inspired lobby, make use of your dining credit at the ultra-glamorous Ms Margot’s Bar & Eats, enjoy a bountiful breakfast at Catch Restaurant, and sit poolside while you sip a cocktail and savour a snack at The Deck Bar.\n\nBreathtaking views form the backdrop to every part of your stay, found in your upgraded room on a higher floor, The Deck Bar or splashing around in one of the four pools - take in the gorgeous hinterland, the vibrant city and the Gold Coast's signature sand beaches. Two fitness centres and the blissful eforea spa are the cherries on top, making for an incredibly indulgent escape. Whether you're travelling with friends or family, explore the glimmering Gold Coast and seize the chance to recharge in splendour.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Hilton Surfers Paradise Hotel & Residences",
    "offer_address": "6 Orchid Avenue, Surfers Paradise 4217, Queensland, Australia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 12,
    "price": 449.0,
    "value": 958.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004NnBXAA0",
    "hero_image": "https://images.luxuryescapes.com/t284wsjymbhjucjfzegs",
    "image_two": "https://images.luxuryescapes.com/g4jw8ij49m032aq2mf8",
    "image_three": "https://images.luxuryescapes.com/fapgt06djmqotcffyybs",
    "vendor_name": "Hilton Surfers Paradise Hotel & Residences",
    "title": "Five-Star Surfers Paradise Hilton Luxury with A$100 Dining Credit, Room Upgrade & Daily Breakfast",
    "description": "Explore Queensland's most famous beach town with a five-star stay at the newly renovated Hilton Surfers Paradise Hotel & Residences. Experience sun-soaked Hilton luxury at this Gold Coast oasis, soaring high above one of Australia’s most iconic beaches, within walking distance of shops, bars and restaurants.\n\nBreathtaking views, gourmet dining, four swimming pools and an onsite spa are all at your fingertips here. An impressive $9 million dollar upgrade brought to life the brand-new, coastal-inspired lobby as well as the ultra-glamorous Ms Margot’s Bar & Eats - the jewels in the hotel’s crown, now ready to be experienced.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Hilton Surfers Paradise Hotel & Residences",
    "offer_address": "6 Orchid Avenue, Surfers Paradise 4217, Queensland, Australia",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 447.0,
    "value": 889.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GQnQUYA1",
    "hero_image": "https://images.luxuryescapes.com/o9fzxxvexz463kbm0ui",
    "image_two": "https://images.luxuryescapes.com/54278o5jdq7d4e6c0e34",
    "image_three": "https://images.luxuryescapes.com/b87kehau0l40dkgyvbje",
    "vendor_name": "Mantra on View",
    "title": "Central Gold Coast Stay Steps from Surfers Paradise Beach with Daily Breakfast & Welcome Wine",
    "description": "Dive into Gold Coast at this prime spot, where paradise isn't just in the name, it's right outside your door. Just a sandal toss from Surfers Paradise Beach, Mantra on View puts you in the heart of Australia's playground. Kick back on your private balcony, treat yourself to blissful pampering at Ocean Day Spa, or let NOSH tantalise your taste buds.\n\nStep outside and you're in the middle of the action - buzzy Cavill Avenue with its mix of trendy bars, shopping and restaurants. After riding waves or retail therapy, retreat to your sanctuary where vacation vibes meet relaxation. Just a short drive from theme parks including Dreamworld, this accommodation is your key to the Sunshine State's entertainment capital.\n\nThe Light Rail is at your doorstep to discover the Broadbeach precinct, The Star and the Pacific Fair Shopping Centre. The Nerang River is nearby with lots of options for gentle sightseeing or the thrill of jet boating.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Mantra on View",
    "offer_address": "22 View Ave, Surfers Paradise, Gold Coast, Queensland 4217, Australia",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 219.0,
    "value": 342.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ab0MPAAZ",
    "hero_image": "https://images.luxuryescapes.com/772c20lyp4d26ai5fb",
    "image_two": "https://images.luxuryescapes.com/ikwsns0nqmqkzc47prdo",
    "image_three": "https://images.luxuryescapes.com/t8aasltr3dd4ii47snk7",
    "vendor_name": "Novotel Surfers Paradise Hotel",
    "title": "Stylish Novotel Surfers Paradise Escape with Daily Breakfast, Room Upgrade & Daily Drinks",
    "description": "Experience the epitome of Gold Coast sophistication and take in impressive views from all angles at Novotel Surfers Paradise. This high-rise hotel puts the sand and sunshine on your doorstep, with the famed sandy stretches just metres away, and the lively atmosphere of Cavill Avenue within easy reach. Exceptional facilities, including a gleaming pool, jet-powered spa and tennis courts are sure to impress, and the newly refurbished Deluxe Rooms ensure blissful relaxation with a stylish twist. To round out your day, fire up the BBQ facilities for a family-friendly feast or enjoy the ambience of The Restaurant or BLVD Café & Bar.\n\nWhether you want to get up close to adventure at the nearby theme parks just a short drive away, lounge on the shores of the Gold Coast’s most iconic beachfront or get lost among 400 retail stores at Pacific Fair, this contemporary hotel is a relaxing retreat where you can unwind after exciting days of discovery.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Novotel Surfers Paradise",
    "offer_address": "3105 Surfers Paradise Boulevard, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 314.0,
    "value": 801.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgI1zQAE",
    "hero_image": "https://images.luxuryescapes.com/ccgsyxrokwvrfgisgvqg",
    "image_two": "https://images.luxuryescapes.com/blaoswjrcmrnhejoaa3e",
    "image_three": "https://images.luxuryescapes.com/abnapd9wjakbgjlo2obg",
    "vendor_name": "Rhapsody Resort",
    "title": "Stylish Ocean View Apartment Stay Overlooking Surfers Paradise",
    "description": "Enjoy high-end comfort while staying in a self-contained apartment just steps from Surfers Paradise beach with spectacular ocean views. Fusing contemporary luxury with a beach-chic ambience, Rhapsody Resort has all you’ll need to enjoy a sun-filled Queensland escape in Surfers Paradise. Indulge in a five or seven-night getaway with a welcome bottle of sparkling wine and Belgium chocolates, access to the famous SkyPoint observation deck, one full-day bike hire and a guaranteed late 11am checkout on your final day.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Rhapsody Resort - March 19",
    "offer_address": "3440 Surfers Paradise Blvd, Surfers Paradise QLD 4217",
    "percentage_discount": 48.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 437.0,
    "value": 837.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R8TYCQA3",
    "hero_image": "https://images.luxuryescapes.com/cec6jqkkpensntmb5rlr",
    "image_two": "https://images.luxuryescapes.com/nde5y6q5pljlwyp8vnso",
    "image_three": "https://images.luxuryescapes.com/ecrej2ht2hfthhg3t5ju",
    "vendor_name": "QT Gold Coast",
    "title": "QT Gold Coast Beachside Escape",
    "description": "A super-stylish beach getaway awaits with three nights at the oh-so-cool QT Gold Coast. Enjoy an automatic upgrade to a luxurious Ocean View Room, daily buffet breakfasts at the renowned Bazaar restaurant (named best buffet on the Gold Coast), daily pre-dinner drink at one of the Gold Coast’s hottest bars - Stingray, four x $20 spa credits, late 1pm checkout, complimentary Wi-Fi, free parking and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "QT Gold Coast - February 2018 - OLD*",
    "offer_address": "7 Staghorn Ave, Gold Coast QLD 4217",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 399.0,
    "value": 823.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EYoIUYA1",
    "hero_image": "https://images.luxuryescapes.com/1uh9sztg1jt556isbm",
    "image_two": "https://images.luxuryescapes.com/zuhwym415ra9aumfh5o6",
    "image_three": "https://images.luxuryescapes.com/4esd0m5b0cwxbsfn7knt",
    "vendor_name": "Paradise Resort Gold Coast",
    "title": "Fun-Filled Gold Coast Escape at Australia's Best Family Resort with Daily Breakfast & Unlimited Water Park Access",
    "description": "Treat your family to the ultimate getaway at this award-winning resort, a paradise of fun featuring an ice-skating rink, Kids' Club and thrilling three-storey water park packed with slides, water cannons and climbing frames.\n\nThis action-packed destination - just minutes from Surfers Paradise's spectacular beaches - makes for the ultimate family adventure and you'll be all set to savour it, with daily breakfast for two adults and two children included in your escape, plus unlimited access to Kidz Zone Waterpark, one Kids' Club session per child, a 50% discount when purchasing additional Kids' Club sessions and more.\n\nRelax in an upgraded Superior Resort Room, conveniently located near the water park, and enjoy endless family fun with a variety of activities, live entertainment and premium facilities, like a jungle gym and climbing wall. This resort, known as 'heaven for kids, paradise for parents', lets the little ones explore while you unwind.\n\nDive into the outdoor heated lagoon and sip on poolside daiquiris, enjoy hassle-free daily housekeeping and satisfy even the pickiest eaters with a variety of onsite dining options.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Paradise Resort Gold Coast",
    "offer_address": "122 Ferny Avenue, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 359.0,
    "value": 747.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMgFXAA1",
    "hero_image": "https://images.luxuryescapes.com/m4uxdld3klm1z65drfu",
    "image_two": "https://images.luxuryescapes.com/e1mrhg35155g3qzvdlj",
    "image_three": "https://images.luxuryescapes.com/rh0bhmseyp8fpl2pabqq",
    "vendor_name": "Novotel Surfers Paradise Hotel",
    "title": "Stylish Novotel Surfers Paradise Escape with Daily Breakfast & Nightly Drinks",
    "description": "Experience the epitome of Gold Coast sophistication and take in impressive views from all angles at this stylish high-rise hotel. Surfers Paradise Novotel puts the sand and sunshine on your doorstep, with the beach just metres away and the lively atmosphere of Cavill Avenue within easy reach.\n\nExceptional facilities, including a gleaming outdoor pool, jet-powered spa and tennis courts, are sure to impress, and dreamy Deluxe Rooms ensure blissful relaxation with a stylish twist. To round out your day, fire up the hotel's BBQ facilities for a family-friendly feast or enjoy the ambience of onsite BLVD Café & Bar.\n\nWhether you want to get up close to adventure at the theme parks (just a short drive away), lounge on the shores of the Gold Coast’s most iconic beachfront or get lost among 400 retail stores at Pacific Fair, Novotel Surfers Paradise is a relaxing retreat where you can unwind after exciting days of discovery.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Novotel Surfers Paradise",
    "offer_address": "3105 Surfers Paradise Boulevard, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 369.0,
    "value": 775.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007m8drAAA",
    "hero_image": "https://images.luxuryescapes.com/0oppcyubto18dwlffwpf",
    "image_two": "https://images.luxuryescapes.com/24o40m8pmddl8nyxvkjw",
    "image_three": "https://images.luxuryescapes.com/3yk3quzy2rxvncg5o9u",
    "vendor_name": "Paradise Resort Gold Coast",
    "title": "Fun-Filled Gold Coast Escape at Australia's Best Family Resort with Room Upgrade, Daily Breakfast & Unlimited Water Park Access",
    "description": "Treat the whole family to the ultimate escape at Paradise Resort Gold Coast, a multi-award-winning, fun-filled family haven with its very own ice-skating rink, Kids' Club and three-storey water park with a myriad of slides, water cannons and climbing frames. Voted Australia's Best Family Resort 11 years in a row by leading family travel magazine Holidays with Kids, this action-packed hotel sits just moments from the bustling hub of Surfers Paradise and its beautiful beaches.\n\nStay in an upgraded Captain's Superior Resort Room with easy access to the splash-tastic water park and enjoy quality time with the family amid a range of exciting activities, live entertainment and top-class facilities, including a jungle gym and climbing wall. This self-proclaimed 'heaven for kids, paradise for parents' lets the children play while the adults take a well-deserved break. Plunge into the outdoor heated lagoon and sip poolside daiquiris, let hassle-free daily housekeeping take care of the cleaning, and keep even the most discerning little food critics happy with the range of onsite dining options.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Paradise Resort Gold Coast",
    "offer_address": "122 Ferny Avenue, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 339.0,
    "value": 772.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y27WiQAJ",
    "hero_image": "https://images.luxuryescapes.com/l01qvfjaz63xrpjrizhe",
    "image_two": "https://images.luxuryescapes.com/duda8xumyiysr3gtcoyp",
    "image_three": "https://images.luxuryescapes.com/eca4u8r74i4or3kyhtvf",
    "vendor_name": "QT Gold Coast",
    "title": "Signature QT Gold Coast Chic with Dazzling Ocean Views",
    "description": "A super-stylish beach getaway awaits at the oh-so-cool QT Gold Coast. Enjoy an automatic upgrade to a luxurious Ocean View Room, daily buffet breakfast at the renowned Bazaar restaurant (named best buffet on the Gold Coast), a nightly pre-dinner drink each at one of the Gold Coast’s hottest bars - Stingray Lounge, an AU$50 credit to spend on food and drinks at the hotel, four x $20 spa credits, late 1pm checkout, complimentary Wi-Fi, free parking and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "QT Gold Coast DECEMBER 2018 - OLD",
    "offer_address": "7 Staghorn Ave, Gold Coast QLD 4217",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 418.0,
    "value": 908.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bP7MQQA0",
    "hero_image": "https://images.luxuryescapes.com/tkwzkr55arde33lbxtld",
    "image_two": "https://images.luxuryescapes.com/hebw9zacjbkpbkfiut2i",
    "image_three": "https://images.luxuryescapes.com/qgvynttf6mv25ypsy9pl",
    "vendor_name": "Mantra Sun City",
    "title": "Gold Coast Getaway - Stay in the Heart of Surfers Paradise at Mantra Sun City",
    "description": "Embrace a relaxed beachside holiday with a stay at Mantra Sun City. Whether you want a romantic couple’s getaway or a fun-filled adventure for the whole family, Mantra Sun City’s well-appointed apartments will be the perfect choice. With its perfect location only a block away from the pristine beaches of Surfers Paradise, Aztec-inspired architecture, amazing lagoon pool complete with waterslides, this is the Gold Coast getaway for you. Includes buffet breakfast, complimentary Wi-Fi, guaranteed late 12pm checkout, 25% discount voucher for the Koastal Kitchen and upgrades available.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Mantra Sun City",
    "offer_address": "3400 Gold Coast Hwy, Surfers Paradise QLD 4217",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 437.0,
    "value": 964.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ab0hrAAB",
    "hero_image": "https://images.luxuryescapes.com/o34sqyeb8mdv23107gl",
    "image_two": "https://images.luxuryescapes.com/qf017yqux0ykzfmptz",
    "image_three": "https://images.luxuryescapes.com/zxj9aw6nhgdmuvvysml",
    "vendor_name": "Paradise Resort Gold Coast",
    "title": "Fun-Filled Gold Coast Escape at Australia's Best Family Resort with Room Upgrade, Daily Breakfast & Unlimited Water Park Access",
    "description": "Treat the whole family to the ultimate escape at this multi-award-winning, fun-filled family haven with its very own ice-skating rink, Kids' Club and three-storey water park with a myriad of slides, water cannons and climbing frames. Voted Australia's Best Family Resort 11 years in a row by leading family travel magazine Holidays with Kids, this action-packed hotel sits just moments from the bustling hub of Surfers Paradise and its beautiful beaches.\n\nStay in an upgraded Captain's Superior Resort Room with easy access to the splash-tastic water park and enjoy quality time with the family amid a range of exciting activities, live entertainment and top-class facilities, including a jungle gym and climbing wall. This self-proclaimed 'heaven for kids, paradise for parents' lets the children play while the adults take a well-deserved break. \n\nPlunge into the outdoor heated lagoon and sip poolside daiquiris, let hassle-free daily housekeeping take care of the cleaning, and keep even the most discerning little food critics happy with the range of onsite dining options.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Paradise Resort Gold Coast",
    "offer_address": "122 Ferny Avenue, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 369.0,
    "value": 907.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y49c8QAB",
    "hero_image": "https://images.luxuryescapes.com/i4uxwtlpikosaqj6ygx7",
    "image_two": "https://images.luxuryescapes.com/tfpplulv0wi8fkr8wpkm",
    "image_three": "https://images.luxuryescapes.com/wx7zcjjhphlsvz9q3zsx",
    "vendor_name": "Ruby Gold Coast by CLLIX",
    "title": "Grand Opening: Stylish Resort Getaway on the Gold Coast",
    "description": "Experience a Gold Coast resort like no other with a stay at the brand-new The Ruby Apartments, located just a two-minute walk from Surfers Paradise beach. Luxe apartment living meets all the amenities of a first-class resort, with modern, self-contained units, an array of on-site dining destinations, a 21-metre saltwater lap pool and a huge range of activities for all ages - from cocktail making and wine and cheese tasting for the adults, to cupcake decorating, teddybear workshops and a waterpark for younger guests. Included in your escape is a daily continental buffet breakfast, AUD$100 resort credit, undercover parking for one vehicle and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "The Ruby Apartments - 2019",
    "offer_address": "9 Norfolk Ave, Surfers Paradise QLD 4217",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 553.0,
    "value": 1329.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G1rWDAAZ",
    "hero_image": "https://images.luxuryescapes.com/wko21226k79afhn3g2",
    "image_two": "https://images.luxuryescapes.com/vgkwsgtcfghwat67ikzk",
    "image_three": "https://images.luxuryescapes.com/e24pj03802mnhlcylrql",
    "vendor_name": "Novotel Surfers Paradise Hotel",
    "title": "Stylish Novotel Surfers Paradise Escape with Daily Breakfast, Room Upgrade & Daily Drinks",
    "description": "Experience the epitome of Gold Coast sophistication and take in impressive views from all angles at Novotel Surfers Paradise. This high-rise hotel puts the sand and sunshine on your doorstep, with the beach just metres away and the lively atmosphere of Cavill Avenue within easy reach. Exceptional facilities, including a gleaming pool, jet-powered spa and tennis courts, are sure to impress, and dreamy Deluxe Rooms ensure blissful relaxation with a stylish twist. To round out your day, fire up the hotel's BBQ facilities for a family-friendly feast or enjoy the ambience of the onsite BLVD Café & Bar.\n\nWhether you want to get up close to adventure at the theme parks (just a short drive away), lounge on the shores of the Gold Coast’s most iconic beachfront or get lost among 400 retail stores at Pacific Fair, Novotel Surfers Paradise is a relaxing retreat where you can unwind after exciting days of discovery. A two-minute walk will take you to the area's shops, cafes, restaurants and nightlife, the Cavill Avenue tram stop and a stretch of golden sand, perfect for a romantic seaside stroll. A little further afield, you can enjoy world-class hiking through the forested hinterland, Currumbin Wildlife Sanctuary and the swells of Burleigh Heads.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Novotel Surfers Paradise",
    "offer_address": "3105 Surfers Paradise Boulevard, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 294.0,
    "value": 750.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000JtINUAA3",
    "hero_image": "https://images.luxuryescapes.com/zpqcrc7nyntkdo1ye20t",
    "image_two": "https://images.luxuryescapes.com/mf9cyhnrv5mrdjsnvjiq",
    "image_three": "https://images.luxuryescapes.com/qlh8ykarcoe3txcrpas3",
    "vendor_name": "Artique Surfers Paradise",
    "title": "Fun-Filled Gold Coast Family Holiday",
    "description": "Escape to the heart of Queensland’s famous Gold Coast and spend five nights at Artique Surfers Paradise. Enjoy a guaranteed upgrade to a One-Bedroom Ocean View Apartment, unlimited premium in-room Foxtel, complimentary Wi-Fi and a ‘Passport 2 Fun’ voucher booklet filled with endota spa vouchers, decadent dining discounts and fantastic savings on local activities from whale watching to action-packed jet-boating experiences for two.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "City of Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Gold Coast",
    "location_description": "Artique Sufers Paradise - 2018",
    "offer_address": "16/18 Enderley Ave, Surfers Paradise QLD 4217",
    "percentage_discount": 45.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 420.0,
    "value": 760.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EgU0AAK",
    "hero_image": "https://images.luxuryescapes.com/1yusgfgw94y5mzgmhkr",
    "image_two": "https://images.luxuryescapes.com/r0bt7wyq98535m86tp4l",
    "image_three": "https://images.luxuryescapes.com/akigpwh1eep3vjdlmcxu",
    "vendor_name": "Hilton Surfers Paradise Hotel & Residences",
    "title": "Five-Star Surfers Paradise Hilton Luxury with Daily Breakfast & Dining Credit",
    "description": "Explore Queensland's most famous beach town staying at the five-star Hilton Surfers Paradise on the sunny Gold Coast. Reward yourself with a laidback, sun-kissed escape at this iconic hotel, conveniently located close to Surfers Paradise beach with breathtaking views, gourmet dining, four swimming pools and a blissful spa. Enjoy daily breakfast, A$100 food and drink credit per room, a welcome bottle of wine and two beers on arrival, daily onsite parking and a 25% discount on treatments at the onsite spa.\n\n**Want even more luxury?** Choose the Club Upgrade to enjoy Executive Lounge benefits including nightly drinks and canapés, and all-day tea and coffee.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Hilton Surfers Paradise Hotel & Residences",
    "offer_address": "6 Orchid Avenue, Surfers Paradise 4217, Queensland, Australia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 419.0,
    "value": 796.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zZReAAM",
    "hero_image": "https://images.luxuryescapes.com/zvkphkfchhgtaxygixx",
    "image_two": "https://images.luxuryescapes.com/oi1vvaw6ujtgg3xdbeg",
    "image_three": "https://images.luxuryescapes.com/xfdtwkqeu52ksluemx4u",
    "vendor_name": "Hilton Surfers Paradise Hotel & Residences",
    "title": "Five-Star Surfers Paradise Hilton Luxury with A$100 Dining Credit, Daily Breakfast & Room Upgrade",
    "description": "Live out your five-star dreams at Hilton Surfers Paradise Hotel & Residences, the newly-renovated jewel in the Gold Coast's shimmering crown. Just one block back from one of Queensland’s most famous stretches of sand, the stylish resort puts the best of the Sunshine State at your fingertips, with gourmet dining, local boutiques and lively bars just seconds away.\n\nBreathtaking views form the backdrop to every part of your stay, whether in your ultra-modern room, at The Deck Bar or splashing around in one of the four pools. An impressive $9 million dollar upgrade has brought to life the brand-new, coastal-inspired lobby, as well as the ultra-glamorous Ms Margot’s Bar & Eats, Catch Restaurant for a bountiful breakfast, and The Deck Bar for poolside snacks, all-day dining and cocktails. Two fitness centres and the blissful eforea spa are the cherries on top, making for an incredibly indulgent escape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Hilton Surfers Paradise Hotel & Residences",
    "offer_address": "6 Orchid Avenue, Surfers Paradise 4217, Queensland, Australia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 429.0,
    "value": 787.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IboEMAAZ",
    "hero_image": "https://images.luxuryescapes.com/5wk63uy6qrc2tsfmlt1",
    "image_two": "https://images.luxuryescapes.com/7usutpswrz7tllxrxjlj",
    "image_three": "https://images.luxuryescapes.com/ympas7rvjgdux3vedzjl",
    "vendor_name": "Breakers North Gold Coast Apartments",
    "title": "Oceanfront Self-Contained Gold Coast Apartments with Direct Beach Access, Heated Pool & Tennis Courts",
    "description": "Experience beachfront bliss just steps from the Gold Coast's famous surf break with a retreat to a self-contained apartment. Ideal for family getaways, guests can enjoy direct access to the beach, a heated outdoor pool, a relaxing sauna, and a tennis court. \n\nJust a short stroll away, discover the eclectic centre of Broadbeach brimming with unique boutiques and eateries, or wander further towards Surfers Paradise to explore lively nightspots including The Star Gold Coast Casino and top-tier shopping at Pacific Fair.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Breakers North",
    "offer_address": "50 Old Burleigh Road, Surfers Paradise 4217, Queensland, Australia",
    "percentage_discount": 38.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 359.0,
    "value": 579.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006C9yKAAS",
    "hero_image": "https://images.luxuryescapes.com/aktjyv851pldu7ztxu",
    "image_two": "https://images.luxuryescapes.com/xhvbj7iwjimbsvy2wiyr",
    "image_three": "https://images.luxuryescapes.com/xdm83wuseceg9cinmjp4",
    "vendor_name": "Paradise Resort Gold Coast",
    "title": "Award-Winning Gold Coast Family Resort with Waterpark",
    "description": "Treat the whole family to the ultimate escape at the newly refurbished Paradise Resort Gold Coast, a multi-award-winning, fun-filled family haven with its very own ice-skating rink, Kids' Club and three-story waterpark. Voted Australia's Best Family Resort 10 years in a row by leading family travel magazine Holidays with Kids, this action-packed hotel sits just moments from the bustling hub of Surfers Paradise and its beautiful beaches. Enjoy easy access to the splash-tastic waterpark and enjoy quality time together amid a range of exciting activities, live entertainment and top-class facilities, including a jungle gym and climbing wall. \n\nThe incredible Kids' Club Mini Fun Park offers complimentary daily supervision for kids aged from six weeks to 12 years, with fun activities such as Astro's Space Station, an 'underwater world' with buried treasure, pyjama parties, disco nights, arts, crafts and so much more. This self-proclaimed 'heaven for kids, paradise for parents' lets the children play while the adults take a well-deserved break. Plunge into the outdoor heated lagoon and sip poolside daiquiris, let hassle-free daily housekeeping take care of the cleaning, and keep even the most discerning little food critics happy with the range of onsite dining options.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Paradise Resort Gold Coast",
    "offer_address": "122 Ferny Avenue, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdejHAAR",
    "hero_image": "https://images.luxuryescapes.com/6mivxuh8m8n5tpvnfz8t",
    "image_two": "https://images.luxuryescapes.com/5kfzu6qyewbxtz77b9hl",
    "image_three": "https://images.luxuryescapes.com/27idzvzn3cyjaf19m3a",
    "vendor_name": "Mantra on View",
    "title": "Central Gold Coast Stay Minutes from Surfers Paradise Beach & Esplanade",
    "description": "Explore the famous beaches and vibrant streets of Gold Coast's city centre with ease at this ideally located stay. Mere steps away from Surfers Paradise Beach, take time to unwind on your private balcony, at the lagoon-style pool, or indulge in a tranquil treatment or two at onsite Ocean Day Spa and Salon. Dine on chef-served dishes at NOSH Pan Asian or venture out to wander nearby Cavill Avenue, a buzzing hub of trendy bars, restaurants and boutique shopping.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "Mantra on View Surfers Paradise",
    "offer_address": "22 View Ave, Surfers Paradise, Queensland, 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 79.0,
    "value": 79.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRerMAAT",
    "hero_image": "https://images.luxuryescapes.com/h0tlfhnm96o1hujha7b",
    "image_two": "https://images.luxuryescapes.com/ng6yfabufnnnimzlh4g",
    "image_three": "https://images.luxuryescapes.com/59h80qpebrwpcotqzzen",
    "vendor_name": "Mantra Legends Hotel",
    "title": "Beachfront Gold Coast Escape in Surfers Paradise with Lagoon-Style Pool & Restaurant",
    "description": "Experience the vibrant energy of Surfers Paradise with a stay at this sophisticated oceanfront retreat, superbly located just moments from the golden sands of the famous beach. This stylish abode offers contemporary rooms and suites and boasts an array of top-notch facilities, including a heated lagoon-style pool, a fully equipped gym and an onsite restaurant serving a delectable menu.\n\nVenture out to explore the nearby Cavill Avenue, brimming with shopping, dining and nightlife options, or take a scenic drive to the lush hinterland of the Gold Coast.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "Mantra Legends Surfers Paradise",
    "offer_address": "25 Laycock St, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 84.0,
    "value": 84.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdehhAAB",
    "hero_image": "https://images.luxuryescapes.com/jp95j2lzffok03kpfpo",
    "image_two": "https://images.luxuryescapes.com/7rd5g7ds57a6lbcvxwpff",
    "image_three": "https://images.luxuryescapes.com/a9jl5wqvbb12kabhwh7p",
    "vendor_name": "Mantra Crown Towers",
    "title": "Surfers Paradise Self-Contained Apartment Stay with Lagoon-Style Pool & Moments from the Esplanade",
    "description": "Experience the sin-kissed lifestyle of Queensland's Surfers Paradise from the comfort of spacious, self-contained apartments. This coastal resort is a leisurely stroll from the golden sands of Surfers Paradise Beach and the lively Esplanade and Cavill Avenue, known for its vibrant nightlife and shopping. Treat yourself to a refreshing dip in the lagoon-style pool, featuring a waterslide and pirate ship for the kids, or savour time in the sauna for the perfect balance of fun and relaxation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "Mantra Crown Towers Surfers Paradise",
    "offer_address": "5/19 Palm Ave, Surfers Paradise, Queensland, 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 86.0,
    "value": 86.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRerqAAD",
    "hero_image": "https://images.luxuryescapes.com/zpbxbt20afuzxlz996cu",
    "image_two": "https://images.luxuryescapes.com/0ltcczqwishlbtpmljs1j",
    "image_three": "https://images.luxuryescapes.com/jx0bb0p3l8p5l4fx4vmv",
    "vendor_name": "Breakfree Imperial Surf",
    "title": "Beachfront Surfers Paradise Self-Contained Escape on the Esplanade with Indoor & Outdoor Pools",
    "description": "Experience the vibrant energy of the Gold Coast with a stay at this stylish beachfront resort. This towering retreat, located in the heart of Surfers Paradise, offers direct access to the beach and the Esplanade. Spend your days exploring the nearby Cavill Avenue, brimming with trendy boutiques, vibrant nightlife and an array of dining options.\n\nAfter a day of exploration, retreat to your spacious self-contained apartment, complete with a private balcony offering panoramic ocean views. Unwind at the heated indoor or outdoor pool, or have a friendly game on the tennis courts.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "BreakFree Imperial Surf Surfers Paradise",
    "offer_address": "80 Esplanade, Surfers Paradise, Queensland, 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 106.0,
    "value": 106.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdekeAAB",
    "hero_image": "https://images.luxuryescapes.com/4i6bhfsjcjq5x0zvyf",
    "image_two": "https://images.luxuryescapes.com/aphiipa22535yxxgre1o",
    "image_three": "https://images.luxuryescapes.com/cvd58g6q5lrfn057ej0m",
    "vendor_name": "Mantra Towers of Chevron",
    "title": "Modern Surfers Paradise Apartment Escape with Rooftop Lagoon Pool & Sauna",
    "description": "Experience the cosmopolitan charm of the Gold Coast with an elegant stay in the heart of Surfers Paradise. Explore the pristine sands of Surfers Paradise Beach and vibrant Cavill Avenue, before returning to your spacious apartment. Take a dip in the onsite 'Beaches in the Sky' lagoon pool, lounge in the hotel's sauna, or savour a delicious meal at one of the many nearby eateries - there's something for everyone at Mantra Towers of Chevron Surfers Paradise.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "Mantra Towers of Chevron Surfers Paradise",
    "offer_address": "23 Ferny Avenue, Surfers Paradise, Queensland, Australia, 4217",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 802.0,
    "value": 802.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JReoOAAT",
    "hero_image": "https://images.luxuryescapes.com/ztoth04rdfzkrh8pc6lm",
    "image_two": "https://images.luxuryescapes.com/043dixa0e90hhbrovy7",
    "image_three": "https://images.luxuryescapes.com/ubnbjtzt7atgvep4cuvm",
    "vendor_name": "Breakfree Longbeach",
    "title": "Beachfront Surfers Paradise Self-Contained Apartments with Three Pools, BBQ Facilities & Tennis Court",
    "description": "Experience the glitz and glamour of the Gold Coast with a central apartment stay just moments away from the world-class waves of Surfers Paradise Beach. There's plenty to keep the whole crew entertained: splash around three swimming pools, practice your serve on the tennis court and enjoy alfresco dining on balmy evenings at the BBQ area.\n\nEach self-contained apartment features fully equipped kitchens and plenty of space for the family or groups of friends, making it the perfect launchpad for your Gold Coast getaway. For more fast-paced action, drive 30 minutes to Warner Bros. Movie World or shop until you drop at Pacific Fair Shopping Centre, only 10 minutes away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "BreakFree Longbeach Surfers Paradise",
    "offer_address": "28 Northcliffe Terrace, Surfers Paradise, Queensland, 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 81.0,
    "value": 81.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gw9h9AAB",
    "hero_image": "https://images.luxuryescapes.com/20aglqrimd97zhp1i5ix",
    "image_two": "https://images.luxuryescapes.com/hutnjmb2o74ib89xdz5j",
    "image_three": "https://images.luxuryescapes.com/sgggt2f1am73bizxyqp1",
    "vendor_name": "Peppers Soul Surfers Paradise",
    "title": "Surfers Paradise Self-Contained Luxury Apartments on The Esplanade with Beach Club Restaurant, Two Heated Pools & Spa",
    "description": "Discover the magic of the Gold Coast for yourself with a glamorous stay at Peppers Soul Surfers Paradise. Begin your day with a leisurely breakfast at Hyde Paradiso, the hotel's in-house eatery-turned-tapas bar come evening, which offers a tantalising array of artisinal dishes to kick-start your day. Wander down the famous Cavill Avenue, known for colourful dining and shopping, or wander over to the Surfers Paradise Beach for a dip in Pacific waters. When you're ready to unwind, head to the outdoor heated pool, a serene oasis where you can enjoy a refreshing plunge year round. For a deeper level of relaxation, the hotel's sauna and steam room provide a rejuvinating retreat.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "Peppers Soul Surfers Paradise",
    "offer_address": "8 Esplanade, Surfers Paradise, Queensland, 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 213.0,
    "value": 213.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRerbAAD",
    "hero_image": "https://images.luxuryescapes.com/m2k6187ngr7q3ibuy95",
    "image_two": "https://images.luxuryescapes.com/5wey6x4k7jttuqjihae",
    "image_three": "https://images.luxuryescapes.com/cs8f453pcvmzij3cl3o",
    "vendor_name": "Breakfree Acapulco",
    "title": "Surfers Paradise Self-Contained Apartment Stay Moments from the Beach with Two Pools & Tennis Courts",
    "description": "Hang ten at this stylish apartment stay, located just 25 metres from the golden sands and first-class waves of Surfer’s Paradise Beach. Backed by showstopping views over the Pacific Ocean, you’ll be all set to discover the city’s best, with Pacific Fair and The Star Gold Coast both easily accessible via the nearby G:link tram.\n\nAfter a day exploring the city's iconic sights, return to the comfort of your self-contained apartment and feel the calming sea breeze from your sun-kissed private balcony. Cool off at one of the hotel's two outdoor pools, the perfect place to laze away the afternoon, have a hit at the onsite tennis courts or cook up a storm in the fully equipped barbecue area.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "BreakFree Acapulco Surfers Paradise",
    "offer_address": "2 Thornton Street, Surfers Paradise, Queensland, Australia, 4217",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 99.0,
    "value": 99.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbPkBAAV",
    "hero_image": "https://images.luxuryescapes.com/kroq63c7wfc1mhzf8ydcj",
    "image_two": "https://images.luxuryescapes.com/o050qwlsg8vwumfv35j",
    "image_three": "https://images.luxuryescapes.com/7oqso6vdf5zi8glaj2a",
    "vendor_name": "Paradise Resort Gold Coast",
    "title": "Family-Friendly Surfers Paradise Fun with Waterpark & Ice-Skating Rink",
    "description": "Unlock core memories with the entire family with an escape to Paradise Resort, where countless family-friendly adventures await. With a tropical-themed water park, ice-skating rink, supervised kids' club, pamper parlour and adventure playground, there is something new to try everyday. Venture outside the award-winning resort to discover even more attractions: iconic Surfers Paradise beach is just metres away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Paradise Resort Gold Coast",
    "offer_address": "122 Ferny Avenue, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 140.0,
    "value": 140.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt5gAAB",
    "hero_image": "https://images.luxuryescapes.com/dtfqkxmc9atrkx9pp1ea",
    "image_two": "https://images.luxuryescapes.com/kpgxyvy2poeen7fbkaps",
    "image_three": "https://images.luxuryescapes.com/crl97jhluftac3qdg7g",
    "vendor_name": "Crowne Plaza Surfers Paradise",
    "title": "Contemporary Surfers Paradise Escape near Iconic Beach",
    "description": "Moments from Surfers Paradise's golden beachfront, the sophisticated Crowne Plaza Surfers Paradise, an IHG Hotel, sits between the iconic strip and lively Broadbeach. Wake up to the sound of the ocean, plunge into the sparkling outdoor pool and enjoy a bite of the Gold Coast at the poolside Relish Grill & Bar, then visit your favourite movie characters at Warner Bros. Movie World - just a 30-minute drive - or get a dose of retail therapy at Pacific Fair Shopping Centre, within a 10-minute tram ride.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Crowne Plaza Surfers Paradise, an IHG Hotel",
    "offer_address": "2807 Gold Coast Hwy, Surfers Paradise QLD 4217",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 103.0,
    "value": 103.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdekUAAR",
    "hero_image": "https://images.luxuryescapes.com/b2rrjgnmd82d6jtvsvwh",
    "image_two": "https://images.luxuryescapes.com/hgskrl49irnwzpdugbdw",
    "image_three": "https://images.luxuryescapes.com/cq1mlonwqj5pdr5x27z8",
    "vendor_name": "Mantra Sun City",
    "title": "Relaxed Central Surfers Paradise Break near Cavill Avenue with Three Pools",
    "description": "Moments from Surfers Paradise's waves and golden sand, revel in sun-kissed days with an escape near the lively Cavill Avenue bursting with cafes, bars and shopping. Start your days with a bite at Koastal Kitchen, splash around in one of three pools (one with waterslides) or practice your serve at the onsite tennis courts. If that's not enough to keep you entertained, kick up the action at Warner Bros Movie World or Sea World, only a short drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "Mantra Sun City Surfers Paradise",
    "offer_address": "3400 Gold Coast Highway, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 63.0,
    "value": 63.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JuMKiYAN",
    "hero_image": "https://images.luxuryescapes.com/evctex2whbqweiawdn",
    "image_two": "https://images.luxuryescapes.com/c57vtfo0nbpcfvoxbn2",
    "image_three": "https://images.luxuryescapes.com/tm6j529k190m7cexdfc",
    "vendor_name": "Mantra Wings Surfers Paradise",
    "title": "Central Gold Coast Self-Contained Apartment Escape Steps from Surfers Paradise Beach",
    "description": "Live the Gold Coast dream at Mantra Wings Surfers Paradise - your laidback launchpad between the ocean and the action. Just a stone's throw away from the iconic Surfers Paradise Beach, this tropical retreat blends beachside bliss with high-rise comfort. Wake to ocean breezes on your private balcony, stroll to the golden sands, or unwind with a dip in the lagoon-style pool.\n\nYou’re just minutes from Cavill Avenue’s electric buzz - think boutique shopping, rooftop bars and foodie hotspots. When it’s time to level up the thrills, theme parks like Dreamworld and Wet’n’Wild are an easy drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Mantra Wings Surfers Paradise",
    "offer_address": "18 Fern Street, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 31,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BVSdAAO",
    "hero_image": "https://images.luxuryescapes.com/vmypjaolqr725sxriy8i",
    "image_two": "https://images.luxuryescapes.com/h59ylpx4hiuubxyvhhhf",
    "image_three": "https://images.luxuryescapes.com/eddmiefr4p4hfjqgrpmd",
    "vendor_name": "voco Gold Coast, an IHG Hotel",
    "title": "Stylish Surfers Paradise Escape near Cavill Avenue with Two Pools",
    "description": "Sparkling azure waters, pristine white sand and trendy beachfront restaurants await at the modern voco™ Gold Coast. Steps away from the golden shores of Surfers Paradise Beach and the unmissable shopping of Cavill Avenue, this contemporary hotel is the perfect place to soak up the Gold Coast sun. Catch a wave at some of Australia’s best beaches or spend the day exploring the diverse culinary offerings around the hotel, before heading back to your contemporary accommodation for a dip in one of the two pools. Dig into juicy steaks at Clifford's Grill & Lounge or pamper yourself with an indulgent massage at the luxurious L’Aqua Day Spa. At night, kick back on your plush bedding, take in the stunning views and enjoy a restful sleep to prepare for more days of sun, surf and sand.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Gold Coast",
    "location_description": "voco™ Gold Coast",
    "offer_address": "31 Hamilton Avenue, Surfers Paradise QLD 4217 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 97.0,
    "value": 97.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbsJJAAZ",
    "hero_image": "https://images.luxuryescapes.com/riyfq33qunmruk5p4tjj",
    "image_two": "https://images.luxuryescapes.com/mu3lpz3pijsubnngy1r",
    "image_three": "https://images.luxuryescapes.com/dqg9cow8y6kqiukdmec",
    "vendor_name": "Novotel Surfers Paradise Hotel",
    "title": "Stylish Novotel Surfers Paradise Escape with Pool Moments from Cavill Avenue",
    "description": "Experience the epitome of Gold Coast sophistication and take in impressive views from all angles at this Surfers Paradise oasis. This high-rise hotel puts the sand and sunshine on your doorstep, with the beach just metres away and the lively atmosphere of Cavill Avenue within easy reach. Exceptional facilities, including a gleaming pool, jet-powered spa and tennis courts, and the onsite BLVD Cafe & Bar are sure to impress. To round out your day, fire up the hotel's BBQ facilities for an alfresco family-friendly feast.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "Novotel Surfers Paradise",
    "offer_address": "Corner Of Surfers Paradise Blvd, Hanlan Street, Surfers Paradise, Queensland 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 100.0,
    "value": 100.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRegpAAD",
    "hero_image": "https://images.luxuryescapes.com/2hvrdcdr1299ijnpbero",
    "image_two": "https://images.luxuryescapes.com/wpxd5xmh6qw22777ml",
    "image_three": "https://images.luxuryescapes.com/hoixszwwfwul0baksh",
    "vendor_name": "Breakfree Peninsula",
    "title": "Contemporary Surfers Paradise Self-Contained Apartments with Four Pools, BBQ Facilities & Tennis Court",
    "description": "Lose yourself in golden moments with a central apartment stay just moments away from the world-class waves of Surfers Paradise Beach and lively Cavill Avenue’s world-class dining and nightlife. There's plenty to keep the whole crew entertained with this fun-filled Gold Coast escape:  splash around four swimming pools, practice your swing on the tennis court and enjoy alfresco dining on balmy evenings at the BBQ area. \n\nEach self-contained apartment features fully equipped kitchens and plenty of space for the family or groups of friends, making it the perfect launchpad for your Gold Coast getaway. For more fast-paced action, drive 30 minutes to Warner Bros. Movie World or shop until you drop at Pacific Fair Shopping Centre, only 10 minutes away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "BreakFree Peninsula Surfers Paradise",
    "offer_address": "Cnr Clifford St & The Esplanade, Surfers Paradise QLD 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 366.0,
    "value": 366.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRer2AAD",
    "hero_image": "https://images.luxuryescapes.com/jx86yt3bzaig8xa5pt7",
    "image_two": "https://images.luxuryescapes.com/xxua7eilffixmg1hqmd",
    "image_three": "https://images.luxuryescapes.com/zxdlcuvktka3vahykj7d",
    "vendor_name": "Paradise Centre",
    "title": "Spacious Surfers Paradise Self-Contained Apartments Metres from the Beach with Two Pools",
    "description": "Enjoy a home away from home in the sparkling Gold Coast with a stay at this collection of stylish apartments, perfectly positioned in the heart of Surfers Paradise. Built above the Paradise Centre shopping complex, retail therapy and the the golden sands of the beach are just moments from your doorstep. Plus the vibrant dining options and eclectic mix of boutiques along Cavill Avenue are also nearby. \n\nEach one-, two- or three-bedroom apartment offers stunning ocean views, a fully-equipped kitchen and spacious living areas. Onsite, relax as you please with two outdoor swimming pools, tennis courts, and a spa and sauna.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "Paradise Centre Apartments Surfers Paradise",
    "offer_address": "3 Hanlan St, Surfers Paradise, Queensland, Australia, 4217",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 75.0,
    "value": 75.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JReoKAAT",
    "hero_image": "https://images.luxuryescapes.com/zr0xb1oix97zgu77ojsc",
    "image_two": "https://images.luxuryescapes.com/xjj1q1gtqbbhhhx39wje",
    "image_three": "https://images.luxuryescapes.com/7p3fwt3uioxcyw8y9ks",
    "vendor_name": "BreakFree Cosmopolitan",
    "title": "Central Surfers Paradise Apartment Escape near Cavill Avenue with Outdoor Pool, BBQ Facilities & Rooftop Sundeck",
    "description": "Seek laidback, beachside bliss with this convenient Gold Coast stay, located mere minutes from the waves of Surfers Paradise Beach. Wake up to hinterland or ocean views from your self-contained apartment, then take a dip in the heated pool to start your day. As the evening falls, head to the rooftop sundeck for enviable sunset views or cook up a storm at the hotel's barbecue facilities.\n\nExperience the best of the Gold Coast from your central abode, moments from Cavill Avenue and perfectly located for delving into the area’s world-class surf breaks, twilight markets and lively nightlife. Just moments away, discover gourmet dining and iconic attractions including Sea World and the SkyPoint Observation Deck.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "BreakFree Cosmopolitan Surfers Paradise",
    "offer_address": "3142 Surfers Paradise Boulevard, Surfers Paradise, Queensland 4217 Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 208.0,
    "value": 208.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRervAAD",
    "hero_image": "https://images.luxuryescapes.com/ikznnc3x4o8qjrqm1smf",
    "image_two": "https://images.luxuryescapes.com/iymjnfg86d2iqfaoci59",
    "image_three": "https://images.luxuryescapes.com/4djg29bcjl0y8wfuzo96",
    "vendor_name": "Breakfree Moroccan",
    "title": "Family-Friendly Self-Contained Apartments Opposite Surfers Paradise Beach with Three Pools",
    "description": "Experience the vibrancy of Surfers Paradise from the comfort of this modern apart-hotel, where space comes at no premium and convenience is king. Perfectly positioned opposite the golden sands of Surfers Paradise Beach, BreakFree Moroccan Surfers Paradise offers large self-contained apartments with private balconies boasting breathtaking ocean views.\n\nEnjoy a dip in one of the three pools, relax in the sauna or keep your fitness regime going in the gym. Explore the nearby Cavill Avenue for shopping, dining and entertainment, or venture further to the Gold Coast Hinterland for a day of adventure with the whole family.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Queensland",
    "location_description": "BreakFree Moroccan Surfers Paradise",
    "offer_address": "14 View Avenue, Surfers Paradise, Queensland, 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 67.0,
    "value": 67.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRergAAD",
    "hero_image": "https://images.luxuryescapes.com/g2qnzan3nvhvajjopurc",
    "image_two": "https://images.luxuryescapes.com/qbb46u2qej1l6jzars18",
    "image_three": "https://images.luxuryescapes.com/nkwo2mu1k26akmldond",
    "vendor_name": "Breakfree Beachpoint",
    "title": "Beachfront Surfers Paradise Self-Contained Apartments with Two Pools & Tennis Court",
    "description": "Experience the laidback coastal charm of Queensland's Gold Coast with a self-contained apartment stay boasting fresh sea breezes and spectacular views. Perfect for families and groups, this idyllic stay is situated mere moments from the powder-soft sands and blue waters of Surfers Paradise, as well as the nearby Cavill Avenue shopping, dining and entertainment precinct.\n\nPositioned in the heart of Surfers Paradise, wander down to shops, restaurants and nightlife, or relax on the beach across the road at the patrolled swimming zone. For those looking to stay closer to home, resort amenities include two pools, a tennis court, a sauna and barbecue facilities.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "BreakFree Beachpoint Surfers Paradise",
    "offer_address": "Cnr Staghorn Avenue and The Esplanade, Surfers Paradise, Queensland, 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 65.0,
    "value": 65.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gw9f3AAB",
    "hero_image": "https://images.luxuryescapes.com/xjyma1mf1ddhz077nmtq",
    "image_two": "https://images.luxuryescapes.com/8860d9k40dvdi5zcp38r",
    "image_three": "https://images.luxuryescapes.com/ja4jzax90ew0comxthn",
    "vendor_name": "Mantra Circle on Cavill Surfers Paradise",
    "title": "Stylish Surfers Paradise Apartment Stay with Private Cinema, Three Pools & Shopping Centre Access",
    "description": "Elevate your Gold Coast stay and discover the perfect home-away-from-home at the Mantra Circle on Cavill Surfers Paradise. Offering apartment-style living and boasting top-notch facilities including a private cinema, three swimming pools, a spa, and direct access to some of the area's best shopping, you'll be in an ideal location to explore  Surfers Paradise. Should you venture out, you'll find an array of tantalising eateries, gorgeous sandy beaches and activities for the whole family just a stone's throw away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Gold Coast",
    "location_heading": "Surfers Paradise",
    "location_subheading": "Australia",
    "location_description": "Mantra Circle on Cavill Surfers Paradise",
    "offer_address": "9 Ferny Avenue, Surfers Paradise, Queensland, 4217, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 125.0,
    "value": 125.0
  }
]