[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gw29GAAR",
    "hero_image": "https://images.luxuryescapes.com/lt8vdbe2s85oxf089xl",
    "image_two": "https://images.luxuryescapes.com/kar6utjdpsry96m8yisw",
    "image_three": "https://images.luxuryescapes.com/8t5gwpqu3j42y0l52bwp",
    "vendor_name": "NH Collection Maldives Havodda Resort",
    "title": "Grand Reopening: All-Inclusive Maldives Private Island Villas with Unlimited Drinks & Roundtrip Domestic Malé Transfers",
    "description": "Make your dreams of pristine sands bathed in Maldivian blues a reality with the grand reopening of the five-star NH Collection Maldives Havodda Resort, the first NH Collection to grace the archipelago. Situated on a shell-shaped private island in the Gaafu Dhaalu Atoll, this retreat is encircled by a crystal-clear lagoon, endless sandy stretches and lush tropical vegetation. Feed your curiosity and soak up the sun drink in hand with all-inclusive dining at five restaurants and bars offering tempting open-air buffets, char-grilled delights, romantic sunset drinks and wood-fired poolside pizza.\n\nArrive stress-free and ready to unwind with roundtrip airport and speedboat transfers. With an azure ocean playground at your fingertips, take to the water and spend days snorkelling coral reefs teeming with vibrant marine life, or travel further out to catch pods of playful dolphins. Stretch out alongside a shimmering outdoor pool, or simply relax in your private villa, each with direct access to the ocean. End your day with a soothing treatment at the tranquil overwater spa before watching the sun cast warm hues over the ocean.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Dhaalu Atoll",
    "offer_geo_area_level_2": "Havodda",
    "location_heading": "Gaafu Dhaalu Atoll",
    "location_subheading": "Maldives",
    "location_description": "NH Collection Maldives Havodda Resort",
    "offer_address": "Gaafu Dhaalu Atoll, Maldives",
    "percentage_discount": 54.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 2999.0,
    "value": 6491.0
  }
]