[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JB6qIAG",
    "hero_image": "https://images.luxuryescapes.com/rwf30040re68ccmmnozm",
    "image_two": "https://images.luxuryescapes.com/l4l0kt1d4dsdb64rgp3",
    "image_three": "https://images.luxuryescapes.com/u7yla6w8kgbl9whuk6k",
    "vendor_name": "Saltbush Retreat",
    "title": "Central Queensland Boutique Outback Cabin Retreat with Breakfast Hamper & Sunset Canapes",
    "description": "Escape to the heart of the rugged Australian wilderness at this Central Queensland lodge, the ultimate Outback sojourn in the historic town of Longreach. With each lodging designed to emulate a traditional homestead, get the authentic Outback experience and feel worlds away, all in complete comfort.\n\nSettle into a relaxing claw-footed tub on the outdoor bathing terrace and toast your stay with a bottle of prosecco before the sprawling sunset, perfectly paired with delicious canapes.  Indulge in a gourmet breakfast hamper of local produce in the morning, and cook up a feast on the barbeque under the stars by night.\n\nExplore the history of Longreach with a visit to the nearby Qantas Founders Museum or the Australian Stockman's Hall of Fame, or choose to simply soak up the ambiance from your Outback verandah.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Longreach",
    "location_heading": "Long Reach",
    "location_subheading": "Queensland",
    "location_description": "Saltbush Retreat",
    "offer_address": "63-65 Ilfracombe Road, Longreach, Queensland 4730, Australia",
    "percentage_discount": 38.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 429.0,
    "value": 696.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000G21ExYAJ",
    "hero_image": "https://images.luxuryescapes.com/tbprovisquiuxblf8ed",
    "image_two": "https://images.luxuryescapes.com/ejvxwtey0iv1z5tdly6j",
    "image_three": "https://images.luxuryescapes.com/vmy3l153qol5fq7t7jts",
    "vendor_name": "Saltbush Retreat",
    "title": "Rustic Outback Queensland Escape with Sunset Bathing, Breakfast Hamper & River Cruise Upgrades Available",
    "description": "Escape to the heart of the rugged Australian wilderness at this Central Queensland lodge, the ultimate outback retreat in the historic town of Longreach. Each accommodation is designed to reflect the charm of a traditional homestead, offering an authentic outback experience with all the comforts you need to feel worlds away.\n\nUnwind in a relaxing claw-footed bathtub on the outdoor bathing terrace, sipping prosecco as you watch the expansive sunset, perfectly complemented by a delicious grazing plate. Enjoy a gourmet breakfast hamper featuring local produce, and in the evening, fire up the barbecue for a feast under the stars.\n\nImmerse yourself in the history of Longreach with visits to the nearby Qantas Founders Museum or the Australian Stockman’s Hall of Fame, or simply relax and soak in the tranquil ambience from your outback terrace.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Longreach",
    "location_heading": "Long Reach",
    "location_subheading": "Queensland",
    "location_description": "Saltbush Retreat",
    "offer_address": "63-65 Ilfracombe Road, Longreach, Queensland 4730, Australia",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 359.0,
    "value": 684.0
  }
]