[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004SpHpAAK",
    "hero_image": "https://images.luxuryescapes.com/js9af0taclb186klpq",
    "image_two": "https://images.luxuryescapes.com/ebwhpuzb2h20qx3zozs",
    "image_three": "https://images.luxuryescapes.com/nfwgh6jal67bhmhtzsqr",
    "vendor_name": "Hotel L'Ariana Isole Eolie",
    "title": "Boutique Italy Island Escape North of Sicily with Direct Ocean Access",
    "description": "Be mesmerised by the breathtaking beauty of Italy's best-kept secret, the UNESCO-listed Aeolian Islands, at Hotel L’Ariana ISOLE EOLIE | UNA Esperienze, a striking property housed in a 19th-century villa on the dreamy island of Salina. Dubbed ‘the green island’, Salina is the second-largest in the Aeolian archipelago, a spectacular destination north of Sicily, known for its high cliffs plunging into dramatic blue waters and rolling hills dotted with vineyards and wildflowers.\n\nPerched on a cliff overlooking the turquoise waters of the Tyrrhenian Sea, this boutique hotel will make you feel a world away from ordinary life. With a collection of just 15 rooms, an enviable location near the ancient port town of Rinella, a charming restaurant serving authentic Sicilian and Aeolian delicacies, and a spectacular private cove with direct access to the sea, this boutique retreat is hard to leave. The Aeolian Islands hide surprises around every corner - and Salina is the ideal starting point for day trips to the seven islands comprising the archipelago. From snorkelling bright blue coves in Panarea to hiking in Lipari, exploring Stromboli’s black-sand beaches and sampling traditional granita with the locals on Salina, the Aeolian Islands are a truly enchanting destination set to forever steal a little piece of your heart.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Sicily",
    "offer_geo_area_level_2": "Leni",
    "location_heading": "Salina",
    "location_subheading": "Italy",
    "location_description": "Hotel L’Ariana ISOLE EOLIE | UNA Esperienze",
    "offer_address": "Via Rotabile 98050 - Borgo di Rinella Sicilia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  }
]