[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R9Iz2QAF",
    "hero_image": "https://images.luxuryescapes.com/oxtazisqsphlskwyg3eu",
    "image_two": "https://images.luxuryescapes.com/m16nyjsxudwkw6rkcpem",
    "image_three": "https://images.luxuryescapes.com/uepxcr8vr8j8yuqxxcsl",
    "vendor_name": "Q Station Manly",
    "title": "Historic Escape in Manly",
    "description": "Escape to Manly's historical, beachside Q Station Hotel, located a short 30-minute ferry ride from the Sydney CBD. Stay two nights and enjoy daily buffet breakfasts, a 45-minute Wharf Wanderer guided tour to learn about the history of this area, bike hire to explore Manly's many beaches at your leisure, a bottle of wine when dining at the Boilerhouse Restaurant and Bar, unlimited snorkel hire, unlimited espresso coffee and more for two.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "",
    "location_heading": "Manly",
    "location_subheading": "Australia",
    "location_description": "Q Station Hotel OLD*",
    "offer_address": "1 N Head Scenic Dr",
    "percentage_discount": 76.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 187.0,
    "value": 786.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JPhSAAW",
    "hero_image": "https://images.luxuryescapes.com/5k7ppkpao56tls92upt9",
    "image_two": "https://images.luxuryescapes.com/8u8mweb3be9i0se5bqeb",
    "image_three": "https://images.luxuryescapes.com/c3mv6cnsk9au4k1w5ryr",
    "vendor_name": "Q Station Manly",
    "title": "Manly Harbourside National Park Retreat with Private Beach & Daily Breakfast",
    "description": "Discover Sydney’s only retreat that offers a glorious stretch of private beachfront and mesmerising harbour views from Q Station Manly. Boasting a rich history and spectacular location moments from serene Manly, this historic escape ensures there’ll never be a dull moment. Nestled high on the hillside within the picturesque surrounds of Sydney Harbour National Park, this retreat will spoil you with pristine nature, delicious food across five venues and poignant history.\n\nTake advantage of complimentary daily snorkelling equipment hire, discover the diverse flora and fauna or keep an eye out for the endangered long-nosed bandicoot and little penguins on bushwalks through this historic National Park. Only a short 30-minute ferry ride from the Sydney CBD or a five-minute drive from Manly’s main hub, you’re ideally positioned to explore the highlights and world-renowned dining scene of Sydney while enjoying a breath of fresh air away from the bustle of the city.\n\n**Your handpicked inclusions:**\n\n- Wake up to a delicious daily breakfast at Views Restaurant with stunning Sydney Harbour vistas\n- Learn about the fascinating history of Q Station on a history tour for two\n- Toast your escape with a welcome bottle of wine\n- Enjoy A$50 dining and drinks credit to spend at any of the five onsite venues\n- Get your caffeine fix with two barista coffee cards per person for Beach Café\n- Complimentary onsite parking for one vehicle per stay\n- Enjoy one final sleep in thanks to guaranteed 12pm late checkout\n\n**Cottage Family Upgrade:** Sleep in what was once quarantine staff homes in the spacious Three-Bedroom Cottage, comfortably sleeping up to six guests (of any age). There’s plenty of space to unwind and enjoy the spectacular views of the grounds, harbour and historic buildings of Q Station from your private balcony or veranda.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Manly",
    "location_subheading": "New South Wales",
    "location_description": "Q Station Manly - 2021",
    "offer_address": "N Head Scenic Dr, Manly NSW 2095",
    "percentage_discount": 78.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 220.0,
    "value": 990.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000d0XtaQAE",
    "hero_image": "https://images.luxuryescapes.com/worlndwgektchv38xmvk",
    "image_two": "https://images.luxuryescapes.com/wtg7zng57qzur1fjq5rh",
    "image_three": "https://images.luxuryescapes.com/vhn0ihq30s8dpilqixs2",
    "vendor_name": "Q Station Manly",
    "title": "Heritage Harbourside Luxury with Private Beach and Daily Buffet Breakfast",
    "description": "Private beachfront and mesmerising harbour views meets luxe heritage at the historic Q Station beachside retreat, located a short 30-minute ferry ride from the Sydney CBD or five-minute drive from Manly’s main hub. Experience a unique city break with daily buffet breakfast, a 45-minute Wharf Wander guided tour, one-time four-hour bike hire to ride along the pristine beachfront, one-time complimentary bottle of wine when dining at the Boilerhouse Restaurant & Bar for dinner (minimum $60 combined spend), daily snorkel hire and espresso coffees throughout your stay at the on-site cafe.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Manly",
    "location_subheading": "New South Wales",
    "location_description": "Q Station Manly - 2021",
    "offer_address": "N Head Scenic Dr, Manly NSW 2095",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 185.0,
    "value": 340.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GRXpwYAH",
    "hero_image": "https://images.luxuryescapes.com/vxaqdxfr4gjh8ziia7h",
    "image_two": "https://images.luxuryescapes.com/9002nrdmotb94cyxmnew",
    "image_three": "https://images.luxuryescapes.com/4c675snl6rely90ozwn9",
    "vendor_name": "Q Station Manly",
    "title": "Manly Harbour National Park Retreat on Secluded Beachfront with Four Restaurants & Bars",
    "description": "Nestled within the historic grounds of Sydney's former Quarantine Station at North Head, this extraordinary hideaway pays homage to the city's rich history. Embark on a thought-evoking tour, delving into the historic tales brimming within the station's corridors, then discover a tranquil stretch of secluded beachfront, offering breathtaking views of Sydney Harbour National Park. With an array of delectable dining options across four venues, indulge in delicious cuisine.\n\nThis meticulously maintained historical lodging is conveniently situated just a 30-minute ferry journey from Sydney's CBD, or a five-minute drive from the bustling heart of Manly. This prime location allows you to easily delve into Sydney's renowned attractions and dining offerings, all while relishing a tranquil escape from the urban hustle.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Manly",
    "location_subheading": "New South Wales",
    "location_description": "Q Station Manly",
    "offer_address": "1 North Head Scenic Drive, Manly, New South Wales 2095, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 112.0,
    "value": 112.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnOvFYAV",
    "hero_image": "https://images.luxuryescapes.com/tzw36kdk1izhrtoeb8wg",
    "image_two": "https://images.luxuryescapes.com/gmr92dd7xdcl5vd1vbmf",
    "image_three": "https://images.luxuryescapes.com/uhlkfuni5k1oh5eyotb9",
    "vendor_name": "Peppers Manly Beach",
    "title": "Stylish Manly Beachside Retreat with Prime Manly Beach Location & Ocean Views",
    "description": "Contemporary coastal-chic accommodation meets an incredible location at this beachside haven, superbly positioned just steps from one of Australia’s most iconic stretches of coastline. Appreciate the stunning azure waters from your private balcony with a morning brew in hand before heading down to dive into the waters of Manly Beach. \n\nOutside the hotel, foodies will be thrilled with the endless options nearby - share plates at Little Pearl Bar & Dining, classic Cantonese at Queen Chow Manly and fresh seafood at The Herring Room.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Manly",
    "location_subheading": "New South Wales",
    "location_description": "Peppers Manly Beach",
    "offer_address": "8 South Steyne, Manly, New South Wales 2095, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 180.0,
    "value": 180.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbmkdAAB",
    "hero_image": "https://images.luxuryescapes.com/2odehd19nsxgk91dt4bva",
    "image_two": "https://images.luxuryescapes.com/fp18rzqjnqgc6w55kkb",
    "image_three": "https://images.luxuryescapes.com/svm9d7lncstxy9z0usgj",
    "vendor_name": "Manly Pacific - M Gallery",
    "title": "Sydney Beachfront Manly Escape with Rooftop Pool & Lounge",
    "description": "Perfectly situated on the sparkling Manly beachfront, enjoy a contemporary retreat for couples or families seeking a peaceful seaside escape. The onsite offerings are nothing short of exceptional, with a breathtaking rooftop pool boasting sweeping ocean views, a state-of-the-art gym and stylish rooms with coastal touches. Outside the hotel, the beaches are undeniably one of Manly’s best natural assets, with vast swathes of sandy stretches and swells to please surfers of all levels.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Sydney",
    "location_heading": "Manly",
    "location_subheading": "New South Wales",
    "location_description": "Manly Pacific Sydney MGallery Collection",
    "offer_address": "55 N Steyne Manly, Sydney, New South Wales 2095, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 203.0,
    "value": 203.0
  }
]