[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UzsvAAC",
    "hero_image": "https://images.luxuryescapes.com/4r3yt9gktdn3zxntta",
    "image_two": "https://images.luxuryescapes.com/40qwwhowenqar2sclraa",
    "image_three": "https://images.luxuryescapes.com/wxh6rgjjuiibepardqd",
    "vendor_name": "Hotel Vestibul Palace",
    "title": "Split Top-Rated Boutique Escape with Daily Breakfast",
    "description": "Experience a slice of heritage luxury at Hotel Vestibul Palace, a Small Luxury Hotel of the World in Split’s UNESCO-listed Old Town. Found in the heart of Diocletian’s Palace, an ancient Roman landmark, this exclusive boutique hideaway exudes over 1,700 years of history within its authentic stone walls, creating a peaceful patch in the middle of the Croatian town’s action. Step out of the hotel's doors and into the middle of Old Town and its multiple monuments, or wander down to the main port - just 10 minutes by foot - to hop on a ferry to nearby islands.\n\nThe hotel’s ancient walls are interwoven with contemporary interiors and all the amenities you could need for a seamless stay. A select number of rooms stretch over multiple floors, all with views of the peaceful square below. Visit the glass-roofed Magnus restaurant from sun up to down for menus of locally sourced and seasonal ingredients, best enjoyed at one of the parasol-shaded outdoor tables. For a Dalmatian day out, take to the water in the hotel speedboat, or chat to the concierge team about excursions to Krka National Park.\n\n**Luxury Escapes inclusions (select packages/nights):**\n\n- You won’t go hungry with **daily à la carte breakfast** at Magnus\n- Enjoy a **bottle of wine arrival**\n- Start your stay with a **welcome fruit basket**\n- **Upgrade to the next available room type**, subject to availability (excludes Luxury Suites; for stays of 4+ nights)\n\n**Suite Upgrade:** Elevate your Hotel Vestibul Palace experience with an upgrade to the Luxury Suite, offering a mezzanine master bedroom, modern living areas and sleek bathroom.",
    "offer_country_name": "Croatia",
    "offer_country_code_alpha_2": "HR",
    "offer_geo_area_level_1": "Split-Dalmatia",
    "offer_geo_area_level_2": "Split",
    "location_heading": "Split",
    "location_subheading": "Croatia",
    "location_description": "Hotel Vestibul Palace",
    "offer_address": "Ul. Iza Vestibula 4, 21000, Split, Croatia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]