[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000crfcxQAA",
    "hero_image": "https://images.luxuryescapes.com/0aonbac768likt9gho2d",
    "image_two": "https://images.luxuryescapes.com/msn6z39vcdskpa1a1qmb",
    "image_three": "https://images.luxuryescapes.com/4k1u0xc1qqnjz8smk0k7",
    "vendor_name": "Amaroo Valley Springs",
    "title": "Brand-New Luxury Cabin Stay with Panoramic Views Over Kangaroo Valley for Four Guests",
    "description": "Take in the beauty of Kangaroo Valley, New South Wales during a group escape in a brand-new luxury cabin at Amaroo Valley Springs. This newly built accommodation offers privacy for up to four people in one spacious cabin with two bedrooms with en suites, a balcony with outdoor bath and sweeping valley views. Includes champagne and chocolates on arrival, breakfast provisions and a lazy late 12 midday checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Barrengarry",
    "location_heading": "Kangaroo Valley",
    "location_subheading": "Australia",
    "location_description": "Amaroo Valley Springs",
    "offer_address": "260 Bunkers Hill Rd, Kangaroo Valley NSW 2577",
    "percentage_discount": 32.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 1097.0,
    "value": 1610.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mxquAAA",
    "hero_image": "https://images.luxuryescapes.com/n1rijdqgao0tb1e1ptz",
    "image_two": "https://images.luxuryescapes.com/k0ffw0hgri6xuk8hn0zrh",
    "image_three": "https://images.luxuryescapes.com/di8ivcxdkaautr54h12",
    "vendor_name": "Wildes Boutique Hotel Kangaroo Valley",
    "title": "Grand Opening: Romantic Kangaroo Valley Studio Retreat Just Two Hours from Sydney with Daily Breakfast",
    "description": "Be one of the first to experience sophisticated luxury in the untamed heart of the Kangaroo Valley with an escape to the brand-new Wildes Boutique Hotel, unveiled in December 2021. With only 23 masterfully appointed and self-contained studios, each surrounded by flawlessly landscaped gardens, it’s the perfect boutique retreat for couples looking to explore Shoalhaven's wealth of rolling hills, twisting rivers and picturesque villages. Stay in summer for lounging by the pool or in the sun-kissed stone courtyard, or snuggle up in winter - spend mornings strolling through otherworldly morning mists and evenings by the radiant fireplace.\n\nThe culinary curious will love Wildes Dining, a laidback eatery showcasing the region’s exceptional local produce. When you're ready to explore, step beyond the hotel grounds and into a region steeped in fascinating history and brimming with extraordinary wilderness. Kayak through the gentle waters of the Kangaroo River, horse around with an equestrian lesson, sip and nibble at any of the region’s excellent tea rooms or seek out the spectacular Fitzroy Falls, only a twenty-minute drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Kangaroo Valley",
    "location_heading": "Kangaroo Valley",
    "location_subheading": "New South Wales",
    "location_description": "Wildes Boutique Hotel Kangaroo Valley",
    "offer_address": "152 Moss Vale Road, Kangaroo Valley, NSW 2577 Australia",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 323.0,
    "value": 751.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ee5elAAB",
    "hero_image": "https://images.luxuryescapes.com/q1m3nxonmw80i6n0yop",
    "image_two": "https://images.luxuryescapes.com/32a22ds9dcbh00fppdm",
    "image_three": "https://images.luxuryescapes.com/xf26c2bc716ax67imadyl",
    "vendor_name": "Wildes Boutique Hotel Kangaroo Valley",
    "title": "Romantic Kangaroo Valley Retreat Just Two Hours from Sydney with Daily Breakfast",
    "description": "Discover sophisticated luxury in the untamed heart of the Southern Highlands at this boutique stay in Kangaroo Valley. Featuring just 26 plush rooms and suites, it’s the perfect bespoke retreat for couples and families looking to explore Shoalhaven's wealth of rolling hills, twisting rivers and picturesque villages.\n\nSpend summertime lazing by the pool or in the sun-kissed stone courtyard, or spend winter mornings strolling through otherworldly morning mists and cosying by the radiant fireplace. For the culinarily curious, indulge in a meal at Wildes Dining, a laidback eatery showcasing the region’s exceptional local produce. \n\nStep beyond the hotel grounds and explore a region steeped in fascinating history and brimming with extraordinary wilderness - kayak through the gentle waters of the Kangaroo River, horse around with an equestrian lesson, sip and nibble at any of the region’s excellent tea rooms or seek out the spectacular Fitzroy Falls, only a 20-minute drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Kangaroo Valley",
    "location_heading": "Kangaroo Valley",
    "location_subheading": "New South Wales",
    "location_description": "Wildes Boutique Hotel Kangaroo Valley",
    "offer_address": "152 Moss Vale Road, Kangaroo Valley, New South Wales 2577, Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 369.0,
    "value": 639.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CO7bXAAT",
    "hero_image": "https://images.luxuryescapes.com/a2q3lki14masejs4bvyh",
    "image_two": "https://images.luxuryescapes.com/0uyd73ljphjre0vldw",
    "image_three": "https://images.luxuryescapes.com/mcx4sn8u99t4aobgpamj",
    "vendor_name": "Wildes Boutique Hotel Kangaroo Valley",
    "title": "Brand-New Romantic Kangaroo Valley Studio Retreat Just Two Hours from Sydney with Daily Breakfast",
    "description": "Discover sophisticated luxury in the untamed heart of New South Wales with an escape to the brand-new Wildes Boutique Hotel Kangaroo Valley. Featuring just 23 boutique self-contained studios - each surrounded by flawlessly landscaped gardens - it’s the perfect boutique retreat for couples and families looking to explore Shoalhaven's wealth of rolling hills, twisting rivers and picturesque villages. Spend summertime lazing by the pool or in the sun-kissed stone courtyard, or spend winter mornings strolling through otherworldly morning mists and cosying by the radiant fireplace.\n\nThe culinarily curious will love Wildes Dining, a laidback eatery showcasing the region’s exceptional local produce. Step beyond the hotel grounds and explore a region steeped in fascinating history and brimming with extraordinary wilderness - kayak through the gentle waters of the Kangaroo River, horse around with an equestrian lesson, sip and nibble at any of the region’s excellent tea rooms or seek out the spectacular Fitzroy Falls, only a 20-minute drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Kangaroo Valley",
    "location_heading": "Kangaroo Valley",
    "location_subheading": "New South Wales",
    "location_description": "Wildes Boutique Hotel Kangaroo Valley",
    "offer_address": "152 Moss Vale Road, Kangaroo Valley, NSW 2577 Australia",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 324.0,
    "value": 707.0
  }
]