[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CIfc6YAD",
    "hero_image": "https://images.luxuryescapes.com/qj66ooeiqlkiwum7cx4n",
    "image_two": "https://images.luxuryescapes.com/emg0wkub6j1uzur6g8t",
    "image_three": "https://images.luxuryescapes.com/o6zzugixmc6w03bpj19",
    "vendor_name": "Rumah Luwih Bali",
    "title": "Bali Colonial-Style Beachfront Bliss with Daily Breakfast, Nightly Dinner & Free-Flow Drinks Hour",
    "description": "Seaside opulence meets old-world charm at this five-star Bali hideaway, placed near world-renowned surfing and diving spots known for their sparkling volcanic sands. Styled after a colonial Indonesian mansion, Rumah Luwih’s sophisticated flair can be seen in every corner, from tropical gardens fringed with water features to the laid-back yet oh-so-elegant ambience of Kirana Living Room & Lounge.\n\nStretch out by the shimmering pool overlooking the ocean, soothe your senses at the onsite spa and sample Indonesian specialities at the chandelier-lit Andrawina Restaurant. When it's time to venture out, discover the heritage-rich province of Gianyar, including the popular Pasar Senggol night market and Bali's spiritual heart, Ubud.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Gianyar",
    "location_heading": "Gianyar",
    "location_subheading": "Bali",
    "location_description": "Rumah Luwih Bali, an IHG Hotel",
    "offer_address": "Jalan Prof. Dr. Ida Bagus Mantra, Km 19.9, Lebih, Gianyar, Bali 80237, Indonesia",
    "percentage_discount": 54.0,
    "min_duration": 4,
    "max_duration": 21,
    "price": 559.0,
    "value": 1203.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Zoh5qQAB",
    "hero_image": "https://images.luxuryescapes.com/i9c227dfgn154vpcamul",
    "image_two": "https://images.luxuryescapes.com/02e4t17rlslu2xo7grbw",
    "image_three": "https://images.luxuryescapes.com/2tpmp915u42rfwodup7",
    "vendor_name": "The Royal Purnama",
    "title": "Exquisite Jacuzzi Suite with Dining, Cocktails and Massages - Child-Free Resort",
    "description": "Escape it all for beachfront beauty in Bali’s serene Gianyar, staying in boutique luxury at the award-winning The Royal Purnama - an exclusive, child-free retreat nestled amongst lush rice fields and a black sand beach. Stay in an exquisite suite with your choice of ocean-view jacuzzi or private pool, daily breakfast, an oceanfront seafood dinner, indulgent daily afternoon tea, a daily cocktail each, a rice paddy field cycling tour experience, daily morning yoga sessions, a 90-minute massage per person, one-way airport transfer on arrival from Bali’s international airport and guaranteed late checkout at 1pm",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Gianyar",
    "location_subheading": "Bali",
    "location_description": "The Royal Purnama Jan 2019",
    "offer_address": "Jl. Pantai Purnama, Sukawati, Kec. Gianyar, Kabupaten Gianyar, Bali, Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 562.0,
    "value": 1202.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ge9oEYAR",
    "hero_image": "https://images.luxuryescapes.com/sg1jwiyfgpqun654lyw",
    "image_two": "https://images.luxuryescapes.com/gxnr1fqlgu6ae3jnl5",
    "image_three": "https://images.luxuryescapes.com/562h6eg3s3v27brkpju",
    "vendor_name": "The Royal Purnama",
    "title": "Bali Adults-Only Beachfront Bliss: Award-Winning Suites & Villas with Nightly Dinner & Cocktails",
    "description": "If you’re looking to get away from it all amid the raw beauty of Bali, look no further than this soul-soothing paradise. The Royal Purnama is a secluded adults-only retreat featuring a collection of Balinese-inspired jacuzzi suites and private pool villas, inviting you to relax in barefoot luxury.\n\nThe real jewel in its crown is the impressive oceanfront infinity pool framed by cabanas and sun loungers, leading onto the black-sand, palm-fringed Purnama Beach. For moments sure to transport you to a new level of relaxation, the blissful Black Sand Spa - inspired by the therapeutic properties of the beach’s volcanic sand - is the place to be.\n\nAn array of international culinary creations will delight gourmands at Standing Stones Beach Restaurant, or retreat to the high-end Moonstone Beach Lounge next door for an open-air beach lounge, restaurant and bar encircled by a dazzling swimming pool and glorious cabanas. With the coast at your fingertips, venture out to the laid-back town of Sanur with complimentary shuttle transfers for a day of tranquil exploring.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Sukawati",
    "location_heading": "Gianyar",
    "location_subheading": "Bali",
    "location_description": "The Royal Purnama",
    "offer_address": "Jalan Pantai Purnama, Sukawati, Gianyar, Bali 80582, Indonesia",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 519.0,
    "value": 888.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zkTzAAI",
    "hero_image": "https://images.luxuryescapes.com/qm7sa5y8ycmgcam0fbwz",
    "image_two": "https://images.luxuryescapes.com/1otgzyqmvdps1layfyy",
    "image_three": "https://images.luxuryescapes.com/sr0abj5oyq3yqzahl6v",
    "vendor_name": "The Royal Purnama",
    "title": "Bali Beachfront Jacuzzi Suite Luxury with A$500 Spa Credit, Daily Breakfast & Nightly Cocktails",
    "description": "If you’re looking to get away from it all amid the raw beauty of southeast Bali, look no further than The Royal Purnama. This secluded and stylish child-free retreat - reserved exclusively for guests aged 12 and over - features a collection of Balinese-inspired jacuzzi suites and private pool villas, inviting you to relax in barefoot luxury. Prepare to be dazzled by this soul-soothing paradise settled between lush rice paddies and world-class surf breaks - including the renowned Keramas surf break, home of Bali's World Surf League - as pastel-hued sunsets mark the end of each blissful day.\n\nThe real jewel in its crown is the impressive oceanfront infinity pool framed by cabanas and sun loungers, leading onto the black-sand, palm-fringed beach. For moments sure to transport you to a new level of relaxation, the blissful Black Sand Spa - inspired by the therapeutic properties of the beach’s volcanic sand - is the place to be. An ever-changing rotation of culinary creations will delight gourmands at Standing Stones Restaurant & Beach Lounge, an open-air beach lounge, restaurant and bar encircled by the sparkling swimming pool.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Sukawati",
    "location_heading": "Gianyar",
    "location_subheading": "Bali",
    "location_description": "The Royal Purnama",
    "offer_address": "Jalan Pantai Purnama, Sukawati, Gianyar, Bali 80582, Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 639.0,
    "value": 1372.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuimQAAR",
    "hero_image": "https://images.luxuryescapes.com/vj1g4359wrxz0lpu1ex",
    "image_two": "https://images.luxuryescapes.com/rw6il3o5wi5ewb6nbqw7",
    "image_three": "https://images.luxuryescapes.com/cryaxd8tz5co03s4zz88",
    "vendor_name": "Rumah Luwih Bali",
    "title": "Bali Five-Star Colonial-Style Beachfront Escape with Beach Pavilion Dining",
    "description": "Transport yourself to a state of pure bliss with a stay at the beachfront Rumah Luwih, Bali - a five-star hideaway near world-renowned surfing and diving spots. Styled after a classic colonial Indonesian mansion, Rumah Luwih offers pure elegance in the tranquil province of Gianyar, loved for its outstanding food and popular Pasar Senggol night market. Lounge by the pool overlooking the ocean, soothe your senses at the spa and sample Indonesian specialities at Andrawina Restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Gianyar",
    "location_heading": "Gianyar",
    "location_subheading": "Bali",
    "location_description": "Rumah Luwih Bali, an IHG Hotel",
    "offer_address": "Jl Prof. Dr. Ida Bagus Mantra, Km 19.9. Gianyar, Bali",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 81.0,
    "value": 81.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IStNIAW",
    "hero_image": "https://images.luxuryescapes.com/uiiqql4pcj7mi1rtpmcs",
    "image_two": "https://images.luxuryescapes.com/zqfq4cxnjj5wmop64e4v",
    "image_three": "https://images.luxuryescapes.com/adfdbhuhbgpc5ti7o9np",
    "vendor_name": "Buahan, a Banyan Tree Escape",
    "title": "Secluded Adults-Only Central Bali Jungle Escape with Restaurant, Bar & Spa",
    "description": "Forget everything you know about traditional hotels - at Buahan, sixteen open-air bales float like dream pods above Bali's untamed jungle. Adults-only bliss meets raw wilderness in the Indonesian island's best-kept secret, where guests breathe with the forest, sleep beneath the stars and wake with birdsong.\n\nWatch culinary wizards work their magic at the open kitchen, where 70% plant-based menus shine through a zero-waste philosophy. The Botanist Bar crafts liquid poetry from garden-fresh herbs, while Toja Spa channels ancient Balinese healing wisdom through expert hands. Every sip, bite and treatment connects you deeper to this island's soul and centuries-old traditions.\n\nPerched where seven sacred peaks kiss the sky, Buahan commands Bali's most jaw-dropping view. The Ayung River trickles gently below while untouched jungle stretches endlessly before the infinity pool. This is nature's VIP lounge, where adventure doesn't knock - it surrounds you.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Gianyar",
    "location_subheading": "Indonesia",
    "location_description": "Buahan, a Banyan Tree Escape",
    "offer_address": "Banjar Selat, Buahan Kaja, Payangan, Gianyar, Bali 80572, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 773.0,
    "value": 773.0
  }
]