[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HufPIAS",
    "hero_image": "https://images.luxuryescapes.com/ij0okz5tbqhtywpr6lmf",
    "image_two": "https://images.luxuryescapes.com/z73i3wz8lflyyofimewe",
    "image_three": "https://images.luxuryescapes.com/ehn9767ljweean2ca6o",
    "vendor_name": "One&Only Kéa Island",
    "title": "One&Only Greek Island All-Villa Retreat with Sea-View Restaurant & Private Infinity Pools",
    "description": "Connecting guests with the elemental healing power of land and sea, this resort on the verdant Cycladic island of Kéa is your exclusive Greek haven. Each villa is thoughtfully designed with uninterrupted sea views and interiors crafted from local wood, stone and marble, setting a new standard for sophisticated island living.\n\nThe days all roll into one when you're running on Kéa island time, where rocky cliffs, rolling olive groves and ancient civilisations all sit side by side. At Atria Restaurant, uncover organic seasonal produce and freshly caught seafood, accompanied by sweeping sea views. When the evening comes round, unwind at Kosmos open-air bar for endless sunset views, or Incognito Speakeasy Bar - if you can find it!\n\nOne&Only Kéa Island enjoys an enviable position along breathtaking coastline, offering an oasis of calm located a short drive away from the vibrant heart of the island. Wander the quaint cobblestone streets of Ioulida, visit hilltop monasteries and discover Greece's hidden gems with unforgettable island hopping experiences and luxurious boat trips. Whichever part of paradise you choose to explore, pristine beaches and spectacular sunsets await.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Kea",
    "location_heading": "Kéa",
    "location_subheading": "Greece",
    "location_description": "One&Only Kéa Island",
    "offer_address": "Kéa Island 840 02, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1453.0,
    "value": 1453.0
  }
]