[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GfK0TAAV",
    "hero_image": "https://images.luxuryescapes.com/2rtm6b6539vnj8esqa",
    "image_two": "https://images.luxuryescapes.com/5kwsl0otcl033t67xuk",
    "image_three": "https://images.luxuryescapes.com/lwncx7hvmw19e9clxsk",
    "vendor_name": "Siri Nature Roost",
    "title": "Family-Friendly Chikkamagaluru Nature Escape with Daily Breakfast & Daily Dinner",
    "description": "Looking for an easy weekend escape? Welcome to Siri Nature Roost, a resort set in the popular town of Chikkamagaluru. Offering a pleasant climate year-round, Chikkamagaluru is a summer sojourn for many hill station lovers. The property is a tribute to Chikkamagaluru’s centuries-old history and tradition and has been designed to showcase the region’s essence, with crescent-shaped roofs that blend with the natural surroundings while providing protection from the elements. Villas equipped with jacuzzis or plunge pools and the hill station's lush green surroundings provide a relaxing experience. Enjoy delicious meals at Atithya restaurant, laze on your private deck, or take a half-day picnic under the private waterfall at Siri’s sister property - Jhari Eco Stay (additional charges apply).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Chikkamagaluru",
    "location_heading": "Chikkamagaluru",
    "location_subheading": "India",
    "location_description": "Siri Nature Roost",
    "offer_address": "SH 7, Allampura, Chikkamagaluru, Karnataka 577101, India",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 186.0,
    "value": 379.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DIs1lAAD",
    "hero_image": "https://images.luxuryescapes.com/6awbvf82zuttyxyff7",
    "image_two": "https://images.luxuryescapes.com/vl0uswcptum7j7m0egyn",
    "image_three": "https://images.luxuryescapes.com/xrrv9ctlbsc5sp0zmrp",
    "vendor_name": "Villa Urvinkhan Luxury Resort",
    "title": "Luxe Chikmagalur Coffee Estate Villa Stay with Daily All-Inclusive Dining",
    "description": "Cradled in the lush Western Ghats of Chikmagalur, Villa Urvinkhan Luxury Resort is a lavish paradise waiting to be discovered. This luxurious property's distinctive architecture effortlessly merges with the surrounding lush vegetation and foggy mountain landscape, fostering a sense of peace and calm. Located a five-hour drive from Bengaluru and three hours from Mangaluru International Airport (IXE), each of the guest villas and suites offers stunning views of the surrounding valley, hills, and mountain ranges, giving guests a complete sense of Chikmagalur's natural splendour. \n\nYou'll be lured to the stunning infinity pool, which provides sweeping views of the plantation and forests around. A walk within the plantation is sure to invigorate you with its heady scent of coffee and spices. All the meals in this luxury resort are handcrafted to perfection with locally sourced ingredients, which makes for a delicious and wholesome affair. \n\nVilla Urvinkhan is the ideal location, whether you're seeking a tranquil nature escape or an exhilarating adventure.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Mudigere",
    "location_heading": "Chikkamagaluru",
    "location_subheading": "India",
    "location_description": "Villa Urvinkhan Luxury Resort",
    "offer_address": "Urvinkhan B Estate Niduvale Mudigere Chikmagalur Karnataka 577122 India",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 545.0,
    "value": 0.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008J2KwAAK",
    "hero_image": "https://images.luxuryescapes.com/i8u7igowl5lcb14qz7a",
    "image_two": "https://images.luxuryescapes.com/ex9zczpwebnfsgw1f1fo",
    "image_three": "https://images.luxuryescapes.com/w7sksyftxcga1re2zll",
    "vendor_name": "Siri Nature Roost",
    "title": "Chikmagalur Wilderness Escape with Private Jacuzzi or Pool, Daily Breakfast & Daily Dinner",
    "description": "Unique architecture, pristine surroundings, and nature's sweetest melodies welcome you to the luxury oasis, Siri Nature Roost in Chikmagalur, ranked within the top 10% of properties on Tripadvisor.\n\nA five-hour scenic drive from Bengaluru city makes it an easy weekend getaway. Offering a year-round pleasant climate, Chikmagalur is a summer sojourn for many hill station lovers. The property is a tribute to Chikmagalur’s centuries-old history and tradition and has been designed to showcase the region’s essence. The crescent-shaped roofs blend with the natural surroundings while providing protection from the elements. Jacuzzis or plunge pools and lush green surroundings give you an ethereal experience that you can never forget. Enjoy delicious meals at the exquisite Aathitiya restaurant, laze on your private deck, or take a half-day picnic under the private waterfall at Siri’s sister property - Jhari Eco Stay (additional charges apply).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Chikkamagaluru",
    "location_heading": "Chikkamagaluru",
    "location_subheading": "India",
    "location_description": "Siri Nature Roost",
    "offer_address": "SH 7, Allampura, Chikkamagaluru, Karnataka 577101, India",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 207.0,
    "value": 385.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CxuLfAAJ",
    "hero_image": "https://images.luxuryescapes.com/pjxr1xcet64xxwovor8",
    "image_two": "https://images.luxuryescapes.com/a5ajzckjd89rewkazold",
    "image_three": "https://images.luxuryescapes.com/wylm83pln6lfnxqxrxk",
    "vendor_name": "Siri Nature Roost",
    "title": "Chikkamagaluru Escape with Private Jacuzzi or Pool, Daily Breakfast & Daily Dinner",
    "description": "Bored of the chaos in Bengaluru? Looking for an easy weekend escape? Welcome to Siri Nature Roost, a resort set in the popular town of Chikkamagaluru. Offering a year-round pleasant climate, Chikkamagaluru is a summer sojourn for many hill station lovers. The property is a tribute to Chikkamagaluru’s centuries-old history and tradition and has been designed to showcase the region’s essence. The crescent-shaped roofs blend with the natural surroundings while providing protection from the elements. Jacuzzis or plunge pools and the hill station's lush green surroundings give you a relaxing experience. Enjoy delicious meals at Atithya restaurant, laze on your private deck, or take a half-day picnic under the private waterfall at Siri’s sister property - Jhari Eco Stay (additional charges apply).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Chikkamagaluru",
    "location_heading": "Chikkamagaluru",
    "location_subheading": "India",
    "location_description": "Siri Nature Roost",
    "offer_address": "SH 7, Allampura, Chikkamagaluru, Karnataka 577101, India",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 221.0,
    "value": 373.0
  }
]