[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMR1SAAX",
    "hero_image": "https://images.luxuryescapes.com/jxqi0aj265h2cuzpyqc",
    "image_two": "https://images.luxuryescapes.com/z40wyq11cxc21ps36q5",
    "image_three": "https://images.luxuryescapes.com/pqv38r4sosrrm5z19na",
    "vendor_name": "Nirjhara",
    "title": "Bali Boutique Eco-Friendly Jungle Villas & Suites with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Discover your own piece of jungle paradise in the tranquil embrace of this luxurious five-star retreat nestled within the vibrant scenery of Tabanan, a 20-minute drive from the bustling hub of Canggu. Balinese opulence meets timeless luxury with this intimate suite and villa property, surrounded by verdant rice fields and lush tropical foliage. Elegant touches such as private rooftop baths, fine dining and infinity pools complete the stay. Crafted with recycled wood, indigenous stone and traditional sirap roofing, the authentic decor honours the natural beauty of the surroundings.\n\nIf you can bear to leave your private kingdom, myriad deluxe facilities await: relax by the property's waterfall or sink into serenity at the tranquil day spa. Exceptional cuisine is within easy reach at onsite restaurant Ambu, and it's an easy stroll to spectacular Balinese sunsets from Kendungu Beach. Nirjhara is perfectly placed for every type of Bali holiday - honeymooners will find privacy in romantic restaurants, families can safely frolic in the sand and friends will love hopping between beach bars and boutiques, all within walking distance.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tabanan",
    "location_heading": "Tabanan",
    "location_subheading": "Bali",
    "location_description": "Nirjhara",
    "offer_address": "Jalan Nirjhara, Belalang, Tabanan, Bali 82121, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 599.0,
    "value": 1819.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcBwtAAF",
    "hero_image": "https://images.luxuryescapes.com/yrxfi4un62en2sqt5r4",
    "image_two": "https://images.luxuryescapes.com/32g13xcogtk25vciyu",
    "image_three": "https://images.luxuryescapes.com/0nf86to21odr0s3i8f0d",
    "vendor_name": "Amarta Beach Retreat by Nakula",
    "title": "West Bali Serenity on Black Sand Beachfront with Daily Lunch or Dinner, Free-Flow Cocktail Hour & Airport Transfers",
    "description": "Reminiscent of old-school Bali's castaway charm, this tranquil retreat in Bali's west lets the island tropics shine. Be surrounded by swaying palms and verdant rice fields, all while perched directly on the black sands of Pasut Beach. \n\nFuel your body with only the freshest local ingredients at the beachfront restaurant, Lilly by the Sea, wash it down with a herbaceous tincture from the bar and indulge in a sweet treat at the bakery - specially made for retreat guests.\n\nTake advantage of wellness that goes beyond incredible spa therapies - look into your future with a Balinese palm reading or astrology session, meet with local healers, meditate, unwind to the soothing sounds of therapeutic singing bowls or find rejuvenation in a private yoga session. \n\nWhen you're rested and ready for adventure, travel to the slopes of Mount Batukaru, the volcano visible from your retreat, or venture into Canggu just 25 minutes away.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tabanan",
    "location_heading": "Tabanan",
    "location_subheading": "Bali",
    "location_description": "Amarta Beach Resort",
    "offer_address": "Banjar Pasut, Tibubiu, Kerambitan, Tabanan Regency, Bali 82161, Indonesia",
    "percentage_discount": 39.0,
    "min_duration": 7,
    "max_duration": 21,
    "price": 539.0,
    "value": 888.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HZpVIAW",
    "hero_image": "https://images.luxuryescapes.com/i3wxtbq2p34nxjqo1v",
    "image_two": "https://images.luxuryescapes.com/7x0hicy0ax6mp6cjufh",
    "image_three": "https://images.luxuryescapes.com/li1yvs6a8bimprbe5c5c",
    "vendor_name": "Oshom Bali",
    "title": "Grand Opening: Bali All-Suite Beachfront Indulgence with Daily Breakfast & Nightly Dinner",
    "description": "You can finally experience one of Bali's most hotly-anticipated resort stays. Just steps from the black sands of Nyanyi Beach, this opulent resort is part of the Nuanu Creative City complex, home to Bali's hottest new beach club, Luna, as well as The Labyrinth Collective artists' retreat and a wealth of dining and wellness sanctuaries.\n\nSpoil yourself with craft drinks and locally sourced, globally inspired fare at Akoya Restaurant and Akoya Bar - enjoy a decadent all-day breakfast before relaxing poolside with daily free-flowing cocktails, then pick your choice of lunch or dinner designed from a careful curation of organic, free-range produce that celebrates European cuisine.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tabanan",
    "location_heading": "Tabanan",
    "location_subheading": "Bali",
    "location_description": "Oshom Bali",
    "offer_address": "Jalan Pantai Nyanyi, Beraban, Kediri, Tabanan, Bali 82121, Indonesia",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 679.0,
    "value": 2001.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002ISywIAG",
    "hero_image": "https://images.luxuryescapes.com/kgbqnx3pi9hi7y0nnmk",
    "image_two": "https://images.luxuryescapes.com/563oor2f04mir6vyd3ec",
    "image_three": "https://images.luxuryescapes.com/7cubksqs9ah16u0pzqpk",
    "vendor_name": "Nirjhara",
    "title": "Boutique Bali Jungle Villas & Suites with Daily Breakfast, Nightly Cocktails & Massages",
    "description": "Discover a jungle paradise in the tranquil embrace of this five-star retreat nestled in the vibrant scenery of Tabanan. Balinese opulence meets timeless luxury at this intimate suite and villa property, surrounded by verdant rice fields and lush tropical foliage. Elegant touches such as private rooftop baths, fine dining and infinity pools complete the stay.\n\nCrafted with recycled wood, indigenous stone and traditional sirap roofing, the authentic decor honours the natural beauty of the surroundings. Relax by the property's waterfall, sink into serenity at the day spa, or sample exceptional cuisine at onsite restaurant Ambu. Just a short stroll from Nirjhara, you can enjoy spectacular Balinese sunsets on Kendungu Beach, making this resort an ideal choice for honeymooners, families and friends.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tabanan",
    "location_heading": "Tabanan",
    "location_subheading": "Bali",
    "location_description": "Nirjhara",
    "offer_address": "Jalan Nirjhara, Belalang, Tabanan, Bali 82121, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 1796.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X9GwtQAF",
    "hero_image": "https://images.luxuryescapes.com/ta5fuuciudaymgrsqjry",
    "image_two": "https://images.luxuryescapes.com/r56gchje1mpb4o5baoyj",
    "image_three": "https://images.luxuryescapes.com/jkr78l4k3cjxkumkqysf",
    "vendor_name": "Soori Bali",
    "title": "A-List Escape at Soori Bali - Including Decadent Dining & Drinks",
    "description": "Experience one of the Leading Hotels of the World, Soori Bali. Hidden within the untouched paradise of Bali's last wild frontier, this is Bali as it should be. Holiday like a star in a huge villa with a private infinity pool and enjoy daily breakfast, return airport transfers, nightly dinners created by a world-class chef including a ‘Flavours of Indonesia’ dinner, three-course fine dining experiences and a romantic candlelit seafood dinner on the beach, plus a 60-minute spa treatment each, Segway tour and Tanah Lot Temple sunset tour.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tabanan",
    "location_heading": "Tabanan",
    "location_subheading": "Bali",
    "location_description": "Soori Bali",
    "offer_address": "Banjar Dukuh, Desa Kelating, Kerambitan, Kelating, Kec. Tabanan, Kabupaten Tabanan, Bali 82161, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 2238.0,
    "value": 5498.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GXM29YAH",
    "hero_image": "https://images.luxuryescapes.com/l5cn5rq3dsso0gfyqbm",
    "image_two": "https://images.luxuryescapes.com/nnu1qsjwve58brextfiic",
    "image_three": "https://images.luxuryescapes.com/9jwrrsck8annrgdrk3li",
    "vendor_name": "Oshom Bali",
    "title": "Serene Bali Beachfront Escape with Onsite Restaurant & Outdoor Infinity Pool",
    "description": "Just steps from the black sands of Nyanyi Beach, this opulent resort is part of the Nuanu Creative City complex, home to Bali's hottest new beach club, Luna, as well as The Labyrinth Collective artists' retreat and a wealth of dining and wellness sanctuaries. Each suite here prioritises wellness and relaxation above all else. \n\nSpoil yourself with craft drinks and locally sourced, globally inspired fare at Akoya Restaurant and Akoya Bar - choose from a careful curation of organic, free-range produce that celebrates European cuisine. Take a dip in the sparkling infinity pool or enjoy a delicious cocktail and gaze out at the ocean.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tabanan",
    "location_heading": "Tabanan",
    "location_subheading": "Bali",
    "location_description": "Oshom Bali",
    "offer_address": "Jalan Pantai Nyanyi, Beraban, Kediri, Tabanan, Bali 82121, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 245.0,
    "value": 245.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DIwCiAAL",
    "hero_image": "https://images.luxuryescapes.com/5ffjl9fitmx43ran675v",
    "image_two": "https://images.luxuryescapes.com/i1vulobr18v2oujr2q",
    "image_three": "https://images.luxuryescapes.com/ghe0355ou8lckhhx88vr",
    "vendor_name": "Soori Bali",
    "title": "Celebrity-Favourite Oceanfront Bali Hideaway with Two World-Class Restaurants & Infinity Pool",
    "description": "The southwest coast of Bali is home to the five-star Soori Bali, an oceanfront and sustainably driven resort designed by award-winning architecture firm SCDA. Favoured by celebrities, this opulent retreat is dedicated to providing an A-list experience. The two restaurants use fresh produce from nearby farms and spices from their own garden to craft exquisite meals. If you're craving premium Western cuisine, secure a table at Ombak, while the open-air Cotta serves authentic Indonesian cuisine. The palm-fringed infinity pool blends into the horizon, offering a pleasant space to forget the world, while Soori Spa and its menu of pampering treatments offer a transcendental experience.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tabanan",
    "location_heading": "Tabanan",
    "location_subheading": "Bali",
    "location_description": "Soori Bali",
    "offer_address": "Banjar Dukuh, Desa Kelating, Kerambitan, Tabanan, Bali 82161, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 987.0,
    "value": 987.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcfR6AAJ",
    "hero_image": "https://images.luxuryescapes.com/zswie809ld5zjupb9hoj",
    "image_two": "https://images.luxuryescapes.com/6qc4n9rtwvis4d5bvfg",
    "image_three": "https://images.luxuryescapes.com/4rom26p67e34n6l6w984b",
    "vendor_name": "Nirjhara",
    "title": "Bali Five-Star Boutique Sustainable Jungle Villas Amid Rice Paddies",
    "description": "Find your slice of jungle paradise at Nirjhara, a serene five-star sanctuary set in the timeless landscape of Tabanan. Bali opulence is taken to new heights at this sustainable enclave, with each intimate suite and villa surrounded by verdant rice fields and lush tropical foliage, and offering luxe touches like rooftop baths or private infinity pools. Recycled wood, natural stone and traditional sirap roofing combine to create authentic decor that preserves the natural landscape. If you can bear to leave your private kingdom, myriad deluxe facilities await: dive into the glistening pool, relax by the property's waterfall or sink into serenity at the tranquil day spa. Exceptional cuisine is within easy reach at onsite restaurant Ambu, and it's an easy stroll to spectacular Balinese sunsets from Kendungu Beach.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tabanan",
    "location_heading": "Tabanan",
    "location_subheading": "Bali",
    "location_description": "Nirjhara",
    "offer_address": "Jl. Nirjhara, Banjar Kedungu, Desa Belalang, Kediri, Tabanan 82121, Bali, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 244.0,
    "value": 244.0
  }
]