[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005Iie0AAC",
    "hero_image": "https://images.luxuryescapes.com/vln3kl1bfcvsjaq81j8",
    "image_two": "https://images.luxuryescapes.com/6bkm0p9kxpg44se0z9hq",
    "image_three": "https://images.luxuryescapes.com/bcazqc2mbdw7v84e8wtg",
    "vendor_name": "The Westin Las Vegas Hotel & Spa",
    "title": "Las Vegas Westin Indulgence Steps from the Strip with Daily Breakfast",
    "description": "Experience Las Vegas' over-the-top personality, A-list lounges and penny slots with a lavish stay at The Westin Las Vegas Hotel & Spa. A taste of Hollywood glitz for everyone, where you play the role instead of watching it, Las Vegas is the ultimate escape. Stay just steps from the bright lights of Las Vegas Boulevard and its endless labyrinth of mega-resorts, shops and restaurants. This luxurious hotel is the perfect launchpad for exploring this slice of the Mojave Desert, with the Bellagio Fountain, Paris Las Vegas and New York-New York Hotel & Casinos all within walking distance.\n\nStamped with a Tripadvisor Travellers' Choice 2021 award, the hotel offers guests state-of-the-art amenities and outstanding service, from the extravagant spa and pool with sauna to delicious cocktails and expert chefs preparing signature dishes at Jake & Eli Restaurant.\n\n**Your handpicked inclusions:**\n\n- Start the day with a delicious daily à la carte breakfast at Jake & Eli Restaurant\n- Arrive ready for your escape with guaranteed 1pm early check-in\n- Relax a little longer with guaranteed 2pm late checkout\n- Enjoy onsite amenities with a waived daily resort fee\n- Make the most of daily self-parking for one car\n\n**Travelling with family or friends?** Upgrade to the Deluxe Guest Room (Double) or Traditional Guest Room (Double) with two double beds for up to four guests.\n\n**Book with Confidence:** We work directly with our trusted partners and provide 24/7 customer service to ensure that no matter what happens, we’re here to help. If your escape is affected by Covid-19 restrictions, we will do our best to assist you with a date change or provide you with a Luxury Escapes credit for another Limited Time Lux Exclusive accommodation, tour or cruise offer, less any unrecoverable costs; excludes flights. [Find out more.](https://luxuryescapes.com/escape-with-confidence)",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Nevada",
    "offer_geo_area_level_2": "Las Vegas",
    "location_heading": "Las Vegas",
    "location_subheading": "United States",
    "location_description": "The Westin Las Vegas Hotel & Spa",
    "offer_address": "160 East Flamingo Road, Las Vegas, Nevada 89109, United States",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 499.0,
    "value": 975.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4JwfAAF",
    "hero_image": "https://images.luxuryescapes.com/niwsmvrfrdaqy7pbm6r5",
    "image_two": "https://images.luxuryescapes.com/2skoa7dtx30n5naqw97",
    "image_three": "https://images.luxuryescapes.com/tolhuqxdkbqnbpl3lccc",
    "vendor_name": "The Westin Las Vegas Hotel & Spa",
    "title": "USA Westin Glamour Steps from Las Vegas Strip with Daily Dining Credit",
    "description": "Experience the over-the-top glamour, A-list celebrity lifestyle and dazzling neon of Las Vegas with a lavish stay at The Westin Las Vegas Hotel & Spa. Whether you've come to put it all on black, take in a show or simply soak up the electric atmosphere, your luxurious hotel is just steps from the bright lights of the Strip. Cruise Las Vegas Boulevard's glittering parade of mega-resorts, shops and restaurants, with the Bellagio Fountain, Paris Las Vegas and New York-New York Hotel & Casinos all within walking distance.\n\nTaste the glitz and glamour of the city that never sleeps, then recharge your batteries in the comfort of your tranquil retreat. Hit the holiday jackpot with the hotel's state-of-the-art amenities, from the extravagant spa and pool, steamy sauna and restorative health club, to delicious cocktails and signature dishes at The Good Plate Restaurant.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Nevada",
    "offer_geo_area_level_2": "Las Vegas",
    "location_heading": "Las Vegas",
    "location_subheading": "United States",
    "location_description": "The Westin Las Vegas Hotel & Spa",
    "offer_address": "160 East Flamingo Road, Las Vegas, Nevada 89109, United States",
    "percentage_discount": 32.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 844.0,
    "value": 1241.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EziMHAAZ",
    "hero_image": "https://images.luxuryescapes.com/ef6x7xfyb7jmpqtth8sw",
    "image_two": "https://images.luxuryescapes.com/r1c9huzpmdnnrmrin7j6",
    "image_three": "https://images.luxuryescapes.com/dsg0mg07blog63gsqb6h",
    "vendor_name": "Aria Las Vegas",
    "title": "Glamorous Resort and Casino on the Las Vegas Strip with 18 Restaurants plus 11 Bars & Clubs",
    "description": "There’s glamour, and then there’s ARIA Resort and Casino. A beacon of sophistication standing proud in the middle of Las Vegas’ famous strip, discover the epitome of five-star luxury around every corner of this architectural masterpiece. Widely celebrated for its unrivalled offerings, explore a world-class casino, 18 concept eateries including iconic names like CATCH and Carbone, and an abundance of bars, clubs and lounges ideal for refreshing drinks and evenings full of fun.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Nevada",
    "offer_geo_area_level_2": "Las Vegas",
    "location_heading": "Las Vegas",
    "location_subheading": "USA",
    "location_description": "ARIA Resort and Casino",
    "offer_address": "3730 S Las Vegas Boulevard, Las Vegas NV 89158, USA",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C1jS9AAJ",
    "hero_image": "https://images.luxuryescapes.com/obx68wl5a9346bovskv8",
    "image_two": "https://images.luxuryescapes.com/pa2hmqmqbsqlqxe5411q",
    "image_three": "https://images.luxuryescapes.com/46r1f734wizmhiboofp6",
    "vendor_name": "Conrad at Resorts World Las Vegas",
    "title": "Las Vegas Mega-Resort with Over 40 Bars & Restaurants",
    "description": "Hit the holiday jackpot with a stay at Conrad Las Vegas at Resorts World, a mega-resort on the famous Las Vegas Strip that's taken claim as the largest Conrad resort in the world. There are more than 40 restaurants and bars to choose from, so you can take a global gourmet tour without even leaving the hotel. From steakhouses to Japanese bistros, you'll be spoilt for choice. There's also a huge casino complex, light shows, shopping, the Resorts World Theatre, five swimming pools and the Awana Spa.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Nevada",
    "offer_geo_area_level_2": "Las Vegas",
    "location_heading": "Las Vegas",
    "location_subheading": "United States",
    "location_description": "Conrad Las Vegas at Resorts World",
    "offer_address": "111 W Resorts World Dr, Las Vegas, NV 89109, United States",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 187.0,
    "value": 187.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AbVE4AAN",
    "hero_image": "https://images.luxuryescapes.com/8a6z3y608ntab9gyj99m",
    "image_two": "https://images.luxuryescapes.com/0xbu6l8bev6gibqnx69",
    "image_three": "https://images.luxuryescapes.com/gq967d0nlk76rkqhd5ns",
    "vendor_name": "Wynn Las Vegas",
    "title": "Wynn Las Vegas Five-Star Luxury on the Strip with 18-Hole Golf Course & 29 Eateries",
    "description": "Step into a world of unmatched appeal at the Wynn Las Vegas & Encore Resort, one of the largest five-star resorts in the world, known for its exceptionally high level of glitz and glamour. This opulent retreat incorporates the festive allure of Vegas with winsome design and entertainment, creating a refined setting, unique on the Strip. Exclusive Wynn Tower and Encore Tower suites offer added benefits like a private pool deck, secluded entrances and daily credit for breakfast at any onsite venue. Indulge in 29 restaurants and bars, from SW Steakhouse overlooking the Lake of Dreams, to chic European-inspired al fresco dining at Tableau, and all-American Charlie’s Sports Bar - there is an option for everyone, be it fine dining or lively crowd-pleasing fun.\n\nEntertainment at the Wynn Las Vegas & Encore Resort is endless. Watch phantasmic staged cirque shows in the custom-designed 360-degree theatre and roll with laughter when hit stand-up comedians take the Encore Theater stage. Dance the night away at two nightclubs known for attracting world-renowned DJs, tee off at the 18-hole golf course, cool off at the Beach Club, discover luxury shopping and let the casino keep you entertained throughout the day and night.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Nevada",
    "offer_geo_area_level_2": "Las Vegas",
    "location_heading": "Las Vegas",
    "location_subheading": "USA",
    "location_description": "Wynn Las Vegas & Encore Resort",
    "offer_address": "3131 Las Vegas Boulevard South, Las Vegas, NV 89109 USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 229.0,
    "value": 229.0
  }
]