[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IzKvIAK",
    "hero_image": "https://images.luxuryescapes.com/9nk6ebw4hokock2qfati",
    "image_two": "https://images.luxuryescapes.com/j98cmjd278i1vrx3lig",
    "image_three": "https://images.luxuryescapes.com/uavaezptbz9f4yg62b",
    "vendor_name": "Mount William Station",
    "title": "Boutique Grampians Homestead Indulgence with Daily Breakfast & Nightly Three-Course Dinner",
    "description": "Country charm meets contemporary elegance at this boutique homestead, surrounded by the boundless beauty of the Grampians in Victoria. This sprawling 1800s estate has been restored to its former glory following a 2022 renovation, yet still exudes the nostalgia of the pioneering Australian spirit.\n\nThis heritage homestead sits among a picturesque five-acre garden, providing a magical setting to unwind and relax away from the stresses of everyday life. Discover the ideal launchpad to explore the region's abundance of beauty, with the trails of the Grampians National Park within easy driving distance.\n\nA commitment to farm-to-fork culinary excellence rounds out the perfect regional stay: mornings begin with an a la carte breakfast with barista-poured coffee, while evenings are made special with an indulgent three-course dinner prepared by the hotel's executive chef.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Willaura",
    "location_heading": "Willaura",
    "location_subheading": "Victoria",
    "location_description": "Mount William Station",
    "offer_address": "118 Mount William Estate Road, Willaura, Victoria 3379, Australia",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 559.0,
    "value": 921.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008g13HAAQ",
    "hero_image": "https://images.luxuryescapes.com/vhaqv95cy8kwaszlcdh",
    "image_two": "https://images.luxuryescapes.com/vraze7g7v43ey01hi56h",
    "image_three": "https://images.luxuryescapes.com/jsk5y7wtmk254he9ie",
    "vendor_name": "Mount William Station",
    "title": "Grampians Heritage Homestead Group Escape with Private Chef Dinner & Daily Breakfast",
    "description": "Country charm meets contemporary elegance at historic boutique homestead Mount William Station, surrounded by the boundless beauty of the Grampians. The 1800s estate has been restored to its former glory following a 2022 renovation, yet still exudes the nostalgia of the pioneering Australian spirit. This heritage homestead sits among a picturesque five-acre garden, providing a magical setting to unwind and relax away from the hustle and bustle of city life. Laze by the pool, play tennis or stop and appreciate the small things in the rose garden. After full days, relax with banter over a drink by the fire or gather together for a meal in the country kitchen. Best of all, you'll have exclusive use of the homestead for your group, so the facilities are yours to enjoy.\n\nLocated on the fringe of the beautiful Grampians National Park, this gorgeous property is well-placed for discovering the region’s abundance of natural beauty, historical significance and sweeping hiking trails. The homestead feels like a world away on its 7,500-acre estate, where you're promised complete privacy and serenity.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Willaura",
    "location_heading": "Willaura",
    "location_subheading": "Victoria",
    "location_description": "Mount William Station",
    "offer_address": "118 Mount William Estate Road, Willaura, Victoria 3379, Australia",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 3101.0,
    "value": 5966.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuzMRAAZ",
    "hero_image": "https://images.luxuryescapes.com/dnjm3o9e38hm9flia88v",
    "image_two": "https://images.luxuryescapes.com/58ggufj1o3jb4d83z3mr",
    "image_three": "https://images.luxuryescapes.com/0qmsj6trel1w6p461q0l",
    "vendor_name": "Mount William Station",
    "title": "Boutique Grampians Homestead Indulgence with Private Chef Dinner & Daily Breakfast",
    "description": "Country charm meets contemporary elegance at boutique homestead Mount William Station, surrounded by the boundless beauty of the Grampians. The 1800s estate has been restored to its former glory following a 2022 renovation, yet still exudes the nostalgia of the pioneering Australian spirit. This heritage homestead sits among a picturesque five-acre garden, providing a magical setting to unwind and relax away from the hustle and bustle, while also forming the ideal launchpad to explore the region's abundance of beauty. A commitment to farm-to-fork culinary excellence rounds out the perfect regional stay: mornings begin with an a la carte breakfast with barista-poured coffee, while one evening is perfectly matched with a two-course, set-menu dinner prepared by the hotel's private chef.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Willaura",
    "location_heading": "Willaura",
    "location_subheading": "Victoria",
    "location_description": "Mount William Station",
    "offer_address": "118 Mount William Estate Road, Willaura, Victoria 3379, Australia",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 419.0,
    "value": 1086.0
  }
]