[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gbvEAAQ",
    "hero_image": "https://images.luxuryescapes.com/4si72szi0i6bvr226rr",
    "image_two": "https://images.luxuryescapes.com/tdllymiker1bwbiwvosr",
    "image_three": "https://images.luxuryescapes.com/t4nk6lxkjn7g5z4br4fb",
    "vendor_name": "Grand Park Kodhipparu Maldives",
    "title": "Maldives Overwater Villa Luxury with Daily Dining, US$100 Food & Drinks Credit & Roundtrip Speedboat Transfers",
    "description": "Step into your picture-perfect escape, on an exquisite island home to the Park Hotel Group's first Maldives luxury resort, Grand Park Kodhipparu Maldives. Perfect for all ages, this Maldivian wonder offers a collection of beguiling villas, beautifully designed by the award-winning hospitality firm Hirsch Bedner Associates. Easy access to the beach means you can walk from your room into clear waters teeming with exotic marine life, and the resort's signature hospitality stops at nothing to give you the best vacation of your life.\n\nLocated just a 20-minute speedboat ride from Velana International Airport, Malé, this pristine sanctuary will mesmerise all your senses. Mouth-watering cuisine and scenic views go hand-in-hand, underwater worlds wait to be explored, and holistic wellness at an exquisite overwater spa will awaken your senses and help you disconnect. For the ultimate experience, lose yourself on a sunset cruise, where nature touches your soul and leaves you with everlasting memories of your Maldives haven.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Kuda Vattaru",
    "location_heading": "Kuda Vattaru",
    "location_subheading": "Maldives",
    "location_description": "Grand Park Kodhipparu Maldives",
    "offer_address": "Grand Park Kodhipparu, Maldives 08121",
    "percentage_discount": 30.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 2599.0,
    "value": 3717.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004S0KcAAK",
    "hero_image": "https://images.luxuryescapes.com/cr0dh5vf6y4cw2bwpav",
    "image_two": "https://images.luxuryescapes.com/hncbgv0z5c2dcejgcm7v",
    "image_three": "https://images.luxuryescapes.com/vepvj13txuif8bi7mi",
    "vendor_name": "Grand Park Kodhipparu Maldives",
    "title": "Maldives Overwater Villa Hideaway with All-Inclusive Dining & Nightly Drinks",
    "description": "The exclusive castaway life is yours amid the Maldives' azure waters at the recently reopened Grand Park Kodhipparu Maldives - a glorious sweep of villas sitting above an unimaginably clear lagoon in the Indian Ocean, with a kaleidoscopic house reef of vibrant marine life lapping at its fringes. A conveniently close island fantasy in the North Malé Atoll, this is a place of unsurpassed beauty, with Velana International Airport just a 20-minute speedboat transfer away.\n\nBy day, dip into the warm waters of the lagoon, and as dusk falls watch cinematic sunsets unfold across the endless horizon. This is a picturesque sanctuary where you can savour fresh island flavours at the beachfront Edge restaurant, watch a movie under the stars and harness your flow with complimentary yoga - find your own perfect paradise at Grand Park Kodhipparu Maldives.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Kuda Vattaru",
    "location_heading": "Kuda Vattaru",
    "location_subheading": "Maldives",
    "location_description": "Grand Park Kodhipparu Maldives OLD",
    "offer_address": "Grand Park Kodhipparu Kodhipparu Maldives 08121 Maldives",
    "percentage_discount": 44.0,
    "min_duration": 4,
    "max_duration": 14,
    "price": 3099.0,
    "value": 5583.0
  }
]