[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PdVgAAK",
    "hero_image": "https://images.luxuryescapes.com/875grrhvzgvbvgizl0b",
    "image_two": "https://images.luxuryescapes.com/9b5aot1qj9yem1ge06",
    "image_three": "https://images.luxuryescapes.com/jb95bhxps5eurt1djfs",
    "vendor_name": "The Sebel Melbourne Ringwood",
    "title": "Grand Opening: Gateway to the Yarra Valley Sebel Stay with Self-Guided Mystery Picnic & Daily Breakfast",
    "description": "Lush rolling vineyards, bespoke distilleries and acclaimed paddock-to-fork restaurants are at your fingertips from The Sebel Melbourne Ringwood. Perfectly poised at the gateway to Victoria's renowned Yarra Valley - in the up-and-coming Ringwood region - boasting design-driven architecture, luxe amenities, stylish rooms and a European-inspired restaurant and bar, this luxurious base is the perfect launchpad for a gourmet escape.\n\nIn less than 30 minutes you’ll reach the historic vineyards, cellar doors and microbreweries of Coldstream and Yering, before reaching the hub of the Yarra Valley. From here, feel a world away as you follow trails through towering forests, compare cellar-door tasting notes at over 80 wineries, graze your way through the local culinary scene, treat yourself to a relaxing spa experience or indulge your love of chocolate in a beautiful countryside dairy factory. Stocking up at farm gates as you go, there’s simply no better way to discover a region where creativity, tradition and nature go hand-in-hand than at The Sebel Melbourne Ringwood.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Ringwood",
    "location_subheading": "Victoria",
    "location_description": "The Sebel Melbourne Ringwood",
    "offer_address": "96 Maroondah Hwy, Ringwood VIC 3134",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 247.0,
    "value": 480.0
  }
]