[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EhS7RYAV",
    "hero_image": "https://images.luxuryescapes.com/qh5ayjqnhtgqgpm9psb",
    "image_two": "https://images.luxuryescapes.com/jsyjng11q8avljlpt42f",
    "image_three": "https://images.luxuryescapes.com/ddw2cxzhtrjnq6nmy1n",
    "vendor_name": "Elevate Bali",
    "title": "Luxurious Bali Private Hilltop Villas with Daily Breakfast, Nightly Dinner & Nightly Cocktails",
    "description": "Escape to the secluded northern highlands of Bali, home to one of the region’s few five-star boutique villa collections. Witness a vast jungle melting into the horizon from this sky-high retreat, promising unbeatable panoramic views over the misty mountains of Munduk. \n\nSwim to the edge of the heated infinity pool that feels like the edge of the world, then continue the fantasy with a culinary journey among the clouds. Indulge in Cloud Kitchen’s fusion of Western and Balinese cuisines and sip on cocktails as the sun casts an evening glow over the emerald peaks.\n\nStep away from the resort to discover Munduk, an untouched corner of Bali with enchanting landscapes, far from the hustle and bustle of larger towns. Uncover the hidden temples of Tamblingan Lake, experience local life at the Candy Kuning traditional market and behold the cascading Banyumala twin waterfalls.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Munduk",
    "location_heading": "Munduk",
    "location_subheading": "Bali",
    "location_description": "Elevate Bali",
    "offer_address": "Munduk, Banjar Kabupaten Buleleng, Bali 81152, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 25,
    "price": 789.0,
    "value": 1997.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BccBmAAJ",
    "hero_image": "https://images.luxuryescapes.com/gry6e0y3dq14p6u0f2v6",
    "image_two": "https://images.luxuryescapes.com/sz8w9wfkfk2wlggrals",
    "image_three": "https://images.luxuryescapes.com/ks3zpykjbghyherukv",
    "vendor_name": "Elevate Bali",
    "title": "Grand Opening: Serene Bali Private Hilltop Villas with Daily Breakfast & Cocktails",
    "description": "Nestled amid the secluded northern highlands of Bali is where you'll find a boutique collection of luxurious private villas at Elevate Bali by Hanging Gardens, a newly-opened resort from the five-star Hanging Gardens of Bali. Witness vast jungle melting into the horizon from this sky-high retreat promising unbeatable views over the misty mountains of Munduk. Swim to the edge of the infinity pool and feel like you're truly on top of the world, then continue the fantasy with a culinary journey among the clouds, tasting flavour-packed cuisine or sipping on a cocktail as the sun casts an evening glow over the emerald peaks.\n\nVenture outside the resort to discover Munduk, an untouched part of Bali, and take a day to explore the hidden temples of Tamblingan lake or make your way to Twin Lakes Viewpoint for awe-inspiring views. With waterfalls and sacred sites around every corner, you'll enjoy a Balinese escape that allows you to reconnect with nature, find serenity and enjoy tranquil moments away from the hustle and bustle of the larger towns.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Munduk",
    "location_heading": "Munduk",
    "location_subheading": "Bali",
    "location_description": "Elevate Bali",
    "offer_address": "Munduk, Banjar Kabupaten Buleleng, Bali 81152, Indonesia",
    "percentage_discount": 33.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 669.0,
    "value": 1000.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqrONAAZ",
    "hero_image": "https://images.luxuryescapes.com/mujomx7n6nsnbzalvmu",
    "image_two": "https://images.luxuryescapes.com/opn0jyuzbaeynmu351td",
    "image_three": "https://images.luxuryescapes.com/6ato6btmvu3k26bmh9vc",
    "vendor_name": "Elevate Bali",
    "title": "Luxurious Bali Private Hilltop Villas with Daily Breakfast & Cocktail Hour",
    "description": "Nestled amid the secluded northern highlands of Bali is where you'll find a boutique collection of luxurious private villas at Elevate Bali by Hanging Gardens, a branch-off resort from the five-star Hanging Gardens of Bali. Witness a vast jungle melting into the horizon from this sky-high retreat, promising unbeatable panoramic views over the misty mountains of Munduk. Swim to the edge of the heated infinity pool and feel like you're truly on top of the world, then continue the fantasy with a culinary journey among the clouds, tasting flavour-packed cuisine or sipping on a cocktail as the sun casts an evening glow over the emerald peaks.\n\nVenture outside the resort to discover Munduk, an untouched part of Bali, and take a day to explore the hidden temples of Tamblingan Lake or make your way to Twin Lakes for awe-inspiring views. With waterfalls and sacred sites around every corner, you're in for a Balinese escape that allows you to reconnect with nature, find serenity and enjoy tranquil moments away from the hustle and bustle of the larger towns.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Munduk",
    "location_heading": "Munduk",
    "location_subheading": "Bali",
    "location_description": "Elevate Bali",
    "offer_address": "Munduk, Banjar Kabupaten Buleleng, Bali 81152, Indonesia",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 27,
    "price": 599.0,
    "value": 1304.0
  }
]