[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IeBjrAAF",
    "hero_image": "https://images.luxuryescapes.com/ukrgow6wt9g323r5ie2k",
    "image_two": "https://images.luxuryescapes.com/apundkek55hn35bjr1q",
    "image_three": "https://images.luxuryescapes.com/c82hmkltyjggzvh0fb1c",
    "vendor_name": "Hotel U Capu Biancu",
    "title": "Sun-Kissed Corsica Clifftop Elegance with Three Secluded Beaches & Daily Breakfast",
    "description": "Experience the soul of Corsica with a secluded luxury stay at this idyllic family-run hotel, nestled on the southern coast of the French island. With access to three pristine beaches, and encased by rugged cliffs and lush maquis shrubland, U Capu Biancu is perfectly perched for days spent discovering stunning natural beauty amid tranquil landscapes. Revel in locally sourced, seasonal flavours over sunset views at the panoramic restaurant, savour Corsican meats and cheeses with local wine at The Cellar, or treat yourself to a cocktail and a game of pool at the bar - there's a place for everyone to unwind.\n\nFor ultimate relaxation, enjoy time to yourself at the onsite spa or bask in seaside serenity at one of the beaches at the foot of the hotel. Lounge on a canopy bed on the aptly named Lazy Beach as you're served refreshing drinks in the sun, or explore Corsica's crystal clear waters on a canoe, paddleboard or pontoon from Hut Beach.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Corsica",
    "offer_geo_area_level_2": "Bonifacio",
    "location_heading": "Corsica",
    "location_subheading": "France",
    "location_description": "U Capu Biancu",
    "offer_address": "Domaine de Pozzoniello, Bonifacio, Corsica 20169, France",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 13,
    "price": 849.0,
    "value": 2155.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Fzu6HYAR",
    "hero_image": "https://images.luxuryescapes.com/jbcr8ce8rajx5lj8jm3j",
    "image_two": "https://images.luxuryescapes.com/f92yj0ro08xtkimdagg",
    "image_three": "https://images.luxuryescapes.com/hsmhtd8tqfzn561d2fj",
    "vendor_name": "Hotel U Capu Biancu",
    "title": "Sun-Kissed Corsica Clifftop Haven with Three Secluded Beaches & Daily Breakfast",
    "description": "Experience the soul of Corsica with a secluded stay at this idyllic family-run hotel, nestled on a cliff on the island's southern coast. With access to three pristine beaches and encased by lush shrubland, this coastal hotel is perfectly perched for days spent discovering stunning natural beauty amid tranquil landscapes.\n\nRevel in locally sourced, seasonal flavours over sunset views at The Panoramic Restaurant, savour Corsican meats and cheeses with local wine at The Cellar, or treat yourself to a cocktail and a game of pool at the bar. For the ultimate relaxation, enjoy time to yourself at the onsite spa or bask in seaside serenity at one of the beaches at the base of the cliff.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Corsica",
    "offer_geo_area_level_2": "Bonifacio",
    "location_heading": "Corsica",
    "location_subheading": "France",
    "location_description": "U Capu Biancu",
    "offer_address": "Domaine de Pozzoniello, Bonifacio, Corsica 20169, France",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 919.0,
    "value": 2240.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000G4b7pYAB",
    "hero_image": "https://images.luxuryescapes.com/rrx2w6z06i12fhlqpa6",
    "image_two": "https://images.luxuryescapes.com/wm01zzf3umr8wicjrjb4",
    "image_three": "https://images.luxuryescapes.com/ir59dk3upeq3631y8aa",
    "vendor_name": "Bartaccia Hôtel",
    "title": "Secluded French Island Luxury in South Corsica with Daily Breakfast, Dining Credit & Three-Course Dinner",
    "description": "Tucked away amid three hectares of lush gardens and only 500 metres from Corsica's sugar-fine sands, this peaceful hideaway offers a Mediterranean escape away from the noise. Brimming with untamed beauty, rugged landscapes and pristine shores, it's no wonder they call this the Isle of Beauty, and Bartaccia Hôtel embodies its very essence.\n\nStart your day with al-fresco breakfast before laps in one of two crystal pools, or take a dip in the jacuzzi with a drink from the Spa Bar. Explore the island's golden beaches, quaint villages and mountainous landscapes, and return to U Spuntinu for the finest Mediterranean flavours. Cap the evenings off with aperitifs at A Cena bar paired with the hotel's serene surroundings.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Corsica",
    "offer_geo_area_level_2": "Propriano",
    "location_heading": "Corsica",
    "location_subheading": "France",
    "location_description": "Bartaccia Hôtel",
    "offer_address": "Route de la Corniche, 12 Qur Bartaccia, Propriano, Corsica 20110, France",
    "percentage_discount": 54.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 459.0,
    "value": 988.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J0hxIAC",
    "hero_image": "https://images.luxuryescapes.com/9o2ghf9f9g766b3v4wbd",
    "image_two": "https://images.luxuryescapes.com/wkbka3ukym6y2xrbvf7",
    "image_three": "https://images.luxuryescapes.com/8t7k6r945c61nj7drx6f",
    "vendor_name": "Hotel U Capu Biancu",
    "title": "Sun-Kissed Corsica Clifftop Haven with Three Secluded Beaches & Daily Breakfast",
    "description": "Experience the soul of Corsica with a secluded luxury stay at this idyllic family-run hotel, nestled on the southern coast of the French island. With access to three pristine beaches, and encased by rugged cliffs and lush maquis shrubland, U Capu Biancu is perfectly perched for days spent discovering stunning natural beauty amid tranquil landscapes.\n\nRevel in locally sourced, seasonal flavours over sunset views at The Panoramic Restaurant, savour Corsican meats and cheeses with local wine at The Cellar, or treat yourself to a cocktail and a game of pool at the bar - there's a place for everyone to unwind.\n\nFor ultimate relaxation, enjoy time to yourself at the onsite spa or bask in seaside serenity at one of the beaches at the foot of the hotel. Lounge on a canopy bed on the aptly named Lazy Beach as you're served refreshing drinks in the sun, or explore Corsica's crystal clear waters on a canoe, paddleboard or pontoon from Hut Beach.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Corsica",
    "offer_geo_area_level_2": "Bonifacio",
    "location_heading": "Corsica",
    "location_subheading": "France",
    "location_description": "U Capu Biancu",
    "offer_address": "Domaine de Pozzoniello, Bonifacio, Corsica 20169, France",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 849.0,
    "value": 2075.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000C5HUMYA3",
    "hero_image": "https://images.luxuryescapes.com/jms3pkhxgj95a6xt5g8",
    "image_two": "https://images.luxuryescapes.com/7atjvr3uppqlrkjnqb1r",
    "image_three": "https://images.luxuryescapes.com/8cvzhjwh9cow0cxbre6u",
    "vendor_name": "La Villa Calvi",
    "title": "Oceanfront Corsican Opulence with Five Pools, Wellness Spa & Four Restaurants & Bars",
    "description": "Escape to Calvi, a medieval citadel on Corsica, to discover a five-star retreat set amongst lush gardens. La Villa Calvi perfectly balances health and hedonism, with a serene spa and hammam, a timetable of exercise classes and a decadent restaurant and bar, including the panoramic La Table by La Villa.\n\nFive swimming pools are dotted throughout the property, with an exceptional bar serving French wine and icy cocktails against vistas of the Meditteranean, and a seasonal pool bar. Further afar, hiking adventures and UNESCO-listed sites await, along with the option for sunset boat tours and wine tastings.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Corsica",
    "offer_geo_area_level_2": "Calvi",
    "location_heading": "Corsica",
    "location_subheading": "France",
    "location_description": "La Villa Calvi",
    "offer_address": "Chemin de Notre Dame de la Serra, 20260, Calvi, Corsica, France",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 369.0,
    "value": 369.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UN9JAAW",
    "hero_image": "https://images.luxuryescapes.com/2hn2057ludq3i1vgyjvm",
    "image_two": "https://images.luxuryescapes.com/5ozgr5sret2odu7w2bb",
    "image_three": "https://images.luxuryescapes.com/93hsb0k4mnph21rin8wa",
    "vendor_name": "Aethos Corsica",
    "title": "Boutique Mediterranean Island Escape in Corsica",
    "description": "Tranquillity, charm and history go hand-in-hand at Aethos Corsica - a restored 17th-century palace set atop a spectacular village on the Mediterranean island of Corsica. This family-owned boutique hotel boasts arresting views across the northern bay of France's Saint-Florent and its unspoiled beaches. Aethos Corsica features just nine tastefully stylish rooms, and each one looks out across the surrounding mountains and sea. The immaculately manicured garden, dotted with olive and palm trees, surrounds the heart of the hotel - a 20-metre lap pool perfectly suited to relaxed afternoons spent on sunbeds or swimming.\n\nThe astounding geographical diversity of Corsica will not be lost on you, as there are endless ways for you to explore this mountainous Mediterranean paradise. When you are ready to step away from your hilltop hideaway, ranked within the top 10% of properties on Tripadvisor, you could spend your days hiking along the nearby trails or, if water-based adventure is more to your tastes, hire a kayak, snorkelling gear or fishing equipment to see what hides below the ocean's glistening surface. Unforgettable experiences await, and a stay at the regal Aethos Corsica makes living out your Mediterranean island fantasy effortless.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Corsica",
    "offer_geo_area_level_2": "Oletta",
    "location_heading": "Corsica",
    "location_subheading": "France",
    "location_description": "Aethos Corsica",
    "offer_address": "Lieu Dit Paganacce, 20232 Oletta, France",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 22,
    "price": 149.0,
    "value": 149.0
  }
]