[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CQ2hAAG",
    "hero_image": "https://images.luxuryescapes.com/znsfa2hl7jfi9cbxezd",
    "image_two": "https://images.luxuryescapes.com/sm0jt9u7wfixe8erqz7a",
    "image_three": "https://images.luxuryescapes.com/4mjvs5qii8qn8pf5ukgn",
    "vendor_name": "Chospa Hotel Leh",
    "title": "Exotic Leh Himalayan Escape with Three-Course Dinner & Daily Breakfast",
    "description": "Bask in the glory of Leh's surreal beauty with a stay at the eco-friendly Chospa Hotel Leh, enviably located on the coveted Old Leh Road and just a 90-minute flight from Delhi. A world away from the ordinary, Chospa Hotel Leh is cradled by snow-capped peaks, enchanting landscapes, bustling bazaars, and Tibetan monasteries. Exquisitely designed in the traditional Ladakhi-style architecture, this eco-friendly oasis has been crafted from sustainable, raw materials without compromising the little luxuries.\n\nBe pampered with a stay in one of just 17 boutique rooms, savour the delights of two onsite eateries, and a convenient location just 15-minutes from Kushok Bakula Rimpochee Airport. Set 11,500 feet above sea level, Chospa Hotel Leh promises the adventure of a lifetime for you and your loved ones with minimal impact on the environment.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Ladakh",
    "offer_geo_area_level_2": "Leh",
    "location_heading": "Leh",
    "location_subheading": "India",
    "location_description": "Chospa Hotel Leh",
    "offer_address": "Old Road, Leh-Ladakh 194101 India",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 224.0,
    "value": 464.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQRI7AAP",
    "hero_image": "https://images.luxuryescapes.com/a4d4e61iu841ka20spt",
    "image_two": "https://images.luxuryescapes.com/libzral3af1gx07d8349",
    "image_three": "https://images.luxuryescapes.com/pgrgagjftka3xyllvqhp",
    "vendor_name": "Dolkhar Resort Leh",
    "title": "Grand Opening: Eco-Friendly Leh Boutique Villa Stay with Daily Breakfast, Dinner & Drinks",
    "description": "In the heart of Leh, enveloped in calmness and serenity, Dolkhar Resort Leh has opened the doors to welcome you into a world of luxury and utopian bliss. Anyone wishing for a tryst with the mountains would love this newly opened seven-villa resort, which was built using sustainable materials by local Ladakhi craftspeople to be in tune with Mother Nature. Merely a 10-minute drive from Kushok Bakula Rimpochee Airport (IXL), this boutique property is surrounded by an apricot and apple orchard and is rooted in Leh's rich heritage and culture. \n\nWhether it's the eco-friendly yet luxurious villas featuring sustainable amenities or the locally inspired plant-based menu at the gorgeous restaurant, this is Leh at its best. Unwind in the cosy Ladakhi-inspired villas that boast contemporary luxury, and dig into some deliciously crafted vegetarian local dishes. Situated close to all the major attractions of Leh-Ladakh, Dolkhar is the perfect base for all your explorations.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Ladakh",
    "offer_geo_area_level_2": "Leh",
    "location_heading": "Leh",
    "location_subheading": "India",
    "location_description": "Dolkhar Resort Leh",
    "offer_address": "Lower Tukcha Rd, opposite Community Hall, Leh, Ladakh 194101",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 444.0,
    "value": 821.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006yd6XAAQ",
    "hero_image": "https://images.luxuryescapes.com/thbvqvro0os5hrril2nh",
    "image_two": "https://images.luxuryescapes.com/2py20qhq296ukvx0mg",
    "image_three": "https://images.luxuryescapes.com/xkqash1u9q4f13bclsmr",
    "vendor_name": "Chospa Hotel Leh",
    "title": "Grand Opening: Exotic Himalayan Escape in Leh with Daily Breakfast",
    "description": "Bask in the glory of Leh's surreal beauty with a stay at the newly opened Chospa Hotel, enviably located on the coveted Old Leh Road and just a 90-minute flight from Delhi. A world away from the ordinary, Chospa Hotel is cradled by snow-capped peaks, enchanting landscapes, bustling bazaars, and Tibetan monasteries. Exquisitely designed in the traditional Ladakhi-style architecture, this eco-friendly oasis has been crafted from sustainable, raw materials without compromising the little luxuries.\n\nBe pampered with a stay in one of just 17 boutique rooms, savour the delights of two onsite eateries, and a convenient location just 15 minutes from Kushok Bakula Rimpochee Airport. Set 11,500 feet above sea level, Chospa Hotel in Leh promises the adventure of a lifetime for you and your loved ones with minimal impact on the environment.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Ladakh",
    "offer_geo_area_level_2": "Leh",
    "location_heading": "Leh",
    "location_subheading": "India",
    "location_description": "Chospa Hotel OLD 2021",
    "offer_address": "Old Road, Leh-Ladakh 194101 India",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 196.0,
    "value": 418.0
  }
]