[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FLGIsYAP",
    "hero_image": "https://images.luxuryescapes.com/sd0yjmnbjqj63ck3fxr7",
    "image_two": "https://images.luxuryescapes.com/nphnctd4wogjqwpdi92",
    "image_three": "https://images.luxuryescapes.com/ftwzurvmuvciz0sgdra",
    "vendor_name": "Matamanoa Island Resort",
    "title": "Fiji Adults-Only Oceanfront Private Pool Villa Oasis on Matamanoa Island with All-Inclusive Dining",
    "description": "Embark to a secluded adults-only paradise within a private island oasis, surrounded by glistening turquoise waters and soft white sands, complete with a restaurant and spa. Nestled in lush greenery and swaying palms, this hidden gem is the island's only resort, the ultimate escape.\n\nIndulge in unforgettable treatments at Spa Matamanoa and enjoy breakfast, lunch and dinner at Vale Ni Blau Restaurant, where international and Fijian flavours shine. Relax on untouched tropical beaches, explore beautiful coral reefs just steps from your oceanfront villa and experience genuine Fijian hospitality.\n\nSpend your days discovering the Island's breathtaking surroundings with guided hikes, daily expeditions, or snorkelling or scuba diving in the Pacific Ocean. Venture to the iconic Monuriki Island, known as the filming location of Cast Away, or stay onshore to learn about authentic Fijian customs and traditions, from coconut husking to tying Sulus.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Matamanoa Island",
    "location_heading": "Matamanoa Island",
    "location_subheading": "Fiji",
    "location_description": "Matamanoa Island Resort",
    "offer_address": "Matamanoa Island, Nadi, Fiji",
    "percentage_discount": 40.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 2299.0,
    "value": 3833.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdZpdAAF",
    "hero_image": "https://images.luxuryescapes.com/h3uj7e8gzere6ydwvsxd",
    "image_two": "https://images.luxuryescapes.com/gigmvxw7ayifuh5wixrs",
    "image_three": "https://images.luxuryescapes.com/8cetuj9r1wbfdijegsj0l",
    "vendor_name": "Matamanoa Island Resort",
    "title": "Fiji Adults-Only Beachfront Private Pool Villa Oasis on Private Mamanucas Island with All-Inclusive Dining",
    "description": "Discover a secluded adults-only paradise with a stay at the luxurious Matamanoa Island Resort, Fiji - a private island oasis surrounded by shimmering turquoise waters and silky white sands, overlooking the iconic Monoriki Island, where Tom Hanks filmed Cast Away. Nestled in lush greenery and swaying palms, this hidden gem is the only resort on the island, offering the ultimate intimate escape for couples and honeymooners. Explore, relax and experience authentic Fijian hospitality, with untouched tropical beaches and beautiful coral reefs just steps from your beachfront villa.\n\nSpend your days exploring the island and its breathtaking surroundings with daily expeditions, including guided hikes and tours, snorkelling or scuba diving in the limpid Pacific Ocean. Learn about authentic Fijian customs and traditions, from coconut husking to tying Sulus. Indulge in unforgettable treatments at Nama Tree Top Spa and enjoy authentic tropical dining at the exquisite Vale Ni Blau restaurant.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Matamanoa Island",
    "location_heading": "Matamanoa Island",
    "location_subheading": "Fiji",
    "location_description": "Matamanoa Island Resort",
    "offer_address": "Matamanoa Island, Nadi, Fiji",
    "percentage_discount": 23.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 2579.0,
    "value": 3362.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gux8sAAB",
    "hero_image": "https://images.luxuryescapes.com/fro1p99cwgzof3g0j839",
    "image_two": "https://images.luxuryescapes.com/v1gkerlirsyakycjxea",
    "image_three": "https://images.luxuryescapes.com/co665438ga7yurw242k",
    "vendor_name": "Matamanoa Island Resort",
    "title": "Fiji Adults-Only Beachfront Private Pool Villa Oasis on Private Mamanucas Island with All-Inclusive Dining",
    "description": "Embark to a secluded adults-only paradise within a private island oasis, encircled by glistening turquoise waters and soft white sands and offering an exquisite restaurant and spa. Nestled in lush greenery and swaying palms, this hidden gem is the only resort on the island, providing the ultimate intimate escape for couples and honeymooners. Explore, relax and experience authentic Fijian hospitality, with untouched tropical beaches and beautiful coral reefs just steps from your beachfront villa.\n\nSpend your days exploring the island and its breathtaking surroundings with daily expeditions, including guided hikes and tours or snorkelling or scuba diving in the Pacific Ocean. Venture to the iconic Monoriki Island, known as the filming location of Cast Away, or stay on land to learn about authentic Fijian customs and traditions, from coconut husking to tying Sulus. Indulge in unforgettable treatments at Spa Matamanoa and enjoy breakfast, lunch and dinner at the exquisite Vale Ni Blau restaurant, where international and Fijian flavours shine.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Matamanoa Island",
    "location_heading": "Matamanoa Island",
    "location_subheading": "Fiji",
    "location_description": "Matamanoa Island Resort",
    "offer_address": "Matamanoa Island, Nadi, Fiji",
    "percentage_discount": 37.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 2199.0,
    "value": 3510.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPHQrAAP",
    "hero_image": "https://images.luxuryescapes.com/jv1s5h5uqptxrat5lun",
    "image_two": "https://images.luxuryescapes.com/ipd1dprefu0z8134mz7s",
    "image_three": "https://images.luxuryescapes.com/8hc222w88bvjn021v108",
    "vendor_name": "Matamanoa Island Resort",
    "title": "Fiji Adults-Only Beachfront Villa Oasis on Private Island with All-Inclusive Dining",
    "description": "Discover a secluded adults-only paradise with a stay at the luxurious Matamanoa Island Resort, Fiji - an oasis surrounded by shimmering turquoise waters and silky white sands, overlooking the iconic Monoriki Island, where Tom Hanks filmed in Cast Away. Nestled in lush greenery and swaying palms, this hidden gem is the only resort on the island, offering the ultimate intimate escape for couples and honeymooners. Explore, relax and experience authentic Fijian hospitality, with untouched tropical beaches and beautiful coral reefs just steps from your beachfront villa.\n\nSpend your days adventuring through the breathtaking surroundings with daily expeditions, including guided hikes and tours, snorkelling or scuba diving in the limpid Pacific Ocean, and authentic local experiences. Indulge in unforgettable treatments at the Nama Spa, learn about Fijian traditions, and enjoy authentic tropical dining at the exquisite Vale Ni Blau restaurant.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Matamanoa Island",
    "location_heading": "Matamanoa Island",
    "location_subheading": "Fiji",
    "location_description": "Matamanoa Island Resort",
    "offer_address": "Matamanoa Island, Nadi, Fiji",
    "percentage_discount": 23.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 2664.0,
    "value": 3464.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UZxbAAG",
    "hero_image": "https://images.luxuryescapes.com/cz47vb4b8bal22syru9",
    "image_two": "https://images.luxuryescapes.com/9xzy67aw8m40fgcbh8u",
    "image_three": "https://images.luxuryescapes.com/7uy8oz628jjqeoll68t",
    "vendor_name": "Matamanoa Island Resort",
    "title": "Top-Rated Adults-Only Fiji Private Island Paradise with Daily Breakfast",
    "description": "Experience true tropical tranquility with an escape to the white sands and azure waters of Matamanoa Island Resort. This secluded sanctuary takes pride of place among Fiji’s Mamanuca Islands, 30km to the west of the country’s capital, Nadi. With no other accommodation on the island, this private paradise is an adults-only playground, with coral reefs, deserted beaches, crystal-clear ocean and lush tropical landscapes just waiting to be explored.\n\nWith just 47 rooms, bures and villas, Matamanoa Island Resort (rated among the top 10% worldwide on Tripadvisor) is an intimate escape from the everyday, with something for every level of leisure. Laze by the infinity pool, cocktail in hand, or sink your toes into the sand at one of the island’s pristine beaches. Snorkel or kayak over a marine sanctuary, or explore the surrounding reefs, pinnacles and wrecks with a scuba diving excursion. Keep the energy up with a spot of tennis, beach volleyball or a guided hike, or learn more about the local culture by joining a Kava ceremony or trying your hand at basket weaving and sulu tying. Finish the day with a treatment at the treetop spa, before venturing to Vale Ni Blau (House of Waves) for an oceanfront dining experience that celebrates local and international flavours with menus that change every day. Don’t worry about asking for the best table - every single one has ocean views.\n\n**Luxury Escapes inclusions (select nights)**\n\n- Dreamy days begin with **daily American breakfast** cooked to order\n- Drink it all in with a welcome **fruit punch on arrival**\n- Start the holiday right with a **10-minute foot ritual massage**\n- Sink into sumptuous serenity with a **60-minute couples’ massage** (for stays of 3+ nights)\n- Enjoy a **three-course lunch for two and a bottle of sparkling wine** (for stays of 5+ nights)\n- Raise the romance with a **private three-course dinner for two and a bottle of wine** on a secluded beach or the privacy of your patio (for stays of 7+ nights)\n\n**Villa Upgrade**: For prestigious levels of privacy, upgrade to a Beachfront Villa, where you’ll enjoy direct access to Veidomoni (Lovers) Beach, as well as a private plunge pool, gazebo with daybed and a king bed that looks over the Pacific Ocean.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Matamanoa Island",
    "location_heading": "Matamanoa Island",
    "location_subheading": "Fiji",
    "location_description": "Matamanoa Island Resort",
    "offer_address": "Matamanoa Island, Fiji, Nadi",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  }
]