[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I8JqIAK",
    "hero_image": "https://images.luxuryescapes.com/2o7z6dlpdmp5mp9cjp1",
    "image_two": "https://images.luxuryescapes.com/jhgxpr0b4pnydevfv5k",
    "image_three": "https://images.luxuryescapes.com/bmguvwnkv88ep7krytq",
    "vendor_name": "Adaaran Prestige Vadoo",
    "title": "Maldives Adults-Only Private Pool Villas with All-Inclusive Dining, Unlimited Drinks & Roundtrip Speedboat Transfers",
    "description": "Reset your clocks to island time for a relaxing escape at this all-inclusive adults-only resort in one of the most magical places on earth. Nestled on a private island in the Maldives' South Malé Atoll - just a short speedboat ride from Velana International Airport - Adaaran Prestige Vadoo is a secluded paradise surrounded by an exotic reef teeming with marine life.\n\nGaze out at the ocean from your spacious private pool villa, savour tropical cocktails at Kandholi Bar and live like royalty with a personalised butler service. Immerse yourself in the resort's technicolour underwater world with scuba diving at the onsite SSI Dive Centre or snorkel, swim or try your hand at sea-bobbing or flyboarding.\n\nGourmet dining awaits across the resort’s restaurants: head to Farivalhu Fine Dining Restaurant for locally caught seafood, Kithajima Japanese Restaurant for authentic sushi and tempura or Kakuni Barefoot Beach Restaurant for an authentic taste of the archipelago.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Vadoo Island",
    "location_heading": "South Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Adaaran Prestige Vadoo",
    "offer_address": "South Male, Atoll 20105, Maldives",
    "percentage_discount": 67.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 3599.0,
    "value": 10971.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004ztbLAAQ",
    "hero_image": "https://images.luxuryescapes.com/fyypno7oq5yck2t30i2h",
    "image_two": "https://images.luxuryescapes.com/kq7nmsn7cub3l0hindss",
    "image_three": "https://images.luxuryescapes.com/64e0tjzj3rbvu7oqum3",
    "vendor_name": "Adaaran Prestige Vadoo",
    "title": "Five-Star Maldives Private Island Overwater Villa Escape with Speedboat Transfers & Daily Dining",
    "description": "Follow the call of the Indian Ocean to what can only be described as paradise found: five-star Maldives oasis Adaaran Prestige Vadoo. Located on a private island - surrounded by its very own pristine reef, teeming with exotic aquatic flora and fauna - this is about as far away from everyday life as you can get.\n\nDaydream as you gaze out at the ocean from your overwater villa, watch the sunset from the beach and while the evening away as you sip tropical cocktails in cosy white pod chairs at Kandholi Bar. The underwater world of the resort’s mesmerising coral reef beckons, urging you to immerse yourself in its enchanting waters with scuba diving at the onsite SSI Dive Centre or via watersports such as snorkelling, seabobbing and flyboarding.\n\nGourmet dining awaits across the resort’s two restaurants: Farivalhu Restaurant, serving beautiful fresh seafood, and Kithajima Restaurant, a unique Japanese experience in the Maldives. Get pampered with traditional therapeutic healing rituals at Mandara Spa, offering soothing massages and ELEMIS facial treatments, and truly surrender to the ways of island life.\n\n**Your handpicked inclusions:**\n\n- Paradise is easier to find than ever thanks to scenic roundtrip speedboat transfers from Malé\n- Begin each day with à la carte breakfast at Farivalhu Restaurant\n- Return to Farivalhu Restaurant for nightly à la carte dinner of fresh local seafood and more\n- Enjoy two daily cocktails per person at beachfront Dhoni Bar or Kandholi Bar\n- Explore the resort’s spectacular coral reef with complimentary snorkelling equipment\n- Stay connected with complimentary Wi-Fi\n\n**All-Inclusive Upgrade:** Experience daily breakfast served à la carte 24/7, daily set-menu lunch and nightly set-menu dinner, plus free-flow drinks (including house wine, select spirits and more than 20 cocktails) when you upgrade to the all-inclusive package. A daily minibar stocked with beer and soft drinks, one beachfront dining experience and daily high tea and evening canapés are also included. Plus, also enjoy a complimentary marine life excursion (prior reservation required; see the Fine Print for details) and one-time discounts at the spa and on any one dive package per person.\n\n**Book with 100% Confidence:** If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Vadoo Island",
    "location_heading": "South Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Adaaran Prestige Vadoo March",
    "offer_address": "South Malé Atoll, Republic Of Maldives, 20105, Maldives",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 2499.0,
    "value": 5942.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zVwKAAU",
    "hero_image": "https://images.luxuryescapes.com/yogot0hkrpcldnh6z1gj",
    "image_two": "https://images.luxuryescapes.com/a00jn3fvfpdxj7krlj",
    "image_three": "https://images.luxuryescapes.com/kn1vky8yck6xhx4k52d",
    "vendor_name": "Adaaran Prestige Vadoo",
    "title": "Five-Star Maldives Overwater Villa Escape with Daily Dining, Cocktails & Roundtrip Speedboat Transfers",
    "description": "Reset your clocks to island time for a relaxing escape at the five-star Adaaran Prestige Vadoo in one of the most magical places on earth, the Maldives. Nestled on a private island, Adaaran Prestige Vadoo is only a short speedboat ride from Velana International Airport and surrounded by its own exotic reef teeming with marine life.\n\nGaze out at the ocean from your overwater villa, watch the sunset from the beach, and while the evenings away as you sip tropical cocktails in cosy white pod chairs at Kandholi Bar. Immerse yourself in the underwater world of the resort’s mesmerising coral reef with scuba diving at the onsite SSI Dive Centre or snorkel, swim or try your hand at sea-bobbing or flyboarding. Gourmet dining awaits across the resort’s two restaurants: Farivalhu Restaurant, serving beautiful fresh seafood, and Kithajima Restaurant, a unique Japanese experience in the Maldives. Get pampered with traditional therapeutic healing rituals at Mandara Spa, offering soothing massages and ELEMIS facial treatments, and truly surrender to the ways of island life.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Vadoo Island",
    "location_heading": "South Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "Adaaran Prestige Vadoo",
    "offer_address": "South Male, Atoll 20105, Maldives",
    "percentage_discount": 59.0,
    "min_duration": 4,
    "max_duration": 14,
    "price": 2609.0,
    "value": 6378.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070y7QAAQ",
    "hero_image": "https://images.luxuryescapes.com/wqelzrmsyd8yq4h7wnw",
    "image_two": "https://images.luxuryescapes.com/i0swzai6mktzinbdaxg",
    "image_three": "https://images.luxuryescapes.com/r8wckbgf0n29pkhz6rfv",
    "vendor_name": "COMO Cocoa Island",
    "title": "Ultra-Lux Five-Star Maldives Private Island Paradise",
    "description": "Escape to the Maldives and discover a slice of pure paradise at the five-star Como Cocoa Island resort, located on a secluded private island. Soak in the magical blues of the sky and sea, with each elegant villa boasting panoramic views of the Indian Ocean and the turquoise lagoon. This luxurious oasis celebrates relaxation and restoration with refined wellness treatments, a state-of-the-art fitness centre and romantic private dining. Each day brings adventure with a sunset cruise or moving nature experience, and while evenings are spent with your toes in the sand as you indulge in a memorable meal overlooking the ocean at the beachfront Ufaa restaurant.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Makunufushi",
    "location_heading": "South Malé Atoll",
    "location_subheading": "Maldives",
    "location_description": "COMO Cocoa Island",
    "offer_address": "Makunufushi South Malé Atoll, 20109, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1175.0,
    "value": 1175.0
  }
]