[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007nTYMAA2",
    "hero_image": "https://images.luxuryescapes.com/lt8cfnisg7i4okbg0xk",
    "image_two": "https://images.luxuryescapes.com/6sgkko8poi1f6vocfi8l",
    "image_three": "https://images.luxuryescapes.com/7vgeun45qi4n8i2s3l",
    "vendor_name": "Mission Bay Resort",
    "title": "San Diego Oceanfront Luxury in Mission Bay with Private Beach",
    "description": "Soak up golden California sunshine with a stay at San Diego Mission Bay Resort, part of the luxurious Noble House Hotel Collection. Discover your home-away-from-home in bright, beach-chic rooms and suites in the heart of San Diego's buzzing Mission Bay. Flop onto a sun-soaked lounger poolside and sip an ice-cold beer, or reserve your own poolside cabana to while away a whole afternoon. Direct access to a private beach means you can laze about on the sand or splash in the ocean all day long. Three waterfront restaurants offer up fresh Californian fare with stellar views. When you're ready to relax, head to the day spa for a holistic, therapeutic treatment to calm body and mind. For the young and young at heart, there is a plethora of activities on offer: life-sized checkers, ping pong and board games. At nightfall, beachside firepits are set alight, ready for s'mores under the stars.\n\nThe resort is just minutes from San Diego's water wonderland, Mission Bay Park. The largest aquatic playground of its kind in the country, it offers everything from sailing lessons, kite surfing and stand-up paddleboarding to jet-skiing, wakeboarding and everything in between. Mission Bay is also home to SeaWorld San Diego, the world-famous marine life adventure park.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "San Diego",
    "location_heading": "San Diego, California",
    "location_subheading": "USA",
    "location_description": "San Diego Mission Bay Resort",
    "offer_address": "1775 E Mission Bay Dr, San Diego, CA 92109, United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]