[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ETUkEYAX",
    "hero_image": "https://images.luxuryescapes.com/1hyo4pja3se02ywqx47",
    "image_two": "https://images.luxuryescapes.com/yda6vcqi977vr2kr8a7",
    "image_three": "https://images.luxuryescapes.com/ihwrtvl3bvqinysnxxt",
    "vendor_name": "Villa Marina Capri Hotel & Spa",
    "title": "Boutique Italian Luxury on Capri with Daily Breakfast, Hotel Credit & Bespoke Shoemaking Experience",
    "description": "Drift off into island serenity with an escape to Italy's charming Capri, home to sapphire waters, dramatic shores and seaside glamour. A living tribute to the Capri of the early 1900s, Villa Marina Capri beckons with elegant interiors and a sprawling pool and sun deck, all paired with panoramic views over the ocean and Mount Vesuvius.\n\nIndulge in authentic Italian flavours at the exquisite Ziqù Restaurant, or sip on a refreshing cocktail as you soak up the endless vistas from a sun lounger. For total relaxation, head to STAI SPA, complete with a sauna, steam bath, multi-sensory shower and infinity pool.\n\nBeyond the hotel, explore Capri Town, teeming with high-end boutiques, historic sites and charming cafes, take a trip to the striking Blue Grotto sea cave, and immerse yourself in the artisanal secrets of Caprese sandal-making with a bespoke leather workshop experience included in your stay.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Campania",
    "offer_geo_area_level_2": "Capri",
    "location_heading": "Capri",
    "location_subheading": "Italy",
    "location_description": "Villa Marina Capri",
    "offer_address": "Via Marina Grande 191, Capri 80073, Italy",
    "percentage_discount": 43.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 2399.0,
    "value": 4226.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRgbkAAD",
    "hero_image": "https://images.luxuryescapes.com/u9lekfs9bb4augthj7ys",
    "image_two": "https://images.luxuryescapes.com/eu8et5rdb9jdn9hnxyt",
    "image_three": "https://images.luxuryescapes.com/qdc1ns7rtvmb7ytqmaha",
    "vendor_name": "Capri Tiberio Palace",
    "title": "Creative Capri Palace Glamour with Oceanview Mediterranean Restaurant & World-Class Day Spa",
    "description": "Live the dolce vita life with a stay at this striking Capri palace, perched high overlooking the shimmering Mediterranean Sea. Explore the island's charming piazzas including from the legendary Piazzetta, vibrant boutiques of Via Camerelle and the mesmerising Blue Grotto, all within a breezy walk away.\n\nBack at the glamorous meets quirky hotel, indulge in authentic Mediterranean cuisine at the Michelin-starred Terrazza Tiberio or sip on handcrafted cocktails at the chic Jacky Bar. For a touch of relaxation, retreat to the Spa Tiberio, a wellness sanctuary offering a range of rejuvenating treatments, therapeutic showers, sauna and a steam room, or float your cares away in the relaxing pool.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Campania",
    "offer_geo_area_level_2": "Capri",
    "location_heading": "Capri",
    "location_subheading": "Italy",
    "location_description": "Capri Tiberio Palace",
    "offer_address": "Via Croce 11-15, Capri, Naples 80073, Italy",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 626.0,
    "value": 626.0
  }
]