[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JTMFGAA5",
    "hero_image": "https://images.luxuryescapes.com/nhn53736g3ls398zhgjq",
    "image_two": "https://images.luxuryescapes.com/8v4ut8w3hptj95omv1y",
    "image_three": "https://images.luxuryescapes.com/xcms9a1kyp97kkro7jnk",
    "vendor_name": "Akrotiri Olympus Luxuxy Suites - Adults Only",
    "title": "Boutique Greek Oceanfront Suites at the Base of Mount Olympus with Private Beach, Daily Breakfast & Nightly Cocktails",
    "description": "Perched at the base of Mount Olympus on mainland Greece, these boutique luxury suites are set against a dramatic cliffside, boasting high-end, secluded relaxation. The property is home to only six sun-drenched and modern suites, each featuring direct views of the glistening Aegean Sea beyond the sleek oceanfront infinity pool and sun loungers. Luxuriate in the comfort of open-plan living, including a mezzanine bedroom, a plush lounge area overlooking the furnished terrace, and a tea and coffee station. The ensuite bathrooms are designed with modern luxury in mind, featuring natural stone materials, polished wood and textured plaster.\n\nGo beyond the walls of your romantic suite and enjoy hiking the hills of Olympus or discover the property's private beach, accessible via the stone pathway cutting through the rugged landscapes. Spend your afternoons enjoying a refreshing cocktail by the pool, savouring a frozen daiquiri, pina colada or spritz, beneath the glistening sunshine. For moments of relaxation head to the Zen Zone Spa Center, where sea views accompany bespoke relaxation treatments.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Central Macedonia",
    "offer_geo_area_level_2": "Dio-Olympos",
    "location_heading": "Litochorou",
    "location_subheading": "Greece",
    "location_description": "Akrotiri Olympus Luxuxy Suites",
    "offer_address": "Gritsa Lotochorou, Litochorou 602 00, Greece",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 789.0,
    "value": 1893.0
  }
]