[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CPHbAAO",
    "hero_image": "https://images.luxuryescapes.com/jlf6we8u28zvwncv50d",
    "image_two": "https://images.luxuryescapes.com/fpq3lvapek7r03qzfwaq",
    "image_three": "https://images.luxuryescapes.com/y0v2wskz9mzjo17ehsn",
    "vendor_name": "Prairie Hotel",
    "title": "Remote South Australia Suite Escape near Flinders Ranges with Daily Breakfast & Nightly Culinary Experience",
    "description": "Discover the magic of the Australian outback at The Prairie Hotel, an iconic hotel on the outskirts of the renowned Flinders Ranges. This true Outback oasis is the perfect base for exploring vast and ancient landscapes, a 5.5-hour drive from Adelaide at the gateway to some of the country's finest desert terrain. Spend your days sharing stories with locals and newcomers alike, enjoying a refreshing beer brewed in-house and watching endless red plains dissolve into orange sunsets every evening.\n\nAdventurous travellers looking to explore the heart of Australia are within easy reach of some of the best Outback sights. Traverse the Mars-like landscape to the 800-million-year-old Wilpena Pound or take to the air in a helicopter to truly appreciate this giant crater with a bird's-eye view. Wake early to catch an epic sunrise from Bunyeroo Valley Lookout or gain an in-depth insight into the cultural significance of the Flinders Ranges when you join an Aboriginal cultural tour. Return to the comforts of this unique lodge, where you can savour dishes crafted from native ingredients at the Gallery Restaurant.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Parachilna",
    "location_heading": "Parachilna",
    "location_subheading": "South Australia",
    "location_description": "The Prairie Hotel",
    "offer_address": "High St & West Terrace, Parachilna, South Australia, 5730",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 527.0,
    "value": 805.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006x2VYAAY",
    "hero_image": "https://images.luxuryescapes.com/06gjn99ur9vkgx9k4",
    "image_two": "https://images.luxuryescapes.com/keo8un7o1vwpdiivg8va",
    "image_three": "https://images.luxuryescapes.com/4yxy2nqdjf350s507uuf",
    "vendor_name": "Prairie Hotel",
    "title": "Remote South Australia Outback Escape near Flinders Ranges with Daily Breakfast & Nightly Culinary Experience",
    "description": "The magic of the Australian outback has the power to take your breath away thanks to its vast and ancient landscapes, and there’s no better base for exploration than South Australia's The Prairie Outback Lodge, within the iconic Prairie Hotel on the outskirts of the renowned Flinders Ranges. The lodge is a true outback oasis with unparalleled remoteness (5.5 hours from Adelaide) where you can share stories with locals and newcomers alike, enjoy a warm welcome with beer brewed in-house and watch as endless red plains dissolve into orange sunsets.\n\nAdventurous travellers looking to explore the heart of Australia are within easy reach of some of the best outback sights. Traverse the Mars-like landscape to the 800-million-year-old Wilpena Pound or take to the air in a helicopter to truly appreciate this giant crater. Wake early to catch an epic sunrise from Bunyeroo Valley Lookout or gain an in-depth insight into the cultural significance of the Flinders Ranges when you join an Aboriginal cultural tour. Return to the comforts of this unique lodge, where you can savour dishes crafted from native ingredients at Gallery Restaurant and clink glasses of beer fermented to perfection in the onsite Brewhouse (opening 2022).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Parachilna",
    "location_heading": "Parachilna",
    "location_subheading": "South Australia",
    "location_description": "The Prairie Hotel",
    "offer_address": "High St & West Terrace, Parachilna, South Australia, 5730",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 557.0,
    "value": 831.0
  }
]