[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IF1GIAW",
    "hero_image": "https://images.luxuryescapes.com/v2u6g9kn17r06e76l6l",
    "image_two": "https://images.luxuryescapes.com/puk5xi0d89guxiu60k5n",
    "image_three": "https://images.luxuryescapes.com/ce0r9l1w394fiq08ld",
    "vendor_name": "Breakas Beach Resort",
    "title": "Romantic Vanuatu Private Beach Paradise with Guided Village Tour, Daily Breakfast, Return Airport Transfers & A$50 Dining Credit",
    "description": "Embrace serenity and set your watch to island time at this secluded oasis - a tranquil resort located right on the postcard-perfect Coral Sea, on Vanuatu's main island of Efate. Settle into the rhythms of a barefoot, island paradise from the moment you arrive at this stunning retreat, where traditionally crafted fares, a pristine white-sand beach, picturesque beachfront dining and an in-house spa await.\n\nRide the waves at Breakas Beach, renowned as Port Vila's premier surf spot, dive into the sparkling 22-metre oceanfront infinity pool, or revel in panoramic ocean vistas. Savour delectable dishes made from fresh, locally grown organic produce, perfectly crafted to delight your senses at the onsite restaurant, then toast to your tropical escape with a glass of wine as the sun sets at Salt Bar.",
    "offer_country_name": "Vanuatu",
    "offer_country_code_alpha_2": "VU",
    "offer_geo_area_level_1": "Shefa",
    "offer_geo_area_level_2": "Port Vila",
    "location_heading": "Shefa",
    "location_subheading": "Vanuatu",
    "location_description": "Breakas Beach Resort",
    "offer_address": "Pango Road, Efate, Port Villa, Vanuatu",
    "percentage_discount": 38.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 699.0,
    "value": 1133.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GQ8HYAA1",
    "hero_image": "https://images.luxuryescapes.com/77br0u6pu2ffcj754jm",
    "image_two": "https://images.luxuryescapes.com/p50but4ppps5ysqbr4y7",
    "image_three": "https://images.luxuryescapes.com/jksvu7w7aow1on3d6ha",
    "vendor_name": "Breakas Beach Resort",
    "title": "Vanuatu Island Retreat with Guided Village Tour, Roundtrip Airport Transfers & Daily Breakfast",
    "description": "Set your watch to island time at Vanuatu's Breakas Beach Resort - a tranquil resort located right on the postcard-perfect Coral Sea, on the main island of Efate. Settle into the rhythms of a barefoot, island paradise from the moment you arrive at this stunning oasis, home to traditionally crafted fares, a private white-sand beach, superb beachfront dining and an in-house spa. Hang ten and catch a swirl at Breakas Beach - voted Port Vila's best surf break - plunge into the glittering 22-metre oceanfront infinity pool or drink in panoramic ocean views and savour mouthwatering dishes crafted using fresh, locally grown organic produce at the restaurant.",
    "offer_country_name": "Vanuatu",
    "offer_country_code_alpha_2": "VU",
    "offer_geo_area_level_1": "Shefa",
    "offer_geo_area_level_2": "Port Vila",
    "location_heading": "Shefa",
    "location_subheading": "Vanuatu",
    "location_description": "Breakas Beach Resort",
    "offer_address": "Pango Road, Efate, Port Villa, Vanuatu",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 589.0,
    "value": 1228.0
  }
]