[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib184YAB",
    "hero_image": "https://images.luxuryescapes.com/pg9slt77enx0ogpr9m7s",
    "image_two": "https://images.luxuryescapes.com/kujgfoka1iq5or4qcsbh",
    "image_three": "https://images.luxuryescapes.com/afd5sfln6nlul0seqoedi",
    "vendor_name": "Grand Mercure Petra",
    "title": "Fortress-Style Petra Retreat in Rift Valley with Two Restaurants & Indoor Pool",
    "description": "Built like a fortress but feeling like home, this castle-style beauty sits majestically on Wadi Mousa's hillside, designed with authentic flair. Just ten minutes from Petra's legendary entrance, you're perfectly positioned to conquer one of the world's greatest wonders. When not exploring, dive into the heated indoor pool, or enjoy Arabian hospitality at Al Khaimah Bedouin Tent. \n\nPerched at 1,400 metres altitude in a secluded spot, Grand Mercure Petra isn't just convenient - it's cinematically spectacular. You're mountain-nested yet minutes from ancient marvels, making this the ultimate base camp for your Jordanian adventure.",
    "offer_country_name": "Jordan",
    "offer_country_code_alpha_2": "JO",
    "offer_geo_area_level_1": "Ma'an Governorate",
    "offer_geo_area_level_2": "Wadi Musa",
    "location_heading": "Petra",
    "location_subheading": "Jordan",
    "location_description": "Grand Mercure Petra",
    "offer_address": "Kings Highway, Queen Rania Street, Petra 71811, Jordan",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 106.0,
    "value": 106.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib17yYAB",
    "hero_image": "https://images.luxuryescapes.com/oucqhxejd6kir3hty13c",
    "image_two": "https://images.luxuryescapes.com/jjl2l0lyomyjo7fhmtyt",
    "image_three": "https://images.luxuryescapes.com/nka5ksyjtpv7f9pk1fnf",
    "vendor_name": "Mövenpick Resort Petra",
    "title": "Opulent Petra Five-Star Indulgence Steps from Rose-Red City with Seven Restaurants & Luxe Spa",
    "description": "Immerse yourself in Petra’s ancient majesty from this exquisite retreat, just steps from the UNESCO-listed site’s entrance. Inside, ornate Arabesque design, handcrafted woodwork and warm stone accents create an atmosphere of refined Middle Eastern charm. After a day exploring Petra’s rose-red wonders, retreat to the serene outdoor pool or rejuvenate at the tranquil Zara Spa.\n\nSavour Jordanian, Mediterranean flavours and diverse culinary experiences across seven dining venues, from the rooftop Al Ghadeer Garden with panoramic views, to the ornate Al Maqa’ad Bar, reminiscent of Syrian palaces. Don't miss the resort's daily chocolate hour for a sweet indulgence. With unmatched access to Petra, this resort is a perfect gateway to exploring Jordan’s iconic wonder.",
    "offer_country_name": "Jordan",
    "offer_country_code_alpha_2": "JO",
    "offer_geo_area_level_1": "Ma'an Governorate",
    "offer_geo_area_level_2": "Wadi Musa",
    "location_heading": "Petra",
    "location_subheading": "Jordan",
    "location_description": "Mövenpick Petra",
    "offer_address": "Tourism Street, Wadi Musa, Petra, 71810, Jordan",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 100.0,
    "value": 100.0
  }
]