[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DRDTBAA5",
    "hero_image": "https://images.luxuryescapes.com/jdi8rz7qhou4qh43677e",
    "image_two": "https://images.luxuryescapes.com/mr3fl1eiupynr9ww2zi",
    "image_three": "https://images.luxuryescapes.com/8drsxyylebqnursqfhz",
    "vendor_name": "Fratelli Estate",
    "title": "Luxe Maharashtra Fratelli Vineyard Stay with All-Inclusive Dining, Wine and Cheese Tasting & Vineyard Tour",
    "description": "A blissful bubble of premium wines, lush greenery, and peaceful surroundings awaits at the Fratelli Estate in Maharashtra, where you'll be treated to a quintessential vineyard stay just seven hours from Mumbai and four hours from Pune. Your home-away-from-home, Fratelli Estate forces you to slow down and unwind with vineyards tours, wine-tasting sessions and endless views. Classic rooms with the best conveniences and a view of the peaceful vineyards will make your stay enjoyable.\n\nWholesome and made-to-order delicacies will satiate your hunger pangs while a game room will keep you entertained. Learn everything about wine-making, enjoy mesmerising sunsets with a glass of your favourite wine, raise a toast with your loved ones, or just simply lose yourself in the tranquillity of the surroundings here. Don't miss out on purchasing some of your favourite wines from the estate's store!",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Malsiras",
    "location_heading": "Maharashtra",
    "location_subheading": "India",
    "location_description": "Fratelli Estate",
    "offer_address": "Gate No. 131, Zanjewadi, Tal Malshiras, District Solapur Shipaiwadi, Motewadi, Maharashtra 41310 India",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 150.0,
    "value": 401.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fn5cdAAB",
    "hero_image": "https://images.luxuryescapes.com/vf0gxhpsnhchvrgb1nm",
    "image_two": "https://images.luxuryescapes.com/l4mgg3l9mjn7lepv89",
    "image_three": "https://images.luxuryescapes.com/ye0hq0exdppmopw29oau",
    "vendor_name": "WelcomHeritage Tadoba Vanya Villas Resort & Spa",
    "title": "Thrilling Tadoba Jungle Escape with Daily Breakfast, Daily Dinner & Daily High Tea",
    "description": "Escape to the heart of Maharashtra's untouched wilderness with a stay at the captivating WelcomHeritage Tadoba Vanya Villas Resort & Spa, a luxe jungle retreat spread across 65 acres of lush landscape adjoining a private lake. A 2.5-hour drive from bustling Nagpur, the plush resort lies adjacent to the famous Tadoba National Park and is a sanctuary for nature and wildlife lovers. Immerse yourself in authentic jungle luxury in the aesthetic cottages while you detox amid nature - go for a swim in the azure pool, pamper yourself at the spa, or simply, feast on flavourful delicacies at the resort's multiple restaurants and bars.\n\nLying close to the largest and oldest national park in Maharashtra, Tadoba National Park entices you with its hilly terrain, dense jungle and wild animals such as Royal Bengal tigers, sloth bears, hyenas, leopards, peacocks, barking deer, and more. Embark on a hair-raising jungle safari to spot the big cats in their natural habitat or visit the ancient hill fort of Manikgarh (a three-hour drive) to beguile yourself with the region's history.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Chimur",
    "location_heading": "Maharashtra",
    "location_subheading": "India",
    "location_description": "WelcomHeritage Tadoba Vanya Villas Resort & Spa",
    "offer_address": "Khasra No 41, Chaiti Tukum Kolara Gate, Maharashtra 442903, India",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 234.0,
    "value": 613.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbI1XAAV",
    "hero_image": "https://images.luxuryescapes.com/eg6qq4wxbegjs0gpullg",
    "image_two": "https://images.luxuryescapes.com/66sez5k47umqxqshe4hu",
    "image_three": "https://images.luxuryescapes.com/8zfzgzrm7bjq7cqrzan",
    "vendor_name": "Tadoba Jungle Camp",
    "title": "Tadoba Wildlife Escape with Daily Breakfast, Daily Lunch/Dinner & High Tea",
    "description": "Neighbouring Tadoba National Park's Moharli Gate and overlooking the beautiful Lake Irai, Tadoba Jungle Camp is the wildlife escape you've been waiting for. Scattered across 10 acres of reforested land in Tadoba, each of the 12 elevated luxury cottages features African decor, vast outdoor decks from where you can enjoy panoramic views of the forest and contemporary amenities. Easily accessible from Nagpur (a three-hour drive), this jungle paradise will put you right in the heart of Tadoba's wild action. Breathe in the fresh air, wake to panoramic views of the surrounding forest, savour mouth-watering delicacies inspired by the local flavours, or simply enjoy thrilling safaris and spot the big cats. \n\nFor those who like to take it slow, there are amazing experiences such as candlelit dinners by the poolside, sundowners at the lake and more. A treasure trove of experiences awaits at this luxe jungle resort. Get ready for a roaring experience!",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Bhadravathi",
    "location_heading": "Maharashtra",
    "location_subheading": "India",
    "location_description": "Tadoba Jungle Camp",
    "offer_address": "Taboda Jungle Camp, Moharli Gate, Tadoba Andhari Tiger Reserve, Bhamdeli Chandrapur Maharashtra 442404 India",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 246.0,
    "value": 594.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GtuOAAS",
    "hero_image": "https://images.luxuryescapes.com/mws8omlx3kf5553jl6jh",
    "image_two": "https://images.luxuryescapes.com/vnk1fq3kw5vi7l0j5cmm",
    "image_three": "https://images.luxuryescapes.com/s6t84ukzzi2q74jix354",
    "vendor_name": "WelcomHeritage Tadoba Vanya Villas Resort & Spa",
    "title": "Exotic Wildlife Escape in Tadoba with Daily Breakfast & Dinner",
    "description": "Hit the 'pause' button on your hectic city life and escape to WelcomHeritage Tadoba Vanya Villas Resort & Spa, an alluring jungle retreat hidden in 65 sprawling acres of lush landscape adjoining a private lake in Maharashtra's untouched wilderness. Situated just 3km from the famous Tadoba National Park, this retreat takes you one step closer to nature. A newly opened joint venture between ITC Limited and Jodhana Heritage, the resort promises rustic luxury, contemporary accommodation and a uniquely natural ambience.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Chandrapur",
    "location_heading": "Maharashtra",
    "location_subheading": "India",
    "location_description": "WelcomHeritage Tadoba Vanya Villas Resort & Spa OLD",
    "offer_address": "Khasra No 41, Chaiti Tukum Kolara Gate, Maharashtra 442903",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 209.0,
    "value": 382.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CctjAAC",
    "hero_image": "https://images.luxuryescapes.com/frimaeuj5d1l78a6usvd",
    "image_two": "https://images.luxuryescapes.com/r61qtv14r59x5hqynqno",
    "image_three": "https://images.luxuryescapes.com/tl0bffiptjdygdewy7l",
    "vendor_name": "Treat Beach Resort Gholvad",
    "title": "Family-Friendly Gholvad Coastal Escape near Bordi Beach with Daily Breakfast & Lunch",
    "description": "Craving a quick escape from the daily grind? Head to Treat Beach Resort & Spa Gholvad, a gorgeous resort nestled on the beautiful coastline of Maharashtra, around a 3.5-hour drive from Mumbai and Surat, and a seven-hour drive from Ahmedabad. Hidden among coconut trees and chikoo orchards, this luxe resort, ranked within the top 10% of properties on Tripadvisor, is less than a five-minute drive from the famous Bordi Beach.\n\nIdeal for staycation-seekers from both Maharashtra and Gujarat, the hotel will make you feel like you are vacationing in Goa, minus the crowds. Leave behind city stress and escape to this splendid resort where you can build up a sweat in the gym, dive into the pool, relax in the cave-like jacuzzi, or get a massage in the luxurious spa. Or, head out and laze on the beach or explore iconic hill forts and then return to the resort where you can dine in one of two restaurants before you retire to the tranquility of your spacious room.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Dahanu",
    "location_heading": "Maharashtra",
    "location_subheading": "India",
    "location_description": "Treat Beach Resort & Spa Gholvad",
    "offer_address": "Station Road, Bordi, Faliya, Gholvad, Maharashtra 401702",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 156.0,
    "value": 239.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oQgJAAU",
    "hero_image": "https://images.luxuryescapes.com/otu4rzcdllq12lopd1",
    "image_two": "https://images.luxuryescapes.com/ks6fh4m3sdzw5it6205",
    "image_three": "https://images.luxuryescapes.com/yo155e6795wyn9u9dunb",
    "vendor_name": "WelcomHeritage Tadoba Vanya Villas Resort & Spa",
    "title": "Serene Resort Hideaway near Tadoba National Park with All-Inclusive Meals",
    "description": "Hit the 'pause' button on your hectic city life and escape to WelcomHeritage Tadoba Vanya Villas Resort & Spa, an alluring jungle retreat hidden amid 65 sprawling acres of lush landscape adjoining a private lake in Maharashtra's untouched wilderness. Adjacent to the famous Tadoba National Park, this retreat takes you one step closer to nature. A joint venture between ITC Limited and Jodhana Heritage, the resort promises rustic luxury, contemporary accommodation and a uniquely natural ambience.\n\nLocated three hours from the bustling city of Nagpur, Tadoba is an untouched piece of land home to many rare animal species. The largest and oldest national park in Maharashtra, Tadoba National Park entices you with its hilly terrain, dense jungle and wild animals such as tigers, sloth bears, hyenas, leopards, peacock, barking deer, and more. Perfect for wildlife enthusiasts!",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Chimur",
    "location_heading": "Maharashtra",
    "location_subheading": "India",
    "location_description": "WelcomHeritage Tadoba Vanya Villas Resort & Spa",
    "offer_address": "Khasra No 41, Chaiti Tukum Kolara Gate, Maharashtra 442903, India",
    "percentage_discount": 21.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 290.0,
    "value": 369.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AabDjAAJ",
    "hero_image": "https://images.luxuryescapes.com/x8xz4i607z8k7ry7avn",
    "image_two": "https://images.luxuryescapes.com/iganjrgrhxmq3ysb0r",
    "image_three": "https://images.luxuryescapes.com/glzy8sqb1sm22piyfgn",
    "vendor_name": "Fratelli Estate",
    "title": "Luxe Maharashtra Fratelli Vineyard Stay with All-Inclusive Dining, Wine Tasting & Vineyard Tour",
    "description": "A blissful bubble of premium wines, lush greenery, and peaceful surroundings awaits at the Fratelli Estate in Maharashtra, where you'll be treated to a quintessential vineyard stay just seven hours from Mumbai and four hours from Pune. Your home-away-from-home, Fratelli Estate forces you to slow down and unwind with vineyards tours, wine-tasting sessions and endless views. Classic rooms with the best conveniences and a view of the peaceful vineyards will make your stay enjoyable. \n\nWholesome and made-to-order delicacies will satiate your hunger pangs while a game room will keep you entertained. Learn everything about wine-making, enjoy mesmerising sunsets with a glass of your favourite wine, raise a toast with your loved ones, or just simply lose yourself in the tranquillity of the surroundings here.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Malsiras",
    "location_heading": "Maharashtra",
    "location_subheading": "India",
    "location_description": "Fratelli Estate",
    "offer_address": "Gate No. 131, Zanjewadi, Tal Malshiras, District Solapur Shipaiwadi, Motewadi, Maharashtra 41310 India",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 212.0,
    "value": 473.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Cux5BAAR",
    "hero_image": "https://images.luxuryescapes.com/9mcr4lu8bm73bjcye5z",
    "image_two": "https://images.luxuryescapes.com/tj5v7luj8yturhtvy15",
    "image_three": "https://images.luxuryescapes.com/vy9h67fouo9l0izlct5i",
    "vendor_name": "Anchaviyo Resort",
    "title": "Riverside Maharashtra Boutique Escape with Daily Breakfast & Lunch",
    "description": "Welcome to Anchaviyo Resort, a riverside retreat hidden away amid rich greenery and clean, fresh air in one of Maharashtra's most serene locations - Wada. Less than three hours from Mumbai, this tranquil paradise is tucked between mango, chikoo and guava trees on a 150-acre estate. Relax in boutique luxury in the resort's unique accommodation: from log cabins to quirky hexagonal rooms, every option is a unique piece of architecture that is an experience in itself.\n\nTaking advantage of its riverside location, the resort offers plenty of adventurous experiences and watersports to keep you entertained throughout. Try your hand at kayaking or paddle boating, or get a taste for the thrills of speedboating (not for the fainthearted). Little ones will love the indoor games, while those in search of romance can indulge in dinner under the stars or a movie screening on a river raft.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Vada",
    "location_heading": "Maharashtra",
    "location_subheading": "India",
    "location_description": "Anchaviyo Resort",
    "offer_address": "Kharivali Tarf Kohoj, Maharashtra 421303 India",
    "percentage_discount": 28.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 216.0,
    "value": 301.0
  }
]