[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LeZPAA0",
    "hero_image": "https://images.luxuryescapes.com/6desjeovu5lkh6g0zncu",
    "image_two": "https://images.luxuryescapes.com/ydzlhtpu2d4pdwxyh5ul",
    "image_three": "https://images.luxuryescapes.com/da8bb0sjxhqqvsol64",
    "vendor_name": "The Ungasan Cliff Top Resort, Bali",
    "title": "Clifftop Pool Villa Escape with Private Butler and VIP Beach Club Access",
    "description": "Experience Balinese luxury at its finest with a stay at the breathtaking Ungasan Clifftop Resort, Uluwatu. Stay in an elegant villa overlooking the ocean complete with a private plunge pool and butler service at your fingertips. Enjoy sumptuous daily breakfast, one two-course lunch for two, one three-course dinner for two, a 75-minute couples' spa treatment, return airport transfers, and daily VIP access to the spectacular Sundays Beach Club with a daily cocktail each.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Ungasan Clifftop Resort - Jan 20",
    "offer_address": "Jl Pantai Selatan Gau | Banjar Wijaya Kusuma, Ungasan 80362, Indonesia",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 1239.0,
    "value": 3156.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNXTQAA5",
    "hero_image": "https://images.luxuryescapes.com/essrvo4ho8akq7ur2jpq",
    "image_two": "https://images.luxuryescapes.com/ij0f77xb48jirxkix2f",
    "image_three": "https://images.luxuryescapes.com/6rlsyo1fd2ldh4eh2h",
    "vendor_name": "Hideaway Villas Uluwatu",
    "title": "Uluwatu Private Pool Villa Seclusion with Daily Breakfast, Nightly Dinner, Cocktails & Roundtrip Transfers",
    "description": "Endless Indian Ocean vistas and quintessential Balinese hospitality await at the blissful Hideaway Villas. Set on a hillside overlooking the ocean in the distance, and enveloped by the tropical Uluwatu jungle, this serene retreat offers a collection of beautifully designed pool villas, just a stone’s throw from some of Bali’s best surfing beaches and hottest beach clubs - truly your slice of Bali paradise. Perfect for romantic honeymoons or adventurous family escapes alike, indulge your senses at the restorative Bamboo Spa and savour exquisite local flavours at Basé Restaurant where each dish is made to order.\n\nPositioned in charming Uluwatu, famed for its quirky cafes, artisan flair and laidback surfer vibe, this peaceful villa complex is within easy reach of the area’s restaurants, markets and independent boutiques. When you are ready to explore, head to the nearby Uluwatu Temple, an ancient sea temple dating back to the 11th century, boasting a dramatic clifftop position overlooking the crashing waves of the Indian Ocean. Soak up the views and meet the resident monkeys that roam the grounds, before retreating to your idyllic private paradise.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Hideaway Villas Uluwatu",
    "offer_address": "Jl. Bangbang Bendot, Gang Hideaway, Uluwatu, Bali, Indonesia",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 549.0,
    "value": 1073.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CwK0UAAV",
    "hero_image": "https://images.luxuryescapes.com/1vrkj1wi4j2hqg7pkasb",
    "image_two": "https://images.luxuryescapes.com/0acdt7nqcsfsqwxt4fs",
    "image_three": "https://images.luxuryescapes.com/n57dnem5ypwlttmwevh9",
    "vendor_name": "Radisson Blu Bali Uluwatu",
    "title": "Five-Star Uluwatu Cliffside Luxury with Daily Breakfast, Nightly Two-Hour Free-Flow Cocktails & Massages",
    "description": "Embrace blissful seclusion perched on a clifftop overlooking the magnificent Indian Ocean with a stay at this ultra-stylish, palm-dotted resort, perfectly positioned in Bali’s happening southernmost tip: Uluwatu. Located just moments from plunging cliff faces, spellbinding coastline and spectacular sunsets, and boasting privileged views over the shimmering Bingin and Padang Padang beaches - it’s truly a surfer’s paradise.\n\nTraditional Balinese design is at the forefront of Radisson Blu Resort, Bali Uluwatu, beckoning you with its tranquillity, spacious accommodation and world-class amenities.\n\nSpend your days here discovering the island's exquisite coral reefs, golden beaches and volcanic mountains, before returning to this five-star oasis. Perfect for honeymooners and couples, this resort offers the best of relaxed island luxury. It's here that you can relax by the spectacular pool, indulge in traditional Indonesian and international delights at Artichoke or slick Western fare at the semi-alfresco Choka pool bar, or take a breather and unwind with massages at the Spa ESC.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Radisson Blu Resort, Bali Uluwatu",
    "offer_address": "Jalan Pemutih, Jalan Labuansait, Pecatu, Kuta Selatan, Badung 80364, Bali",
    "percentage_discount": 40.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 899.0,
    "value": 1510.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000E0OyLYAV",
    "hero_image": "https://images.luxuryescapes.com/70935y4ckxlmi87vhs87",
    "image_two": "https://images.luxuryescapes.com/h64s39ho39d6853xvyg",
    "image_three": "https://images.luxuryescapes.com/4linou00cm4mfv3986vk",
    "vendor_name": "Six Senses Uluwatu",
    "title": "Ultra Lux Uluwatu Clifftop Pool Suites & Villas with Daily Breakfast, Dinner & Free-Flow Cocktail Hour",
    "description": "Escape to the pinnacle of secluded coastal luxury perched atop the famous limestone cliffs of Bali’s southernmost peninsula. Immerse yourself in sweeping 180-degree views of the glittering Indian Ocean from your spacious suite or villa, and watch as the sun dips below the horizon from the spectacular resort pool that clings to the cliff's edge over three terraced levels.\n\nAs evening arrives, relax against the backdrop of the darkening sky with an expertly crafted cocktail served at their signature Cliff Bar, or unwind beneath the stars with an open-air cinema screening for a truly magical experience. This five-star eco-sanctuary combines its signature zero-waste concept with carefully curated and sophisticated contemporary touches, creating effortlessly elegant spaces you’ll never want to leave.\n\nRejuvenate your body and soul with daily yoga and meditation, surrender to pure bliss at the wellness spa and indulge in gourmet farm-to-table sustainable dining at the resort’s two restaurants, including Japanese and Peruvian fusion at Watu Steakhouse. This is the ultimate paradise, where luxury meets true tranquillity.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Six Senses Uluwatu",
    "offer_address": "Jalan Goa Lempeh, Uluwatu 80361, Bali, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 859.0,
    "value": 2145.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eNE6TQAW",
    "hero_image": "https://images.luxuryescapes.com/qi2hq4o5kbr9ph6kdvv2",
    "image_two": "https://images.luxuryescapes.com/e9q8t7j57omy9ggnvry",
    "image_three": "https://images.luxuryescapes.com/bexst1d768pzazv8j93r",
    "vendor_name": "Six Senses Uluwatu",
    "title": "Cliffside Six Senses Luxury with Daily Free-Flow Cocktails",
    "description": "Venture to the edge of the world, where every view is of the ocean and secluded luxury is a given: welcome to Six Senses Uluwatu. Dive into this eco-sanctuary, Bali’s only World Green Council-certified resort, with luxury inclusions befitting Travel + Leisure Magazine’s #1 hotel brand. \n\nYour escape includes daily buffet breakfast with à la carte options, two three-course set menu dinners for two, daily free-flow cocktails (5pm to 6pm) overlooking the ocean, a ‘Cinema Under the Stars’ experience with popcorn, daily unlimited homemade ice cream, your choice of transfer to or from Denpasar Airport, welcome seasonal fruits on arrival, six pieces of laundry per room, per day, and a guaranteed 6pm late checkout.\n\nTravel freely with no surcharges.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details)",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Six Senses Uluwatu",
    "offer_address": "Jalan Goa Lempeh, Uluwatu 80361, Bali, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 1199.0,
    "value": 2904.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HD9GbYAL",
    "hero_image": "https://images.luxuryescapes.com/o7dh5zov35goh06wyhbo",
    "image_two": "https://images.luxuryescapes.com/n54fyyobvpsdx5xjz9c",
    "image_three": "https://images.luxuryescapes.com/ovbo78qmuwm9589wt9gi",
    "vendor_name": "Seascape Uluwatu",
    "title": "Grand Opening: Uluwatu Boutique Suites & Villas with Daily Breakfast, Dinner & Free-Flow Cocktail Hour",
    "description": "Discover your slice of paradise at this seaside sanctuary in Uluwatu, where boutique suites and villas sit peacefully on the Island of the Gods. Raw timber, concrete and stone finishes create a cocoon of calm, carried by the ocean breeze and elevated by stylish facilities - including a cliffside spa, refined restaurant and shimmering infinity pool.\n\nSavour precision-crafted Japanese cuisine at Tsune Uluwatu, where every dish is a minimalist masterpiece served against a scenic ocean backdrop. At Svaha Spa Bingin, tension dissolves with every tailored treatment as you soak up the rhythm of the sea from a distance.\n\nPerfect for couples, this new Balinese jewel provides the perfect launching pad for exploring secret coves by day and glowing skies by dusk, before retreating to a private haven where thoughtful design and quiet indulgence come standard. Unveiled in 2025, this clifftop stay is Uluwatu's newest scene-stealer - and you can be among the first to experience it.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Seascape Resort Uluwatu",
    "offer_address": "Seascape Uluwatu Complex, Jl. Labuansait, Pecatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 69.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 559.0,
    "value": 1822.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I5gpIAC",
    "hero_image": "https://images.luxuryescapes.com/0ujayiy1pst2zco9qw3m",
    "image_two": "https://images.luxuryescapes.com/rpu3i5n7bdxxnq3sgqxq",
    "image_three": "https://images.luxuryescapes.com/9gra3twwuhobi80wosl5n",
    "vendor_name": "Six Senses Uluwatu",
    "title": "Uluwatu Ultimate Cliffside Pool Villas with Daily Breakfast, Nightly Dinner & Free-Flow Drinks Hour",
    "description": "Venture to the edge of the world and experience the pinnacle of secluded coastal living perched atop the famous limestone cliffs of Bali’s southernmost peninsula. Immerse yourself in sweeping 180-degree views of the glittering Indian Ocean from your private pool villa, and watch as the sun dips below the horizon from the spectacular resort pool that clings to the cliff's edge over three terraced levels.\n\nAs evening arrives, relax against the backdrop of the darkening sky with a delicious cocktail served at their signature Cliff Bar, or watch a movie under the twinkling stars before venturing to one of Bali's many famed beach clubs. This five-star eco-sanctuary combines its signature zero-waste concept with carefully curated contemporary touches, creating effortlessly elegant spaces you’ll never want to leave.\n\nRejuvenate your body and soul with daily yoga and meditation, relax at the blissful wellness spa and indulge in gourmet farm-to-table sustainable dining at the resort’s two restaurants, including Japanese at Watu Steakhouse. This is the ultimate paradise, where luxury meets true tranquillity.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Six Senses Uluwatu",
    "offer_address": "Jalan Goa Lempeh, Uluwatu 80361, Bali, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1829.0,
    "value": 4416.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LrKVAA0",
    "hero_image": "https://images.luxuryescapes.com/s9q2u0g6yhexooc6k03wl",
    "image_two": "",
    "image_three": "",
    "vendor_name": "Hideaway Villas Uluwatu",
    "title": "Hideaway Villas Uluwatu April 20",
    "description": "xxx",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Hideaway Villas",
    "offer_address": "Jl. Bangbang Bendot Gang Hideaway, Uluwatu, Uluwatu, South Kuta, Pecatu, Kuta Selatan, Pecatu, South Kuta, Bali, 80361, Indonesia",
    "percentage_discount": 43.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 877.0,
    "value": 1545.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZnM1rQAF",
    "hero_image": "https://images.luxuryescapes.com/jmuwxy5qxl6wxkvfcmcq",
    "image_two": "https://images.luxuryescapes.com/fwnr5q7ldkuyzsuwz42f",
    "image_three": "https://images.luxuryescapes.com/mc7s2mmb0zjaieuh2os8",
    "vendor_name": "Radisson Blu Bali Uluwatu",
    "title": "Stylish Clifftop Escape with Massages and Daily Cocktails",
    "description": "Fall in love with the super stylish and ultra-chic Radisson Blu Uluwatu with its secluded, waterfront location, palm tree-dotted property, ultra-spacious rooms and five-star service. Experience a five or seven-night getaway in an Ocean View Room and indulge in a daily buffet ‘Super Breakfast’, three two-course lunches or dinners at your choice of any of the onsite restaurants, daily sunset cocktail for two, four 45-minute signature massages to share and a private airport pick-up or drop off from Ngurah Rai International Airport.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Radisson Blu Uluwatu 2019",
    "offer_address": "JI Pemutih, Pecatu, Kuta Sel., Pecatu, Bali 80364, Indonesia",
    "percentage_discount": 70.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 762.0,
    "value": 2504.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zO6LAAU",
    "hero_image": "https://images.luxuryescapes.com/c5dqxo156aexi1dpzn8w",
    "image_two": "https://images.luxuryescapes.com/bfhnisk9ehsr72zycn",
    "image_three": "https://images.luxuryescapes.com/jtzu2sa3kof30ijyr1w",
    "vendor_name": "Anantara Uluwatu",
    "title": "Five-Star Uluwatu Cliffside Luxury with Daily Dining & Nightly Cocktails",
    "description": "Secluded luxury and endless ocean views await at the five-star Anantara Uluwatu Bali Resort, an award-winning sanctuary of serenity ranked #6 among the Top 10 Resorts in Indonesia in Condé Nast Traveler Readers' Choice Awards 2021. Perfectly poised on a clifftop on Bali's south coast, overlooking the Indian Ocean, this luxury hotel is surrounded by dramatic coastal landscape, native jungle and lush rice paddies, but is just 15 minutes from the centre of bustling Uluwatu.\n\nIntimate and stylish, Anantara Uluwatu Bali Resort will exceed your expectation of paradise with its myriad luxe facilities. Tantalise your tastebuds with fusion delights at a host of bars and restaurants, relish lazy days at the Insta-worthy infinity pool, discover true tranquillity at Anantara Spa, slice through the cliffside with private beach elevator access to the sands below and soak up the chilled-out vibes of Uluwatu with complimentary beach shuttles. All suites feature a private jacuzzi, luxurious amenities, plush bedding and bespoke touches, offering guests a spacious sanctuary away from it all.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Anantara Uluwatu Bali Resort",
    "offer_address": "Jl. Pemutih - Labuan Sait, Uluwatu, Pecatu, Kuta Selatan, Pecatu, Kuta Sel., Kabupaten Badung, Bali 80364, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 759.0,
    "value": 1921.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DoJKEAA3",
    "hero_image": "https://images.luxuryescapes.com/d0tu67v2xbmmmudymndr",
    "image_two": "https://images.luxuryescapes.com/flnlwmrz57x7oz2guch",
    "image_three": "https://images.luxuryescapes.com/f0vu07cu0m4ymr9w3ux9",
    "vendor_name": "Six Senses Uluwatu",
    "title": "Clifftop Uluwatu Six Senses Paradise with Daily Breakfast, Two-Course Lunch or Dinner & Daily Two Hours Free Flow Drinks",
    "description": "Venture to the edge of the world - perched atop the famous limestone cliffs of Bali’s southernmost peninsula known as Billionaire's Row - and experience the pinnacle of secluded luxury at Six Senses Uluwatu. Immerse yourself in sweeping views of the glittering Indian Ocean and watch as the sun dips below the horizon from the spectacular resort pool that clings to the cliff's edge over three terraced levels. As evening arrives, relax against the backdrop of the darkening sky with a delicious cocktail served at Cliff Bar.\n\nThis opulent eco-sanctuary - the island's only World Green Council-certified resort - combines its signature zero-waste concept with carefully curated contemporary touches, creating effortlessly elegant spaces you’ll never want to leave. Rejuvenate your body and soul with daily yoga and meditation, relax at the blissful wellness spa and indulge in gourmet farm-to-table sustainable dining at the resort’s two restaurants, including Japense fusion at the recently opened Watu Steakhouse. This is where luxury meets true tranquillity.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Six Senses Uluwatu",
    "offer_address": "Jalan Goa Lempeh, Uluwatu 80361, Bali, Indonesia",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 1707.0,
    "value": 3486.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biolYQAQ",
    "hero_image": "https://images.luxuryescapes.com/9hy5wu0w672ygu1boqv",
    "image_two": "https://images.luxuryescapes.com/ayrx98pc2olc07fu7vi",
    "image_three": "https://images.luxuryescapes.com/c7ncrjsivo071a64uzar",
    "vendor_name": "The Ungasan Cliff Top Resort, Bali",
    "title": "A-List Escape: Clifftop Pool Villa with Private Butler and VIP Access to Sundays Beach Club",
    "description": "Experience Balinese luxury at its finest with a stay at the breathtaking The Ungasan Clifftop Resort, in Uluwatu. Stay in an elegant villa overlooking the ocean complete with a private plunge pool, enjoying sumptuous daily breakfast, butler service at your fingertips, return airport transfers, an IDR1,000,000 food and drinks credit, VIP access to the spectacular Sundays Beach Club and much more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Ungasan Clifftop Resort - June 2019",
    "offer_address": "Jl Pantai Selatan Gau | Banjar Wijaya Kusuma, Ungasan 80362, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 1267.0,
    "value": 3473.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FRSKXYA5",
    "hero_image": "https://images.luxuryescapes.com/zlg6a0suiiy3eqp2jn",
    "image_two": "https://images.luxuryescapes.com/64i6o8hkgp1dup5zmhi",
    "image_three": "https://images.luxuryescapes.com/e8t567bzvnfrpsku7vm",
    "vendor_name": "Bvlgari Resort Bali",
    "title": "Bali Ultimate Luxury: Clifftop Pool Villas with Daily Breakfast, Nightly 3-Course Dinner & Nightly Cocktails",
    "description": "A seamless fusion of Italian elegance and Balinese charm, this resplendent resort is an opulent sanctuary perched atop a breathtaking 160-metre cliff along the island’s southern coast. This exclusive retreat, crafted by the renowned luxury house Bvlgari, offers an unrivaled escape with sweeping views of the Indian Ocean and access to a secluded, pristine beach.\n\nDesigned for the most discerning travelers, Bvlgari Resort Bali redefines indulgence with bespoke butler service, lavishly appointed villas and exquisite interiors adorned with handcrafted Indonesian antiques. Each villa boasts a private infinity pool, seamlessly blending sophisticated design with nature’s raw beauty.\n\nBeyond your private haven, embark on a culinary journey at Sangkar, savour authentic Italian flavours with a Balinese touch at Il Ristorante - Luca Fantin or sip sunset cocktails at the iconic Bvlgari Bar. Unwind with holistic treatments at the world-class Bvlgari Spa, while kids revel in tailored activities at the Little Gems Club. For those eager to explore, the cultural wonders of Uluwatu and beyond await.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Bvlgari Resort Bali",
    "offer_address": "Jalan Goa Lempeh, Banjar Dinas Kangin, Uluwatu, Badung, Bali 80364, Indonesia",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 15,
    "price": 2399.0,
    "value": 3721.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPeWEQA0",
    "hero_image": "https://images.luxuryescapes.com/qiwdvdcwgnncxdg0b4jm",
    "image_two": "https://images.luxuryescapes.com/cr7vnlpwxynubt03nrhn",
    "image_three": "https://images.luxuryescapes.com/ezbonqyouiyoesx8nhwq",
    "vendor_name": "Banyan Tree Ungasan Bali",
    "title": "Clifftop Pool Villa Indulgence in Uluwatu",
    "description": "Experience five-star Balinese luxury at its finest with an Uluwatu clifftop getaway at Banyan Tree Ungasan. Perfect for couples and honeymooners, you will stay in your own spacious private pool villa, with the option to upgrade to stunning ocean views. Named one of the Most Luxurious Hotels in the World by Forbes Travel Guide, a stay at Banyan Tree Ungasan is sure to be an unforgettable experience. Includes three two-course dining experiences, one luxurious massage with your choice of reflexology or head and shoulder massage, a cocktail at the amazing Ju-Ma-Na bar, a one-way private airport transfer and daily breakfast.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Banyan Tree Ungasan - April 2019",
    "offer_address": "Banjar Kelod, Jl. Melasti, Ungasan, Kuta Sel., Kabupaten Badung, Bali 80364, Indonesia",
    "percentage_discount": 61.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1868.0,
    "value": 4831.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eLMdrQAG",
    "hero_image": "https://images.luxuryescapes.com/gb3e7ez9dwhrb3x3jg36",
    "image_two": "https://images.luxuryescapes.com/suagkun9ktj157whula5",
    "image_three": "https://images.luxuryescapes.com/bqoy650bhe6e9h2s3q2n",
    "vendor_name": "Prasana by Arjani Resorts",
    "title": "Private Pool Villa Escape with Gourmet Dining & Massages",
    "description": "Escape to the secluded shores of Bali’s Uluwatu and treat yourself to a luxury villa stay with your own private pool at Prasana Villa by Arjani Resorts - rated #1 on TripAdvisor for specialty lodging in Ungasan. Experience unparalleled privacy and indulge in daily breakfast - including one floating breakfast served in your private swimming pool - plus three delicious four-course dinners, a two-course set menu lunch, four 60-minute massages per room, a private one-way transfer from Denpasar Airport and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Prasana by Arjani Resorts",
    "offer_address": "1 Jalan Harjani, Ungasan, South Kuta, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 72.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 990.0,
    "value": 3556.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FjM8bAAF",
    "hero_image": "https://images.luxuryescapes.com/xrsl4nq27g2bfly7o04r",
    "image_two": "https://images.luxuryescapes.com/02cffiugbleu8vglvvi",
    "image_three": "https://images.luxuryescapes.com/fjktfdcz1qjrgoeut8khn",
    "vendor_name": "Hideaway Residence Bali",
    "title": "Secluded Uluwatu Private Pool Villas with Daily Breakfast, Nightly Cocktails & Massages",
    "description": "Experience the tranquillity of Bali's Uluwatu region at the secluded Hideaway Residence Bali, where private pools and a la carte breakfasts are part of the everyday. Just minutes from the famous Ungasan Badung Regency statue and fantastic beach clubs, this retreat is the ultimate escape for those seeking a balance of fun in the sun and cultural wonders. Enjoy authentic Indonesian cuisine at local eateries and immerse yourself in the spiritual serenity of Uluwatu Temple. Each villa boasts modern amenities, along with a private pool and a sun-kissed deck with sunloungers, providing an idyllic setting for your Bali escape.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Hideaway Residence Bali",
    "offer_address": "Jl. Mengelak No. 168,  Ungasan, South Kuta, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 389.0,
    "value": 731.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000QuMXLQA3",
    "hero_image": "https://images.luxuryescapes.com/qwwybgsrj13yscflt0me",
    "image_two": "https://images.luxuryescapes.com/u6kogvbldb3whvvgfqzp",
    "image_three": "https://images.luxuryescapes.com/jx6wxlnd7k4bl0y7eesn",
    "vendor_name": "Radisson Blu Bali Uluwatu",
    "title": "Grand Opening: Radisson Blu Bali Uluwatu",
    "description": "Be amongst the first to experience the brand-new Radisson Blu Bali Uluwatu. Fall in love with the super stylish and ultra-chic resort when you spend six days/five nights in a large Deluxe Room and enjoy daily buffet breakfasts, choice of three multi-course lunches or dinners, four 30-minute signature massages, choice of daily poolside cocktails or nightly sunset cocktails, complimentary airport pick-up and free kids’ club access",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Radisson Blu Uluwatu - May 2018*",
    "offer_address": "Jalan Pemutih, Jalan Labuansait, Pecatu, Kuta Selatan, Badung 80364, Bali",
    "percentage_discount": 74.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 629.0,
    "value": 2383.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Uwk6MQAR",
    "hero_image": "https://images.luxuryescapes.com/umidupzv1j3rthczrbhq",
    "image_two": "https://images.luxuryescapes.com/jjz62c1vrk1gic5t8hps",
    "image_three": "https://images.luxuryescapes.com/n9yfn7nge6mlbgmkxejm",
    "vendor_name": "Banyan Tree Ungasan Bali",
    "title": "Bali Clifftop Pool Villa in Uluwatu",
    "description": "Experience five-star Balinese luxury at its finest with three nights of Uluwatu clifftop indulgence at Banyan Tree Ungasan. Stay in a huge 400sqm private pool villa and enjoy daily buffet breakfast, an exotic three-course degustation dinner, private airport pick up and two massages to share.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Banyan Tree Ungasan - June/July 2018*",
    "offer_address": "Jalan Melasti, Banjar Kelod, Ungasan, Ungasan, Kuta Sel., Kabupaten Badung, Bali 80364, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 1287.0,
    "value": 3944.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FlBQRAA3",
    "hero_image": "https://images.luxuryescapes.com/zpck2ohlnhjb3efb6rcs",
    "image_two": "https://images.luxuryescapes.com/te8a7eqbdkvbpqmmz212f",
    "image_three": "https://images.luxuryescapes.com/q12wd5novjptjfo9tfek",
    "vendor_name": "Six Senses Uluwatu",
    "title": "Six Senses Uluwatu Cliffside Luxury with Daily Breakfast, Gourmet Lunch or Dinner & Cocktails",
    "description": "Venture to the edge of the world - perched atop the famous limestone cliffs of Bali’s southernmost peninsula - and experience the pinnacle of secluded coastside living at Six Senses Uluwatu. Immerse yourself in sweeping views of the glittering Indian Ocean and watch as the sun dips below the horizon from the spectacular resort pool that clings to the cliff's edge over three terraced levels. As evening arrives, relax against the backdrop of the darkening sky with a delicious cocktail served at Cliff Bar, or watch a movie under the twinkling stars before venturing to one of Bali's many famed beach clubs. \n\nThis five-star opulent eco-sanctuary - the island's only World Green Council-certified resort - combines its signature zero-waste concept with carefully curated contemporary touches, creating effortlessly elegant spaces you’ll never want to leave. Rejuvenate your body and soul with daily yoga and meditation, relax at the blissful wellness spa and indulge in gourmet farm-to-table sustainable dining at the resort’s two restaurants, including Japanese and Peruvian fusion at the recently opened Watu Steakhouse. This secure paradise is where luxury meets true tranquillity.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Six Senses Uluwatu",
    "offer_address": "Jalan Goa Lempeh, Uluwatu 80361, Bali, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1179.0,
    "value": 3153.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000crkRyQAI",
    "hero_image": "https://images.luxuryescapes.com/uwvu8u9lxp3rlginub7o",
    "image_two": "https://images.luxuryescapes.com/xi85omzxhwufin9wzfb",
    "image_three": "https://images.luxuryescapes.com/p7gxw6ye1kdper0mgiyn",
    "vendor_name": "Anantara Uluwatu",
    "title": "Romantic Cliffside Suites with Gourmet Dining",
    "description": "If secluded luxury in a romantic setting is what you’re seeking, look no further than the award-winning Anantara Uluwatu. Spectacularly located on a cliffside on Bali’s south coast, overlooking the Indian Ocean, this cliff's edge sanctuary has recently been given a sizzling makeover, with an Insta-worthy infinity pool and ocean-facing suites with private Jacuzzis. Your escape includes daily breakfast, your choice of indulgent multi-course lunches or dinners, a sunset cocktail for two, scheduled refreshments by the pool, a 60-minute Balinese massage each and a private one-way airport transfer.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Anantara Uluwatu Bali Resort",
    "offer_address": "Jl. Pemutih - Labuan Sait, Uluwatu, Pecatu, Kuta Selatan, Pecatu, Kuta Sel., Kabupaten Badung, Bali 80364, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 792.0,
    "value": 1953.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvY8DAAV",
    "hero_image": "https://images.luxuryescapes.com/3oey9waoefm1c7dq1ecj",
    "image_two": "https://images.luxuryescapes.com/idyxgi94uk41ilbok6a",
    "image_three": "https://images.luxuryescapes.com/m6ujp9ujmgwg9niy8o9o",
    "vendor_name": "Prasana by Arjani Resorts",
    "title": "Cliffside Uluwatu Private Pool Villa Retreat with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Embrace blissful seclusion with a luxury private pool villa stay at the newly renovated Prasana by Arjani Resorts, perfectly positioned in Uluwatu, Bali’s happening southernmost tip. Located just moments from plunging cliff faces, spellbinding coastline and spectacular sunsets, and boasting privileged views over the shimmering Indian Ocean, there’s no better place to soak up the island’s inimitable soul. Enjoy a sunrise walk to the golden sands of Melasti Beach and return to Menaka Spa for a wellness treatment drawing on ancient healing techniques. After an indulgent spa session, visit Whim for sumptuous plates and innovative cocktails showcasing Bali’s culinary brilliance. Finish with a decadent dark chocolate dessert or house-made gelato at Petit Garcon.\n\nIf you’re looking to explore the stunning region, there’s no better place to soak up Bali’s unique ambience. Take advantage of the resort's complimentary shuttle and enjoy local attractions like fire dancing at Uluwatu Temple, surfing at Padang-Padang Beach and the region's top beach clubs. Spend your evenings savouring Uluwatu's electrifying clifftop nightlife beneath the stars and return to your newly reimagined villa, elevated with countless luxury touches.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Prasana by Arjani Resorts",
    "offer_address": "1 Jalan Harjani, Ungasan, South Kuta, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 1039.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000E0KTKYA3",
    "hero_image": "https://images.luxuryescapes.com/vh0jbnsvlq0ppe9an747",
    "image_two": "https://images.luxuryescapes.com/h2d35bppl35q6m050db",
    "image_three": "https://images.luxuryescapes.com/kkajdm5lxhwsjd43x8fe",
    "vendor_name": "Radisson Blu Bali Uluwatu",
    "title": "Award-Winning Uluwatu Clifftop Opulence with Massages, Daily Breakfast & Nightly Cocktails",
    "description": "Embrace blissful seclusion perched on a clifftop overlooking the magnificent Indian Ocean with a stay at this ultra-stylish, palm-dotted resort, perfectly positioned in Bali’s vibrant southernmost tip: Uluwatu. Located just moments from plunging cliff faces, a spellbinding coastline and spectacular sunsets, and boasting privileged views of the shimmering Bingin and Padang Padang beaches - it’s truly a surfer’s paradise.\n\nPerfect for honeymooners and couples, this resort offers the best of relaxed island opulence. It's here that you can relax by the spectacular pool, indulge in traditional Indonesian and international delights at Artichoke or slick Western fare at the semi-alfresco Choka pool bar, or take a breather and unwind with a massage at Spa ESC.\n\nTraditional Balinese design is at the forefront of this resort, beckoning you with its tranquillity, spacious accommodation and world-class amenities. Spend your days here discovering the island's exquisite coral reefs, golden beaches and volcanic mountains before returning to this five-star oasis.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Radisson Blu Resort, Bali Uluwatu",
    "offer_address": "Jalan Pemutih, Jalan Labuansait, Pecatu, Kuta Selatan, Badung 80364, Bali",
    "percentage_discount": 41.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 969.0,
    "value": 1653.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004PtaqAAC",
    "hero_image": "https://images.luxuryescapes.com/26r2sz1ksi88qlpd98ag",
    "image_two": "https://images.luxuryescapes.com/63atufazqs4gwjws32s",
    "image_three": "https://images.luxuryescapes.com/0rvujl1el8leigglo7pe",
    "vendor_name": "Radisson Blu Bali Uluwatu",
    "title": "Stylish Uluwatu Clifftop Escape with Gourmet Dining & Daily Cocktails",
    "description": "Perched on a clifftop overlooking the magnificent Indian Ocean in Uluwatu, Radisson Blu Uluwatu beckons you with its tranquillity, spacious accommodation and world-class amenities. Situated close to the stunning beaches of Bingin and Padang Padang, this ultra-stylish, palm-dotted resort was awarded Best Coastal Design and Regional Winner in the Luxury Boutique Spa category at the World Luxury Spa Awards 2020.\n\nSpend your days by the spectacular pool, indulge in culinary delights in one of the onsite restaurants, or take a breather and unwind with massages at the spa. Perfect for honeymooners and couples, this resort offers relaxed island luxury.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Radisson Blu Uluwatu Dec 20",
    "offer_address": "Bali Uluwatu, Jl. Pemutih, Pecatu, Kec. Kuta Sel., Bali, 80364, Indonesia",
    "percentage_discount": 70.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 619.0,
    "value": 2058.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxQE1QAN",
    "hero_image": "https://images.luxuryescapes.com/dqobztk5dfio66hpxjwx",
    "image_two": "https://images.luxuryescapes.com/raeewvni9emp9mbqn2dx",
    "image_three": "https://images.luxuryescapes.com/ellisfcmborfyvgsg4zf",
    "vendor_name": "Hideaway Villas Uluwatu",
    "title": "Pool Villa Paradise: Where The Jungle Meets The Sea",
    "description": "Set on a hillside overlooking the Indian Ocean and enveloped by tropical Uluwatu jungle, Hideaway Villas offer a serene and private getaway just a stone’s throw from some of Bali’s best surfing beaches and chic beach clubs. Stay in a gorgeous villa with a private pool and enjoy daily a la carte breakfast, Balinese massages, sunset cocktails, dining experiences and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Hideaway Villas - OLD",
    "offer_address": "Jl. Bangbang Bendot Gang Hideaway, Uluwatu, Uluwatu, South Kuta, Pecatu, Kuta Selatan, Pecatu, South Kuta, Bali, 80361, Indonesia",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 643.0,
    "value": 1309.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EhS7AAK",
    "hero_image": "https://images.luxuryescapes.com/gdpiydfkespw07bbbmlcb",
    "image_two": "https://images.luxuryescapes.com/yurngknv0785x3b3lkbg",
    "image_three": "https://images.luxuryescapes.com/tcsj25eniidgp7ctjxr9",
    "vendor_name": "Hideaway Villas Uluwatu",
    "title": "Tropical Bali Pool Villa Paradise with Daily Dining & Cocktails",
    "description": "Endless Indian Ocean views and quintessential Balinese hospitality await at the blissful Hideaway Villas. Set on a hillside overlooking the ocean and enveloped by tropical Uluwatu jungle, this serene retreat offers a collection of beautifully designed pool villas, just a stone’s throw from some of Bali’s best surfing beaches and hottest beach clubs.\n\nTreat yourself to an escape from reality in a private pool villa as you enjoy daily à la carte breakfast, your choice of daily two-course lunch or dinner, a daily cocktail per adult, a 60-minute massage per adult, a one-way private airport transfer and a welcome mocktail on arrival.\n\n**Travelling with kids?** Upgrade to a Two-Bedroom Pool Villa for two adults and two children (aged 11 years and under).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Hideaway Villas",
    "offer_address": "Jl. Bangbang Bendot Gang Hideaway, Uluwatu, Uluwatu, South Kuta, Pecatu, Kuta Selatan, Pecatu, South Kuta, Bali, 80361, Indonesia",
    "percentage_discount": 43.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 449.0,
    "value": 786.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CRWuAAO",
    "hero_image": "https://images.luxuryescapes.com/h9m18845ms8l9h7g6c2p",
    "image_two": "https://images.luxuryescapes.com/p2arjxfurbc847ophpo3",
    "image_three": "https://images.luxuryescapes.com/buyjwri7pewz2my6l2ef",
    "vendor_name": "Active Escapes",
    "title": "Bali: 7-Day Group Fitness Festival Retreat with All-Inclusive Chef-Prepared Meals, Daily Activities & Roundtrip Transfers",
    "description": "Step up into six nights of fitness and fun on Uluwatu’s glorious golden sands and celebrate the 10-year anniversary of Active Escapes with this one-of-a-kind festival extravaganza. There's no better place to focus on your health and wellness as you savour each unforgettable sunset from the balcony of your spacious private room at the cliffside Radisson Blu Resort Bali Uluwatu, just a short jog from the world-class surf of Padang Padang beach and Uluwatu’s town centre. Plus, the entire resort will be exclusively reserved by Active Escapes, ensuring that you’ll be surrounded by like-minded fitness and wellness enthusiasts.\n\nBe fuelled with locally sourced, chef-prepared meals (breakfast, lunch and dinner) throughout your stay, and enjoy action-packed fun and adventure, including daily fitness sessions, non-motorised water sports, yoga, and more. Before you head home filled with amazing memories and lifelong friendships, your stay ends with a one-of-a-kind party to celebrate a decade of fitness and fun, with live music and guest DJs.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Bali Fitness Escape",
    "offer_address": "Bali Uluwatu, Jl. Pemutih, Pecatu, Kec. Kuta Sel., Bali, 80364, Indonesia",
    "percentage_discount": 37.0,
    "min_duration": 6,
    "max_duration": 7,
    "price": 2639.0,
    "value": 4163.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxD6SQAV",
    "hero_image": "https://images.luxuryescapes.com/l8yyb9f4ooklyjkevhcn",
    "image_two": "https://images.luxuryescapes.com/ycvlqatmk52wq1xbnta3",
    "image_three": "https://images.luxuryescapes.com/cynmaytodgzgzmdumljv",
    "vendor_name": "Anantara Uluwatu",
    "title": "Bali’s Anantara Uluwatu: Spectacular Cliffside Escape",
    "description": "If secluded luxury in a romantic setting is what you’re seeking, look no further than Anantara Uluwatu. Spectacularly located on a cliffside on Bali’s south coast overlooking the Indian Ocean, this glamorous resort is home to a cliff-edge infinity pool and ocean-facing suites with private jacuzzis. Your escape includes daily breakfasts, indulgent nightly dinners, massages and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Anantara Uluwatu Bali 2018",
    "offer_address": "Jl. Pemutih - Labuan Sait, Uluwatu, Pecatu, Kuta Selatan, Pecatu, Kuta Sel., Kabupaten Badung, Bali 80364, Indonesia",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1291.0,
    "value": 2643.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aiGabQAE",
    "hero_image": "https://images.luxuryescapes.com/gx8nwqkdidef8uxj1ixw",
    "image_two": "https://images.luxuryescapes.com/a7dxpzygimvqqcoiy0s0",
    "image_three": "https://images.luxuryescapes.com/otvvoo6hjberjhlfu3am",
    "vendor_name": "Anantara Uluwatu",
    "title": "Spectacular Clifftop Escape with Nightly Cocktails, Decadent Dining and More",
    "description": "If secluded luxury in a romantic setting is what you’re seeking, look no further than Anantara Uluwatu. Spectacularly located on a cliffside on Bali’s south coast overlooking the Indian Ocean, this glamorous resort is home to a cliff-edge infinity pool and ocean-facing suites with private jacuzzis. Your escape includes daily breakfasts, nightly cocktails, indulgent multi-course dinners and scheduled refreshments by the pool, a 60-minute Balinese massage per person and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Anantara Uluwatu Bali (2018)",
    "offer_address": "Jl. Pemutih - Labuan Sait, Uluwatu, Pecatu, Kuta Selatan, Pecatu, Kuta Sel., Kabupaten Badung, Bali 80364, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 810.0,
    "value": 1830.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C47IVAAZ",
    "hero_image": "https://images.luxuryescapes.com/nhrujgoaig9u8wg4auyc",
    "image_two": "https://images.luxuryescapes.com/31df7ymwv3uiq6rjqfe",
    "image_three": "https://images.luxuryescapes.com/g6apnixu5hiozgmvamo7",
    "vendor_name": "Karma Kandara",
    "title": "Five-Star Bali Uluwatu Private Pool Villas on Billionaire’s Row with Daily Breakfast & Nightly Cocktails",
    "description": "Welcome to Karma Kandara, your own secluded slice of paradise discreetly tucked away in Bali’s Bukit Peninsula, known globally as ‘Billionaire’s Row’. Ideally positioned clifftop in the charming village of Ungasan, this exclusive villa complex is home to a collection of expansive one, two and three-bedroom pool villas, and is within easy reach of some of the island's must-see sights. Discover tranquillity at the resort's ocean-facing infinity pool, sample flavour-packed, Mediterranean-inspired bites at di Mare restaurant or for something more relaxing, try lighter snacks at Karma Beach or cocktails at Temple Lounge.\n\nFor those looking to get out and about, strike the perfect balance between relaxation and nightlife with an abundance of mouthwatering restaurants, seaside cafés and local flea markets just a short walk away. What's more, thriving beach clubs such as Sundays Beach Club, Mïnoo Beach Club, Savaya Bali, Roosterfish and Oneeighty Dayclub are all within a 15-minute drive.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Karma Kandara",
    "offer_address": "Banjar Wijaya Kusuma, Ungasan, Kuta Selatan, Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 32.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 989.0,
    "value": 1450.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lVYbAAM",
    "hero_image": "https://images.luxuryescapes.com/43129jvqjcz6vzxsygrq",
    "image_two": "https://images.luxuryescapes.com/70ycclknjidkc3x6zjuf",
    "image_three": "https://images.luxuryescapes.com/mlhu0ahdxv9deh7xnqtpp",
    "vendor_name": "Renaissance Bali Uluwatu Resort & Spa",
    "title": "Uluwatu Tranquil Five-Star Luxury with Gourmet Dining, Nightly Cocktails & One-Way Private Airport Transfer",
    "description": "Experience the pinnacle of secluded romance at Renaissance Bali Uluwatu Resort & Spa, a five-star sanctuary bound to offer an unexpected and local lens to Bali’s Bukit peninsula. Nestled amid dramatic cliffs, this luxury hotel - part of Marriott’s premium Renaissance Hotels brand - is surrounded by rich Balinese jungle but just 20 minutes from the waves of Uluwatu’s famed Padang Padang Beach and the cool, calm waters of Dreamland Beach.\n\nMake the most of the resort’s luxurious amenities, which include three pools, a state-of-the-art fitness centre, a full-service spa, and a kids' club. The jewel in the resort’s crown? Its ultra-stylish beach club, Roosterfish, a chilled venue on the shores of Pandawa Beach - just a short, complimentary shuttle bus away. Enjoy an all-day culinary experience at Clay Craft restaurant, learn the techniques and secrets of Indonesian cookery at the Cooking Studio, or swim up and enjoy quality snacks and drinks at the Pool Bar. In the evening, sample creative cocktails overlooking a splendid coastal setting at the unbeatable R Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Renaissance Bali Uluwatu Resort & Spa",
    "offer_address": "Jl. Pantai Balangan I No.1, Ungasan, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia•+62 361 2003588",
    "percentage_discount": 0.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 759.0,
    "value": 1.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ail18QAA",
    "hero_image": "https://images.luxuryescapes.com/peotllj8bhqwqx3xkk8d",
    "image_two": "https://images.luxuryescapes.com/xbcrffscnjw251s3dhlc",
    "image_three": "https://images.luxuryescapes.com/ehh4nixcrmyydmdiaqp0",
    "vendor_name": "The Edge",
    "title": "Clifftop Luxury at Bali's Most Instagrammable Resort",
    "description": "Endless Indian Ocean views and a jaw-dropping, glass-bottom sky pool extending over the cliff edge towards the most breathtaking 180° panorama: welcome to The Edge in Uluwatu, Bali. Stay in an enormous one-bedroom private pool villa with dedicated 24-hour butler service, daily a la carte breakfast served in the comfort of your villa, nightly dinner, one daily cocktail each, one signature 60-minute massage per person and private VIP return airport transfers.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Edge APR 2019",
    "offer_address": "Jalan Pura Goa Lempeh Banjar Dinas Kangin Pecatu, Uluwatu, Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 1570.0,
    "value": 3569.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQQW3AAP",
    "hero_image": "https://images.luxuryescapes.com/97q1xnpdbjxgejpiilzs",
    "image_two": "https://images.luxuryescapes.com/k5aqsn3cvsn3g5w1grse",
    "image_three": "https://images.luxuryescapes.com/dp0x6c76in93xl5tu77d",
    "vendor_name": "Karma Kandara",
    "title": "Bali Uluwatu Private Pool Villas with Massages, Daily Breakfast, Cocktails & One Child Stays & Eats Free",
    "description": "Welcome to Karma Kandara, your own secluded slice of paradise discreetly tucked away in Bali’s Bukit Peninsula. Ideally positioned clifftop in the charming village of Ungasan, this exclusive villa complex is home to a collection of expansive one-, two- and three-bedroom pool villas, and is within easy reach of some of the island's must-see sights. Discover tranquillity at the resort's ocean-facing infinity pool, sample flavour-packed, Mediterranean-inspired bites at di Mare or try cocktails at Temple Lounge.\n\nFor those looking to get out and about, strike the perfect balance between relaxation and nightlife with an abundance of mouthwatering restaurants, seaside cafes and local flea markets just a short walk away. What's more, the thriving Sundays Beach Club is located within the resort complex offering guests easy access to unwind, soak up the vibes, enjoy the iridescent waters and experience a day of complete relaxation.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Karma Kandara",
    "offer_address": "Banjar Wijaya Kusuma, Ungasan, Kuta Selatan, Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 33.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 914.0,
    "value": 1366.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IAqLIAW",
    "hero_image": "https://images.luxuryescapes.com/kbpyf95izs3ayl0xh6m",
    "image_two": "https://images.luxuryescapes.com/23o08bprqiqg0saw5jel",
    "image_three": "https://images.luxuryescapes.com/3r1y6mnwnp5k9gq0n5an",
    "vendor_name": "Prasana by Arjani Resorts",
    "title": "Cliffside Uluwatu Private Pool Villa Retreat with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Embrace blissful seclusion with a luxury private pool villa stay, perfectly positioned in Uluwatu, Bali’s happening southernmost tip. Located just moments from plunging cliff faces, spellbinding coastline and spectacular sunsets, and boasting privileged views over the shimmering Indian Ocean, there’s no better place to soak up the island’s inimitable soul.\n\nEnjoy a sunrise walk to the golden sands of Melasti Beach and return to Menaka Spa for a wellness treatment drawing on ancient healing techniques. After an indulgent spa session, visit Whim for sumptuous plates and innovative cocktails showcasing Bali’s culinary brilliance. Finish with a decadent dark chocolate dessert or house-made gelato at Petit Garçon.\n\nIf you’re looking to explore the stunning region, there’s no better place to soak up Bali’s unique ambience. Take advantage of the resort's complimentary shuttle and enjoy local attractions like fire dancing at Uluwatu Temple, surfing at Padang-Padang Beach and the region's top beach clubs.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Prasana by Arjani Resorts",
    "offer_address": "1 Jalan Harjani, Ungasan, South Kuta, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 629.0,
    "value": 2080.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zULxAAM",
    "hero_image": "https://images.luxuryescapes.com/bcpsw8be7so7aozrv0rs",
    "image_two": "https://images.luxuryescapes.com/84tdmymi1a5woyelk01c",
    "image_three": "https://images.luxuryescapes.com/78t7rixpgmgqtyu3dmd",
    "vendor_name": "The Ungasan Cliff Top Resort, Bali",
    "title": "Clifftop Uluwatu One-Bedroom Private Pool Suites with Gourmet Dining, VIP Beach Club Access & Roundtrip Transfers",
    "description": "Discover a new definition for Balinese indulgence by escaping to The Ungasan Clifftop Resort, staying in an extraordinary One-Bedroom Plunge Pool Suite, perched on the cliffs of the Bukit Peninsula. Sitting above Uluwatu’s famous Sundays Beach Club, this luxury resort, ranked within the top 10% of properties on Tripadvisor, redefines what it is to be truly relaxed, with a soundtrack of crashing waves and panoramic ocean views as far as the eye can see.\n\nCelebrate opulence from the luxury of your exclusive suite, where traditional architectural styles are combined with modern amenities to offer oceanside living at its best. Spend your days lazing by the infinity pool, snacking on local and international delicacies at the Pool Lounge, or head to Sundays Beach Club, where free watersports hire and a VIP seating area await. Enjoy a beachside massage at the Club’s Spa Bale, or venture to indoor Vela Spa, where signature treatments include body scrubs, massages, facials and reflexology. Align your chakras with a private yoga session, or practise your swing on the tennis court or putting green. Villa guests need not leave their plush surroundings - private pools, yoga sessions and in-villa dining come as standard, with floating breakfasts and show-stopping BBQs on offer.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Ungasan Clifftop Resort",
    "offer_address": "Jl Pantai Selatan Gau | Banjar Wijaya Kusuma, Ungasan 80362, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1299.0,
    "value": 2927.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eKVOFQA4",
    "hero_image": "https://images.luxuryescapes.com/v451znf9rlrfoyak92",
    "image_two": "https://images.luxuryescapes.com/ji0aqbxfbl4tuo72sxbo",
    "image_three": "https://images.luxuryescapes.com/9guygfv057k0r7cxfd9",
    "vendor_name": "The Edge",
    "title": "Bali Villa Luxury with Glass-Bottom Cliffside Pool, Daily Dining & Cocktails",
    "description": "Endless Indian Ocean views and a jaw-dropping, glass-bottom sky pool extending over the cliff edge towards the most breathtaking 180° panorama: welcome to The Edge in Uluwatu, Bali. Stay in an enormous one-bedroom private pool villa with dedicated 24-hour butler service, daily à la carte breakfast served in the comfort of your villa, nightly two-course à la carte dinner, one post-dinner cocktail each, a signature 60-minute ‘The Edge’ massage per person and private VIP return airport transfers.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Edge Nov 2019",
    "offer_address": "Jalan Pura Goa Lempeh Banjar Dinas Kangin Pecatu, Uluwatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 1733.0,
    "value": 3516.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3WvMQAV",
    "hero_image": "https://images.luxuryescapes.com/wwzddrmhvpkuwdwgavlw",
    "image_two": "https://images.luxuryescapes.com/dibskbf7raypniy2nqkm",
    "image_three": "https://images.luxuryescapes.com/gme0ddwabgtpr06janfd",
    "vendor_name": "The Ungasan Cliff Top Resort, Bali",
    "title": "A-List Escape: Clifftop Pool Villa with Private Butler and VIP Access to Exclusive Beach Club",
    "description": "Experience endless Indian Ocean views and Balinese luxury at its finest with a stay at the breathtaking The Ungasan Clifftop Resort, in Uluwatu. Stay in an enormous three-bedroom villa overlooking the ocean complete with an infinity pool, enjoying sumptuous daily breakfast, butler service at your fingertips, VIP transports around the island with a private driver, return airport transfers, a USD$500 food and drinks credit and exclusive access to the spectacular Sundays Beach Club.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Ungasan Clifftop Resort - OLD",
    "offer_address": "Jl Pantai Selatan Gau | Banjar Wijaya Kusuma, Ungasan 80362, Indonesia",
    "percentage_discount": 35.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 6392.0,
    "value": 9875.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcBvqAAF",
    "hero_image": "https://images.luxuryescapes.com/hxqbq6s5zc7uriin19cwv",
    "image_two": "https://images.luxuryescapes.com/pam7scfteowtvtmp0o6m",
    "image_three": "https://images.luxuryescapes.com/ptk2oh52rclk72u13y4l",
    "vendor_name": "Six Senses Uluwatu",
    "title": "Six Senses Uluwatu Cliffside Suite & Villa Luxury with Daily Breakfast, Gourmet Lunch or Dinner, Nightly Cocktails & Massages",
    "description": "Venture to the edge of the world - perched atop the famous limestone cliffs of Bali’s southernmost peninsula - and experience the pinnacle of secluded coastside living. Immerse yourself in sweeping views of the glittering Indian Ocean and watch as the sun dips below the horizon from the spectacular resort pool that clings to the cliff's edge over three terraced levels. As evening arrives, relax against the backdrop of the darkening sky with a delicious cocktail served at Cliff Bar, or watch a movie under the twinkling stars before venturing to one of Bali's many famed beach clubs.\n\nThis five-star opulent eco-sanctuary - the island's only World Green Council-certified resort - combines its signature zero-waste concept with carefully curated contemporary touches, creating effortlessly elegant spaces you’ll never want to leave. Rejuvenate your body and soul with daily yoga and meditation, relax at the blissful wellness spa and indulge in gourmet farm-to-table sustainable dining at the resort’s two restaurants, including Japanese and Peruvian fusion at the recently opened Watu Steakhouse. This secure paradise is where luxury meets true tranquillity.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Six Senses Uluwatu",
    "offer_address": "Jalan Goa Lempeh, Uluwatu 80361, Bali, Indonesia",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1199.0,
    "value": 3093.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hDSoAAM",
    "hero_image": "https://images.luxuryescapes.com/2jbflryc2rjavv819ewj",
    "image_two": "https://images.luxuryescapes.com/cwia10lppqkrnlr1qqo",
    "image_three": "https://images.luxuryescapes.com/0jgx8t73ga6y1nfnh3ia",
    "vendor_name": "Karma Kandara",
    "title": "Bali Five-Star Private Pool Clifftop Villas near Uluwatu with Daily Breakfast, One-Time Dinner & Nightly Cocktails",
    "description": "Welcome to Karma Kandara, your own secluded slice of Balinese paradise, discreetly tucked away in Bali’s Bukit Peninsula, known globally as ‘Billionaire’s Row’. Ideally positioned clifftop in the charming seaside village of Ungasan near Uluwatu, this exclusive villa complex is within easy reach of some of Bali's best beach clubs, thriving restaurants, local markets and independent boutiques.\n\nPerfect for couples, families or groups, Karma Kandara is home to a collection of expansive one, two and three-bedroom pool villas crafted in traditional Balinese style. While leaving your sumptuous sanctuary, nestled within the confines of a walled garden, is optional, there’s more to explore. Discover true tranquility at the resort's ocean-facing infinity pool and Cliff Spa, set into the rugged limestone cliffs with 180-degree views of the Indian Ocean. Sample Bali's finest at onsite restaurant di Mare, which combines high-quality ingredients and exotic flavours with Mediterranean influences, or opt for something more relaxed with beach-inspired bites at Karma Beach or custom cocktails at Temple Lounge. Then, when the sun sets, head to Veritas Wine Bar for a tasting experience, or dive into blissful barefoot hedonism at the glamorous Karma Beach Club. Accessible via a scenic cliffside inclinator lift, this celebrity favourite offers cocktails, oceanside spa treatments and good vibes to the sound of international DJ sets.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Karma Kandara",
    "offer_address": "Banjar Wijaya Kusuma, Ungasan, Kuta Selatan, Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 803.0,
    "value": 1484.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000QHcNKAA1",
    "hero_image": "https://images.luxuryescapes.com/p2aabglp3bbpdnruoz26",
    "image_two": "https://images.luxuryescapes.com/wqu3lqy5jnbaza3mtkrd",
    "image_three": "https://images.luxuryescapes.com/nosunoenxeqxvlhvtvno",
    "vendor_name": "Banyan Tree Ungasan Bali",
    "title": "Bali Clifftop Pool Villa in Uluwatu",
    "description": "Experience five-star Balinese luxury at its finest with five nights of Uluwatu clifftop indulgence at Banyan Tree Ungasan. Stay in a huge 400sqm private pool villa and enjoy return airport transfers, daily breakfasts, exotic dining experiences, nightly sunset cocktails, massages, guided temple and village tour and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Banyan Tree Ungasan  OLD*",
    "offer_address": "Jalan Melasti, Banjar Kelod, Ungasan, Ungasan, Kuta Sel., Kabupaten Badung, Bali 80364, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1913.0,
    "value": 3976.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y317WQAR",
    "hero_image": "https://images.luxuryescapes.com/rrmivld9u0w5qe44g5ej",
    "image_two": "https://images.luxuryescapes.com/oupgl5kwor8hco9f7xjz",
    "image_three": "https://images.luxuryescapes.com/sjrp3casojannbqfpbig",
    "vendor_name": "Banyan Tree Ungasan Bali",
    "title": "Balinese Pool Villa Indulgence with Daily Gourmet Dining Experiences",
    "description": "Experience five-star Balinese luxury at its finest with five nights of Uluwatu clifftop indulgence at Banyan Tree Ungasan. Stay in a huge 400sqm private pool villa, with the option to upgrade to stunning ocean views. The highlight of your stay will be the included gourmet dining experiences, with each morning beginning with a full breakfast at Bambu restaurant. Every evening you’ll return here nightly for a complimentary two-course dinner of signature Indonesian dishes and western favourites. Or take the option to switch one dinner for an unforgettable two-course lunch at Ju-Ma-Na, Banyan Tree’s fine-dining establishment, serving unique French-Japanese fusion. Also included in your stay is a private airport pick-up, a 30-minute massage, one cocktail per person and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Banyan Tree Ungasan - OLD",
    "offer_address": "Banjar Kelod, Jl. Melasti, Ungasan, Kuta Sel., Kabupaten Badung, Bali 80364, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 2044.0,
    "value": 4284.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cIeLBQA0",
    "hero_image": "https://images.luxuryescapes.com/v952ugh0pn7sdidc9ejk",
    "image_two": "https://images.luxuryescapes.com/4rv2bcq6nq9rgedxyc",
    "image_three": "https://images.luxuryescapes.com/apyahsg6xi67ejtb9x39",
    "vendor_name": "The Edge",
    "title": "Villa Luxury at Bali's Most Instagrammable Resort",
    "description": "Endless Indian Ocean views and a jaw-dropping, glass-bottom sky pool extending over the cliff edge towards the most breathtaking 180° panorama: welcome to The Edge in Uluwatu, Bali. Stay in an enormous three-bedroom private pool villa with dedicated 24-hour butler service, daily a la carte breakfast served in the comfort of your villa (including one incredible floating breakfast in the glass-bottom pool), nightly à la carte dinner, one daily cocktail each, one signature 60-minute massage per person and private VIP return airport transfers - all for six people.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Edge February 2019",
    "offer_address": "Jalan Pura Goa Lempeh Banjar Dinas Kangin Pecatu, Uluwatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 4435.0,
    "value": 8991.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ecov5AAB",
    "hero_image": "https://images.luxuryescapes.com/b0ln10ker09oxlivve",
    "image_two": "https://images.luxuryescapes.com/30sfxt337bnd4k13o1",
    "image_three": "https://images.luxuryescapes.com/2fstban4bcfn67pylxk",
    "vendor_name": "Prasana by Arjani Resorts",
    "title": "Cliffside Uluwatu Private Pool Villa Retreat with Massages, Nightly Three-Hour Free-Flow Cocktails & Daily Breakfast",
    "description": "Embrace blissful seclusion with a luxury private pool villa stay at Prasana by Arjani Resorts, perfectly positioned in Bali’s happening southernmost tip: Uluwatu. Located just moments from plunging cliff faces, spellbinding coastline and spectacular sunsets, and boasting privileged views over the shimmering Indian Ocean, there’s no better place to soak up the island’s inimitable soul. Enjoy a sunrise walk to the golden sands of Melasti Beach and return to Menaka Spa for a wellness treatment drawing on ancient healing techniques. After an indulgent spa session, visit Whim for sumptuous plates and innovative cocktails showcasing Bali’s culinary brilliance. Finish with a decadent dark chocolate dessert or house-made gelato at Petit Garçon.\n\nIf you’re looking to explore the stunning region, there’s no better place to soak up Bali’s unique ambience. Take advantage of the resort's complimentary shuttle and enjoy local attractions like fire dancing at Uluwatu Temple, surfing at Padang-Padang Beach and the region's top beach clubs. Spend your evenings savouring Uluwatu's electrifying clifftop nightlife beneath the stars.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Prasana by Arjani Resorts",
    "offer_address": "1 Jalan Harjani, Ungasan, South Kuta, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 743.0,
    "value": 1462.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000QuMXfQAN",
    "hero_image": "https://images.luxuryescapes.com/huyxdipe1gxbbbzjk22v",
    "image_two": "https://images.luxuryescapes.com/im96ephpwh0ia0hjjipe",
    "image_three": "https://images.luxuryescapes.com/ztesiutevadp2552gxqv",
    "vendor_name": "The Edge",
    "title": "Cliff-Hanging Luxury on the Edge in Uluwatu",
    "description": "Experience endless Indian Ocean views, a series of cascading ponds, spilling into a jaw-dropping glass-bottom sky pool extending over the cliff edge and the most breathtaking 180° panorama imaginable at The Edge in Uluwatu, Bali. Stay in an enormous two bedroom private pool villa for five or seven nights with daily a la carte breakfast, daily dinner or two-course set lunch, nightly sunset cocktails for two, two signature 60-minute massages to share, private VIP return airport transfers and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Edge OLD 2018*",
    "offer_address": "Jl. Pura Goa Lempeh Banjar Dinas Kangin, Pecatu - Uluwatu BALI 80364 - INDONESIA",
    "percentage_discount": 67.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 3144.0,
    "value": 9398.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjfwAAC",
    "hero_image": "https://images.luxuryescapes.com/vf1x9raae62f2g57mcbe",
    "image_two": "https://images.luxuryescapes.com/emy4az29v3opokqjen5",
    "image_three": "https://images.luxuryescapes.com/vloyhw6w0srpj4ktcrgqi",
    "vendor_name": "Prasana by Arjani Resorts",
    "title": "Clifftop Pool Villa Retreat with Decadent Dining",
    "description": "Experience secluded privacy and unparalleled luxury amid Uluwatu’s jungle landscape at Prasana Villa by Arjani Resorts - rated #1 on TripAdvisor for specialty lodging in Ungasan.\n\nTreat yourself to a luxury pool villa stay and indulge in daily breakfast - including one decadent floating breakfast served in your private swimming pool - plus three delicious four-course dinners with a glass of wine per person, a two-course set-menu lunch, four 60-minute massages per room, a welcome drink on arrival and a private one-way transfer from Denpasar Airport. Plus, two children aged 11 years and under stay free.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupatén Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Prasana Villa by Arjani Resorts 2020",
    "offer_address": "1 Jalan Harjani, Ungasan, South Kuta, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1680.0,
    "value": 4211.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LnRvAAK",
    "hero_image": "https://images.luxuryescapes.com/qms2r6vnf2vynwoiwlh",
    "image_two": "https://images.luxuryescapes.com/8ysqwnji9br0qwryhk18g",
    "image_three": "https://images.luxuryescapes.com/t0h4s1n07xh4wnneycf",
    "vendor_name": "Radisson Blu Bali Uluwatu",
    "title": "Stylish Uluwatu Clifftop Escape with Gourmet Dining & Daily Cocktails",
    "description": "Fall in love with the super-stylish Radisson Blu Uluwatu, a waterfront oasis surrounded by palm tree-dotted grounds offering ultra-spacious rooms and five-star service. Experience a quintessential tropical escape and indulge in a daily buffet ‘Super Breakfast’, three two-course lunches or dinners at your choice of any of the onsite restaurants, a daily sunset cocktail for two, two 45-minute signature massages per adult and a private airport pick-up or drop-off from Denpasar airport.\n\nWant to extend your stay? Combine your five and/or seven-night packages to stay even longer and receive double the inclusions.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details)",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Radisson Blu Uluwatu March 2020",
    "offer_address": "JI Pemutih, Pecatu, Kuta Sel., Pecatu, Bali 80364, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 701.0,
    "value": 2132.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcWHFAA3",
    "hero_image": "https://images.luxuryescapes.com/5tjac044wiym63ycrnui",
    "image_two": "https://images.luxuryescapes.com/itl85nvcltpopcnjrcc6",
    "image_three": "https://images.luxuryescapes.com/uaji7xr2tc1028ewjq",
    "vendor_name": "The Edge",
    "title": "Five-Star Uluwatu The Edge Villas with Glass-Bottom Cliffside Pool, Daily Breakfast, Nightly Dinners & Cocktails",
    "description": "The towering cliffs of Uluwatu are the stunning setting for an exquisite collection of five-star private villas known as The Edge. Perched on the very edge of Bali’s southwestern corner, in the traditional village of Pecatu, this secluded resort is a masterclass in exclusivity and opulence, with just eight villas spread across the 2.5-hectare property. Start each day with a butler-served breakfast, before venturing to the onsite day club, oneeighty°, to plunge into the jaw-dropping glass-bottomed sky pool that extends six metres over the cliff edge. Discover true bliss at the cliffside spa, with treatments inspired by Balinese traditions, or head out for 18 holes at the international golf course, just 3km away.\n\nWith plenty to enthrall and entertain onsite, venturing further afield is completely optional - but keen surfers will find some of Bali’s best breaks just 10 minutes away. Take a day to explore the surrounding beaches, all filled with spectacular beach clubs and authentic restaurants, or drive up to the historic Uluwatu Temple for a dose of culture.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Edge.",
    "offer_address": "Jl Pura Goa Lempeh, Banjar Dinas Kangin, Pecatu, Uluwatu, Bali 80361, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 2009.0,
    "value": 4423.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003Gy8HAAS",
    "hero_image": "https://images.luxuryescapes.com/9osuxoqpmm046tjb0so",
    "image_two": "https://images.luxuryescapes.com/8mcb0gdzgs0aqfx9e1w",
    "image_three": "https://images.luxuryescapes.com/wz9tjng0kmr2ct9pamhi",
    "vendor_name": "Wyndham Dreamland Resort Bali",
    "title": "Award-Winning Uluwatu Luxury near Dreamland Beach with Daily Dining",
    "description": "Escape to the pristine shores of Uluwatu with a stay at Wyndham Dreamland Resort Bali, winner of a Tripadvisor Travellers' Choice Award 2020. Located just metres from scenic Dreamland Beach and the famed Uluwatu Temple, this is your personal gateway to the many wonders of southern Bali. Kick back and relax in an atmosphere which seamlessly blends unspoilt Bali beauty with sophisticated luxury, where elegantly designed accommodation, an eclectic dining scene and stunning surf breaks await.\n\nRooms come with contemporary Balinese design and modern luxuries. Sink into your plush bedding, take advantage of the walk-in wardrobe and enjoy complimentary Wi-Fi. Take your tastebuds on a delicious trip with the resort's multiple onsite dining options. Savour classic Indonesian fare at the vibrant Rayunan Restaurant or indulge in a Melbourne café-style brunch at Dreamland Café. In the evenings, catch an amazing view of the sunset with a drink or two at the stunning Sunset Deck Bar. If you're looking to take your first steps into the world of wellness, rejuvenate and refresh yourself at the Tirta Spa & Wellness Centre, or take up yoga at the expansive yoga studio.\n\n**Bonus inclusions (select nights only)**\n\n- Begin each day with delicious **breakfast** at Rayunan Restaurant\n- Enjoy **daily lunch or dinner** for two at Rayunan Restaurant \n- Switch off with **one cocktail** per adult, per stay (for stays of 3+ nights)\n\n**Travelling with family?** One child (aged 11 years and under) stays free in existing bedding with daily breakfast.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Wyndham Dreamland Resort Bali",
    "offer_address": "Kawasan, Jl. Pecatu Indah Raya Jl. Pantai Dreamland, Pecatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80364, Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004RqPAAA0",
    "hero_image": "https://images.luxuryescapes.com/9dln0fsfxrg4bme6l3c",
    "image_two": "https://images.luxuryescapes.com/rjxo086oplrx8h56fwi8",
    "image_three": "https://images.luxuryescapes.com/1d5xq9ymnr2n3u0jphv",
    "vendor_name": "The Ungasan Cliff Top Resort, Bali",
    "title": "Five-Star Uluwatu Clifftop Luxury with Butler Service & VIP Beach Club Access",
    "description": "Discover a new definition for Balinese indulgence by escaping to The Ungasan Clifftop Resort, a collection of extraordinary suites and villas perched on the cliffs of the Bukit Peninsula. Sitting above Uluwatu’s famous Sundays Beach Club, this luxury resort redefines what it is to be truly relaxed, with a soundtrack of crashing waves and panoramic ocean views as far as the eye can see.\n\nSuites and villas celebrate opulence - traditional architectural styles are combined with modern amenities to offer oceanside living at its best. Spend your days lazing by the infinity pool, snacking on local and international delicacies at the Pool Lounge, or head to Sundays Beach Club, where free watersports hire and a VIP seating area await. Enjoy a beachside massage at the Club’s Spa Bale, or venture to indoor Vela Spa, where signature treatments include body scrubs, massages, facials and reflexology. Align your chakras with a private yoga session, or practise your swing on the tennis court or putting green. Villa guests need not leave their plush surroundings - private pools, yoga sessions and in-villa dining come as standard, with floating breakfasts and show-stopping BBQs on offer.\n\n**Luxury Escapes inclusions (select nights/packages)**\n\n- Enjoy a luxurious start to the day with **breakfast served to your suite or villa daily**\n- Travel in style with **return airport transfers**\n- Spend your days by the sea with **complimentary access to Sundays Beach Club**, with an exclusive VIP seating area and use of snorkelling and watersports equipment\n- Don’t bother lifting a finger: **butler service** will look after all your wants and needs\n- Settle into your sumptuous sanctuary with a **one-time 60-minute treatment per person** at Vela Spa (for stays of 2+ nights)\n- Enjoy a feast for the senses with **one three-course dinner** served in the comfort of your suite (suite guests only, for stays of 5+ nights)\n- Get family and friends together for **one in-villa BBQ experience for up to 10 people** (villa guests only, for stays of 5+ nights)\n\n**Group villa upgrades available**: Escape with friends and family when you choose one of the spectacular five-bedroom villa upgrades for 10 guests.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Ungasan Clifftop Resort",
    "offer_address": "Jl Pantai Selatan Gau | Banjar Wijaya Kusuma, Ungasan 80362, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 641.0,
    "value": 641.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GeotAAC",
    "hero_image": "https://images.luxuryescapes.com/ihozh5abtc7lv3zxxwc8",
    "image_two": "https://images.luxuryescapes.com/pawi5klqpcy1adrn2qjq",
    "image_three": "https://images.luxuryescapes.com/sffzwrvsj3j6hu6vdf",
    "vendor_name": "Radisson Blu Bali Uluwatu",
    "title": "Award-Winning Uluwatu Clifftop Escape with Daily Breakfast & Cocktails",
    "description": "Perched on a clifftop overlooking the magnificent Indian Ocean, Radisson Blu Uluwatu beckons you with its tranquillity, spacious accommodation and world-class amenities. Situated close to the stunning beaches of Bingin and Padang Padang, this ultra-stylish, palm-dotted resort was awarded Best Coastal Design and Regional Winner in the Luxury Boutique Spa category at the World Luxury Spa Awards 2020.\n\nSpend your days here discovering the island's exquisite coral reefs, golden beaches and volcanic mountains, before returning to this five-star oasis. Perfect for honeymooners and couples, this resort offers the best of relaxed island luxury. It's here that you can relax by the spectacular pool, indulge in traditional Indonesian and international delights at Artichoke or slick western fare at the semi-alfresco Choka pool bar, or take a breather and unwind with massages at the spa.\n\n**Luxury Escapes inclusions (select nights)**\n\n- Begin your day in Uluwatu with a **lavish buffet breakfast** at Artichoke restaurant\n- Enjoy a **daily cocktail per person** at the Lookout bar or Choka pool bar\n- Indulge with **a two-course lunch or dinner** at Artichoke or Choka, once during your stay (for stays of 3+ nights)\n- Unwind with **one relaxing 45-minute spa treatment** each at Spa ESC (for stays of 4+ nights)\n- Enjoy **a bonus two-course lunch or dinner** at Artichoke or Choka (total of two during your stay; for stays of 5+ nights)\n\n**Looking for breathtaking ocean views?** Upgrade to an ocean-view room or suite to soak up awe-inspiring Indian Ocean vistas from your private balcony.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Radisson Blu Uluwatu",
    "offer_address": "Bali Uluwatu, Jl. Pemutih, Pecatu, Kec. Kuta Sel., Bali, 80364, Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009Bi4yAAC",
    "hero_image": "https://images.luxuryescapes.com/zs439ci9iiv6qkk6kfgu",
    "image_two": "https://images.luxuryescapes.com/mycxh6nc14j4d7u5aoh",
    "image_three": "https://images.luxuryescapes.com/um5nz1ar72i7hrqzsi",
    "vendor_name": "Alila Villas Uluwatu",
    "title": "Elevated Alila Uluwatu Private Pool Villa Luxury with Cliffside Infinity Pool",
    "description": "An unbeatable clifftop location and endless horizon panoramas await at the five-star Alila Villas Uluwatu, home to a refined collection of private pool villas offering sophisticated interiors and peaceful seclusion. While private pools outside your bedroom door promise effortless relaxation throughout your stay, a sunset swim in the refreshing waters of the celebrated infinity pool is a must. Make your way to Spa Alila for a transcendent experience using ancient Asian healing techniques and fresh, quality ingredients. Surrender to signature spa rituals where indulgent massages, body scrubs and masks using sandalwood and other herbs will leave you feeling rejuvenated and polished. When you're ready to descend from the heavenly clifftops and sink your toes into golden shores, the beach is accessible via an impressive exclusive stairway which hugs the cliffside.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Alila Villas Uluwatu",
    "offer_address": "Jl. Belimbing Sari Tambiyak, Pecatu, South Kuta, Badung Regency, Bali 80364, Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037J67AAE",
    "hero_image": "https://images.luxuryescapes.com/4iz3pxt5mk8rz5mbac",
    "image_two": "https://images.luxuryescapes.com/f8g5dk4acrkfqkzx37b7",
    "image_three": "https://images.luxuryescapes.com/1j4jm2s5k8t0kljnkqsr",
    "vendor_name": "The Edge",
    "title": "Uluwatu Five-Star Clifftop Pool Villas with Glass-Bottom Sky Pool & Indian Ocean Views",
    "description": "The towering cliffs of Uluwatu are the stunning setting for this jaw-dropping collection of private villas known as The Edge. Perched on the very edge of Bali’s southwestern corner, in the traditional village of Pecatu, this secluded bolthole is a masterclass in exclusivity and opulence, with just eight villas spread across the exquisite 1.5-hectare property. With plenty to enthral and entertain onsite, venturing further afield is completely optional - but keen surfers will find some of Bali’s best breaks just 10 minutes away.\n\nThe Edge combines all the luxuries of a five-star hotel with the privacy and seclusion of a villa experience plus 24-hour butler service. Sweeping and unobstructed views of the Indian Ocean come as standard in each of the exclusive villas, with floor-to-ceiling windows perfectly placed to capture the enclave’s unique location. Start each day with a butler-served breakfast, before venturing to the onsite day club, oneeighty°, to plunge into the jaw-dropping glass-bottom sky pool that extends six metres over the cliff edge. Discover true bliss at the cliffside spa, with treatments inspired by Balinese traditions, or have your butler organise 18 holes at the international golf course, just 3km away.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "The Edge",
    "offer_address": "Jalan Pura Goa Lempeh Banjar Dinas Kangin Pecatu, Uluwatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 1182.0,
    "value": 1182.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gvo8zAAB",
    "hero_image": "https://images.luxuryescapes.com/i9wx0nol5izh5jif21l7",
    "image_two": "https://images.luxuryescapes.com/1m9vx958qmeeinthjpar",
    "image_three": "https://images.luxuryescapes.com/k3a66urzail2qac9wq1",
    "vendor_name": "Ulu Cliffhouse",
    "title": "Eclectic Uluwatu Cliffside Retreat with Infinity Pool, Onsite Spa & Restaurant",
    "description": "Feel the sea breeze in your hair as you revel in tropical luxury perched high on the cliffs of Bali's stunning Bukit Peninsula. Savour the flavours of the island at the onsite restaurant, renowned for its fresh seafood and delicious classic dishes. Those seeking relaxation can indulge in a rejuvenating treatment at the onsite spa, or sip on cocktails at Ulu Cliffhouse Beach Club, soaking up the luxurious Palms Springs vibes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Ulu Cliffhouse",
    "offer_address": "Pecatu, South Kuta, Pecatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80361",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 190.0,
    "value": 190.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GrhRAAS",
    "hero_image": "https://images.luxuryescapes.com/bzqcuzhu3drp1ri8f",
    "image_two": "https://images.luxuryescapes.com/5f34ahga8hi7pbal2jek",
    "image_three": "https://images.luxuryescapes.com/3kethdelrgat51toqxam",
    "vendor_name": "Six Senses Uluwatu",
    "title": "Uluwatu Suite Escape with Spectacular Cliffside Pool",
    "description": "Venture to the edge of the world, where every view is of the ocean and secluded luxury is a given: this is Six Senses Uluwatu - a cliffside sanctuary perched on the southernmost tip of Bali, ranked among the top five hotels in Uluwatu on Tripadvisor. Here, a spectacular pool clings to the cliff's edge over three terraced levels, and watching the sun dip towards the glittering ocean is best enjoyed while sipping cocktails. Bali’s only World Green Council-certified resort, Six Senses Uluwatu proudly focuses on recycling, composting and reusing, using sustainable architecture with contemporary Balinese touches. Relax at the blissful spa, rejuvenate your body and soul at the yoga and meditation pavilion, and indulge in farm-to-table sustainable dining at the resort’s two restaurants.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Six Senses Uluwatu",
    "offer_address": "Jl. Goa Lempeh, Uluwatu, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 613.0,
    "value": 613.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTAwAAO",
    "hero_image": "https://images.luxuryescapes.com/lois1hdo82o9csho17e",
    "image_two": "https://images.luxuryescapes.com/sl4eaxddufgd1eoz4pu",
    "image_three": "https://images.luxuryescapes.com/p4rqgilqtwvrzv1gpfm",
    "vendor_name": "Anantara Uluwatu",
    "title": "Five-Star Uluwatu Cliffside Luxury with Oceanfront Infinity Pool & Private Beach Elevator Access",
    "description": "Secluded luxury and endless ocean views await at the five-star Anantara Uluwatu Bali Resort, an award-winning sanctuary of serenity. Perfectly poised on a clifftop on Bali's south coast, overlooking the Indian Ocean, this luxury hotel is surrounded by dramatic coastline, native jungle and lush rice paddies, yet just 15 minutes from the centre of bustling Uluwatu. Intimate and stylish, Anantara will exceed your expectation of paradise with its myriad luxe facilities. Tantalise your tastebuds with fusion delights at a host of bars and restaurants, relish lazy days at the Insta-worthy infinity pool, discover true tranquillity at Anantara Spa, slice through the cliffside with private beach elevator access to the sands below and soak up the chilled-out vibes of Uluwatu with complimentary beach shuttles.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Anantara Uluwatu Bali Resort",
    "offer_address": "Jl. Pemutih - Labuan Sait, Uluwatu, Bali 80364, Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Cj3hJYAR",
    "hero_image": "https://images.luxuryescapes.com/3sn43yxnbsuq300owy",
    "image_two": "https://images.luxuryescapes.com/sn457rx6qmyej6a69jtn",
    "image_three": "https://images.luxuryescapes.com/9lmgj47xbj3h3s28v4",
    "vendor_name": "Alila Villas Uluwatu",
    "title": "Elevated Alila Uluwatu Private Pool Villas with Cliffside Cabana Bar & World-Class Spa",
    "description": "An unbeatable clifftop location and endless horizon panoramas await at this five-star escape, home to a refined collection of private pool villas offering sophisticated interiors and peaceful seclusion.\n\nMake your way to Spa Alila for a transcendent experience using ancient Asian healing techniques, or gaze out over the ocean from The Warung, the onsite restaurant inspired by traditional food stalls. When you're ready to descend from the heavenly clifftops and sink your toes into golden shores, the beach is accessible via an impressive exclusive stairway which hugs the cliffside.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Alila Villas Uluwatu",
    "offer_address": "Jl. Belimbing Sari Tambiyak, Pecatu, Kuta Selatan, Badung, Bali, 80364, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 628.0,
    "value": 628.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ExBopAAF",
    "hero_image": "https://images.luxuryescapes.com/v264wwap8s43vot5zxgf",
    "image_two": "https://images.luxuryescapes.com/zk0c50vbyl5pesp9pxtw",
    "image_three": "https://images.luxuryescapes.com/ud8p67l7ol5vjtakucm7",
    "vendor_name": "Karma Kandara",
    "title": "Clifftop Uluwatu Private Pool Villas with Five Restaurants & Bars & Beach Club",
    "description": "Welcome to Karma Kandara, your own secluded slice of paradise discreetly tucked away in Bali’s Bukit Peninsula. Ideally positioned clifftop in the charming village of Ungasan, this exclusive villa complex is home to a collection of expansive pool villas, and is within easy reach of some of the island's must-see sights. Discover tranquillity at the resort's ocean-facing infinity pool, sample flavour-packed, Mediterranean-inspired bites at di Mare or sip on cocktails at Temple Lounge. Strike the perfect balance between relaxation and nightlife with an abundance of mouthwatering restaurants, seaside cafes and local flea markets just a short walk away, or visit the thriving Karma Beach Club, where watersports, beachcombing, all-day dining, spa treatments, yoga sessions and private cabanas await.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Uluwatu",
    "location_subheading": "Bali",
    "location_description": "Karma Kandara",
    "offer_address": "Jalan Villa Kandara, Banjar Wijaya Kusuma, Ungasan Bali, 80362, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 715.0,
    "value": 715.0
  }
]