[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gx7hdAAB",
    "hero_image": "https://images.luxuryescapes.com/mmo4llwhlvccm17zae",
    "image_two": "https://images.luxuryescapes.com/xl5mjfnsjvxms9ybsn3g",
    "image_three": "https://images.luxuryescapes.com/vuabe7nuqjtv5vw3vv",
    "vendor_name": "Outrigger Mauritius Beach Resort",
    "title": "Mauritius Outrigger Beachfront Escape with Daily Breakfast, Nightly Dinner, Nightly Cocktails & Massages",
    "description": "Nestled amidst powder-white sands and glamorous plantation-style architecture, this outstanding Mauritian tropical luxury abode offers a myriad of delights, including world-class restaurants, thrilling watersports and a tranquil spa along the shores of the Indian Ocean in the upscale Bel Ombre area. Perfectly suited for both families and honeymooning couples seeking privacy and romance, the resort also boasts a picturesque private beachfront, four pools and the exclusive Plantation Club.\n\nWhether immersing oneself in Mauritian culture, exploring historic tea plantations nearby in Bois Cheri, or embarking on world-class diving adventures in the azure ocean, guests are invited to unwind in style and indulge in barefoot elegance at this perfectly positioned retreat.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Savanne",
    "offer_geo_area_level_2": "Bel Ombre",
    "location_heading": "Bel Ombre",
    "location_subheading": "Mauritius",
    "location_description": "Outrigger Mauritius Beach Resort",
    "offer_address": "Allee des Cocotiers, Bel Ombre 61001, Mauritius",
    "percentage_discount": 67.0,
    "min_duration": 4,
    "max_duration": 24,
    "price": 899.0,
    "value": 2689.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000avhzKQAQ",
    "hero_image": "https://images.luxuryescapes.com/7hxrymlv9hvee63avkx",
    "image_two": "https://images.luxuryescapes.com/u7c8cdmh34tnme2be65k",
    "image_three": "https://images.luxuryescapes.com/pkx1t33p9s8e2yfj40b",
    "vendor_name": "Outrigger Mauritius Beach Resort",
    "title": "Tropical Outrigger Escape with Exclusive Club Access",
    "description": "Escape to a place where the Indian Ocean laps pristine white sands and it’s just as easy to find an exciting adventure as it is a tranquil spot to unwind: welcome to Outrigger Mauritius Resort & Spa. VIP treatment awaits with access to the exclusive Plantation Club which includes a nightly free-flow cocktail hour, daily afternoon tea and all-day soft drinks and snacks. Enjoy daily indulgent à la carte breakfast with sparkling wine at the Plantation Club or head to Mercado Market Dining for an international buffet feast. Your escape also includes nightly dinner across three resort restaurants from three-course à la carte at the beachfront Edgewater to a full buffet at Mercado, one beer or wine per person, 25% off food, beverages and spa treatments and AU$100 cashback per person when booking return flights with Air Mauritius via Luxury Escapes (see 'Fine Print' for details).",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Savanne District",
    "offer_geo_area_level_2": "",
    "location_heading": "Bel Ombre",
    "location_subheading": "Mauritius",
    "location_description": "Outrigger Mauritius Resort & Spa - 2019",
    "offer_address": "Allee Des Cocotiers Bel Ombre",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 553.0,
    "value": 1299.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DK92sYAD",
    "hero_image": "https://images.luxuryescapes.com/pjostk2ndf0ohdykoedemg",
    "image_two": "https://images.luxuryescapes.com/qxg07t1p0qy0u7nd7e94",
    "image_three": "https://images.luxuryescapes.com/pwf1c2qaemtyuau6c6r",
    "vendor_name": "Sofitel SO Mauritius",
    "title": "Secluded Mauritius Beachfront Suites with Daily Breakfast & Nightly Dinner",
    "description": "Tucked away on Mauritius' untamed southern coast, this haven of tranquility beckons, with Kenzo Takada's visionary design melding French sophistication and island soul. Pockets of paradise await at SO Sofitel Mauritius, where private beaches whisper serenity to the rhythm of the waves.\n\nSavour local flavours at the beachfront La Plage, or graze on international favourites at Le Flamboyant, perched by the glistening infinity pool.\n\nAwaken to gentle kisses of tropical sunshine before exploring nearby treasures. Trek Le Morne Brabant's storied slopes, or wander Bel Ombre Nature Reserve, just moments away. Return to indulge in bespoke rituals at SO Spa, or simply float in the panga-knife-shaped pool, surrounded by swaying palms. Here, 'lavi ene lakaz' (life is home) takes on a whole new meaning.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Savanne",
    "offer_geo_area_level_2": "Bel Ombre",
    "location_heading": "Bel Ombre",
    "location_subheading": "Mauritius",
    "location_description": "SO Sofitel Mauritius",
    "offer_address": "Royal Road, Beau Champs, Bel Ombre 61008, Mauritius",
    "percentage_discount": 66.0,
    "min_duration": 4,
    "max_duration": 26,
    "price": 1089.0,
    "value": 3177.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP6aYAF",
    "hero_image": "https://images.luxuryescapes.com/sdbfe7bwsjwt9p1wxfz",
    "image_two": "https://images.luxuryescapes.com/4gm86sqeuoolfqf83r7m",
    "image_three": "https://images.luxuryescapes.com/gmw1zvb7oisxr69bbd5n",
    "vendor_name": "Sofitel SO Mauritius",
    "title": "Boutique Mauritius Eco-Friendly Suites & Villas on South Coast with Beachfront Pool & Butler Service",
    "description": "Dive into paradise at this eco-chic retreat, where island charm meets French luxury in a relaxed beachfront setting. Exclusive suites and villas, designed by renowned Thai architect Lek Bunnag and Japanese fashion designer Kenzo Takada, blend gracefully into the natural environment, creating patches of peace within paradise. Splash around in the pool shaped like a panga knife, unwind with a nourshing treatment at SO Spa, or savour culinary delights at the French-inspired Le Flamboyant or oceanfront La Plage. \n\nPerched on Mauritius' wild south coast, adventure awaits just outside your door. Explore Fréderica Nature Reserve, tackle hiking trails at Le Morne Brabant or discover La Vanille Mascarene Reserve. Relish every opportunity knowing that SO Sofitel Mauritius is doing what it can to protect the local environment, including installing a water chiller plant and LED lighting, managing plastic and food waste and supporting local artisans and suppliers.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Savanne",
    "offer_geo_area_level_2": "Bel Ombre",
    "location_heading": "Bel Ombre",
    "location_subheading": "Mauritius",
    "location_description": "SO Sofitel Mauritius",
    "offer_address": "Royal Road, Beau Champs, Bel Ombre 61008, Mauritius",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 260.0,
    "value": 260.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004SYiAAAW",
    "hero_image": "https://images.luxuryescapes.com/rwlyooy26kjodlidgioe",
    "image_two": "https://images.luxuryescapes.com/q0j9fulj6re4dkqo4ge",
    "image_three": "https://images.luxuryescapes.com/21jybd2ck8x9ohhng4t",
    "vendor_name": "Outrigger Mauritius Beach Resort",
    "title": "Mauritius Outrigger Escape with Five Restaurants & Bars & Private Beachfront Overlooking the Indian Ocean",
    "description": "Escape to a place where the Indian Ocean laps pristine white sands and it’s just as easy to find an exciting adventure as it is a tranquil spot to unwind. Outrigger Mauritius Beach Resort invites guests to relax at the hands of the high-end service the brand is renowned for and be whisked away to a world of refined beachfront luxury that’s just as perfect for honeymooning couples as it is for families.\n\nLocated on the island’s south coast, in the upscale beach village of Bel Ombre, the resort offers guests a tranquil stretch of private beachfront with powder-white sand and azure ocean, perfect for swimming. Make the most of watersports, five pools, exceptional dining options, and the fun-filled Coral Kids' Club. Those looking for R&R can head to Navasana Spa, where an invigorating hammam and soothing Mauritian massages await. Dine on delectable fresh seafood, take a swing at picturesque golf courses and make the most of the incredible nature on your doorstep with forest hiking, world-class diving and snorkelling.",
    "offer_country_name": "Mauritius",
    "offer_country_code_alpha_2": "MU",
    "offer_geo_area_level_1": "Savanne",
    "offer_geo_area_level_2": "Bel Ombre",
    "location_heading": "Bel Ombre",
    "location_subheading": "Mauritius",
    "location_description": "Outrigger Mauritius Beach Resort",
    "offer_address": "Allee des Cocotiers, Bel Ombre, Mauritius",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 178.0,
    "value": 178.0
  }
]