[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004h8EAAAY",
    "hero_image": "https://images.luxuryescapes.com/cwik8miv3x53czx0zasz9",
    "image_two": "https://images.luxuryescapes.com/s2o8wjriua1rxjp75g",
    "image_three": "https://images.luxuryescapes.com/uxwub3okftacfnb2klt",
    "vendor_name": "The Picker's Hut at Invercarron",
    "title": "Tasmania Vineyard Cabin Escape just 40 Minutes from Hobart",
    "description": "If your idea of pure bliss is rolling hills covered in grapevines that change colour with the season, The Picker’s Hut at Invercarron - a luxury cabin dramatically perched above the Jordan Valley in southern Tasmania - eagerly awaits. It might feel worlds apart from real life, but this luxury countryside stay is just a 40-minute drive from Hobart's unmissable attractions. Enjoy exclusive use of the property so you can come and go as you wish.\n\nOnce built to house and train soldiers before World War II, this historic hut has found its new home on a working Merino sheep farm and vineyard, Invercarron, and still retains the original foundations and floorboards to honour the building's storied past. The interior boasts a full kitchen where you can prepare meals at your leisure, two spacious bedrooms and a bathroom with a deep bath overlooking the valley by day or the stars at night. The expansive outdoor deck is perfectly positioned to soak up some rays while creating a vantage point to spot the farmworkers herding sheep nearby. As the sun melts away, the stone fireplace begs for evenings spent with a glass of wine in hand playing a game of chess, or simply listening to the crackle of burning kindling.\n\nWith exceptional views of natural bushland set deep within Jordan Valley, the comforts of a luxury stay and the delights of Hobart within close reach, The Picker’s Hut at Invercarron makes a compelling case for leaving the city behind.\n\n**Your handpicked inclusions:**\n\n- Daily breakfast provisions including locally-sourced sourdough bread, eggs, milk, jams, cereals\n- Settle in for a night by the fire and enjoy a bottle of Invercarron wine\n- Enjoy a gourmet charcuterie board with locally sourced cheeses and cured meats\n- Learn about life on a working Merino sheep farm and vineyard with a private tour of the property\n- Guaranteed 12pm late checkout so you can make the most of your country escape\n\n**Want to make your stay extra special?** Choose the Gourmet Upgrade and enjoy a spectacular five-course farm-to-plate private dinner with paired wines for each delicious course.\n\n**This deal has NO peak surcharges**: Travel any time for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Broadmarsh",
    "location_heading": "Broadmarsh",
    "location_subheading": "Tasmania",
    "location_description": "The Picker's Hut",
    "offer_address": "1329 Elderslie Road, Broadmarsh 7030, Tasmania, Australia",
    "percentage_discount": 28.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 629.0,
    "value": 876.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQ4uzAAD",
    "hero_image": "https://images.luxuryescapes.com/tgd2til4f6ox0iqglqod",
    "image_two": "https://images.luxuryescapes.com/2i9a1u4sud2q50bnosw",
    "image_three": "https://images.luxuryescapes.com/a4wzs4vk0zpckwzgn93s",
    "vendor_name": "The Picker's Hut at Invercarron",
    "title": "Tasmania Luxury Cabin Retreat just 40 minutes from Hobart with 360 degree Vineyard & Farm Views",
    "description": "If your idea of pure bliss is lush, rolling hills covered in picturesque grapevines that change colour with the season, The Picker’s Hut - a private, luxury cabin dramatically perched above the Jordan Valley in southern Tasmania - eagerly awaits. It might feel worlds apart from real life, but this exclusive countryside retreat is just a 40-minute drive from Hobart's unmissable attractions. This historic hut sits on a working Merino sheep farm and vineyard, Invercarron, and still retains the original foundations and floorboards to honour the building's storied past.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Broadmarsh",
    "location_heading": "Broadmarsh",
    "location_subheading": "Tasmania",
    "location_description": "The Picker's Hut",
    "offer_address": "1329 Elderslie Road, Broadmarsh 7030, Tasmania, Australia",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 793.0,
    "value": 1166.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BTWiAAO",
    "hero_image": "https://images.luxuryescapes.com/y5qjmhvuuins75eix",
    "image_two": "https://images.luxuryescapes.com/g0p2dtiavqg83axk6dgs",
    "image_three": "https://images.luxuryescapes.com/3cqmdx25xsygpx9mmsh",
    "vendor_name": "The Picker's Hut at Invercarron",
    "title": "Tasmania Vineyard Cabin Retreat just 40 Minutes from Hobart with Welcome Wine & Distillery Tasting",
    "description": "If your idea of pure bliss is lush, rolling hills covered in picturesque grapevines that change colour with the season, The Picker’s Hut - a private, luxury cabin dramatically perched above the Jordan Valley in southern Tasmania - eagerly awaits. It might feel worlds apart from real life, but this exclusive countryside retreat is just a 40-minute drive from Hobart's unmissable attractions.\n\nOnce built to house and train soldiers before World War II, this historic hut now sits on working Merino sheep farm and vineyard, Invercarron, and still retains the original foundations and floorboards to honour the building's storied past. The interior boasts a full kitchen where you can prepare meals at your leisure, two spacious bedrooms and a bathroom with a deep bath overlooking the valley by day or the stars at night. The expansive outdoor deck is perfectly positioned to soak up some rays while creating a vantage point to spot the farmworkers gathering sheep nearby. As the sun melts away, the stone fireplace begs for evenings spent with a glass of wine in hand playing a game of chess, or simply listening to the crackle of burning kindling.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Broadmarsh",
    "location_heading": "Broadmarsh",
    "location_subheading": "Tasmania",
    "location_description": "The Picker's Hut",
    "offer_address": "1329 Elderslie Road, Broadmarsh 7030, Tasmania, Australia",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 1187.0,
    "value": 1736.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IRY1IAO",
    "hero_image": "https://images.luxuryescapes.com/9eoqy2t6kuui3jclp5",
    "image_two": "https://images.luxuryescapes.com/l9ho6wn4zjp9my0tiwr",
    "image_three": "https://images.luxuryescapes.com/eqimylhzeg2s4dsx8u5",
    "vendor_name": "The Picker's Hut at Invercarron",
    "title": "Tasmania Luxury Cabin Retreat for Four Guests Just 40 minutes from Hobart with Winery Tour & Tasting",
    "description": "If lush, rolling hills covered in picturesque grapevines that change colour seasonally are your idea of pure bliss, this gorgeous retreat eagerly awaits. Boasting a private luxury cabin dramatically perched above the Jordan Valley, this secluded escape in southern Tasmania is your perfect place to disconnect and cherish time with loved ones.\n\nThe historic hut sits on a working Merino sheep farm and vineyard, Invercarron, and still retains the original foundations and floorboards to honour the building's storied past. When you're not lounging on your expansive outdoor deck by the cosy firepit, make the most of the peaceful countryside location and explore nearby Derwent Valley or Coal River Valley. While you might feel worlds apart from reality, you're also only a 40-minute drive from Hobart's unmissable attractions.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Broadmarsh",
    "location_heading": "Broadmarsh",
    "location_subheading": "Tasmania",
    "location_description": "The Picker's Hut",
    "offer_address": "1329 Elderslie Road, Broadmarsh 7030, Tasmania, Australia",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 609.0,
    "value": 1038.0
  }
]