[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004hhgyAAA",
    "hero_image": "https://images.luxuryescapes.com/flscq36xim1evwuh4zg7r",
    "image_two": "https://images.luxuryescapes.com/qae03cnqzlpq6a3msa6",
    "image_three": "https://images.luxuryescapes.com/j2ebm1zwep2fq5n8lw4d",
    "vendor_name": "L'Abode Accommodation",
    "title": "Secluded Tamar Valley Coastal Escape with Private Beach",
    "description": "Surround yourself with the impossible beauty of Tasmania's Tamar Valley wine region with a stay at Stargazers Waterfront Luxury Cottage, a secluded waterfront hideaway with its own private pebble beach, where you can reconnect with nature and take a moment to disconnect from the world.\n\nPerfect for small families or groups seeking a revitalising retreat, this designer cottage is the perfect antidote to daily life with two bedrooms for up to four guests, a private cinema room and fully equipped kitchen. Sprawled across three acres of manicured land, this retreat invites you to unwind by the private pebble beachfront, roam freely through the lush onsite orchard - helping yourself to seasonal fruits along the way - and stargazing at the night skies - where you could spy the likes of Mars, Jupiter or Saturn - before returning to the superior comfort of your cottage.\n\nBeyond the walls of this coastal hideaway, the sensational sights of the world-renowned Tamar Valley region await, laden with award-winning wineries, coastal towns and astounding landscapes.\n\n**Your handpicked inclusions:**\n\n- Celebrate your stay with a bottle of local Tamar Valley wine\n- Be greeted by a welcome hamper of treats, including soft drinks, chips and popcorn\n- Hit the snooze button and enjoy 11am guaranteed late checkout\n\n**Want to make your stay extra special?** Choose the wine tour upgrade and enjoy a guided half-day Tamar Valley winery experience with return transfers, visits to up to five cellar doors with tastings and a gourmet cheese platter to share.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Clarence Point",
    "location_heading": "Clarence Point",
    "location_subheading": "Tasmania",
    "location_description": "Stargazers Waterfront Luxury Cottage",
    "offer_address": "Clarence Point TAS 7270",
    "percentage_discount": 31.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 319.0,
    "value": 461.0
  }
]