[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cqMcwQAE",
    "hero_image": "https://images.luxuryescapes.com/hqy5tcmxytc7tozbzwj",
    "image_two": "https://images.luxuryescapes.com/pue8wv0ntdcbnyw25icer",
    "image_three": "https://images.luxuryescapes.com/d43ecsjgxj08b5w9h8rl",
    "vendor_name": "Ayurvaid Kalmatia",
    "title": "A Relaxing Wellness Retreat in the Himalayas",
    "description": "Perched on a hilltop in Almora, Uttarakhand and surrounded by 14 acres of lush landscape, AM Hotel Kollection - AyurVAID: Kalmatia makes for a perfect getaway to relax and rejuvenate. The retreat features 10 private cottages, offering a private and exclusive experience. Purpose-built to deliver Ayurveda experiences, the retreat offers personalised treatments to each guest to detox, de-stress, and restore wellbeing. With its cozy private cottages, delicious and healthy food, peaceful mountain views and a serene ambiance, AyurVAID Kalmatia is a great way to escape the chaos of everyday life. Enjoy a two or three-night getaway and enjoy complimentary soul-enriching vegetarian breakfast, lunch and dinner along with a complimentary 45-minute treatment for up to two people.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Almora",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "AM Hotel Kollection - AyurVAID: Kalmatia",
    "offer_address": "Kalimat Estate, Kasar Devi Upper Binsar Road, Almora, Uttarakhand 263601, India",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 357.0,
    "value": 500.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EDKLoAAP",
    "hero_image": "https://images.luxuryescapes.com/xpbl895pxbo73942zckj",
    "image_two": "https://images.luxuryescapes.com/jtp0hmevieoi06sj27d",
    "image_three": "https://images.luxuryescapes.com/dk6ynhcl1t2osmlzf89u",
    "vendor_name": "Saraca Corbett",
    "title": "Corbett Villa Stay with Daily Breakfast, One Lunch/Dinner & a Moongazing Experience",
    "description": "Perched right on the fringes of Jim Corbett National Park, Lebua Corbett is a sprawling nine-acre paradise, perfect for a wild escape. Cradled within the verdant forests of Bhakrakot Valley in Uttarakhand, serenaded by the sounds of the jungle and lulled by a gentle forest breeze, Lebua Corbett is merely a two-hour drive from Pantnagar Airport (PGH), and easily accessible from Delhi (a five-hour drive). The luxe jungle retreat boasts a glimmering outdoor infinity pool, gorgeous villas with private patios and balconies, a plush restaurant, and a bar stirring up great delicacies and cocktails. Unwind in the serenity of the lush natural surroundings and indulge in bespoke forest experiences offered by the property - from bird-watching tours to thrilling wildlife safaris.\n\nFor any wildlife and nature enthusiast, exploring one of India’s oldest and largest national parks - Jim Corbett National Park (a 20-minute drive), is a thrilling delight as it is home to many exotic animals, including royal Bengal tigers and Asiatic elephants. Offering an ecologically sustainable haven in the middle of dense wilderness, Lebua Corbett makes for an unforgettable jungle escape.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ranikhet",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Lebua Corbett",
    "offer_address": "Bhakrakot, Mohaan, Corbett, Ramnagar, Uttarakhand 244715",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 249.0,
    "value": 365.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lh4GAAS",
    "hero_image": "https://images.luxuryescapes.com/asyur7btwh1cc0j7d0te",
    "image_two": "https://images.luxuryescapes.com/8scfe9xe0eugmztj7ewq",
    "image_three": "https://images.luxuryescapes.com/tslg8gkqvfqmznoz8lws",
    "vendor_name": "Amatra by the Ganges",
    "title": "BEST OF 2019: The Only High-End Resort on the Banks of the Ganges",
    "description": "If you’re looking to get away from the trappings of city life, a stay by the banks of the Ganges is just what the doctor ordered. A beautiful resort, Amatra by the Ganges also has the distinction of being the only luxury resort by the holy river. Enjoy a two or three-night stay featuring nightly three-course dinner, daily buffet breakfast, one nightly cocktail each, complimentary Wi-Fi and special discounts on food, beverages and wellness services.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Haridwar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Amatra by the Ganges OLD",
    "offer_address": "Near Rajaji National Park Shyampur Noamabad, Haridwar, Uttarakhand 249408, India",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 142.0,
    "value": 288.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzelrAAB",
    "hero_image": "https://images.luxuryescapes.com/1oaqsftcnqovxv0cfeud",
    "image_two": "https://images.luxuryescapes.com/502svrdg3h4f34w43bdb",
    "image_three": "https://images.luxuryescapes.com/2bkw0fk9clxbt33g1lp",
    "vendor_name": "Tree of Life Grand Oak Manor, Binsar",
    "title": "Tranquil Uttarakhand Manor Escape near Binsar National Park with Daily Breakfast, One Lunch & Daily High Tea",
    "description": "Enveloped deep within the famous Binsar Wildlife Sanctuary, Tree of Life Grand Oak Manor is a colonial estate overlooking the gorgeous Kumaoni Himalayas of Uttarakhand. An hour’s drive from Almora and a 4.5-hour drive from Pantnagar Airport (PGH), this 40-acre hilltop retreat is a rejuvenating escape, easily reachable via a 10-hour drive from New Delhi. Over 150 years old, the colonial manor served as the private residence for the then-British Commissioner of Kumaon, General Sir Henry Ramsay. Now transformed into an inviting hotel, the hotel boasts a glorious history plus epic views of the neighbouring snow-capped peaks.\n\nBe prepared to experience nature and luxury at its finest as you regale in the old-world charm of your escape. Go for sojourns in the forest or venture out on a thrilling trek, savour delicious Pahaari cuisine, or head out with your camera and binoculars for a delightful bird-watching session - the choices are plenty. Also, visit Binsar Zero Point (a three-minute drive) and witness the magnanimous peaks of Kedarnath, Chaukhamba, Shivling, Trisul, Nanda Devi, Nanda Kot and Panchachuli in all their glory.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Bageshwar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Tree of Life Grand Oak Manor, Binsar",
    "offer_address": "Jhandi Dhar - Binsar Sanctuary Gate Rd, Regariya, Uttarakhand 263628",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 182.0,
    "value": 257.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004TAIvAAO",
    "hero_image": "https://images.luxuryescapes.com/o1qcsfafta17g18zprwj",
    "image_two": "https://images.luxuryescapes.com/wwrwgxn8p4j1g9jm3yl",
    "image_three": "https://images.luxuryescapes.com/dzkvmjpldaxpdci882el",
    "vendor_name": "Justa Mukteshwar Retreat & Spa",
    "title": "Tranquil Uttarakhand Spa Retreat Overlooking the Himalayas with Decadent Dining",
    "description": "Bathe in the glory of the exquisite Himalayas with a stay at jüSTa Mukteshwar Retreat & Spa, Uttarakhand, a scenic three-hour drive from Pantnagar Airport and an 8.5-hour drive from Delhi. Nestled within the tall deodars, 7,500 feet above sea level, the resort offers unparalleled views of the Himalayas, including the majestic Nanda Devi peak. jüSTa Mukteshwar Retreat & Spa orchestrates a unique experience, with state-of-the-art accommodation, scenic views, warm hospitality, decadent dining options and a gorgeous spa offering rejuvenating treatments with pure botanicals and marine elements. So, get away from the city lights, breathe in the crisp mountain air and rejuvenate in the lap of nature at this five-star hilltop hideout.\n\n**Your handpicked inclusions:**\n\n- Be welcomed with refreshing non-alcoholic drinks on arrival\n- Begin every day with breakfast at Coffee Shop\n- Enjoy one three-course or buffet dinner at Sabor, once per stay\n- Unwind every evening with tea, coffee and cookies on the dreamy open-air deck\n- Make the most of your stay with a 20% discount on drinks, dining and spa\n- Stay connected with complimentary Wi-Fi\n- Up to two children (aged six years and under) stay free on existing bedding with all package inclusions\n\n**Himalayan View Upgrade:** Wake up to breathtaking views of the majestic Himalayas from your private balcony when you upgrade.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Nainital",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "jüSTa Mukteshwar Retreat & Spa",
    "offer_address": "Village Saliyakot, Tehsil Dhari, Mukteshwar, Uttarakhand 263132",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 160.0,
    "value": 386.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdWM6AAN",
    "hero_image": "https://images.luxuryescapes.com/evmw344jscnlse8pv1jb",
    "image_two": "https://images.luxuryescapes.com/2uiocyyer42vy0tosf5n",
    "image_three": "https://images.luxuryescapes.com/n5fgq9ws7apgei0vlh56",
    "vendor_name": "The Oasis Mussoorie, a member of Radisson Individuals",
    "title": "Marvellous Mussoorie Hilltop Escape with Daily Breakfast, One Lunch/Dinner & Two Kids Stay Free",
    "description": "Perched on a tranquil hillside, The Oasis Mussoorie, a Member of Radisson Individuals is a charming property lying in the heart of the ‘Queen of the Hills’. A two-hour drive from Jolly Grant Airport - Dehradun (DED), the boutique hotel is garlanded by beauteous views of the Southern Himalayas. A six-hour drive from New Delhi, the hotel redefines mountain luxury with its 53 warmly decorated rooms and suites, the multi-cuisine Rosemary restaurant doling out lip-smacking delicacies, and the chic All Seasons Bar Café. For those feeling sporty, there is an Activity Zone with a pool table and air hockey table to fan the friendly competitive spirit. Ideal for both families and couples, the hotel promises an idyllic hill station escape and curates a memorable experience.\n\nLying in the heart of Mussoorie, the hotel lies close to all the popular tourist attractions and is the perfect base for discovering the vibrant town’s colonial past. Visit the manicured Company Garden (a 12-minute drive), indulge in a thrilling cable car ride at Gun Hill (a 20-minute drive) or hike up George Everest House (a 20-minute drive). For book lovers, a visit to the Cambridge Book Depot (a 12-minute drive) is a must as the legendary writer, Ruskin Bond, keeps frequenting it.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Mussoorie",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "The Oasis Mussoorie, a Member of Radisson Individuals",
    "offer_address": "Convent Road, Near Library Chowk, Mussoorie, Uttarakhand  248179, India",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 256.0,
    "value": 457.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005Ju6JAAS",
    "hero_image": "https://images.luxuryescapes.com/06kpfjzuynjulmv6ik3g",
    "image_two": "https://images.luxuryescapes.com/6zbte5q36bxstnny9vq",
    "image_three": "https://images.luxuryescapes.com/8u85z0dchewhgaz9ig97",
    "vendor_name": "Tree of Life Grand Oak Manor, Binsar",
    "title": "Heritage Uttarakhand Manor Stay in Binsar National Park with Daily Breakfast",
    "description": "Enjoy a rejuvenating stay at Tree of Life Grand Oak Manor, Binsar, a colonial estate nestled in the Kumaoni hills of Uttarakhand, hidden deep within Binsar Wildlife Sanctuary. Just 25km from Almora and less than 10 hours from Delhi, this 40-acre hilltop retreat is where you can rediscover the joy of being in nature. Built in 1856 as the private residence for the then British Commissioner of Kumaon, General Sir Henry Ramsay, this stunning structure is now a hotel offering visitors a rejuvenating ambience, elegant hospitality and a glimpse into its historic legacy.\n\nLet your quest for serenity end at Tree of Life Grand Oak Manor, Binsar, where you and your loved ones can experience nature and luxury at its best, as you wake up to the breathtaking views and the calming silence of the Himalayan snowcapped peaks and Kumaoni hills.\n\n**Your handpicked inclusions:**\n\n- Begin your stay with a welcome drink on arrival\n- Enjoy daily set-menu breakfast at Acorn Restaurant\n- Relish one set-menu dinner at Acorn Restaurant, once per stay\n- Make the most of your stay with a 15% discount on soft drinks and dining\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** One child (aged six years and under) stays free in existing bedding with all package inclusions.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Bageshwar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Tree of Life Grand Oak Manor, Binsar",
    "offer_address": "Jhandi Dhar - Binsar Sanctuary Gate Rd, Regariya, Uttarakhand 263628",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 143.0,
    "value": 226.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzgnfAAB",
    "hero_image": "https://images.luxuryescapes.com/xt124zyxgdmlqqq3uyog",
    "image_two": "https://images.luxuryescapes.com/hktkd25yefo4soilxe2",
    "image_three": "https://images.luxuryescapes.com/0nmtar4zdxm8c580ex4m",
    "vendor_name": "Jim's Jungle Retreat Corbett",
    "title": "Jungle-Themed Corbett Escape with Daily Breakfast, One Lunch & Forest Experiences",
    "description": "Immerse yourself in the lap of nature at the exquisite Jim's Jungle Retreat Corbett, tucked away in the verdant edges of the iconic Jim Corbett National Park. A short journey from Pantnagar Airport or a scenic drive from New Delhi, this eco-luxe sanctuary echoes the charm of colonial bungalows and forest lodges of yesteryears. Revel in the rustic elegance of thatched cottages, indulge in the azure outdoor pool, and savour Kumaoni and international cuisine at two on-site dining venues. This luxurious retreat offers an elevated wildlife experience, from thrilling jeep safaris to serene bird-watching tours, guided by expert naturalists.\n\nRetreat to your private balcony with a book, serenaded by the forest's symphony, and discover the thrill of spotting Royal Bengal tigers and Asiatic elephants in their natural habitat. Jim's Jungle Retreat Corbett is the epitome of forest luxury, an unforgettable escape for the discerning wildlife enthusiast.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ramnagar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Jim's Jungle Retreat",
    "offer_address": "Village Dhela, Ramnagar, Corbett National Park, Ramnagar",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 314.0,
    "value": 666.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FisQ5AAJ",
    "hero_image": "https://images.luxuryescapes.com/og4h5bme6ltbxjuc7ae",
    "image_two": "https://images.luxuryescapes.com/34l81k41ehsjiyhgsim",
    "image_three": "https://images.luxuryescapes.com/e4nv64vbmpq23ev4anq",
    "vendor_name": "Jim's Jungle Retreat Corbett",
    "title": "Award-Winning Corbett Jungle Escape with Daily Breakfast & Nature Experiences",
    "description": "Immerse yourself in the lap of nature at the exquisite Jim's Jungle Retreat, tucked away in the verdant edges of the iconic Jim Corbett National Park. This eco-luxe sanctuary is nestled in a restored native forest and echoes the charm of colonial bungalows and forest lodges of yesteryears. Revel in the rustic elegance of thatched cottages, take a dip in the azure outdoor pool and savour Kumaoni and international cuisine at two onsite dining venues - Gol Ghar and Carpet Sahib's Cafe. This luxurious jungle abode offers an elevated wildlife experience, from thrilling jeep safaris to serene bird-watching tours, guided by expert naturalists.\n\nRetreat to your private balcony with a book, serenaded by the forest's symphony, and discover the thrill of spotting Royal Bengal tigers and Asiatic elephants in their natural habitat. Jim's Jungle Retreat is the epitome of forest luxury, where the call to “seek the tiger, find the jungle” is echoed throughout, making it an unforgettable escape for the discerning wildlife enthusiast. In fact, Conde Nast Traveller highlighted Jim's Jungle Retreat in a list of the Top 5 Favourite Safari Lodges in India between December 2022 and January 2023.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ramnagar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Jim's Jungle Retreat",
    "offer_address": "Village Dhela, Ramnagar, Corbett National Park, Ramnagar",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 372.0,
    "value": 766.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cKBBkQAO",
    "hero_image": "https://images.luxuryescapes.com/bybyaqpmggnvq2c2cmg",
    "image_two": "https://images.luxuryescapes.com/iy0mfh1udil9gqu7opoi",
    "image_three": "https://images.luxuryescapes.com/f8b48xr7vwxt7u3l5y",
    "vendor_name": "Amatra by the Ganges",
    "title": "The Only High-End Resort on the Banks of the Ganges",
    "description": "If you’re looking to get away from the trappings of city life, a stay by the banks of the Ganges is just what the doctor ordered. A beautiful resort, Amatra by the Ganges also has the distinction of being the only luxury resort by the holy river. Enjoy a two or three-night stay featuring nightly three-course dinners, daily buffet breakfast, one nightly cocktail each, complimentary Wi-Fi and special discounts on food, beverages and wellness services.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Haridwar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Amatra by the Ganges OLD",
    "offer_address": "Near Rajaji National Park Shyampur Noamabad, Haridwar, Uttarakhand 249408, India",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 145.0,
    "value": 293.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2uKkQAJ",
    "hero_image": "https://images.luxuryescapes.com/s9usueboldg0zli9zw8a",
    "image_two": "https://images.luxuryescapes.com/zjwm70jeej9tlpnfdndw",
    "image_three": "https://images.luxuryescapes.com/ygkjmzqywxiwpbz9vehm",
    "vendor_name": "Jim's Jungle Retreat Corbett",
    "title": "Safari Escape with Gourmet Inclusions and High Tea Every Evening",
    "description": "Get closer to nature with this luxurious Escapes Club at Jim’s Jungle Retreat, located in the heart of the Corbett Tiger Reserve. Relax amid spectacular scenery and indulge with daily breakfast, dinner each night, one cocktail per person every evening, one 30-minute spa treatment per person, high tea every evening, outdoor activities and a 15% discount on food and drinks.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ramnagar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Jim's Jungle Retreat",
    "offer_address": "Village Dhela, Ramnagar, Corbett National Park, Ramnagar",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 277.0,
    "value": 714.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004iAG7AAM",
    "hero_image": "https://images.luxuryescapes.com/jz0n7h98xi7gv8codnd",
    "image_two": "https://images.luxuryescapes.com/a868lf3e9ln7c15pvw5br",
    "image_three": "https://images.luxuryescapes.com/9hqw6bygjs36dhbo4dj",
    "vendor_name": "AM Kollection Sukoon",
    "title": "Idyllic Uttarakhand Mountain Hideaway with Decadent Dining & Himalaya Views",
    "description": "Nestled in the shadow of the majestic Himalayas, hidden within the lush forests of Bhatrojkhan (just an eight-hour drive from Delhi), Sukoon, Bhatrojkhan - AM Hotel Kollection is an idyllic escape amid nature. This mountain hideaway offers unparalleled views of the Kumaon forests, Himalayas and surrounding meadows and valleys. Put the city lights in your rearview mirror as you head to this charming mountaintop resort, home to rustic mud cottages with modern luxuries. Relax completely as you shake off all your city stress and savour Pahadi cuisine prepared fresh from locally sourced ingredients at the onsite restaurant.\n\n**Your handpicked inclusions:**\n\n- Be welcomed with refreshing drinks on arrival (one drink per person)\n- Fuel up every day with set-menu breakfast at the open-air cafeteria\n- Enjoy a three-course dinner for two at the open-air cafeteria, once per stay\n- Spend an evening with tea, coffee and snacks at the open-air cafeteria or in your room, once per stay\n- Make the most of your stay with a 10% discount on drinks and dining\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** One child (aged eight years and under) stays free in existing bedding with breakfast included.\n\n**Longer stay bonus:** Stay four nights or more and enjoy two three-course dinners for two per stay, daily evening tea, coffee and snacks, plus a guided trek in the deodar forest with refreshments.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ranikhet",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Sukoon, Bhatrojkhan - AM Hotel Kollection",
    "offer_address": "Village Dharar, Post Office Pant Gaon, Bhatrojkhan, near Ranikhet, Uttarakhand 263646",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 143.0,
    "value": 293.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C2SeqAAF",
    "hero_image": "https://images.luxuryescapes.com/xqzn1ijjyspkxqlqlrqk",
    "image_two": "https://images.luxuryescapes.com/h4jruci144pdin625kpo",
    "image_three": "https://images.luxuryescapes.com/e5anwd5t7lohpv3pan8",
    "vendor_name": "Tarangi Jim Corbett Resort and Spa",
    "title": "Tranquil Uttarakhand Riverside Retreat near Jim Corbett National Park with Daily Breakfast & One Dinner",
    "description": "On the banks of the River Kosi in Uttarakhand is where you will find Tarangi Jim Corbett Resort and Spa, offering breathtaking views of the Shivalik foothills and perfectly set within close proximity to Jim Corbett National Park. Get in touch with nature at this riverside hideaway just a five-hour drive from Delhi and prepare to be enveloped in tranquilly. Relax with a treatment at the spa, then, head to Jim Corbett National Park,  just a short drive away to admire rare animals in their natural habitat. After hours of exploring, a restful night's sleep is guaranteed in the opulent rooms located in two gorgeous wings of the resort - Sarangi and Tarangi, that may offer views of the glistening pool, impeccable grounds or gurgling river, and each wing boasts it's own individual restaurant where you can satisfy your appetite with delectable Kumaoni dishes including chainsoo, dubaka, and international cuisine.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ramnagar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Tarangi Jim Corbett Resort and Spa",
    "offer_address": "Tarangi Jim Corbett Resort and Spa Ramnagar, Dhikuli, Dhikuli, Uttarakhand 244715 India",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 237.0,
    "value": 408.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcBTcAAN",
    "hero_image": "https://images.luxuryescapes.com/1qybnfmx24yyelrbnja",
    "image_two": "https://images.luxuryescapes.com/xznr1z3bxdffiz72v2z9",
    "image_three": "https://images.luxuryescapes.com/65t1vdp1b43ac2ngn4loe",
    "vendor_name": "Lemon Tree Premier, Corbett",
    "title": "Upscale Corbett Riverside Escape with Daily Breakfast, One Lunch/Dinner & One High Tea",
    "description": "Sitting pretty on the banks of River Kosi in Uttarakhand's Corbett, Lemon Tree Premier, Corbett could easily become your next jungle escape. Nestled in the lap of lush wilderness and merely a 10-minute drive from the Dhikala and Dhangarhi safari zones of Jim Corbett National Park, this upscale retreat offers tastefully designed rooms, lip-smacking meals and gorgeous views. Jump into the sparkling pool with a jacuzzi for an extravagant experience. Taste mouth-watering delicacies at Citrus Café, sip on unique cocktails at Slounge Bar, or grab a snack or two at the beautiful Pug Lounge. \n\nElevate your Corbett escape with a safari or two at India's oldest national park, and try your luck spotting the big cats, elephants and more. Or, discover the region's other popular towns of Mukteshwar, Ranikhet and more. Or, simply unwind at this comfortable retreat. The choice is yours.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ramnagar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Lemon Tree Premier, Corbett",
    "offer_address": "Zero Milestone, Mohaan- Tehsil Ramnagar, Jim Corbett National Park, Uttrakhand, Ramnagar Uttrakhand 244715, India",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 214.0,
    "value": 565.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zRu5AAE",
    "hero_image": "https://images.luxuryescapes.com/oivu51h07m7n6k2dsw9",
    "image_two": "https://images.luxuryescapes.com/bz49q7zo8kbfx5tnaq53v",
    "image_three": "https://images.luxuryescapes.com/diwbzyl085vsw1kvn15o",
    "vendor_name": "Saraca Corbett",
    "title": "Corbett Jungle Escape with Daily Dining & Adventurous Activities",
    "description": "Answer the call of the wild at Lebua Corbett, a luxurious jungle retreat perched on the edge of India's oldest national park, Jim Corbett in Uttarakhand. A five-hour drive from Delhi, Lebua Corbett is home to just 44 villas and suites scattered across nine acres of lush landscape.\n\nYour stay includes a confirmed upgrade to the next best room category,  daily breakfast, your choice of daily three-course lunch or dinner and an organic immunity booster refresher on arrival. Plus, enjoy exciting activities such as a nature walk with a naturalist guide, an exclusive moongazing session, once during the stay, a 15-minute horse riding session per person, once during the stay, daily 30-minute morning meditation and yoga session, and complimentary usage of bicycles inside the resort premises. You'll also benefit from flexible 24/7 check-in and checkout and complimentary Wi-Fi.\n\n**Travelling with family?** One child (aged seven years and under) stays free with all inclusions, sleeping in existing bedding.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ranikhet",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Lebua Corbett",
    "offer_address": "Bhakrakot, Mohaan, Corbett, Ramnagar, Uttarakhand 244715",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 169.0,
    "value": 313.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004PxFZAA0",
    "hero_image": "https://images.luxuryescapes.com/yahzo5pm2qvudssi6f5",
    "image_two": "https://images.luxuryescapes.com/mmnwmjxauvkqqyvtbz1nq",
    "image_three": "https://images.luxuryescapes.com/v74ej61ffgt499lwg09r",
    "vendor_name": "Mary Budden Estate",
    "title": "Tranquil Uttarakhand Mountain Estate Stay with All-Inclusive Dining & Morning Trek",
    "description": "Answer the call of the mountains at Mary Budden Estate, a 120-year-old property nestled in the secluded greenery of Binsar Wildlife Sanctuary in Uttarakhand. At almost 8,000 feet above sea level, this magical place gets you one step closer to the majestic Himalayas, where you can go completely off the grid and reconnect with nature in your newfound forest home. Spread over five acres, this relaxing escape promises elegant luxury, alluring outdoor spaces and rustic cottages for you and your loved ones.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Bageshwar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Mary Budden Estate",
    "offer_address": "Binsar Wildlife Sanctuary, Uttarakhand 263601, India",
    "percentage_discount": 21.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 495.0,
    "value": 623.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Cy8VIAAZ",
    "hero_image": "https://images.luxuryescapes.com/adoqsfmzfjyshw8tspvc",
    "image_two": "https://images.luxuryescapes.com/dznrloq78bbeyf5mfc3y",
    "image_three": "https://images.luxuryescapes.com/j80hbooivs39g9j9ue9g",
    "vendor_name": "Justa Rasa Retreat & Spa Rishikesh",
    "title": "Rishikesh Riverfront Escape with Daily Breakfast, One Lunch/Dinner & Daily Drinks",
    "description": "Nestled in the foothills of the Garhwal Himalayas with the mighty Ganges meandering by its banks, the boutique Justa Rasa Retreat & Spa Rishikesh offers a serene escape - away from the chaos of the cities. The luxe property, true to its name - ‘Rasa', curates an aesthetic, artistic and luxurious experience with top-notch amenities, an outdoor pool, a spa offering relaxing therapies, and a contemporary restaurant doling out lip-smacking local as well global delicacies. A scenic 60-minute drive from Jolly Grant Airport - Dehradun (DED) and a five-hour drive from New Delhi, this riverfront paradise is an idyllic weekend escape. \n\nThe gateway to several pilgrimage sites, Rishikesh is filled with many historical, cultural and spiritual attractions. Witness the majestic beauty of the iron suspension bridges of Lakshman Jhula and Ram Jhula or visit the famous The Beatles Ashram and marvel over its vivid graffiti walls. Moreover, for those seeking a dose of adrenaline, Rishikesh offers plenty of thrilling sports such as white-water river rafting, bungee jumping and more to make your escape memorable.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Lansdowne",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Justa Rasa Retreat & Spa Rishikesh",
    "offer_address": "Justa Rasa Resorts, Mohan Chatti Rishikesh Uttarakhand 249304 India",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 207.0,
    "value": 315.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000OeZlrAAF",
    "hero_image": "https://images.luxuryescapes.com/wotvvj321gzemp3jgrjd",
    "image_two": "https://images.luxuryescapes.com/er5vzhuialxat6cdacvu",
    "image_three": "https://images.luxuryescapes.com/wuehihynefo6luxrsreb",
    "vendor_name": "Paatlidun Safari Lodge",
    "title": "Luxury Nature Escape in the Heart of Jim Corbett National Park",
    "description": "Get closer to nature with this luxurious Escapes Club stay at Paatlidun Safari Lodge. Set on the edge of the Corbett Tiger Reserve, located in the world-famous Jim Corbett National Park, you’ll have a unique opportunity to view these majestic animals (and many more!) up close. Included in your stay are daily a la carte or buffet breakfasts, a decadent seven-course Bush Dinner for two, daily cocktails, unique nature experiences and more. Plus, two kids aged seven and under stay free with breakfast.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ranikhet",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Paatlidun Safari Lodge",
    "offer_address": "Jim Corbett National Park, Mohan, Uttarakhand 244715, India",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 352.0,
    "value": 1051.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005K9P6AAK",
    "hero_image": "https://images.luxuryescapes.com/ilmm8jzv3r7cn4jtxzln",
    "image_two": "https://images.luxuryescapes.com/9a1hxot9t2pkjll7ezxg",
    "image_three": "https://images.luxuryescapes.com/nb8nytkpkuy446oljsgm",
    "vendor_name": "Tree of Life Vanvilas Riveredge, Corbett National Park",
    "title": "Grand Re-Opening: Uttarakhand Riverfront Hideaway near Jim Corbett National Park with Daily Breakfast",
    "description": "Imagine this: picturesque wildlife setting, a river snaking its way past your secluded hideaway, acres of lush greenery and serene silence only broken by the call of wild animals and birds. Experience all this and so much more at the newly re-opened Tree of Life Vanvilas Riveredge, Corbett National Park. Nestled within the Kumaon hills, just eight kilometres from India's first national park - Jim Corbett National Park - and five hours from Delhi, this refurbished riverfront retreat invites you to rediscover the joy of being in nature with just six boutique rooms onsite.\n\nIdeal for wildlife lovers and families looking for a secluded escape, Tree of Life Vanvilas Riveredge, Corbett National Park, puts you right in the heart of the action, where you can succumb to the serene silence of the Himalayan snowcapped peaks and experience a rare and up-close encounter with nature at its most spectacular in the nearby tiger reserve.\n\n**Your handpicked inclusions:**\n\n- Begin your tranquil escape with a non-alcoholic welcome drink each on arrival\n- Every morning, enjoy a set-menu breakfast at The Wild Grass Café\n- Enjoy one set-menu dinner for two at The Wild Grass Café, once per stay\n- Make the most of your stay with a 15% discount on soft drinks and dining\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** One child (under 7) stays free in existing bedding with all package inclusions.\n\n**Longer Stay Bonus:** Stay 4+ nights and enjoy two set-menu dinners for two during your stay.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ramnagar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Tree of Life Vanvilas Riveredge, Corbett National Park",
    "offer_address": "Kyari Village, near River, Ramnagar, Uttarakhand 244715, India",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 115.0,
    "value": 248.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005Jxv0AAC",
    "hero_image": "https://images.luxuryescapes.com/440abcp2gmi2sp30w3w",
    "image_two": "https://images.luxuryescapes.com/dreip27m9il5n76960fe",
    "image_three": "https://images.luxuryescapes.com/jtu1hxg32dmxi03se75e",
    "vendor_name": "Rosefinch Sarovar Portico, Bhimtal",
    "title": "Tranquil Uttarakhand Lakefront Stay with Decadent Dining",
    "description": "Soak in the lakefront tranquility of Bhimtal at Rosefinch Sarovar Portico, an utterly gorgeous hideaway just 6.5 hours from Delhi. Nestled in the beautiful Kumaoni hills of Uttarakhand and overlooking the serene Bhimtal Lake, this hilly retreat is just what you need right now.\n\nConveniently located on the Haldwani-Nainital highway and just 22km from Nainital, Rosefinch Sarovar Portico lets you experience nature in all its glory. Breathe in the fresh mountain air, let the lush greenery calm your mind and simply embrace serenity at this idyllic resort. Reflecting the local architectural styles, the resort ensures that very little comes between you and Mother Nature. Wake up to uninterrupted views of Bhimtal Lake, savour delicious meals and create long-lasting memories with your loved ones.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Nainital",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Rosefinch Sarovar Portico OLD",
    "offer_address": "June Estate Rd, Bhimtal, Uttarakhand 263136",
    "percentage_discount": 22.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 151.0,
    "value": 194.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzhE2AAJ",
    "hero_image": "https://images.luxuryescapes.com/hys157jle8b7n72g8n8",
    "image_two": "https://images.luxuryescapes.com/u9vstbch6ooc0690lds",
    "image_three": "https://images.luxuryescapes.com/yhvwj75afh3t265z30yn",
    "vendor_name": "Vatsyayana Resorts",
    "title": "Himalayan Boutique Stay near Jim Corbett with Daily Breakfast, One Lunch/Dinner & High Tea",
    "description": "Enveloped by panoramic views of the snowclad Shivalik Hills, Vatsyayana Resorts, managed by Clio Hotels, is a boutique retreat inspired by the ancient Indian classics, cradled in the lap of the Himalayas. A 1.5-hour drive from Jim Corbett National Park and a four-hour drive from Pantnagar Airport, the hotel reflects the charms of the world-famous Khajuraho Temple with intricate sculptures and paintings. Blending luxury and comfort with a touch of the sensual to appease all aesthetic senses, the uniquely designed hotel is ideal for couples looking for a romantic escape.\n\nChoose from aesthetically adorned rooms to exclusively couple-friendly rooms, feast on sumptuous regional and global delicacies, or lounge by the gleaming outdoor pool and watch epic Himalayan sunsets. If you're looking to rejuvenate, head to the spa while adventure-seekers can embark on treks to a haunted house, relax with a riverside picnic and explore the quaint town of Manila. If you wish to explore more, visit the sacred Manila Devi Temple (a 30-minute drive) or go for a wildlife safari at Jim Corbett National Park.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ranikhet",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Vatsyayana Resorts",
    "offer_address": "Village Dudhodi, Tehsil Sult, Manila Range, Uttarakhand - 263661, India",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 256.0,
    "value": 557.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqS0dAAF",
    "hero_image": "https://images.luxuryescapes.com/cf548vgx372427pfzgrbj",
    "image_two": "https://images.luxuryescapes.com/ntxtdxvee5q0f4ji801r",
    "image_three": "https://images.luxuryescapes.com/jlaouard6q1b0ppmz1oq",
    "vendor_name": "Amritara the Avadh Badrinath",
    "title": "Tranquil Escape Near Badrinath Temple with Daily Breakfast, One Lunch or Dinner & Daily High Tea",
    "description": "Expect a confluence of spirituality and comfort at your next escape at Amritara The Avadh Badrinath. Set in the heart of one of India's holiest towns, this hotel is located just a three-minute drive from the famous Badrinath Temple and 500m from the helipad. Centrally located and easily accessible, Amritara The Avadh Badrinath is the ideal option for your pilgrimage and offers comfortable rooms with contemporary amenities and uninterrupted views of Neelkanth Parvat, Kuber and the tranquil Badrinath temple. \n\nSavour deliciously crafted meals at the 24-hour restaurant, or take advantage of shuttle services and VVIP darshan experiences for your soul-seeking journey.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Joshimath",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Amritara The Avadh Badrinath",
    "offer_address": "Plot No 834, Chamoli district, near Helipad Badrinath Uttarakhand 246422 India",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 172.0,
    "value": 385.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cII8GQAW",
    "hero_image": "https://images.luxuryescapes.com/ddcgk15umjoq0ixduuj",
    "image_two": "https://images.luxuryescapes.com/l814ewyob3vq87xkwn8i",
    "image_three": "https://images.luxuryescapes.com/wt9eu15sqjivsvxtjyfa",
    "vendor_name": "Namah Resort Corbett",
    "title": "Award-Winning Nature Escape in Dhikuli",
    "description": "Dreaming of a fantastic getaway close to nature? At Namah Resort Corbett, nature is everywhere around you. Enjoy a stay at this luxe boutique hotel located in Jim Corbett National Park and look out at stunning mountain views and lush greenery in every direction. Whether you’re a wildlife adventurer or content to spend your days by the pool, there’s something for everyone at Namah Resort. Enjoy a daily buffet breakfast, daily buffet or three-course lunch, daily buffet or three-course dinner, daily high tea, evening cocktail at Boond Bar and complimentary Wi-Fi.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Ramnagar",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Namah Resort Corbett",
    "offer_address": "Namah Resort Dhikuli Road, Jim Corbett National Park, Ramnagar, Uttarakhand 244715, India",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 316.0,
    "value": 717.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000COi8EAAT",
    "hero_image": "https://images.luxuryescapes.com/p5rzxvroepg01nyj8k6v",
    "image_two": "https://images.luxuryescapes.com/5rpd79ncurzhkjoma6g9",
    "image_three": "https://images.luxuryescapes.com/51ggh9ygfw16cdoite",
    "vendor_name": "Six Senses Vana",
    "title": "Boutique India Six Senses Wellness Retreat at Himalyan Foothills",
    "description": "Truly immerse yourself in an unparalleled healing journey with Six Senses Vana - a health and wellness retreat just below the Himalayan foothills of Mussoorie in India's north. Set across 21 acres of virgin Sal Forest, this modern-day temple of wellness prioritises a rebalance of body, mind and soul through lifestyle, herbal medicine and manual therapies in uniquely crafted programs, ranging from Ayurveda and Yoga to Tibetan medicine and natural healing therapies. Each Six Senses Vana experience is curated to suit the needs of individual guests, with an assembly of traditional healers, teachers, health professionals and chefs on board to look after your every need, so that you can focus on rebalance and rejuvenation.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttarakhand",
    "offer_geo_area_level_2": "Dehradun",
    "location_heading": "Uttarakhand",
    "location_subheading": "India",
    "location_description": "Six Senses Vana - A Wellness Retreat",
    "offer_address": "Mussoorie Road, Uttarakhand 248001, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 32,
    "price": 1629.0,
    "value": 1629.0
  }
]