[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnGntYAF",
    "hero_image": "https://images.luxuryescapes.com/ch3cl5tqks4pvn6b1wv",
    "image_two": "https://images.luxuryescapes.com/c9vf2k5ujw3slx32ywni",
    "image_three": "https://images.luxuryescapes.com/jy6siwhoalgex2miylo",
    "vendor_name": "Waikoloa Beach Marriott Resort & Spa",
    "title": "Hawaii Beachfront Bliss on Kohala Coast with US$200 Dining Credit, Daily Drinks & Luau Experience",
    "description": "Experience the allure of Hawaii's 'Big Island' at this Kohala Coast sanctuary, spread across 17 acres of beachfront property. Discover the true meaning of ‘Aloha’ with an unforgettable sunset Luau, where traditional music, dance and island flavours come to life. For ultimate relaxation, reserve your private cabana and unwind by one of the resort’s three dazzling pools.\n\nThis haven of tranquillity is framed by golden beaches, clear coves and volcanic mountains. Fill your days with snorkelling, paddleboarding, ziplining or hiking, or indulge in a soothing treatment at the Mandara Spa.\n\nStart your morning with a fresh coffee or tea at the Aka‘ula Lanai Coffee Shop, then savour farm-to-table delights at Hawaii Calls Restaurant, led by award-winning Executive Chef Jayson Kanekoa.\n\nGolf enthusiasts can tee off on the resort’s three nine-hole courses, set against breathtaking coastal landscapes.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Waikoloa",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Waikoloa Beach Marriott Resort & Spa",
    "offer_address": "69-275 Waikōloa Beach Drive, Waikoloa Village, Hawaii 96738, United States",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 2769.0,
    "value": 5809.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JRvfBYAT",
    "hero_image": "https://images.luxuryescapes.com/f3c5wjvvhc94sw1v0wh7",
    "image_two": "https://images.luxuryescapes.com/7wm2jgr5foj8mnjp3tyj",
    "image_three": "https://images.luxuryescapes.com/kirctkxwkgzfrun9t6v",
    "vendor_name": "Romer House Waikiki",
    "title": "Hawaii Adults-Only Waikiki Oasis with Daily Breakfast, Daily US$50 Credit & Wellness Activities",
    "description": "Experience the allure of Waikiki at this adults-only retreat, the ideal launchpad for your island adventures. This stylish hotel in the heart of Waikiki, near the popular International Market Place, seamlessly blends island life with modern comforts and is just moments from the crystal-clear waters of the Pacific Ocean - perfect for swimming and snorkelling.\n\nRomer House Waikiki exceeds every expectation, with a serene wading pool surrounded by softly upholstered daybeds and relaxed sling deck chairs. Indulge in a modern twist on Hawaiian cuisine at 855-ALOHA, where fusion-inspired dishes and signature cocktails are served in a tranquil, open-air setting, with nightly live entertainment.\n\nWhen not exploring this neighbourhood clubhouse, venture out to explore the bustling Kalakaua Avenue, lined with high-end boutiques and local eateries, visit the Duke Kahanamoku Statue, take a surfing lesson or explore O’ahu’s diverse attractions.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Romer House Waikiki",
    "offer_address": "415 Nāhua Street, Honolulu, Hawaii 96815, USA",
    "percentage_discount": 56.0,
    "min_duration": 4,
    "max_duration": 18,
    "price": 729.0,
    "value": 1663.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JhN01YAF",
    "hero_image": "https://images.luxuryescapes.com/048amylf0m7k5o32jp",
    "image_two": "https://images.luxuryescapes.com/z5szlkk4m4ce3u0nrbb",
    "image_three": "https://images.luxuryescapes.com/zul03abqepf2lzonjvm",
    "vendor_name": "Outrigger Kona Resort and Spa",
    "title": "Hawaii Kona Coast Oasis with Daily Breakfast & Nightly Drinks with Canapes",
    "description": "When it comes to unforgettable Big Island stays, this magnificently renovated oceanfront escape has everything. Resting on the Kona Coast above the lava-rock cliffs of Keauhou Bay, this 22-acre resort is one of the only places in the world where gentle, giant manta rays swim right up to the shoreline.\n\nMake a splash at the oceanfront pool and waterslide, offering endless family-friendly fun for both kids and adults, all with breathtaking views of the Pacific. Take a dip in the shimmering lagoon pool, toast to good times at Piko cafe and wine bar or relax at the poolside Holua Poolside Bar & Lounge before returning to your serene room.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kailua-Kona",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "OUTRIGGER Kona Resort & Spa",
    "offer_address": "78-128 Ehukai Street, Kailua-Kona, Hawaii 96740, United States",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 729.0,
    "value": 1903.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JTHWSAA5",
    "hero_image": "https://images.luxuryescapes.com/or2f3xm4yb3wn8xb4yolr",
    "image_two": "https://images.luxuryescapes.com/3a51rdyokrko9fd0fksp",
    "image_three": "https://images.luxuryescapes.com/0fwcdx8b6m8ydvwdc9x",
    "vendor_name": "Outrigger Kona Resort and Spa",
    "title": "Hawaii Newly Renovated OUTRIGGER Big Island Escape with Oceanfront Pool & Daily Breakfast",
    "description": "When it comes to unforgettable Big Island stays, this magnificently renovated oceanfront oasis has everything - resting on the Kona Coast above the lava-rock cliffs of Keauhou Bay, this 22-acre resort is one of the only places in the world where gentle, giant manta rays swim right up to the shoreline. Following a US$60 million revamp, experience the very best of island heritage and modern aesthetics.\n\nCelebrate Hawaiian culture through the cool coastal tones of OUTRIGGER Kona Resort & Spa, slide into the multi-level fantasy pool, toast to good times at the brand-new Piko Coffee and Wine Bar and unwind in Voyager 47 Club Lounge (club rooms only), before returning to your serene room, each complete with a private, spacious lanai (balcony).\n\nThe resort is ideally located to explore the Big Island's extraordinary landscapes. The revered island fringed by sacred mountains is of extreme spiritual significance and has been cherished by the Hawaiian monarchy for centuries. Visit Punaluʻu black sand beach to witness hundreds of green turtles bask under the glowing sun, trek around Kilauea and glimpse the volcano's steaming might or uncover ancient history along the Ala Kahakai National Historic Trail.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kailua-Kona",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "OUTRIGGER Kona Resort & Spa",
    "offer_address": "78-128 Ehukai Street, Kailua-Kona, Hawaii 96740, United States",
    "percentage_discount": 37.0,
    "min_duration": 3,
    "max_duration": 18,
    "price": 1179.0,
    "value": 1880.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Gz06kYAB",
    "hero_image": "https://images.luxuryescapes.com/0in8a2f6ciav1d1ip3f",
    "image_two": "https://images.luxuryescapes.com/813i59y8zri2m35fmxzp",
    "image_three": "https://images.luxuryescapes.com/qfdnbtkikvgnte4hsme6",
    "vendor_name": "Outrigger Kona Resort and Spa",
    "title": "Hawaii Kona Coast Oceanfront Oasis on Keauhou Bay with Daily Breakfast & Two Children Stay Free",
    "description": "When it comes to unforgettable Big Island stays, this magnificently renovated oceanfront escape has everything. Resting on the Kona Coast above the lava-rock cliffs of Keauhou Bay, this 22-acre resort is one of the only places in the world where gentle, giant manta rays swim right up to the shoreline.\n\nMake a splash at the oceanfront pool and waterslide, offering endless family-friendly fun for both kids and adults, all with breathtaking views of the Pacific. Take a dip in the shimmering lagoon pool, toast to good times at the brand-new Piko coffee and wine bar and relax at the poolside Holua Poolside Bar & Lounge before returning to your serene room, each complete with a private lanai (balcony).\n\nThe resort is ideally located to explore the Big Island's extraordinary landscapes. The revered island fringed by sacred mountains is of extreme spiritual significance and has been cherished by the Hawaiian monarchy for centuries.\n\nVisit Punaluʻu Black Sand Beach to witness hundreds of green turtles bask under the glowing sun, trek around Kilauea and glimpse the volcano's steaming might, or uncover ancient history along the Ala Kahakai National Historic Trail.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kailua-Kona",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "OUTRIGGER Kona Resort & Spa",
    "offer_address": "78-128 Ehukai Street, Kailua-Kona, Hawaii 96740, United States",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 1459.0,
    "value": 2942.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008J5P6AAK",
    "hero_image": "https://images.luxuryescapes.com/4ihc5t9w7m5d82q4ss4",
    "image_two": "https://images.luxuryescapes.com/gc2hup654v9ehxomd1b",
    "image_three": "https://images.luxuryescapes.com/i0k9gacpfl0mivrsn5wg",
    "vendor_name": "Outrigger Reef Waikiki Beach Resort",
    "title": "Outrigger Waikiki Beachfront Escape with Daily Breakfast, Nightly Cocktails & Brand-New Voyager 47 Club Lounge",
    "description": "Hawaii’s sun-drenched beaches, picturesque bays and towering volcanic peaks are nothing short of tropical bliss, and you can experience it all with an escape to the iconic Outrigger Reef Waikiki Beach Resort. A stay at this stylish oasis will leave you feeling reinvigorated, recharged and inspired, only steps from Honolulu's laidback city centre and the world-famous shores of Waikiki Beach. Book a Club room and enjoy spectacular ocean views and access to the brand-new Voyager 47 Club, serving a huge range of premium and local spirits, craft beers and mouthwatering canapés every sunset-filled evening.\n\nThe resort's design celebrates Hawaiian culture in all its forms - evenings spent at the onsite Kani Ka Pila Grille are filled with the joyous dancing and music of traditional and contemporary Oahu performers, and the resort walls are filled with local art. To make things even better, a spectacular US$80 million refurbishment has made the Outrigger Reef Waikiki Beach Resort the place to be - upgrades include a complete refresh of all guestrooms, an overhaul of the onsite restaurants and bars, plus a plethora of newly created wellness and fitness experiences, including state-of-the-art Peloton and Technogym equipment. Families will cherish the resort's range of cultural experiences while adults can hire a private cabana and savour the sound of brilliant-blue waves rolling gently across the shore, all without having to leave the resort.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "OUTRIGGER Reef Waikiki Beach Resort",
    "offer_address": "2169 Kālia Road, Honolulu, Hawaii 96815, USA",
    "percentage_discount": 46.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1754.0,
    "value": 3264.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxnM3AAJ",
    "hero_image": "https://images.luxuryescapes.com/agyph50kq6j17jqvzv0u",
    "image_two": "https://images.luxuryescapes.com/v79scenmwytpsfrba05k",
    "image_three": "https://images.luxuryescapes.com/t0x4ivi2euct2nsgb7il",
    "vendor_name": "Outrigger Reef Waikiki Beach Resort",
    "title": "Iconic OUTRIGGER Waikiki Beachfront Escape with Daily Breakfast & Nightly Cocktails",
    "description": "Say \"Aloha\" to Hawaii’s most loved stretch of beach with a sun-drenched escape to this iconic Waikiki luxury beach resort. A stay at this contemporary retreat, only steps from the world-famous shores of Waikiki Beach and Honolulu's laidback city centre, is perfect for couples and families alike. \n\nThe resort's design celebrates Hawaiian culture in all its forms - evenings spent at the onsite Kani Ka Pila Grille are filled with the joyous dancing and music of traditional and contemporary Oahu performers, and the resort walls are filled with local art. Celebrate locally sourced, farm-fresh organic cuisine at the picturesque Monkeypod Kitchen boasting panormaic sea views and learn the art of hula with scheduled resort classes.\n\nFamilies will cherish the resort's range of cultural experiences while adults can hire a private cabana and savour the sound of brilliant blue waves rolling gently across the shore, all without having to leave the resort. Book a Club room and enjoy spectacular ocean views and access to the brand-new Voyager 47 Club, serving a huge range of premium and local spirits, craft beers and mouthwatering canapes every sunset-filled evening.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "OUTRIGGER Reef Waikiki Beach Resort",
    "offer_address": "2169 Kālia Road, Honolulu, Hawaii 96815, USA",
    "percentage_discount": 43.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1849.0,
    "value": 3231.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ig9UMYAZ",
    "hero_image": "https://images.luxuryescapes.com/lagxvpu71qpcu52v4b5o",
    "image_two": "https://images.luxuryescapes.com/jb931jbh8h94qt0h4kx7",
    "image_three": "https://images.luxuryescapes.com/q9e0phfny98t0iibuqlf",
    "vendor_name": "Outrigger Reef Waikiki Beach Resort",
    "title": "Hawaii Icon: Waikiki Beachfront Escape with Daily Breakfast & Club Lounge Upgrades Available",
    "description": "Say 'Aloha' to Hawaii’s most loved stretch of beach with a sun-drenched escape to this iconic Waikiki luxury beach resort. A stay at this contemporary retreat, only steps from the world-famous shores of Waikiki Beach and Honolulu's laidback city centre, is perfect for couples and families alike.\n\nThe resort’s design celebrates Hawaiian culture in all forms - evenings at the onsite Kani Ka Pila Grille are alive with the spirit of kanikapila ('let's play music' in Hawaiian), where award-winning local artists perform nightly. The resort’s walls showcase local art, and cultural immersion continues at the A’o Cultural Center, where guests can unwind with beachside yoga, string fresh flower lei and play the ukulele.\n\nCelebrate farm-fresh, locally sourced cuisine at Monkeypod Kitchen accompanied by panoramic sea views. Families will cherish the resort's range of cultural experiences, while adults can hire a private cabana and savour the sound of waves lapping the shore. Book a Club room and enjoy ocean views and access to the  Voyager 47 Club Lounge, serving a range of premium and local spirits, craft beers and appetisers every sunset-filled evening.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "OUTRIGGER Reef Waikiki Beach Resort",
    "offer_address": "2169 Kālia Road, Honolulu, Hawaii 96815, USA",
    "percentage_discount": 31.0,
    "min_duration": 4,
    "max_duration": 18,
    "price": 1259.0,
    "value": 1815.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007opBhAAI",
    "hero_image": "https://images.luxuryescapes.com/w13ibbw11tfg8my9mv9j",
    "image_two": "https://images.luxuryescapes.com/4iqoi1fngr3obsvlw1i",
    "image_three": "https://images.luxuryescapes.com/wsmgrfgiqpfe5ovh8y56",
    "vendor_name": "Sheraton Waikiki",
    "title": "Grand Reopening: Sheraton Waikiki Beachfront Haven with Daily US$100 Dining Credit",
    "description": "Be one of the first to experience a spectacular, newly-imagined stay at the iconic oceanfront haven Sheraton Waikiki, following a US$200 million renovation (including redesigned guest rooms). Boasting a coveted position on Waikiki’s crescent-shaped, palm-lined shores, this resort places you mere moments from the area's top attractions, with high-end shopping, family-friendly fun and magnificent natural wonders, including the famed Diamond Head crater, all within easy access.\n\nTake a dip at the award-winning, adults-only infinity edge pool, be enchanted by stunning views of Waikiki and Diamond Head, or splash about the sprawling family-friendly Helumoa pool with a waterslide, whirlpool, fountain area and poolside cabanas to keep everyone entertained. Satisfy your craving for delectable dishes at the onsite eatery Kai Market, boasting jaw-dropping views of Waikiki Beach, taste Asian-fusion bites at RumFire, or grab a snack at Edge of Waikiki located by the pool. There's no such thing as boredom in Hawaii with a host of cultural activities available during your stay to keep you entertained, including ukelele lessons, standup paddleboarding, sunset ceremony or lei making.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Sheraton Waikiki",
    "offer_address": "2255 Kalakaua Ave, Honolulu, Hawaii 96815 USA",
    "percentage_discount": 27.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1889.0,
    "value": 2578.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zZ25AAE",
    "hero_image": "https://images.luxuryescapes.com/bwycg2kjp8gh23mvt2bn",
    "image_two": "https://images.luxuryescapes.com/hrf7kdurark3gcm3ti2r",
    "image_three": "https://images.luxuryescapes.com/800ot61rg70r8yngq3a",
    "vendor_name": "Alohilani Resort",
    "title": "Luxury Waikiki Beach Escape with Daily Breakfast, Nightly Drinks & Two Days of Club Access",
    "description": "Soak up the energy of world-famous Waikiki Beach with a stay at the super-sleek ‘Alohilani Resort Waikiki Beach - a trendy oceanfront retreat beautifully designed to redefine Hawaii's hotel scene. Sitting smack bang in the middle of Kalakaua Avenue, Honolulu’s vibrant shopping and entertainment district, and only steps from one of the world’s most famous shorelines, ‘Alohilani is perfectly placed for exploring the very best of Waikiki. From family-friendly attractions such as Honolulu Zoo (less than 10 minutes walk away) to the unmissable hiking hotspot, Diamond Head (five minutes' drive), there's something for everyone.\n\nThere’s no doubting ‘Alohilani Resort Waikiki Beach's tropical island setting: a two-story, 280,000-gallon oceanarium is the star attraction of the open-air lobby, brimming with reef fish. The aquatic theme continues on the fifth floor, home to one of Waikiki’s most Instagrammable pools, complete with a bar, teak loungers, and private cabanas overlooking the beach. As the sun sets, the space is transformed with lanterns and live music, setting the scene for a night of drinks and beautiful bites from Swell Restaurant. Or, you may choose to head to Morimoto Asia or Momosan, the resort’s restaurants led by world-famous ‘Iron Chef’ Masaharu Morimoto. Families will find plenty to enjoy too including a shallow paddling pool for the little ones, and twice-daily tank talks by the oceanarium.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "'Alohilani Resort Waikiki Beach",
    "offer_address": "2490 Kalakaua Avenue, Honolulu, Hawaii 96815, USA",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1599.0,
    "value": 3139.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbDx2AAF",
    "hero_image": "https://images.luxuryescapes.com/d1o8p0ej5mvzqwxdmf5j",
    "image_two": "https://images.luxuryescapes.com/zk6ihkoqxr0e840oop8b",
    "image_three": "https://images.luxuryescapes.com/d95792o9j0p359g21pk",
    "vendor_name": "The Royal Hawaiian, A Luxury Collection Resort",
    "title": "Hawaiian 5-Star Pink Palace Escape with Oceanfront Dining, Private Beach & Luxury Pool",
    "description": "Step into a world of coastal luxury at the ‘Pink Place of the Pacific’, The Royal Hawaiian, a Luxury Collection Resort, Waikiki on the tranquil island of Oahu. Beyond its infamous pink exteriors, explore an exceptionally designed 5-star resort that embodies Hawaii’s vibrant culture and welcoming spirit. Indulge in some of the island’s most enticing dining experiences without leaving the resort with the award-winning Azure Restaurant and original Mai Tai Bar operating on the hotel's doorsteps. Enjoy cruisy days beside the incredible Malulani pool, or swim around in the natural turquoise waters of Waikiki Beach.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "The Royal Hawaiian, a Luxury Collection Resort, Waikiki",
    "offer_address": "2259 Kalākaua Ave, Honolulu, HI 96815, United States",
    "percentage_discount": 0.0,
    "min_duration": 3,
    "max_duration": 33,
    "price": 1669.0,
    "value": 1669.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqaoTAAR",
    "hero_image": "https://images.luxuryescapes.com/gsqfeccldpvd8t27da9p",
    "image_two": "https://images.luxuryescapes.com/af1h3zy4qmn7ptp0f88l",
    "image_three": "https://images.luxuryescapes.com/4ap3yhv93bh2sfijzmy",
    "vendor_name": "Wailea Beach Resort - Marriott, Maui",
    "title": "Sophisticated Hawaii Beachfront Retreat Overlooking Maui’s Coastline with US$100 Resort Credit",
    "description": "Embrace the laidback island lifestyle of Hawaii with a stay at the oceanfront Wailea Beach Resort - Marriott Maui - a stylish retreat boasting breathtaking coastal views. Lounge in a private pool cabana (if you're lucky, grab a floating cabana at the adults-only pool), watch a vibrant luau show, or take the plunge down the thrilling water slide at the NALU Adventure Pool. As night falls, indulge in a romantic evening dining in beachfront candlelit bliss as you watch the golden sun dipping below the turquoise horizon.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kihei",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Wailea Beach Resort - Marriott, Maui",
    "offer_address": "3700 Wailea Alanui Dr, Wailea, HI 96753, United States",
    "percentage_discount": 9.0,
    "min_duration": 3,
    "max_duration": 33,
    "price": 2741.0,
    "value": 3011.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J1rYIAS",
    "hero_image": "https://images.luxuryescapes.com/fkzx6tb7ze1rtpd5ah4j",
    "image_two": "https://images.luxuryescapes.com/rptikf2svlx6vomg50mq",
    "image_three": "https://images.luxuryescapes.com/oh9mp8xxbf1hay02ozt",
    "vendor_name": "Hotel Wailea, Relais & Chateaux",
    "title": "Maui Adults-Only Suites with US$200 Dining Credit, Daily Breakfast & Cocktails",
    "description": "Escape to a serene adults-only retreat nestled within 15 acres of lush, tropical hillside in one of Maui's most exclusive enclaves. \n\nSet 300 feet above the ocean with panoramic views of three Hawaiian islands, this haven offers ultimate seclusion at one of Hawaii's premier hotels - the first to be inducted into the prestigious Relais & Châteaux collection.\n\nStart your day with a peaceful yoga session beside a shimmering waterfall, then unwind in a poolside cabana. For dining, savour exquisite Hawaiian-inspired dishes at The Restaurant or enjoy sunset views while indulging in delectable Japanese cuisine at The Birdcage.\n\nBy day, take advantage of the luxury shuttle service to Wailea Beach, where complimentary chairs, umbrellas and refreshments await.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kihei",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Hotel Wailea, Relais & Châteaux",
    "offer_address": "555 Kaukahi Street, Wailea, Hawaii 96753, United States",
    "percentage_discount": 64.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 4359.0,
    "value": 12053.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LgZHAA0",
    "hero_image": "https://images.luxuryescapes.com/j0gpoga04g8ucba4iyj",
    "image_two": "https://images.luxuryescapes.com/lb5k5gq6r7p0cdsjpiyr",
    "image_three": "https://images.luxuryescapes.com/8so3pzazkabo5vso7jnw",
    "vendor_name": "Alohilani Resort",
    "title": "Luxury Waikiki Beach Escape with US$300 Resort Credit & Guaranteed Ocean-View Upgrade",
    "description": "Soak up the energy of world-famous Waikiki Beach with a stay at the super-sleek ‘Alohilani Resort - a trendy retreat beautifully designed to redefine Hawaii's hotel scene. Sitting smack bang in the middle of Kalakaua Avenue, Honolulu’s vibrant shopping and entertainment district, and only steps from one of the world’s most famous shorelines, ‘Alohilani is perfectly placed for exploring the very best of Waikiki. From family-friendly attractions such as Honolulu Zoo (a six-minute walk away) to the unmissable hiking hotspot, Diamond Head (five minutes' drive), there's something for everyone.\n\nThere’s no doubting ‘Alohilani Resort Waikiki Beach's tropical island setting: a two-storey, 280,000-gallon oceanarium is the star attraction of the open-air lobby, brimming with reef fish, fed twice daily by a scuba diver. The aquatic theme continues on the fifth floor, home to one of Waikiki’s most Instagrammable pools, complete with a bar, teak loungers and private cabanas looking over the beach below. As the sun sets, space is transformed with lanterns and live music, setting the scene for handcrafted cocktails and beautiful bites from Swell Restaurant. For something a little more refined, head to Morimoto Asia or Momosan, the resort’s restaurants led by world-famous ‘Iron Chef’ Masaharu Morimoto.\n\nFamilies will find plenty to enjoy among ‘Alohilani Resort Waikiki Beach's facilities - a shallow paddling pool and twice-daily ‘tank talks’ by the oceanarium are designed to make this Waikiki escape completely stress-free.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "'Alohilani Resort Waikiki Beach",
    "offer_address": "2490 Kalakaua Avenue, Honolulu, Hawaii 96815, USA",
    "percentage_discount": 48.0,
    "min_duration": 7,
    "max_duration": 14,
    "price": 1589.0,
    "value": 3078.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070YHVAA2",
    "hero_image": "https://images.luxuryescapes.com/4sgj950wrc8uss4eiqic",
    "image_two": "https://images.luxuryescapes.com/1p4neqlf3by1m38hrzvb",
    "image_three": "https://images.luxuryescapes.com/sfimnw2219ie0v33egcb",
    "vendor_name": "Sheraton Waikiki",
    "title": "Grand Reopening: Sheraton Waikiki Beachfront Haven with Roundtrip International Flights & Daily US$100 Dining Credit",
    "description": "Be one of the first to experience a spectacular, newly-imagined stay at the iconic oceanfront haven Sheraton Waikiki, following a US$200 million renovation (including redesigned guest rooms). Boasting a coveted position on Waikiki’s crescent-shaped, palm-lined shores, this resort places you mere moments from the area's top attractions, with high-end shopping, family-friendly fun and magnificent natural wonders, including the famed Diamond Head crater, all within easy access.\n\nTake a dip at the award-winning, adults-only infinity edge pool, be enchanted by stunning views of Waikiki and Diamond Head, or splash about the sprawling family-friendly Helumoa pool with a waterslide, whirlpool, fountain area and poolside cabanas to keep everyone entertained. Satisfy your craving for delectable dishes at the onsite eatery Kai Market, boasting jaw-dropping views of Waikiki Beach, taste Asian-fusion bites at RumFire, or grab a snack at Edge of Waikiki located by the pool. There's no such thing as boredom in Hawaii with a host of cultural activities available during your stay to keep you entertained, including ukelele lessons, standup paddleboarding, sunset ceremony or lei making.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Sheraton Waikiki",
    "offer_address": "2255 Kalakaua Ave, Honolulu, Hawaii 96815 USA",
    "percentage_discount": 0.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1889.0,
    "value": 1.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DPKrAAO",
    "hero_image": "https://images.luxuryescapes.com/7gfq5rel2s23n8embtje",
    "image_two": "https://images.luxuryescapes.com/8snfkmqkful8xk4v854",
    "image_three": "https://images.luxuryescapes.com/k39dg55ftk57u4xl27af",
    "vendor_name": "Kaimana Beach Hotel",
    "title": "Boutique Waikiki Beachfront Retreat near Iconic Diamond Head with Daily US$100 Dining Credit & Nightly Cocktails",
    "description": "Think sun-drenched shores, cocktails on the beach, and azure water stretching out as far as the eye can see - everything quintessential about Hawaii is packed into a stay at the award-winning Kaimana Beach Hotel, the only boutique beachfront property in Waikiki near the iconic Diamond Head. It's easy to see why it was rated as one of the top 10 hotels in Hawaii in the prestigious Condé Nast Traveller Readers’ Choice Awards 2021, with vibrant ‘50’s-inspired décor and spectacular ocean views, along with some of Honolulu’s best beachside brunch at the laidback Hau Tree restaurant. With Hau Tree’s bar led by a veteran mixologist, indulge in signature cocktails designed to accompany the setting sun, ranging from fashionable classics to remixed favourites.\n\nReferred to as Sans Souci, meaning 'without cares', Kaimana Beach encapsulates the essence of Hawaiian tropical relaxation. Dive into the surf, enjoy a beachfront yoga session, or head a little further out to explore the striking Diamond Head, a volcanic-crater-turned-park perfect for adventurous hikes. After a long day of discovering what Waikiki has to offer, head back to find out why Kaimana Beach truly is a hidden gem.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Kaimana Beach Hotel",
    "offer_address": "2863 Kalākaua Ave, Honolulu, Hawaii 96815, United States",
    "percentage_discount": 33.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1724.0,
    "value": 2566.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005K1GBAA0",
    "hero_image": "https://images.luxuryescapes.com/1zsw4i11s9131d5hlpt3",
    "image_two": "https://images.luxuryescapes.com/8mx63cvmby9fd5igj1m7",
    "image_three": "https://images.luxuryescapes.com/k4eruziox9gap92z4kyp",
    "vendor_name": "Outrigger Reef Waikiki Beach Resort",
    "title": "First Look: Outrigger Waikiki's Grand Reopening with Daily Breakfast & Nightly Drinks",
    "description": "Hawaii’s sun-drenched beaches, picturesque bays and towering volcanic peaks are nothing short of tropical perfection - and with the grand reopening of the iconic Outrigger Reef Waikiki Beach Resort, it’s time to say ‘aloha!’ to an idyllic escape with a sneak peek at this much-loved beachfront hideaway.\n\nPerfectly positioned directly on Waikiki Beach, where the city meets the sea, Outrigger Reef Waikiki Beach Resort is the place to be following a spectacular US$80 million refurbishment set to be completed in November 2021- and this is your first look at the highly anticipated reopening. Resort upgrades include a complete refresh of all guestrooms, an overhaul of the onsite restaurants and bars, plus a plethora of newly created wellness and fitness experiences, including state-of-the-art Peloton and Technogym equipment. Thanks to all this and more, a stay at this stylish oasis will leave you feeling reinvigorated, recharged and inspired.\n\n**Your handpicked inclusions:**\n\n- Wake to a delicious daily breakfast at Kani Ka Pila Grille\n- Round out each day in paradise with a daily drink (beer or wine) per adult at Kani Ka Pila Grille\n- The daily resort fee is included in your package, giving you access to complimentary Wi-Fi, reusable water bottles, weekly Hawaiin cultural activities, fitness centre use, in-room coffee and tea, reef-friendly sunscreen and more\n- Enjoy a 50% discount on valet parking for one vehicle\n- One child (17 and under) stays free on existing bedding (accommodation only)\n\n**Club Upgrade**: Take your stay to the next level when you book the Club Oceanfront Room with access to Voyager 47 Club, offering nightly free-flow cocktails, wine and beer with evening pupu (appetisers).\n\n**This deal has NO peak surcharges:** Travel any time for the same great price.\n\n**100% Refund Guarantee:** Book your escape with peace of mind thanks to our 100% Refund Guarantee, offering flexible date changes or a full refund up until 14 days before check-in. Refund is on accommodation only, excludes flights. See the Fine Print for details.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu County",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Outrigger Reef Waikiki Beach Resort - 2021",
    "offer_address": "2169 Kālia Rd, Honolulu, HI 96815, United States",
    "percentage_discount": 56.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1389.0,
    "value": 3175.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DPnQwAAL",
    "hero_image": "https://images.luxuryescapes.com/wt38dlmdo5gp8g2qdne4",
    "image_two": "https://images.luxuryescapes.com/e9n9001ksekidastri3",
    "image_three": "https://images.luxuryescapes.com/yo21jc5vd7jc82dp22tl",
    "vendor_name": "Sheraton Waikiki",
    "title": "Sheraton Waikiki Beachfront Haven with Daily US$100 Dine-Around Resort Credit & Oceanfront Infinity Pool",
    "description": "Hawaii's sun-drenched shores, towering volcanic peaks, and azure water stretching out as far as the eye can see are nothing short of tropical bliss, and you can experience it all with an escape at Sheraton Waikiki's oceanfront haven. The warmth of both island hospitality and a tropical ocean breeze await during a spectacular stay at this quintessentially Hawaiian resort, along with the chance to satisfy your craving for delectable dishes with a daily dine-around credit to use across 16 venues in four resorts, including the palatial 'First Lady of Waikiki' Moana Surfrider. Boasting a coveted position on Waikiki’s crescent-shaped, palm-lined shores, this resort places you mere moments from the area's top attractions, with high-end shopping, family-friendly fun and magnificent natural wonders -  including the famed Diamond Head crater -  all within easy access. \n\nTake a dip in the award-winning, adults-only infinity edge pool, be enchanted by stunning views of Waikiki and Diamond Head, or splash about the sprawling family-friendly Helumoa pool, which features a waterslide, whirlpool, fountain area and poolside cabanas to keep everyone entertained. There's no such thing as boredom in Hawaii with a host of cultural activities available during your stay to keep you entertained, including ukelele lessons, standup paddleboarding, sunset ceremony or lei making.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Sheraton Waikiki",
    "offer_address": "2255 Kalakaua Ave, Honolulu, Hawaii 96815 USA",
    "percentage_discount": 26.0,
    "min_duration": 5,
    "max_duration": 25,
    "price": 2999.0,
    "value": 4042.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqbOqAAJ",
    "hero_image": "https://images.luxuryescapes.com/d4x2wgjm1ovjlw5iu7u",
    "image_two": "https://images.luxuryescapes.com/pgiatzku3le8k1uma4v",
    "image_three": "https://images.luxuryescapes.com/i8msbwrvsduztp7lovmq",
    "vendor_name": "Waikoloa Beach Marriott Resort & Spa",
    "title": "Hawaii Big Island Resort Paradise with Three Pools & Three Nine-Hole Golf Courses",
    "description": "Find exhilarating adventure alongside nourishing rejuvenation at the sparkling Waikoloa Beach Marriott Resort & Spa, offering the pinnacle of Hawaiian Big Island experiences. Laze the day away poolside with a cocktail of choice in hand, or find deep reinvigoration with a signature treatment at the resort's famed Mandara Spa. Kick things up a notch by trying your hand at golf on the resort’s lush greens, or dive deep into the resort’s water sports on offer, including snorkelling and surfing at Anaeho'omalu Bay. After days spent just how you like, re-fuel with locally sourced and lovingly prepared meals at Hawaii Calls Restaurant.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Waikoloa",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Waikoloa Beach Marriott Resort & Spa",
    "offer_address": "69-275 Waikōloa Beach Dr, Waikoloa Beach, HI 96738, United States",
    "percentage_discount": 0.0,
    "min_duration": 3,
    "max_duration": 33,
    "price": 1196.0,
    "value": 1196.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BevBLAAZ",
    "hero_image": "https://images.luxuryescapes.com/sm6z1yvn3w6tyg5omtiuj",
    "image_two": "https://images.luxuryescapes.com/wfi19nre9gmwis0xgqn",
    "image_three": "https://images.luxuryescapes.com/yjszxi8xs870xn8fbzj",
    "vendor_name": "Outrigger Kona Resort and Spa",
    "title": "Hawaii Big Island Outrigger Oceanfront Escape with Daily Breakfast & Cocktails",
    "description": "When it comes to unforgettable Big Island stays, the tranquil Outrigger Kona Resort and Spa more than delivers: resting on the Kona Coast above the lava-rock cliffs of Keauhou Bay, this 22-acre resort is one of the only places in the world where gentle, giant manta rays swim right up to the shoreline. Celebrate Hawaiian culture through the cool coastal tones, plunge into good times at Holua Poolside Bar and Lounge and unwind in Voyager 47 Club Lounge (surcharges apply), before returning to your serene room, each complete with a private, spacious lanai (balcony).\n\nThe resort is ideally located to explore the Big Island's extraordinary landscapes. The revered island fringed by sacred mountains is of extreme spiritual significance and has been cherished by the Hawaiian monarchy for centuries. Visit Punaluʻu black sand beach to witness hundreds of green turtles bask in the glowing sun, trek around Kilauea and glimpse the volcano's steaming might or uncover ancient history along the Ala Kahakai National Historic Trail.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kailua-Kona",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "OUTRIGGER Kona Resort & Spa",
    "offer_address": "78-128 Ehukai Street, Kailua-Kona, Hawaii 96740, United States",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 18,
    "price": 1004.0,
    "value": 2604.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000COnhaAAD",
    "hero_image": "https://images.luxuryescapes.com/keom6ea03yysjutkrpx",
    "image_two": "https://images.luxuryescapes.com/el3s6ndkt77m30dkr2h",
    "image_three": "https://images.luxuryescapes.com/5kizos76l81jlhum9dep",
    "vendor_name": "Outrigger Reef Waikiki Beach Resort",
    "title": "Outrigger Waikiki Beachfront Escape with Daily Breakfast, Nightly Cocktails & Brand-New Voyager 47 Club Lounge",
    "description": "Hawaii’s sun-drenched beaches, picturesque bays and towering volcanic peaks are nothing short of tropical bliss, and you can experience it all with an escape to the iconic Outrigger Reef Waikiki Beach Resort. A stay at this stylish oasis will leave you feeling reinvigorated, recharged and inspired, only steps from Honolulu's laidback city centre and the world-famous shores of Waikiki Beach. Book a Club room and enjoy spectacular ocean views and access to the brand-new Voyager 47 Club, serving a huge range of premium and local spirits, craft beers and mouthwatering canapes every sunset-filled evening.\n\nThe resort's design celebrates Hawaiian culture in all its forms - evenings spent at the onsite Kani Ka Pila Grille are filled with the joyous dancing and music of traditional and contemporary Oahu performers, and the resort walls are filled with local art. To make things even better, a spectacular US$80 million refurbishment has made the Outrigger Reef Waikiki Beach Resort the place to be - upgrades include a complete refresh of all guestrooms and an overhaul of the onsite restaurants and bars. Families will cherish the resort's range of cultural experiences while adults can hire a private cabana and savour the sound of brilliant-blue waves rolling gently across the shore, all without having to leave the resort.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "OUTRIGGER Reef Waikiki Beach Resort",
    "offer_address": "2169 Kālia Road, Honolulu, Hawaii 96815, USA",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1754.0,
    "value": 3422.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zcY0AAI",
    "hero_image": "https://images.luxuryescapes.com/hamqgexdubwrmbdqc6er",
    "image_two": "https://images.luxuryescapes.com/i5m4lh286993godjqise",
    "image_three": "https://images.luxuryescapes.com/a8ec2nsrpt3vwrsmfmsh",
    "vendor_name": "Outrigger Reef Waikiki Beach Resort",
    "title": "Grand Reopening: Outrigger Waikiki Beachfront Escape with Daily Breakfast, Nightly Cocktails, Resort Fee & Travel Until December 2023",
    "description": "Hawaii’s sun-drenched beaches, picturesque bays and towering volcanic peaks are nothing short of tropical bliss. Experience it all with an escape to the iconic Outrigger Reef Waikiki Beach Resort, a much-loved beachfront hideaway ranked within the top 10% of properties on Tripadvisor.\n\nPerfectly positioned directly on Waikiki Beach, where the city meets the sea, Outrigger Reef Waikiki Beach Resort is the place to be following a spectacular US$80 million refurbishment. Resort upgrades include a complete refresh of all guestrooms, an overhaul of the onsite restaurants and bars, plus a plethora of newly created wellness and fitness experiences, including state-of-the-art Peloton and Technogym equipment. A stay at this stylish oasis will leave you feeling reinvigorated, recharged and inspired.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu County",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Outrigger Reef Waikiki Beach Resort - 2021",
    "offer_address": "2169 Kālia Rd, Honolulu, HI 96815, United States",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1574.0,
    "value": 3103.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DpiI5AAJ",
    "hero_image": "https://images.luxuryescapes.com/kmqtsu7ize9w4it8k8k9",
    "image_two": "https://images.luxuryescapes.com/qjsv32u9gth4ld29604e",
    "image_three": "https://images.luxuryescapes.com/5n38h49pynrsek1t3toq",
    "vendor_name": "Alohilani Resort",
    "title": "Award-Winning Oceanfront Hawaii Glamour on Iconic Waikiki Beach with Daily US$75 Resort Credit",
    "description": "Discover the best of iconic Hawaii with a stay at the award-winning ‘Alohilani Resort Waikiki Beach, perfectly positioned in the heart of Honolulu’s glamorous main beachfront promenade, Kalakaua Avenue. Rated #6 in Conde Nast Traveler’s Top 25 Hawaii Resorts for 2022, there’s no better time to experience this acclaimed reimagining of Waikiki’s world-famous surfside serenity - become spellbound by the resort’s breathtaking oceanarium, teeming with reef fish in countless shapes and colours, or spend lazy afternoons by the dreamlike SWELL, a sprawling, cabana-flanked infinity pool and bar offering tremendous views over the Pacific Ocean.\n\nThe dining is top-notch - head to Morimoto Asia for a taste of the renowned Iron Chef’s masterful Asian plates, Piccola Onda for Italian bites served with a Roman flair or savour small-batch, artisanal scoops at Double Fat Ice Cream, Hawaii’s best-loved ice creamery. Feel like hitting the waves? The nearby surf boutique, Beach Candy Waikiki, offers private lessons and a wide variety of rental boards, beach chairs and accessories to guarantee sun-soaked, fun-filled days in abundance.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "'Alohilani Resort Waikiki Beach",
    "offer_address": "2490 Kalakaua Avenue, Honolulu, Hawaii 96815, USA",
    "percentage_discount": 33.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 1651.0,
    "value": 2450.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HdGQIA0",
    "hero_image": "https://images.luxuryescapes.com/zhtopd9k86hzv8ztt3pvw",
    "image_two": "https://images.luxuryescapes.com/tkw1asgmtnf5psqua46p",
    "image_three": "https://images.luxuryescapes.com/0tixt8bj1ss5emx64pk",
    "vendor_name": "Alohilani Resort",
    "title": "Oceanfront Hawaii Glamour on Iconic Waikiki Beach with Infinity Pool & US$500 Dining Credit",
    "description": "Discover the best of iconic Hawaii with a stay at ‘Alohilani Resort Waikiki Beach, perfectly positioned in the heart of Honolulu’s glamorous main beachfront promenade, Kalakaua Avenue.\n\nFrom the moment you step inside ‘Alohilani’s two-storey, open-air lobby, you’ll be spellbound by the resort’s breathtaking oceanarium, teeming with reef fish in countless shapes and colours. Spend lazy afternoons at SWELL, a sprawling, cabana-flanked infinity pool and bar offering panoramic views over the Pacific Ocean from its high floor elevation.\n\nThe dining is top-notch - head to Morimoto Asia for a taste of the renowned Iron Chef’s masterful Asian plates, Piccola Onda for Italian bites served with a Roman flair or savour small-batch, artisanal scoops at Double Fat Ice Cream, Hawaii’s best-loved ice creamery.\n\nFeel like hitting the waves? The nearby surf boutique, Beach Candy Waikiki, offers private lessons and a wide variety of rental boards, beach chairs and accessories to guarantee sun-soaked, fun-filled days in abundance.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Alohilani Resort Waikiki Beach",
    "offer_address": "2490 Kalākaua Avenue, Honolulu, Hawaii 96815, United States",
    "percentage_discount": 38.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1499.0,
    "value": 2400.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Dvm21YAB",
    "hero_image": "https://images.luxuryescapes.com/faqcql74sax4q3o3cvy",
    "image_two": "https://images.luxuryescapes.com/pmx6ef396pee43w1g6ct",
    "image_three": "https://images.luxuryescapes.com/9903ad2segoe4swgw2t",
    "vendor_name": "Royal Kona Resort",
    "title": "Oceanfront Hawaii Retreat with Daily Breakfast & Complimentary Daily Parking",
    "description": "Hawaii's spirit comes alive at this magical, tropical haven overlooking breathtaking azure waters perched on the edge of Kailua Bay. Picture ocean waves dancing against lava rock shores, verdant gardens with tropical hues and fragrant breezes carrying the warmth of endless sunshine. Enveloped by immaculate gardens, this is the perfect base to explore The Big Island's natural wonders.\n\nIndulge in fresh seafood, daily a la carte breakfast and tropical drinks at Don the Beachcomber Restaurant and Mai Tai Bar or rejuvenate at the Lotus Centre Spa. Spend your days diving with graceful manta rays or exploring fiery volcanoes. With the Pacific Ocean, a private saltwater lagoon, excellent local shopping and an abundance of Hawaiian cultural activities on your doorstep, a world of adventures awaits.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kailua-Kona",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Royal Kona Resort",
    "offer_address": "75-5852 Ali‘i Drive, Kailua-Kona, Hawaii 96740, United States",
    "percentage_discount": 40.0,
    "min_duration": 4,
    "max_duration": 18,
    "price": 1069.0,
    "value": 1769.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FkywUAAR",
    "hero_image": "https://images.luxuryescapes.com/2yg9pbrr4flpa80ztcpv",
    "image_two": "https://images.luxuryescapes.com/3mtfwxbgi3czg77foeua",
    "image_three": "https://images.luxuryescapes.com/24bx0q0hwm1sf3qkbk",
    "vendor_name": "Outrigger Reef Waikiki Beach Resort",
    "title": "Iconic Outrigger Waikiki Beachfront Escape with Ocean Views, Daily Breakfast & Nightly Cocktails",
    "description": "Say \"Aloha\" to Hawaii’s most iconic stretch of beach with a sun-drenched escape to the Outrigger Reef Waikiki Beach Resort. A stay at this contemporary retreat, only steps from the world-famous shores of Waikiki Beach and Honolulu's laidback city centre, is perfect for couples and families alike. The resort's design celebrates Hawaiian culture in all its forms - evenings spent at the onsite Kani Ka Pila Grille are filled with the joyous dancing and music of traditional and contemporary Oahu performers, and the resort walls are filled with local art. Celebrate locally sourced, farm-fresh organic cuisine at the brand-new seaside al-fresco Monkeypod Kitchen and learn the art of hula with scheduled resort classes. \n\nFamilies will cherish the resort's range of cultural experiences while adults can hire a private cabana and savour the sound of brilliant blue waves rolling gently across the shore, all without having to leave the resort. Book a Club room and enjoy spectacular ocean views and access to the brand-new Voyager 47 Club, serving a huge range of premium and local spirits, craft beers and mouthwatering canapes every sunset-filled evening.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "OUTRIGGER Reef Waikiki Beach Resort",
    "offer_address": "2169 Kālia Road, Honolulu, Hawaii 96815, USA",
    "percentage_discount": 30.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1808.216675,
    "value": 2581.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DIOB7AAP",
    "hero_image": "https://images.luxuryescapes.com/p5fpl650jcw0jzuwzp4",
    "image_two": "https://images.luxuryescapes.com/wef5gnrg6kzs1pj8hler",
    "image_three": "https://images.luxuryescapes.com/d8i6r8rrj88fde87h2hj",
    "vendor_name": "Outrigger Waikiki Beach Resort",
    "title": "Iconic Outrigger Waikiki Beachfront Escape with Daily Breakfast & Daily Drinks",
    "description": "Wake up steps from the action in blissful tropical surroundings at Outrigger Waikiki Beach Resort. Whether you’re chasing surf, sand or shopping sprees, this blissful tropical resort is the place to be. Boasting an unrivalled oceanfront location in Waikiki, a stay at this modern beachfront haven is sure to leave you feeling well-rested and relaxed. With complimentary Hawaiian cultural activities sure to fascinate all ages and aquatic fun just waiting to be had, this kid-friendly destination is sure to deliver a soothing stay for the whole family. Drop by Infinity Spa for moments of indulgence or energise your body and mind at the fitness centre.\n\nNext, savour some of Oahu's favourite dining at popular Duke's Waikiki, pick up a tropical smoothie at Sunrise Shack, stop by Pai's Deli for healthy sandwiches or take in magnificent views of Diamond Head at Hula Grill Waikiki. For adventures beyond your idyllic oasis, spend your days shopping on Kalakaua Avenue's fashion mile, hiking the trails at Diamond Head, uncovering the history of Pearl Harbor, or admiring the scenery at Manoa Falls.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Outrigger Waikiki Beach Resort",
    "offer_address": "2335 Kalakaua Avenue Honolulu HI 96815 United States",
    "percentage_discount": 64.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 1889.0,
    "value": 5195.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I3SSIA0",
    "hero_image": "https://images.luxuryescapes.com/5hy0ip0g7qcl2zmb83cf",
    "image_two": "https://images.luxuryescapes.com/14yakja26zx8sjto5o2",
    "image_three": "https://images.luxuryescapes.com/rhengwybkflttmgh8qkv",
    "vendor_name": "Renaissance Honolulu Hotel & Spa",
    "title": "Grand Opening: Sky-High Honolulu Luxury near Waikiki Beach with Daily Breakfast & Two Children Stay Free",
    "description": "Be whisked away by this brand-new Honolulu haven, located just minutes from Waikiki Beach. Built from the ground up in 2024, this hotel stands out among the crowd of properties with its sleek design and state-of-the-art facilities.\n\nHere, each sun-drenched morning is accompanied by mountain or ocean views from your private oasis, followed by breakfast at the MARA restaurant, featuring Mediterranean flair cooked in an open kitchen. When it's time to venture out, this lavish resort is your luxury launchpad for exploring Hawaii, where the wonders of Waikiki and Ala Moana are within easy reach, thanks to the complimentary shuttle service - in none other than an ultra-sleek, airconditioned Mercedes Benz. Visit the Ala Moana Centre for world-class open-air shopping or Waikiki Beach to witness powder-white sands and wildlife-rich waters.\n\nYou’ll feel like a new person after taking advantage of the resort’s cutting-edge wellness centre, boasting Peloton equipment, as well as its 25-meter outdoor lap pool, rooftop pool, indoor and outdoor Ofuro soaking baths, sauna and steam rooms, and tension-melting treatments at the NAMI Spa at Renaissance Honolulu. There's an activity for every family member and even better, up to two children (17 years & under) stay free in select rooms.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Renaissance Honolulu Hotel & Spa",
    "offer_address": "1390 Kapiolani Boulevard, Honolulu, Hawaii 96814, United States",
    "percentage_discount": 62.0,
    "min_duration": 4,
    "max_duration": 15,
    "price": 1239.0,
    "value": 3247.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DZpTCYA1",
    "hero_image": "https://images.luxuryescapes.com/1e5wuo3jqo3fw6xj17wp",
    "image_two": "https://images.luxuryescapes.com/p3gpwoarsmk4tyzsu68o",
    "image_three": "https://images.luxuryescapes.com/6a85h4w1rmjjd5cnmnp",
    "vendor_name": "Pacific 19 Kona",
    "title": "Contemporary Hawaii Escape Near Kailua Bay with Daily Coffee & Outdoor Pool",
    "description": "Experience the allure of Hawaii’s Big Island at this sun-drenched retreat, the ideal launchpad for your island adventures. This stylish hotel, positioned on the 19th Parallel, seamlessly blends island life with modern comforts and is just moments from the crystal-clear waters of Kailua Bay - perfect for swimming and snorkelling - and the soft white sands of Kamakahonu Beach.\n\nEscape the crowds and immerse yourself in the local charm of Kona, great for travellers seeking a slower, more tranquil pace. After a day of exploration, kick back in the hotel’s lobby lounge, complete with lush planters and features carved of monkeypod and teak, or relax by the pool deck before retreating to your thoughtfully designed room.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kailua-Kona",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Pacific 19 Kona",
    "offer_address": "75-5646 Palani Rd, Kailua-Kona, Hawaii 96761, United States",
    "percentage_discount": 38.0,
    "min_duration": 4,
    "max_duration": 14,
    "price": 1029.0,
    "value": 1669.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FP8xqYAD",
    "hero_image": "https://images.luxuryescapes.com/ml40ymechg7043y6snyi",
    "image_two": "https://images.luxuryescapes.com/1ph9kdxz0bqk7cw3iolb",
    "image_three": "https://images.luxuryescapes.com/jpvcnkp3prs6gumx90gl",
    "vendor_name": "Romer House Waikiki",
    "title": "Hawaii Adults-Only Waikiki Oasis with Daily Breakfast, Nightly Drinks & Wellness Activities",
    "description": "Experience the allure of Waikiki at this adults-only retreat, the ideal launchpad for your island adventures. This stylish hotel in the heart of Waikiki,  near the popular International Market Place, seamlessly blends island life with modern comforts and is just moments from the crystal-clear waters of the Pacific Ocean - perfect for swimming and snorkelling.\n\nThis reimagined retreat - O'ahu's sole adults-only hotel - exceeds every expectation, with a serene pool surrounded by a continuous row of softly upholstered daybeds and relaxed sling deck chairs complemented by an open-air lanai that overlooks the lively streets of Waikiki.\n\nIndulge in a modern twist on Hawaiian cuisine at Izakaya 855-ALOHA, where fusion-inspired dishes and signature cocktails are served in a tranquil, open-air setting with nightly live entertainment.\n\nVenture out to explore the bustling Kalakaua Avenue, lined with high-end boutiques and local eateries, visit the Duke Kahanamoku Statue, take a surfing lesson or explore O’ahu’s diverse attractions.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Romer House Waikiki",
    "offer_address": "415 Nāhua Street, Honolulu, Hawaii 96815, USA",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1139.0,
    "value": 2652.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BzfeAAC",
    "hero_image": "https://images.luxuryescapes.com/p1xhsi6azb8s2gezvhx3n",
    "image_two": "https://images.luxuryescapes.com/ktuzeq5k6kx2e7zz069j",
    "image_three": "https://images.luxuryescapes.com/gpejacv5loqf1urgf96g",
    "vendor_name": "Mauna Lani, Auberge Resorts Collection",
    "title": "Hawaii Ultra-Luxe Big Island Oceanfront Haven with Daily US$200 Resort Credit",
    "description": "Tucked along the rambling wilderness of the spectacular Kohala Coast is the five-star, ultra-luxurious Mauna Lani, Auberge Resorts Collection - the prestigious hotel collection's first and only Hawaiian property - a staggeringly soulful resort and the best place to uncover the true magic of the islands. Feel the salty breeze in your hair as you explore the island’s volcanic highlands, swim beneath cerulean waves or dine at any of the resort’s spectacular onsite eateries. The resort offers a wide range of watersport and culinary adventures to be cherished by amateur snorkellers and sommeliers alike, but where Mauna Lani, Auberge Resorts Collection really shines is in its cultural experiences - explore preserved historical sites by helicopter, meet and greet with the green sea turtles of the island or enter Mauna Lani’s House of Knowledge and commune with indigenous Hawaiian storytellers and poets.\n\nThere’s no better place to explore the Big Island’s extraordinarily diverse frontier. It’s an island of extreme spiritual significance, ringed by sacred mountains and cherished by Hawaiian royalty for centuries. Trek around Kilauea and glimpse the volanco’s steaming might, walk across gemstone sands at Green Sand Beach or uncover ancient history along the Ala Kahakai National Historic Trail.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kamuela",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Mauna Lani, Auberge Resorts Collection",
    "offer_address": "68-1400 Mauna Lani Dr, Waimea, HI 96743 United States",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 4619.0,
    "value": 9260.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Dbd7mYAB",
    "hero_image": "https://images.luxuryescapes.com/exl7ujgxg4kv2s4a5jdq",
    "image_two": "https://images.luxuryescapes.com/ovknlno2u0nc6fdlszw",
    "image_three": "https://images.luxuryescapes.com/z30u887ribooybjmtgll",
    "vendor_name": "Prince Waikiki",
    "title": "Hawaii Award-Winning Haven near Waikiki Beach with Daily Breakfast, Nightly Drinks & Infinity Pool",
    "description": "At the gateway to Waikiki on the island of O'ahu, Prince Waikiki offers unprecedented views over the shimmering Pacific Ocean and bustling Ala Wai Harbour. With each room boasting impressive floor-to-ceiling windows, the hotel maximises its privileged location and captures panoramic views of Hawaiian sunsets from every angle.\n\nFloat above Honolulu in the infinity pool overlooking the harbour, unwind poolside with a signature Aqua Bloom cocktail at the Hinana Bar - boasting one of Waikiki's best sunsets - or savour local poke bowls, duck confit ramen and craft cocktails at the acclaimed 100 Sails Restaurant & Bar. Alternatively, head to Honolulu Coffee Company for artisanal coffee and fresh pastries, or Katsumidori Sushi Tokyo for masterfully crafted sushi rolls.\n\nThe island of O'ahu has an abundance of natural wonders and cultural treasures, all within easy reach. Hike to the Diamond Head crater for breathtaking coastal views, or venture to the North Shore to witness legendary surf breaks. Nature lovers can explore the nearby Lyon Arboretum's tropical gardens, and history buffs will appreciate the proximity to Pearl Harbour.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Prince Waikiki",
    "offer_address": "100 Holomoana Street, Honolulu, Hawaii 96815, United States",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1839.0,
    "value": 4280.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004SYjmAAG",
    "hero_image": "https://images.luxuryescapes.com/n5x1wcqnh4wzctub95g",
    "image_two": "https://images.luxuryescapes.com/ijqmwrmslklxpmbyfo15",
    "image_three": "https://images.luxuryescapes.com/iozlntgrxaago3ngimw",
    "vendor_name": "Outrigger Waikiki Beach Resort",
    "title": "Outrigger Waikiki Beachfront Escape",
    "description": "If you’re chasing sun, sand, shopping and tropical bliss, Outrigger Waikiki Beach Resort is the place to be. A stay at this modern beachfront haven is sure to leave you feeling well-rested and relaxed. Catch some rays at the shimmering pool, drop by Infinity Spa for moments of indulgence or break a sweat at the fitness centre. \n\nWhen hunger strikes, savour some of Oahu's favourite dining at popular Duke's Waikiki, pick up a tropical smoothie at Sunrise Shack, stop by at Pai's Deli for healthy sandwiches or take in magnificent views of Diamond Head at Hula Grill Waikiki. Take part in the many activities available at the hotel, including stand-up paddleboard yoga, flower lei making and surfing. For adventures beyond your idyllic oasis, spend your days shopping on Kalakaua Avenue's fashion mile, hiking the trails at Diamond Head, uncovering the history of Pearl Harbor, or admiring the scenery at Manoa Falls.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Outrigger Waikiki Beach Resort",
    "offer_address": "2335 Kalakaua Ave, Honolulu, HI 96815, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 311.0,
    "value": 311.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRz5XAAT",
    "hero_image": "https://images.luxuryescapes.com/q5kqiawshptdwars66vc",
    "image_two": "https://images.luxuryescapes.com/r8hzchgb1ivfxq56fdcg",
    "image_three": "https://images.luxuryescapes.com/5wut8rpr8ccqlglj9gsq",
    "vendor_name": "Napili Shores Maui by OUTRIGGER",
    "title": "Tranquil Oceanfront Hawaii Escape with Four Onsite Restaurants & Two Pools",
    "description": "Experience the tranquillity of Maui with a stay at this beachfront retreat, perfectly positioned on the island's northwest coast, offering easy access to the azure waters of Napili Bay. Indulge yourself with a swim in one of the two pools, have a savoury meal at The Gazebo Restaurant or enjoy a BBQ night and perfect your birdie in the nearby championship golf courses.\n\nRest well in the beautiful rooms offering sweeping ocean views and the sweet scents of plumeria trees. Make the most of the hotel's superb location and the drive along the famous Road to Hana.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Lahaina",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Napili Shores Maui by OUTRIGGER",
    "offer_address": "5315 Lower Honoapiilani Road, Lahaina, Hawaii 96761, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 322.0,
    "value": 322.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRz2KAAT",
    "hero_image": "https://images.luxuryescapes.com/jch21qc7n21hqp1tt8g",
    "image_two": "https://images.luxuryescapes.com/6njm2vknk7gf56j2c45c",
    "image_three": "https://images.luxuryescapes.com/kj6f44095kbwgnnkfoz",
    "vendor_name": "Royal Sea Cliff Kona by OUTRIGGER",
    "title": "Boutique Cliffside Big Island Apartment Escape on Kona Coast with Two Pools & Tennis Court",
    "description": "Embrace the aloha spirit and discover the allure of Big Island with a luxurious stay at this apartment oasis, perched atop a lava rock bluff and overlooking the turquoise waters of the Pacific Ocean. Soak up the dazzling beauty of the Kona Coast teeming with volcanic black sand beaches, scenic hiking trails and epic surf spots. Relax in the sleek studios or apartments and bask in the expansive ocean views from the comfort of your abode.\n\nSpend your days by one of the two outdoor pools, indulge in a traditional Hawaiian Luau feast and savour stunning sunsets from your private balcony. If you wish to explore, Kailua Village is a short drive away, where you can visit local art galleries, feast on fresh seafood or shop for Hawaiian souvenirs.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kailua-Kona",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Royal Sea Cliff Kona by OUTRIGGER",
    "offer_address": "75-6040 Ali‘i Drive, Kailua-Kona, Hawaii 96740, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 286.0,
    "value": 286.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRz4eAAD",
    "hero_image": "https://images.luxuryescapes.com/0xdyelh2cqgozxr9exx",
    "image_two": "https://images.luxuryescapes.com/9cqf87ypbi3lpk2ofvyi",
    "image_three": "https://images.luxuryescapes.com/danyjhfpvo5sbw82c6",
    "vendor_name": "Regency on Beachwalk Waikiki by OUTRIGGER",
    "title": "Boutique Honolulu Self-Contained 1- & 2-Bedroom Condo Retreat near Waikiki Beach",
    "description": "Embrace the vibrant spirit of Hawaii with an indulgent stay at this chic condominium-style retreat, set mere moments from the bustling Waikiki Beach Walk® high-end shopping and dining hub. This stylish retreat boasts exquisitely crafted wooden furnishings, sleek amenities and offers floor-to-ceiling windows that frame spectacular coastline vistas, all while being steps away from the surf-friendly white sand shores of Waikiki Beach.\n\nSoak up the sun and immerse yourself in tropical bliss, explore nearby O'ahu's stunning beaches like Chun's Reef, perfect for snorkelling and the Ala Moana Beach Park which is ideal for family-friendly fun. For a dive into history, visit the Pearl Harbor museum and memorial to gain insights into World War II history. Plus, when hunger strikes, head to the nearby Japanese Tonkatsu Ginza Bairin or Yard House restaurant to delight your tastebuds.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Regency on Beachwalk Waikiki by OUTRIGGER",
    "offer_address": "255 Beach Walk, Honolulu, Hawaii 96815, United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECh78AAD",
    "hero_image": "https://images.luxuryescapes.com/ng19re7pzsokqsk0bbeo",
    "image_two": "https://images.luxuryescapes.com/uufryxge9foxuj87ou0r",
    "image_three": "https://images.luxuryescapes.com/sbgi5gm5sf2mi4s2blu",
    "vendor_name": "Timbers Kauai Ocean Club & Residences",
    "title": "Verdant Hawaiian Island Luxury Residences with Oceanfront Golf Course & Infinity Pool",
    "description": "Retreat to a glorious Hawaiian island oasis, where the grass is greener, the water is clearer and the drinks are sweeter, with a stay at Timbers Kaua'i Ocean Club & Residences. Embrace the classic laidback and vibrant culture of Hawaii while admiring panoramic views of the turquoise ocean stretching out from the front door. Spend your days exploring nearby beaches and tropical forests, floating in the incredible two-tiered infinity pool or rejuvenating in Nanea Spa. Tee off at The Ocean Course, a Jack Nicklaus Signature, to soak up the longest stretch of oceanfront golf in Hawaii. Take your tastebuds on a delicious adventure to the Garden Isles with fresh farm-to-table dishes served up at Hualani’s Restaurant, finishing with a refreshing cocktail at the poolside bar.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Lihue",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Timbers Kaua'i Ocean Club & Residences",
    "offer_address": "3770 Ala'oli Way, Hokuala, 96766, Hawaii, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 2243.0,
    "value": 2243.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRz5hAAD",
    "hero_image": "https://images.luxuryescapes.com/8axvhuc436y6dwve81tv",
    "image_two": "https://images.luxuryescapes.com/ew4t8knti84cylf5y21m",
    "image_three": "https://images.luxuryescapes.com/x1z0w27z19rox0om40ar",
    "vendor_name": "The Kapalua Villas Maui",
    "title": "Contemporary Hawaii Villas on Kapalua Resort with Eight Restaurants & Three Pools",
    "description": "Explore Hawaii in style with an escape to these lush villas, perfectly positioned on Maui's northwest coast. This tropical paradise offers spacious one- to three-bedroom condos with full kitchens, plus stunning ocean or golf course views, lush gardens and two championship golf courses.\n\nExplore the nearby Kapalua Coastal Trail, sink your toes into the sands of Oneloa Beach, dine at the award-winning Merriman's Kapalua restaurant or take a dip in one of the resort's sparkling pools. For those seeking adventure, the renowned Kapalua Ziplines are just moments away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Lahaina",
    "location_heading": "Hawaii",
    "location_subheading": "United States of America",
    "location_description": "The Kapalua Villas Maui",
    "offer_address": "300 Kapalua Drive, Lahaina, Hawaii 96761, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 276.0,
    "value": 276.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UZwxAAG",
    "hero_image": "https://images.luxuryescapes.com/4r6a8zqk0gowg30qnsv1",
    "image_two": "https://images.luxuryescapes.com/oci8ax2pblmj4r9sqbd",
    "image_three": "https://images.luxuryescapes.com/wgw3g1j10kcrx12drpc",
    "vendor_name": "Alohilani Resort",
    "title": "Oceanfront Hawaii Glamour on Iconic Waikiki Beach with Infinity Pool",
    "description": "Discover the best of iconic Hawaii with a stay at ‘Alohilani Resort Waikiki Beach, perfectly positioned in the heart of Honolulu’s glamorous main beachfront promenade, Kalakaua Avenue. Admire the resort’s breathtaking oceanarium or visit SWELL, a sprawling, cabana-flanked infinity pool and bar offering panoramic views over the Pacific Ocean from its high floor elevation.\n\nThe dining is top-notch - head to Morimoto Asia for a taste of the renowned Iron Chef’s masterful Asian plates, Piccola Onda for Italian bites served with a Roman flair or savour small-batch, artisanal scoops at Double Fat Ice Cream, Hawaii’s best-loved ice creamery.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "'Alohilani Resort Waikiki Beach",
    "offer_address": "2490 Kalakaua Avenue, Honolulu, Hawaii 96815, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 304.0,
    "value": 304.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRz5cAAD",
    "hero_image": "https://images.luxuryescapes.com/8496b9m9ners0kwd9gqh",
    "image_two": "https://images.luxuryescapes.com/beli0x4s4bec7u02q2cg",
    "image_three": "https://images.luxuryescapes.com/2tv6kjj1bp1z6aitx34u",
    "vendor_name": "Royal Kahana Maui by OUTRIGGER",
    "title": "Maui Beachfront Self-Contained Studio & Condo Escape with Outdoor Pool",
    "description": "Bask in the enchanting beauty of Maui from this oceanfront condominium-style abode by OUTRIGGER, tucked between the fashionable resort areas of Ka'anapali Beach and Kapalua Bay. Fall in love with the charming aloha spirit and spend your days sea-gazing as you swim laps in the outdoor pool and soak up the tropical vibes.\n\nTempt your tastebuds with fresh seafood at the nearby Hula Grill Kaanapali and jive along to local music with a cocktail at Monkeypod Kitchen by Merriman, both located in the nearby, vibrant Whalers Village. \n\nExplore the historic town of Lahaina with its art galleries and boutiques, and enjoy the nearby Nakalele Blowhole and Ka'anapali Beach, perfect for spotting playful dolphins and whales.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Lahaina",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Royal Kahana Maui by OUTRIGGER",
    "offer_address": "4365 Lower Honoapiilani Road, Lahaina, Hawaii 96761, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 227.0,
    "value": 227.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004SYk6AAG",
    "hero_image": "https://images.luxuryescapes.com/5fntyxeiedh8r75ny451",
    "image_two": "https://images.luxuryescapes.com/ke3j1ar7ygkgn998xwt",
    "image_three": "https://images.luxuryescapes.com/3lbwxuyh4lsg4ifm5nzc",
    "vendor_name": "Outrigger Reef Waikiki Beach Resort",
    "title": "OUTRIGGER Reef Waikiki Newly Refurbished Beachfront Escape",
    "description": "Hawaii’s sun-drenched beaches, picturesque bays and towering volcanic peaks are nothing short of tropical bliss. Experience it all with an escape to the iconic OUTRIGGER Reef Waikiki Beach Resort, a much-loved beachfront hideaway in the heart of Waikiki.\n\nPerfectly positioned directly on Waikiki Beach, where the city meets the sea, OUTRIGGER Reef Waikiki Beach Resort is the place to be following a spectacular US$80 million refurbishment. Resort upgrades include a complete refresh of all guestrooms, an overhaul of the onsite restaurants and bars, plus a plethora of newly created wellness and fitness experiences, including state-of-the-art Peloton and Technogym equipment. A stay at this stylish oasis will leave you feeling reinvigorated, recharged and inspired.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "OUTRIGGER Reef Waikiki Beach Resort",
    "offer_address": "2169 Kālia Rd, Honolulu, HI 96815, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 270.0,
    "value": 270.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRz5NAAT",
    "hero_image": "https://images.luxuryescapes.com/ecb4uyocyo1amrpj933",
    "image_two": "https://images.luxuryescapes.com/swd8lbsc4kghj2aiac4j",
    "image_three": "https://images.luxuryescapes.com/bb981n53c3s74f9rxrg",
    "vendor_name": "Palms at Wailea Maui",
    "title": "Enchanting Maui Self-Contained Villa Oasis near Wailea Beach with Lush Tropical Gardens & Pool",
    "description": "Get a taste of pure paradise at this Maui oasis, moments from the sun-drenched shores of Wailea Beach, where tranquility and natural beauty await. Strike the perfect balance between leisure and relaxation as you unwind by the pool or soak in the incredible ocean or garden views from your very own lanai. The Palms at Wailea Maui boasts self-contained villas designed with comfort and style in mind, for an island escape that will leave you refreshed and rejuvenated. \n\nOften referred to as the Valley Isle, Maui is renowned for its incredible landscapes and diverse terrain, from the lush valleys of Hana to the towering peaks of Haleakalā, it offers a slice of tropical bliss for every soul.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kihei",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Palms at Wailea Maui",
    "offer_address": "3200 Wailea Alanui Drive, Wailea, Hawaii 96753, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 257.0,
    "value": 257.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G1teNAAR",
    "hero_image": "https://images.luxuryescapes.com/kdqlvoxinxenj94qc4nce",
    "image_two": "https://images.luxuryescapes.com/1lrb3vwcxdnhlecdtlfg",
    "image_three": "https://images.luxuryescapes.com/3e5kvik2ha5uaemlwhdr",
    "vendor_name": "Outrigger Kona Resort and Spa",
    "title": "Hawaii Big Island Family Resort by Outrigger with Spa & Multi-Level Pool",
    "description": "Discover the magic of Hawaii at Outrigger Kona Resort and Spa, a family paradise on the sun-kissed shores of Hawaii's Big Island. This idyllic retreat is a stone's throw from vibrant Kailua-Kona town, brimming with historic sites and oceanfront dining. Kids and grown-ups alike will love the multi-level fantasy pool with a 200-foot water slide, manta-ray viewing and sweeping views of the Pacific Ocean. Hit the spa to relax and as the sun sets, savour the flavours of Hawaii at the resort's Wailele Café.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Kailua-Kona",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Outrigger Kona Resort and Spa",
    "offer_address": "78-128 Ehukai Street, Kailua-Kona, Hawaii 96740, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 228.0,
    "value": 228.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRz4jAAD",
    "hero_image": "https://images.luxuryescapes.com/puhfppu2kljvij7wz8t",
    "image_two": "https://images.luxuryescapes.com/a5suyz0nvdw4wr3y908b",
    "image_three": "https://images.luxuryescapes.com/fm6gwli30maupi95skaw",
    "vendor_name": "Waikiki Shore by OUTRIGGER",
    "title": "Coastal Hawaii OUTRIGGER Self-Contained Apartments Steps from Waikiki Beach",
    "description": "Step into a world of beachfront luxury with a stay at this coastal retreat, the only resort directly on the sands of Waikiki Beach. This prime location offers easy access to the vibrant Kalakaua Avenue, where a variety of high-end shopping, eclectic eateries and lively entertainment await, perfect for exploring by foot before beach swims.\n\nThe resort itself boasts spacious, self-contained apartments with breathtaking ocean views. Just a short stroll away, discover the historic Fort DeRussy Park, while the bustling Ala Moana Center, the world's largest open-air shopping centre, is a mere 15-minute walk away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Waikīkī Shore by OUTRIGGER",
    "offer_address": "2161 Kālia Road, Honolulu, Hawaii 96815, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 264.0,
    "value": 264.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRexAAAT",
    "hero_image": "https://images.luxuryescapes.com/l47aucphrmms5ypo9e2",
    "image_two": "https://images.luxuryescapes.com/wcvzqcvkgcbz7yex6jkp",
    "image_three": "https://images.luxuryescapes.com/sqbyjobr1ibl6zk70alm",
    "vendor_name": "Ala Moana Hotel by Mantra",
    "title": "Contemporary Honolulu Escape Near World's Largest Open-Air Mall with Two Onsite Restaurants",
    "description": "Immerse yourself in the tropical allure of Hawaii with a lavish stay at this stylish Honolulu abode, perfectly positioned beside the world's largest open-air shopping mall, the Ala Moana Centre. A short stroll from the glistening waters of the Pacific Ocean, the two-tower hotel features plush, well-appointed rooms and even a Starbucks in the lobby. In between exploring the vibrant Waikiki neighbourhood, cool off in the outdoor pool and soak up elegant views from the 36th-floor Signature Prime Steak & Seafood Restaurant.\n\nWork your way through high-end boutiques, surf shops and lively beach bars, or venture further afield to explore the historic Pearl Harbour or hike the scenic Diamond Head Crater, offering panoramic ocean vistas.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Honolulu",
    "location_heading": "Hawaii",
    "location_subheading": "United States",
    "location_description": "Ala Moana Honolulu by Mantra",
    "offer_address": "410 Atkinson Dr, Honolulu, HI 96814, United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRz5DAAT",
    "hero_image": "https://images.luxuryescapes.com/pbhru38t5w4corle5rls",
    "image_two": "https://images.luxuryescapes.com/d853f72h85flnfcxyuv",
    "image_three": "https://images.luxuryescapes.com/1xir2ijbftz6nmgy438b",
    "vendor_name": "Fairway Villas Waikoloa by OUTRIGGER",
    "title": "Hawaii Big Island Private Condo Escape on Kohala Coast with a Lava Rock Whirlpool Spa & Golf Course Views",
    "description": "Experience the tranquillity of Hawaii with a stay at this serene retreat on the Big Island's Kohala Coast. Part of a gated community, these self-contained condos provide access to the property's facilities, including an infinity pool and lava-rock whirlpool spa. Find yourself within minutes of Anaeho'omalu Bay, a perfect spot for a refreshing dip or a leisurely stroll. \n\nFor the golf enthusiasts, two championship golf courses are within easy reach. After a day of exploring the sights of Hawaii, retreat to your villa and enjoy a drink on your private lanai overlooking the lush golf course. Serene hues and uninterrupted views make this Hawaiian escape an absolute delight.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Hawaii",
    "offer_geo_area_level_2": "Waikoloa",
    "location_heading": "Hawaii",
    "location_subheading": "USA",
    "location_description": "Fairway Villas Waikoloa by Outrigger",
    "offer_address": "69-200 Pohakulana Place, Waikoloa, Hawaii 96738, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 172.0,
    "value": 172.0
  }
]