[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zmMPAAY",
    "hero_image": "https://images.luxuryescapes.com/1poy0i9poatxl52rgr2",
    "image_two": "https://images.luxuryescapes.com/68q2mkiqu75s9l0ik6",
    "image_three": "https://images.luxuryescapes.com/i1lojpwdobq3ofjpneic",
    "vendor_name": "Chateau Elan",
    "title": "Hunter Valley Five-Star Tuscan-Inspired Escape with Gourmet Wine & Cheese Tastings",
    "description": "Find the true meaning of tranquility in the vibrant rolling hills of the Hunter Valley at Château Élan at The Vintage Hunter Valley. Set in the heart of Australia’s premium wine country, this European-inspired five-star retreat brings a little piece of Tuscany to New South Wales, with laidback country elegance and high-end gastronomy. Rooms are designed to take full advantage of the location, with floor-to-ceiling windows, private terraces and balconies offering an elevated position overlooking the verdant greenery of the rolling hills and The Vintage golf course.\n\nRelish the delights of seasonal local produce and views over the golf course at Legends Grill or dine alfresco at Spike Bar. Practise your swing at the hotel’s award-winning 18-hole golf course designed by Greg Norman or watch the world go by at the 25-metre lap pool. If you’d rather unwind, the peaceful Hunter Valley Day Spa will help with relaxation, rejuvenation and recuperation. While leaving the hotel is optional, there’s more to see further afield - from wine and cheese tastings to early-morning hot-air balloon rides and exploring many walking or cycling trails.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 247.0,
    "value": 678.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EduOAAS",
    "hero_image": "https://images.luxuryescapes.com/ilil35fmmcfodwof9ye",
    "image_two": "https://images.luxuryescapes.com/h10r90y61vqmq9a87uf",
    "image_three": "https://images.luxuryescapes.com/cjlo1w9a3k1znwezph7f",
    "vendor_name": "Chateau Elan",
    "title": "European Elegance in the Hunter Valley with Wine & Cheese Tasting",
    "description": "Château Élan brings a little piece of Europe to the Hunter Valley with laidback country elegance and high-end gastronomy. Indulge the senses with daily plated breakfast, complimentary wine and cheese tasting at McLeish Estate Wines, a wine and cheese appreciation course at Hunter Valley Cheese (with purchases at exclusive members-only prices), a spirit tasting at Hunter Distillery, a complimentary Pukara Estate wine tasting, a welcome cocktail each, two A$25 spa credits to put towards individual treatments and 25% off green fees at The Vintage Golf Club.\n\n**Travelling with family?** Check out the One-Bedroom Villa Apartment upgrade - two kids aged 12 and under stay free (see Fine Print for details).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 227.0,
    "value": 542.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2sPrQAJ",
    "hero_image": "https://images.luxuryescapes.com/mojzlnk5poxyhifwo0zj",
    "image_two": "https://images.luxuryescapes.com/bnqpianaohjkq4eobjdl",
    "image_three": "https://images.luxuryescapes.com/mswvb98f6onx2hcqiizt",
    "vendor_name": "Grand Mercure The Vintage (Accor Vacation Club Account)",
    "title": "Resort-Style Wine Country Getaway Just Two Hours from Sydney",
    "description": "Leave the city behind for a laid-back self-catering escape in the heart of the Hunter Valley, one of Australia’s most celebrated wine regions and a foodie’s paradise. Enjoy a weekday getaway staying in a spacious and contemporary apartment at Grand Mercure The Vintage Accor Vacation Club Apartments, fitted with everything you might need with an 18-hole championship golf course, an award-winning restaurant and a heated outdoor pool at your fingertips. Your escape includes a complimentary drink per person at Legends Bar & Grill and convenient late checkout at 12pm.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Grand Mercure The Vintage Accor Vacation Club Apartments",
    "offer_address": "Vintage Dr, Rothbury NSW 2320",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 222.0,
    "value": 438.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biaxuQAA",
    "hero_image": "https://images.luxuryescapes.com/rarggwyvhsh6xnyxfeub",
    "image_two": "https://images.luxuryescapes.com/zdjz02xy3polx7pxty5v",
    "image_three": "https://images.luxuryescapes.com/tqzsvss5ss4l0t74aqmh",
    "vendor_name": "Chateau Elan",
    "title": "Award-Winning, Five-Star Indulgence in the Scenic Hunter Valley Region",
    "description": "Indulge in a year-round romantic escape in the world-famous Hunter Valley food and wine region at the multi-award-winning Chateau Elan. Discover the laid-back country lifestyle, high-end gastronomy and some of the country’s finest wines with a two or three-night stay with daily buffet breakfast, an entrée each to enjoy at Legends Grill, welcome cocktail, guaranteed late 12pm checkout, spa credits and golfing discounts.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Cessnock City Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Chateau Elan 2019",
    "offer_address": "Vintage Dr, Rothbury NSW 2320",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 253.0,
    "value": 696.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CHdndYAD",
    "hero_image": "https://images.luxuryescapes.com/t7kx79rkzbts6sf038",
    "image_two": "https://images.luxuryescapes.com/mmk9n8z68an9nbjiwgaf",
    "image_three": "https://images.luxuryescapes.com/chcs4a69ipzb6mfrk6jp",
    "vendor_name": "voco Kirkton Park Hunter Valley , an IHG Hotel",
    "title": "Elegant Hunter Valley Wine Country Estate with Daily Breakfast, Nightly Cocktails & Local Wine Tastings",
    "description": "Make this elegant Hunter Valley estate your base to explore Pokolbin's renowned cellar doors, artisan food makers, and craft distillers, all at your fingertips. Set among 70 acres of beautifully manicured gardens, with the rolling Broken Back Ranges as your backdrop, you’re perfectly placed to explore New South Wales' most cherished wine country.\n\nWatch sunlight filter through the French windows of The Conservatory during breakfast, all while looking out over the rose garden and mountains. Indulge in paddock-to-plate cuisine from the hotel's own gardens at Locavore Dining and curl up by the fire with a glass of regional wine at Epoche Lounge Bar.\n\nPokolbin has the highest concentration of wineries in the valley and most are under a 10-minute drive from voco™ Kirkton Park Hunter Valley, an IHG Hotel. Visit Tyrell's Wines, home to some of the world's oldest grape vines, pop up the street to Tulloch Wines' award-winning cellar door and return to your hotel for a swim in the indoor heated pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "voco Kirkton Park Hunter Valley by IHG",
    "offer_address": "336 Oakey Creek Road, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 309.0,
    "value": 725.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GfxGhAAJ",
    "hero_image": "https://images.luxuryescapes.com/kxa950vtm6bbl3l6j4ub",
    "image_two": "https://images.luxuryescapes.com/mecr7k144shdyp4wf05ri",
    "image_three": "https://images.luxuryescapes.com/p51fz3avcnqa2j56h1ea",
    "vendor_name": "Chateau Elan",
    "title": "Hunter Valley Tuscan-Inspired Spa Escape with Daily Breakfast, Cellar Door Tasting & Cheese Appreciation Course",
    "description": "Find the true meaning of tranquillity with a stay at Château Élan at The Vintage, a European-inspired retreat set in the picturesque rolling hills of the Hunter Valley, New South Wales' premier wine region. This estate is a little piece of Tuscany, with rooms designed to take full advantage of the verdant greenery of the valley and The Vintage Golf Course. Situated on an idyllic 100 acres, this property is a romantic rendezvous within two hours of Sydney, or just a one-hour drive from Newcastle Airport.\n\nSurrounded by vineyards and meandering cellar door wine trails, and home to an elegant restaurant overlooking the fairways, Château Élan at The Vintage is ideal for those seeking luxurious gourmet experiences. Relish the delights of seasonal local produce at Legends Restaurant or dine alfresco at Spike Bar. Practise your swing at the hotel’s award-winning 18-hole golf course designed by Greg Norman, or watch the world go by at the 25-metre lap pool. If you’d rather unwind, the offerings at Château Élan Day Spa are sure to help with relaxation, rejuvenation and recuperation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 66.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 289.0,
    "value": 840.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvpogQAB",
    "hero_image": "https://images.luxuryescapes.com/shtflxaky73rxiveoptq",
    "image_two": "https://images.luxuryescapes.com/zvmxduat5pn77zt0wzxj",
    "image_three": "https://images.luxuryescapes.com/ttogeeuzqjhbjqxpwufm",
    "vendor_name": "Chateau Elan",
    "title": "Five-Star Gourmet Hunter Valley Escape",
    "description": "Indulge in a year-round romantic escape in the world-famous Hunter Valley food and wine region at Chateau Elan at The Vintage. Includes daily cooked buffet breakfast, welcome cocktails, guaranteed late checkout, golfing discounts and saving on local gourmet experiences.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "NSW",
    "location_description": "Chateau Elan at The Vintage - 2018*",
    "offer_address": "Vintage Dr, Rothbury NSW 2320",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 242.0,
    "value": 625.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GPjUcAAL",
    "hero_image": "https://images.luxuryescapes.com/xlgxvaqgo96f9khgxrxf",
    "image_two": "https://images.luxuryescapes.com/drh4uounvhfm8ytpz97q",
    "image_three": "https://images.luxuryescapes.com/nbco1319ngpgg7s3h8vn",
    "vendor_name": "Rydges Resort Hunter Valley",
    "title": "Tranquil Hunter Valley Wine Country Escape with Daily Breakfast & VIP Wine-Tasting Experience",
    "description": "Go to where the wine flows, vines are rich and full, and lush hills endlessly roll. Perched among a myriad of cellar doors, Rydges Resort Hunter Valley offers the perfect countryside hideaway, just a few hours from Sydney. The region’s largest resort offers a tremendous number of things to see, sip and savour - settle into a pint at Sydney Brewery Hunter Valley, take a swing at Hunter Valley Golf Club or indulge among the vines at Ubika Spa. It’s also the place to sink your teeth into the Hunter Valley’s legendary farm-to-fork dining scene, with Redsalt Restaurant plating a five-course degustation ‘Behind the Vines’ experience - the perfect way to sample the region's best.\n\nWhen you’re ready to explore, Hunter Valley’s wine country has countless delights in store. Your package includes a VIP tasting experience for two at the offsite First Creek Wines, covering tipples from the winery’s award-winning Classic, Limited and Reserve Ranges. Alternative adventures include the Hunter Valley Gardens, Maitland Regional Art Gallery and one of the country’s most impressive arrays of local wineries and distilleries.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Lovedale",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Rydges Resort Hunter Valley",
    "offer_address": "430 Wine Country Drive, Lovedale, New South Wales 2325, Australia",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 287.0,
    "value": 533.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HpqVpYAJ",
    "hero_image": "https://images.luxuryescapes.com/xkclj3yerkv3x87ugvdo",
    "image_two": "https://images.luxuryescapes.com/7dwep8dbthb32xyk9gt5",
    "image_three": "https://images.luxuryescapes.com/bptqjjjwjrs2qwvdgyfc",
    "vendor_name": "Chateau Elan",
    "title": "Hunter Valley Tuscany-Inspired Spa Escape with Daily Breakfast & Cellar Door Wine Tastings",
    "description": "Find the true meaning of tranquillity with a stay at Château Élan at The Vintage, a European-inspired retreat set in the picturesque rolling hills of the Hunter Valley, New South Wales' premier wine region.\n\nThis estate is a little piece of Tuscany, with rooms designed to take full advantage of the valley's verdant greenery and The Vintage Golf Course. Situated on an idyllic 100 acres, this property is a romantic rendezvous within 2.5 hours of Sydney, or just a one-hour drive from Newcastle Airport.\n\nSurrounded by vineyards and meandering cellar door wine trails, and home to an elegant restaurant overlooking the fairways, Château Élan at The Vintage is ideal for those seeking luxurious gourmet experiences. Relish the delights of seasonal local produce at Legends Restaurant or dine alfresco at Spike Bar.\n\nPractise your swing at the hotel’s award-winning 18-hole golf course designed by Greg Norman, or watch the world go by at the 25-metre lap pool. If you’d rather unwind, the offerings at The Spa at Château Élan are sure to help with relaxation, rejuvenation and recuperation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 71.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 259.0,
    "value": 880.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GMxAAAW",
    "hero_image": "https://images.luxuryescapes.com/9hoskbjf6pvun0riroif",
    "image_two": "https://images.luxuryescapes.com/gv3tbxpi5w9to5fs2m8l",
    "image_three": "https://images.luxuryescapes.com/w3upvbkj2m9cbpyatyn7",
    "vendor_name": "Mercure Resort Hunter Valley Gardens",
    "title": "Romantic Hunter Valley Retreat with Daily Breakfast & Welcome Drinks",
    "description": "Swap the bustle of Sydney for a glass of shiraz and immerse yourself in the regional beauty of New South Wales with a stay at Mercure Resort Hunter Valley Gardens. Discover award-winning wines and epicurean indulgences on a sensual escape through rolling olive groves and vine-laced hills, before retreating to your central oasis to unwind in the landscaped gardens or outdoor pool.\n\nYour luxe escape includes daily gourmet breakfast, a welcome drink voucher each, a leisurely 12pm checkout and 15% off dining at the decadent éléments restaurant. Plus, soak up the stunning surrounds with 50% off Hunter Valley Gardens tickets.\n\n**Premium Picnic and Winery Experience Upgrade:** Looking to elevate your romantic escape to the next level? Check out the premium Winery Upgrade. Enjoy an exclusive tasting before choosing a bottle of delicious handpicked wine to enjoy with your generous picnic hamper and chocolates for two, all set up ready especially for you.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Mercure Resort Hunter Valley Gardens",
    "offer_address": "2090 Broke Rd, Pokolbin NSW 2320",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 179.0,
    "value": 389.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csdUsQAI",
    "hero_image": "https://images.luxuryescapes.com/lvj5jtdquafkrned6at",
    "image_two": "https://images.luxuryescapes.com/jakrvxr5pctnn71mhg3c",
    "image_three": "https://images.luxuryescapes.com/le1knac38tmzwstmpveh",
    "vendor_name": "Grand Mercure The Vintage (Accor Vacation Club Account)",
    "title": "Mid-Week Wine Country Apartment Stay with Winery Tour & Tastings",
    "description": "Leave the city behind for a laid-back, self-catering escape in the heart of the Hunter Valley, one of Australia’s most celebrated wine regions and a foodie’s paradise. Enjoy a weekday getaway staying in a spacious apartment at Grand Mercure The Vintage Accor Vacation Club Apartments, fitted with resort facilities including an 18-hole championship golf course, an award-winning restaurant and a heated outdoor pool. Your escape includes a complimentary drink per person at Legends Bar & Grill, convenient late checkout at 12pm, winetasting at Tyrell's Wines, tastings at Hunter Distillery and Pukara Estate, plus a AU$20 credit each for Heavenly Hunter Massage Centre.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Grand Mercure The Vintage Accor Vacation Club Apartments",
    "offer_address": "Vintage Dr, Rothbury NSW 2320",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 225.0,
    "value": 359.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LrDHAA0",
    "hero_image": "https://images.luxuryescapes.com/vyexqxppqv4ugvgqo2i",
    "image_two": "https://images.luxuryescapes.com/ek1d5bjwfikn8tgabj6k",
    "image_three": "https://images.luxuryescapes.com/cv9v21ashbcglu35spm",
    "vendor_name": "Oaks Cypress Lakes Resort",
    "title": "Hunter Valley Country Retreat with Wine-Tasting Experience",
    "description": "Leave city life behind and discover the serene beauty and vibrant rolling hills of the striking Hunter Valley wine region, brimming with gourmet delights and stunning vineyards. Find an apartment-style oasis in Pokolbin - located in the heart of New South Wales’ best wine region - staying at Oaks Cypress Lakes Resort. Includes a complimentary upgrade to a Premier Villa, daily buffet breakfast, a wine and cellar door experience at Brokenwood Wines (2019 Cellar Door of the Year) and A$50 food and drink credit to use at the resort.\n\n**Golf lover?** Check out the exclusive upgrade package, including access to the 18-hole championship golf course.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Cypress Lakes Resort",
    "offer_address": "15 Thompsons Rd, Pokolbin NSW 2320",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 204.0,
    "value": 432.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IUZlIAO",
    "hero_image": "https://images.luxuryescapes.com/5drj2k78ybikfy0d3gp",
    "image_two": "https://images.luxuryescapes.com/fhtz02r0zqq5hgsz9jho",
    "image_three": "https://images.luxuryescapes.com/fs17wgvxki3cv5ufu0xh",
    "vendor_name": "Rydges Resort Hunter Valley",
    "title": "Tranquil Hunter Valley Wine Country Escape with Daily Breakfast, Nightly Cocktail & Wine Tastings",
    "description": "Perched among a myriad of cellar doors, this resort is the perfect countryside hideaway, just a few hours from Sydney. The region’s largest resort offers a tremendous number of things to see, sip and savour - settle into a pint at Sydney Brewery Hunter Valley, take a swing at Hunter Valley Golf Club or relax among the vines at Ubika Spa.\n\nIt’s also the place to sink your teeth into the Hunter Valley’s legendary farm-to-fork dining scene, with Redsalt Restaurant plating a five-course degustation ‘Behind the Vines’ experience - the perfect way to sample the region’s best. When you’re ready to explore, Hunter Valley’s wine country has countless delights in store.\n\nTwo wine-tasting experiences are included, covering tipples from a premium selection of Brokenwood Varietal at Brokenwood Wines, and Single Vineyard wines at Pepper Tree Winery. Alternative adventures include the Hunter Valley Gardens, Maitland Regional Art Gallery and one of the country’s most impressive arrays of local wineries and distilleries.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Lovedale",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Rydges Resort Hunter Valley",
    "offer_address": "430 Wine Country Drive, Lovedale, New South Wales 2325, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 279.0,
    "value": 554.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2bmQQAR",
    "hero_image": "https://images.luxuryescapes.com/ue7kdqdpk6jlpexxbycb",
    "image_two": "https://images.luxuryescapes.com/x900qkjjhstch4cjyirw",
    "image_three": "https://images.luxuryescapes.com/ozgu9r8gihnzaie2ljho",
    "vendor_name": "Leisure Inn Pokolbin Hill",
    "title": "Relax Amidst One of Australia’s Oldest Wine Regions",
    "description": "Leave city life behind for fine wine and gourmet dining in the beautiful Hunter Valley - just over a two-hour drive north of Sydney - staying at Leisure Inn Pokolbin, set in 25 scenic countryside acres. Your escape includes tour passes for Tyrell’s Wines historic winery, complimentary tennis court hire, guaranteed late checkout at 11am, complimentary DVD hire up to the value of AU$20, unlimited Wi-Fi and a 10% discount at The Vines Cafe, Bar and Restaurant.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Cessnock City Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Leisure Inn Polkobin Hill OLD*",
    "offer_address": "485 McDonalds Rd, Pokolbin NSW 2320",
    "percentage_discount": 71.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 117.0,
    "value": 403.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zmMjAAI",
    "hero_image": "https://images.luxuryescapes.com/62bnvk9vjk96dmv11vg",
    "image_two": "https://images.luxuryescapes.com/yjbln6zirlvkl52c7ck7",
    "image_three": "https://images.luxuryescapes.com/qjvkozvr5kx8dks8i5i",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "Hunter Valley Newly Renovated Leading Wellness Retreat with Exclusive All-Inclusive Packages & Retreat Credit",
    "description": "Find your happy place at the newly renovated Elysia Wellness Retreat, one of Australia’s leading wellness sanctuaries in the heart of the Hunter Valley acclaimed wine country. Take a moment for yourself, far from the distractions of the every day, and become completely immersed in nature -  and among the vines - at this wellness sanctuary. \n\nBe among the first to experience the retreat's newly refurbished Premium One-Bedroom Villas, completed in December 2021. Stretch out, relax and take a deep breath with daily yoga classes, soothe your soul with guided tai chi lessons at sunrise, and take advantage of the pristine Hunter Valley vistas on this all-inclusive escape curated exclusively for Luxury Escapes’ customers. Nestled in the picturesque Hunter Valley - Australia’s oldest wine-making region - Elysia Wellness Retreat is a welcome escape from reality. Experience laidback, all-inclusive luxury staying at Tripadvisor’s #1 hotel in Pokolbin, where you can relax, recharge and reset with a dip in the indoor and outdoor swimming pool, enjoy an afternoon round of tennis, or cosy up by the fire. Surrounded by panoramic views of wine country, this retreat focuses on yoga, rest and wholesome meals to soothe your soul.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Elysia Wellness Retreat",
    "offer_address": "165 Thompsons Road, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 26.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 639.0,
    "value": 861.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CtsIbYAJ",
    "hero_image": "https://images.luxuryescapes.com/62d7gnoag13evt5d35",
    "image_two": "https://images.luxuryescapes.com/exwarif55eocmyjj6z1e",
    "image_three": "https://images.luxuryescapes.com/bsng4fk83480oqbx8xv",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "Serene Hunter Valley Wellness Retreat with Top-Rated Spa & Retreat Credit + All-Inclusive Dining Upgrades Available",
    "description": "Experience laidback luxury at one of Australia’s leading wellness sanctuaries in the heart of the Hunter Valley's acclaimed wine country. Take a moment for yourself, far from the distractions of daily life, and become completely immersed in nature, among the vines.\n\nStretch out, relax and take a deep breath with daily wellness classes, soothe your soul with guided tai chi lessons at sunrise and take advantage of pristine Hunter Valley vistas. Whether you are seeking a self-guided adventure or a wellness retreat tailored for one or two guests, Elysia Wellness Retreat has unique experiences suited to your needs.\n\nSurrounded by lush greenery in Australia’s oldest wine-making region, Elysia Wellness Retreat is a welcome escape from reality. You’d be forgiven for thinking you were in Italy, with rolling hills and olive groves sprawling out as far as the eye can see. Cultural sites and World Heritage-listed parks are also worth exploring, should you choose to venture out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Elysia Wellness Retreat",
    "offer_address": "165 Thompsons Road, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 279.0,
    "value": 441.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mp61AAA",
    "hero_image": "https://images.luxuryescapes.com/lwxoxa0lr3qgfulxi8d",
    "image_two": "https://images.luxuryescapes.com/m1dknfglduz142u4mo2x",
    "image_three": "https://images.luxuryescapes.com/vo85k5v6hnyfbignk5p",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "Bestselling Hunter Valley Wellness Retreat with All-Inclusive Dining, Daily Spa Access & Activities",
    "description": "Experience laidback, all-inclusive luxury at the newly renovated Elysia Wellness Retreat, one of Australia’s leading wellness sanctuaries in the heart of the Hunter Valley's acclaimed wine country. Take a moment for yourself, far from the distractions of the every day, and become completely immersed in nature - and among the vines - at this wellness retreat. Stretch out, relax and take a deep breath with daily yoga classes, soothe your soul with guided tai chi lessons at sunrise, and take advantage of the pristine Hunter Valley vistas. Surrounded by panoramic views of wine country, this retreat focuses on yoga, rest and wholesome meals to soothe your soul.\n\nSurrounded by lush greenery in Australia’s oldest wine-making region, Elysia Wellness Retreat is a welcome escape from reality. You'd be forgiven for thinking you were in Italy, with rolling hills and olive groves sprawling out as far as the eye can see, along with Aboriginal cultural sites and World Heritage-listed parks to explore should you choose to venture out from your slice of paradise.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Elysia Wellness Retreat",
    "offer_address": "165 Thompsons Road, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 659.0,
    "value": 983.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvYXqAAN",
    "hero_image": "https://images.luxuryescapes.com/3jw1xzj2egkdkrvesxng",
    "image_two": "https://images.luxuryescapes.com/g6fie3lcugeiwcqat5th",
    "image_three": "https://images.luxuryescapes.com/vap5iladpk1kdg4qwrv6",
    "vendor_name": "Oaks Cypress Lakes Resort",
    "title": "Elegant Hunter Valley Villa Retreat with Premier Upgrade & Complimentary Wine Tasting",
    "description": "Leave city life behind and discover the vibrant rolling hills and boundless serenity of the Hunter Valley with a villa escape at Oaks Cypress Lakes Resort, perfectly set in the heart of historic Pokolbin, one of Australia's most cherished wine countries. This self-contained apartment-style oasis is an idyllic hideaway featuring laidback country elegance, high-end gastronomy and no shortage of championship golf. Villas are designed to take full advantage of the location, with private balconies offering an elevated position overlooking boundless rambling hinterland.\n\nRelish the delights of seasonal plates and golf course views at Cypress Lakes Bistro & Bar, or indulge in a culinary journey inspired by Pokolbin's soaring history at Oak & Vine. Practise your swing at the picturesque 18-hole golf course - the annual host of The Players Series Hunter Valley championship - or enjoy a soak in the resort's steaming jacuzzi. Journey further afield to discover the Hunter Valley's rich tapestry of bespoke experiences, from wine and cheese tastings to early-morning hot air balloon rides and superb bushwalking trails.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Cypress Lakes Resort",
    "offer_address": "15 Thompsons Road, Pokolbin, Hunter Valley, New South Wales 2320, Australia",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 233.0,
    "value": 384.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3Ic5QAF",
    "hero_image": "https://images.luxuryescapes.com/j1emk0o4puxcqve1izu9",
    "image_two": "https://images.luxuryescapes.com/mgdgakjkkm8o3t3eciwf",
    "image_three": "https://images.luxuryescapes.com/f0b45vws0yph763untm9",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "All-Inclusive Golden Door Health and Wellness Retreat with Daily Wellbeing Activities",
    "description": "Whether you’re settling back on the balcony and watching the kangaroos feed at dusk, enjoying the indoor or outdoor pool or relaxing in your luxurious villa, the exclusive, hilltop Golden Door Elysia Health Retreat & Spa is a welcome sanctuary from reality. Recently voted ‘Australia’s Best Wellness Retreat 2018’ in the World Spa Awards, Golden Door invites you to stay in a one-bedroom villa and enjoy all-inclusive, daily gourmet meals (breakfast, lunch, dinner, morning tea and afternoon tea) designed to nourish and detox the body, daily fitness and wellbeing activities, daily seminar, access to the on-site, high-end facilities, a retreat credit and a complimentary guest speaker session on Saturday evening.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Cessnock City Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Golden Door Elysia Health Retreat and Spa - Nov 2018",
    "offer_address": "165 Thompsons Rd, Pokolbin NSW 2320",
    "percentage_discount": 26.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 612.0,
    "value": 823.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004h7TsAAI",
    "hero_image": "https://images.luxuryescapes.com/hd2gyssllmzw84aosv399",
    "image_two": "https://images.luxuryescapes.com/mvnu4co662xw8u6nrk4s",
    "image_three": "https://images.luxuryescapes.com/pusuwlwga22n6xmfoga",
    "vendor_name": "Wandin Valley Estate",
    "title": "Tuscan-Inspired Hunter Valley Luxury Cottage for Eight Guests with Dining Credit & Wine Tasting",
    "description": "Join your friends and family on an indulgent escape in the vibrant rolling hills of the Hunter Valley at Wandin Valley Estate's exclusive Oliver's Cottage - a beautifully designed four-bedroom, four-bathroom abode for up to eight guests. Blessed with a spectacular location in the Lovedale area of the Lower Hunter Valley, Wandin Valley Estate brings a little piece of Tuscany to New South Wales, with laidback country elegance and decadent gastronomy.\n\nIdeal for groups, this self-contained cottage is perfectly positioned amid the estate's glorious private bushland. Make yourself at home among four ensuite bedrooms - each with private balconies and individual keypad access - a large open-plan living area and private sheltered alfresco space offering unrivalled views over the verdant greenery of Australia’s premium wine country. Unwind by the open fire, cook up feasts in your private kitchen or on the BBQ, or wander over to Wandin Valley Estate's cellar door and restaurant, where Head Chef John Rutherford and his team are happy to do all the hard work for you.\n\n**Your handpicked inclusions:**\n\n- Enjoy A$50 drinks and dining credit per couple for use at the onsite restaurant or cellar door\n- Savour a one-time afternoon premium wine tasting experience for your group\n- Toast your escape with two complimentary bottles of 2019 Wandin Estate Rosé\n- Delight in a delicious cheese platter with a selection of cheeses, quince, Wandin honey and crisps",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Lovedale",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Wandin Valley Estate",
    "offer_address": "12 Wilderness Rd, Lovedale NSW 2320, Australia",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 1133.0,
    "value": 1606.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LrLEAA0",
    "hero_image": "https://images.luxuryescapes.com/p6zbq73ir6k2z1cqax8",
    "image_two": "https://images.luxuryescapes.com/r34ldd2ydvw0ykpj36k",
    "image_three": "https://images.luxuryescapes.com/9r0n2g70youm8rfgpk2i",
    "vendor_name": "Chateau Elan",
    "title": "European Elegance in the Hunter Valley with Wine & Cheese Tastings",
    "description": "Château Élan brings a little piece of Europe to the Hunter Valley with laid-back country elegance and high-end gastronomy. Indulge the senses with daily buffet breakfast, a complimentary wine and cheese tasting at McLeish Estate Wines, a wine and cheese appreciation course at Hunter Valley Cheese (with purchases at exclusive members-only prices), a spirit tasting at Hunter Distillery, a complimentary Pukara Estate tasting, a welcome cocktail, two A$25 spa credits to put towards individual treatments and 25% off green fees at The Vintage Golf Course.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 222.0,
    "value": 529.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxSmkAAF",
    "hero_image": "https://images.luxuryescapes.com/krrkcht0wu8u2p2kgjj7",
    "image_two": "https://images.luxuryescapes.com/rs9oyhwwyn6fwug562a",
    "image_three": "https://images.luxuryescapes.com/y9ppypqwl4qy5nzkwe3u",
    "vendor_name": "Rydges Resort Hunter Valley",
    "title": "Tranquil Hunter Valley Wine Country Escape with Daily Breakfast, Wine Tasting & Dining Credit",
    "description": "Escape to where the wine flows, vines are rich and full, and lush hills endlessly roll. Perched among a myriad of cellar doors, Rydges Resort Hunter Valley offers the perfect countryside hideaway, just a few hours from Sydney. The region’s largest resort offers a tremendous number of things to see, sip and savour - settle into a pint at Sydney Brewery Hunter Valley, take a swing at Hunter Valley Golf Club or relax among the vines at Ubika Spa. It’s also the place to sink your teeth into the Hunter Valley’s legendary farm-to-fork dining scene, with Redsalt Restaurant plating a five-course degustation ‘Behind the Vines’ experience - the perfect way to sample the region's best.\n\nWhen you’re ready to explore, Hunter Valley’s wine country has countless delights in store. Your package includes a VIP tasting experience for two at Brokenwood Winery, covering tipples from the winery’s premium selection of Brokenwood Varietal and Single Vineyard wines. Alternative adventures include the Hunter Valley Gardens, Maitland Regional Art Gallery and one of the country’s most impressive arrays of local wineries and distilleries.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Lovedale",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Rydges Resort Hunter Valley",
    "offer_address": "430 Wine Country Drive, Lovedale, New South Wales 2325, Australia",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 293.0,
    "value": 542.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HpsuEYAR",
    "hero_image": "https://images.luxuryescapes.com/naydom2shmfs7uz5xcp",
    "image_two": "https://images.luxuryescapes.com/ij5brw3b99owkqp25hak",
    "image_three": "https://images.luxuryescapes.com/vty57tg0u8szyl9c5hr",
    "vendor_name": "Rydges Resort Hunter Valley",
    "title": "Hunter Valley Wine Country Hideaway with Daily Breakfast, Nightly Cocktails & Wine Tastings",
    "description": "Perched among a myriad of cellar doors, this resort is the perfect countryside hideaway, just a few hours from Sydney. The region’s largest resort offers a tremendous number of things to see, sip and savour - settle into a pint at Sydney Brewery Hunter Valley, take a swing at Hunter Valley Golf Club or relax among the vines at Ubika Day Spa.\n\nIt’s also the place to sink your teeth into the Hunter Valley’s legendary farm-to-fork dining scene, with Redsalt Restaurant plating a five-course degustation ‘Behind the Vines’ experience - the perfect way to sample the region’s best. When you’re ready to explore, Hunter Valley’s wine country has countless delights in store.\n\nTwo wine-tasting experiences are included, covering tipples from a premium selection at Briar Ridge Vineyard and Single Vineyard wines at Pepper Tree Wines. Alternative adventures include the Hunter Valley Gardens, Maitland Regional Art Gallery and one of the country’s most impressive arrays of local wineries and distilleries.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Lovedale",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Rydges Resort Hunter Valley",
    "offer_address": "430 Wine Country Drive, Lovedale, New South Wales 2325, Australia",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 251.0,
    "value": 512.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fld1LAAR",
    "hero_image": "https://images.luxuryescapes.com/6ftgy6uv8n9uzcxcsc4i",
    "image_two": "https://images.luxuryescapes.com/j4hkm3ed5mhx5olm2hi",
    "image_three": "https://images.luxuryescapes.com/38vq4tzvzpn7ruwqdx7k",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "Serene Hunter Valley Wellness Retreat with All-Inclusive Dining, Top-Rated Spa & Retreat Credit",
    "description": "Experience laidback luxury at the boutique Elysia Wellness Retreat, one of Australia’s leading wellness sanctuaries in the heart of the Hunter Valley's acclaimed wine country. Take a moment for yourself, far from the distractions of daily life, and become completely immersed in nature - and among the vines - at this wellness retreat. Stretch out, relax and take a deep breath with daily yoga classes, soothe your soul with guided tai chi lessons at sunrise and take advantage of pristine Hunter Valley vistas - all of this with all-inclusive dining. Surrounded by panoramic views of wine country, this retreat focuses on yoga, rest and wholesome meals to soothe your soul.\n\nSurrounded by lush greenery in Australia’s oldest wine-making region, Elysia Wellness Retreat is a welcome escape from reality. You'd be forgiven for thinking you were in Italy, with rolling hills and olive groves sprawling out as far as the eye can see, along with cultural sites and World Heritage-listed parks to explore should you choose to venture out from your slice of paradise.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Elysia Wellness Retreat",
    "offer_address": "165 Thompsons Road, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 589.0,
    "value": 879.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvaKKAAZ",
    "hero_image": "https://images.luxuryescapes.com/fmmlnyclnahnn2x7yh8",
    "image_two": "https://images.luxuryescapes.com/2saubw0oma9t47qp9obh",
    "image_three": "https://images.luxuryescapes.com/ryotkitusqo0ciutjdj",
    "vendor_name": "Wandin Valley Estate",
    "title": "Tuscan-Inspired Hunter Valley Vineyard Hideaway with Self-Contained Cottages, Breakfast Hamper & Premium Wine Tasting",
    "description": "Leave it all behind for the vibrant rolling hills of the Hunter Valley at this beautifully designed retreat, boasting an intimate collection of self-contained cottages and villas. Perfect for a romantic escape or group get-together, Wandin Valley Estate takes full advantage of its location, with beautifully designed open-plan living and unrivalled views over the verdant greenery of New South Wales' premium wine country. When you're not busy sampling exquisite drops at the surrounding vineyards or onsite cellar door, take a dip in the estate's tranquil swimming pool, featuring a stunning landscaped backdrop. Retreat to your abode and cook up a feast in your private kitchen, or wander over to Wandin Kitchen restaurant where a locally sourced menu features ingredients picked straight from the onsite garden.\n\nWhile in the Hunter Valley, take a drive and explore the region's offerings, which not only include hundreds of bespoke wineries, but also a wealth of opportunities to get out in nature. Explore the romantic Hunter Valley Gardens, Wildlife Park and hot air ballooning, all just a short drive away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Lovedale",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Wandin Valley Estate",
    "offer_address": "12 Wilderness Rd, Lovedale NSW 2320, Australia",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 1019.0,
    "value": 1557.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004h7KWAAY",
    "hero_image": "https://images.luxuryescapes.com/bb7z46a9tw6luveui33v",
    "image_two": "https://images.luxuryescapes.com/ncj8gvxwaeywv1e0nou5",
    "image_three": "https://images.luxuryescapes.com/qk0uwvf9czzbwekf5g9w",
    "vendor_name": "Wandin Valley Estate",
    "title": "Tuscan-Inspired Hunter Valley Group Villa for Eight Guests with Dining Credit & Wine Tasting",
    "description": "Get together with friends or family and escape to the vibrant rolling hills of the Hunter Valley at Wandin Valley Estate's Villa Zara - an ultra-luxe four-bedroom, four-bathroom villa for eight guests. Blessed with a spectacular location in the Lovedale area of the Lower Hunter Valley, Wandin Valley Estate brings a little piece of Tuscany to New South Wales, with laidback country elegance and decadent gastronomy.\n\nPerfect for families or groups, this self-contained villa takes full advantage of its location, with a large open-plan living area and private gardens nestled into the mountain slope, overlooking the verdant greenery of Australia’s premium wine country. Winter calls for cosy nights by the large open log fire, while the private outdoor BBQ is perfect for a summer feast with friends. Don't feel like cooking? Wander over to Wandin Valley Estate's cellar door and restaurant, where Head Chef John Rutherford and his team are happy to do all the hard work for you.\n\n**Your handpicked inclusions:**\n\n- Enjoy A$50 drinks and dining credit per couple for use at the onsite restaurant or cellar door\n- Savour a one-time afternoon premium wine tasting experience for your group\n- Toast your escape with two complimentary bottles of 2019 Wandin Estate Rosé\n- Delight in a delicious cheese platter with a selection of cheeses, quince, Wandin honey and crisps\n\n**Travelling with a larger group?** This villa can accommodate up to 12 guests: two additional guests may stay free of charge and a further two may stay for a surcharge (see package for details). Please note, extra guests will not receive inclusions.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Lovedale",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Wandin Valley Estate",
    "offer_address": "12 Wilderness Rd, Lovedale NSW 2320, Australia",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 1259.0,
    "value": 1763.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z076AAA",
    "hero_image": "https://images.luxuryescapes.com/6excjw2c28odfcx5172",
    "image_two": "https://images.luxuryescapes.com/6mqa1a8cjvmzpuw7k59",
    "image_three": "https://images.luxuryescapes.com/7lseji8z8cut77dxcbf",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "All-Inclusive Hunter Valley Wellness Retreat with Mind & Body Classes & Spa Credit",
    "description": "Nestled in the picturesque Hunter Valley - Australia’s oldest wine-making region - Elysia Wellness Retreat is a welcome escape from reality. Experience laidback, all-inclusive luxury staying at TripAdvisor’s #1 hotel in Pokolbin, where you can relax, recharge and reset.\n\nSurrounded by panoramic views of wine country, this retreat focuses on yoga, rest and wholesome meals to soothe your soul. Enjoy all-inclusive daily gourmet breakfast, lunch and dinner with morning and afternoon tea, one A$50 credit per person, per stay to put towards spa and wellness experiences, a daily mind and body program of pilates, yoga and guided meditation, plus access to the onsite spa, activity studios, resort pools and relaxation lounges.\n\n**Travelling solo?** Choose our luxury Solo Wellness Retreat package, a chance to take time that's just for you.\n\n**Wants some more 'me' time?** Upgrade to the indulgent five-night escape with solo and couple options available. Plus, enjoy A$150 spa credit per person, per stay, for that added touch of luxury.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Cessnock City Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Elysia Wellness Retreat 2020",
    "offer_address": "165 Thompsons Rd, Pokolbin NSW 2320",
    "percentage_discount": 23.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 619.0,
    "value": 807.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000NNULxAAP",
    "hero_image": "https://images.luxuryescapes.com/etx0gazfq8rezzzk44fg",
    "image_two": "https://images.luxuryescapes.com/grkmzkq3g5nqhlpcftvf",
    "image_three": "https://images.luxuryescapes.com/hpyafc2nmhg12wwthccc",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "World-Class Wellness Retreat in the Stunning Hunter Valley",
    "description": "Relax and rejuvenate with a two-night weekend escape to the idyllic Golden Door Health Retreat Elysia. Boasting a hilltop location with spectacular views overlooking the Hunter Valley in NSW, this highly-acclaimed retreat offers a holistic approach to wellbeing, through a combination of daily activities and classes, seminars, spa treatments and nourishing cuisine. Enjoy a couples' escape with two nights in a one-bedroom villa, all nutritious meals, daily activities, a $50 retreat credit each and a guest speaker session for just $1,399 for two adults, valued up to $2,330.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Cessnock City Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "NSW",
    "location_description": "The Golden Door Spa [207576] All-Inclusive Wellness Escape in the Stunning Hunter Valley",
    "offer_address": "165 Thompson Road Pokolbin",
    "percentage_discount": 26.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 650.0,
    "value": 874.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000daaA8QAI",
    "hero_image": "https://images.luxuryescapes.com/7rn2b6nj5ul5wqvtvqeb",
    "image_two": "https://images.luxuryescapes.com/58nw506sccgjs4495yt5",
    "image_three": "https://images.luxuryescapes.com/9ke9oc5ebpgos5h0wwci",
    "vendor_name": "Mercure Resort Hunter Valley Gardens",
    "title": "Romantic Hunter Valley Escape Minutes' Walk from Top Wineries",
    "description": "Discover the serene beauty and vibrant rolling hills of the Hunter Valley wine region, brimming with gourmet delights and famed vineyards, with a stay at the Mercure Resort Hunter Valley Gardens. Enjoy daily buffet breakfast, two complimentary desserts when dining at the stylish Elements bar and restaurant, a welcome glass of house wine or beer on arrival, 50% discount on tickets to the gorgeous Hunter Valley Gardens and a convenient 12 noon checkout. Plus, receive an exclusive Experience Passport, entitling you to discounts at a local winery, distillery and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Mercure Resort Hunter Valley Gardens",
    "offer_address": "2090 Broke Rd, Pokolbin NSW 2320",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 182.0,
    "value": 431.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DcD83YAF",
    "hero_image": "https://images.luxuryescapes.com/y6ei7obw9c0toa6p4dxh",
    "image_two": "https://images.luxuryescapes.com/smmfonb4lnwd22ky0md",
    "image_three": "https://images.luxuryescapes.com/oy061bx6rrhskeiyz03",
    "vendor_name": "Oaks Cypress Lakes Resort",
    "title": "Elegant Hunter Valley Lakeside Villa Retreat with Daily Breakfast & Wine Tasting",
    "description": "Leave city life behind and discover the rolling hills and boundless serenity of the Hunter Valley at Oaks Cypress Lakes Resort. Perfectly set in historic Pokolbin, one of Australia's most cherished wine countries, this self-contained apartment-style oasis is an idyllic hideaway.\n\nVillas are designed to take full advantage of the location, with private balconies offering an elevated position overlooking boundless rambling hinterland. Journey further afield to discover the Hunter Valley's rich tapestry of bespoke experiences, from wine and cheese tastings to early-morning hot air balloon rides and superb bushwalking trails.\n\nRelish in the seasonal plates and golf course views at Cypress Lakes Bistro & Bar or indulge in a culinary journey inspired by Pokolbin's soaring history at Oak & Vine. For wine lovers, a complimentary wine-tasting experiences hosted by the award-winning Brokenwood Wines makes for the perfect afternoon out; alternatively, practice your swing at the picturesque 18-hole golf course - the annual host of The Players Series Hunter Valley championship.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Cypress Lakes Resort",
    "offer_address": "15 Thompsons Road, Pokolbin, Hunter Valley, New South Wales 2320, Australia",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 269.0,
    "value": 439.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Guz7KAAR",
    "hero_image": "https://images.luxuryescapes.com/hzv469l82igwtmdvs8cd",
    "image_two": "https://images.luxuryescapes.com/12g7yibysnkrlpje7woq",
    "image_three": "https://images.luxuryescapes.com/ijsy2vcrmw2o29x3kglh",
    "vendor_name": "The Convent Hunter Valley",
    "title": "Boutique Vineyard Escape in the Heart of the Hunter Valley with Local Wine, Daily Breakfast & One Italian Lunch",
    "description": "Framed by the verdant vineyards of Pokolbin, The Convent Hunter Valley delivers a luxurious stay and gourmet greatness in one of Australia's premier wine regions. Here, European elegance meets Hamptons-inspired decor in the stunning surroundings of the New South Wales countryside. Flock to this romantic retreat and be lured in by fine wines, sprawling vineyard vistas and timeless charm. Start the morning with a refined breakfast at Restaurant Eighty Eight before entertaining yourself with a relaxed game of boules or an energetic bout of tennis. As evening falls, take in sunset views at Pepper Tree Wines, located right next door, before sampling award-winning vintages, or dine on farm-to-fork organic fare at The Convent's Circa 1876 restaurant. \n\nLocated 2.5 hours outside Sydney, The Convent Hunter Valley puts you in prime position to experience all the best the region has to offer, with gardens and vineyards surrounding the property. Aside from sipping wines, fill your days sampling fresh produce at Hunter Valley Cheese Factory, Binnorie Dairy, and the Hunter Olive Centre - all within a delightful drive of the property. Or, embrace nature as you explore the region, hiking to Bimbadeen Lookout and Mount Bright Lookout for the best views, or venturing a little further out to explore by horseback at Chapman Valley Horse Riding.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "The Convent Hunter Valley",
    "offer_address": "88 Halls Road, Pokolbin 2320, New South Wales, Australia",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 365.0,
    "value": 991.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004h7BoAAI",
    "hero_image": "https://images.luxuryescapes.com/ysrbzzv4tqc9307u20in",
    "image_two": "https://images.luxuryescapes.com/ahd0blya8lwp2p7rsbtn",
    "image_three": "https://images.luxuryescapes.com/9y714zaiadhgcot8ma",
    "vendor_name": "Wandin Valley Estate",
    "title": "Tuscan-Inspired Hunter Valley Vineyard Luxury with Dining Credit & Wine Tasting",
    "description": "Leave it all behind for the vibrant rolling hills of the Hunter Valley at Wandin Valley Estate - a beautifully designed retreat boasting an intimate collection of self-contained accommodation for couples and small groups. Blessed with a spectacular location in the Lovedale area of the Lower Hunter Valley, Wandin Valley Estate brings a little piece of Tuscany to New South Wales, with laidback country elegance and decadent gastronomy.\n\nPerfect for a romantic escape or group gettogether, each self-contained studio and villa takes full advantage of its location, with beautifully designed open-plan living and unrivalled views over the verdant greenery of New South Wales' premium wine country. When you're not busy sampling exquisite drops at the surrounding vineyards or onsite cellar door, take a dip in the estate's tranquil swimming pool, featuring a stunning landscaped backdrop. Retreat to your abode and cook up a feast in your private kitchen, or wander over to Wandin Valley Estate's cellar door and restaurant, where Head Chef John Rutherford and his team are happy to do all the hard work for you.\n\n**Your handpicked inclusions:**\n\n- Enjoy A$50 dining credit per couple for use at the onsite restaurant\n- Savour a one-time afternoon premium wine tasting experience\n- Toast your escape with a complimentary bottle of 2019 Wandin Estate Rosé per couple\n- Delight in a delicious one-time cheese platter to share with a selection of cheeses, quince, Wandin honey and crisps\n\n**Travelling with a group?** Choose Alasdair's Place, Villa Angus or Villa Isabella for up to four guests. \n\n**Upgrade bonus:** receive a second bottle of Wandin Estate wine and double the dining credit per package (A$50 per couple) for the onsite restaurant",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Lovedale",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Wandin Valley Estate",
    "offer_address": "12 Wilderness Rd, Lovedale NSW 2320, Australia",
    "percentage_discount": 31.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 289.0,
    "value": 420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMQZQAA5",
    "hero_image": "https://images.luxuryescapes.com/uvjnzc260tbri9zic8tr",
    "image_two": "https://images.luxuryescapes.com/x64x9nmx3eu9qn1chao",
    "image_three": "https://images.luxuryescapes.com/gh7lf35hc4rwugqn5ur",
    "vendor_name": "Chateau Elan",
    "title": "Hunter Valley Tuscan-Inspired Spa Escape with Daily Breakfast, Cellar Door Tasting & Cheese Appreciation Course",
    "description": "Find the true meaning of tranquillity with a stay at Château Élan at The Vintage, a European-inspired retreat set in the picturesque rolling hills of the Hunter Valley, New South Wales' premier wine region. This estate is a little piece of Tuscany, with rooms designed to take full advantage of the verdant greenery of the valley and The Vintage Golf Course. Situated on an idyllic 100 acres, this property is a romantic rendezvous within two hours of Sydney, or just a one-hour drive from Newcastle Airport.\n\nSurrounded by vineyards and meandering cellar door wine trails, and home to an elegant restaurant overlooking the fairways, Château Élan at The Vintage is ideal for those seeking luxurious gourmet experiences. Relish the delights of seasonal local produce at Legends Restaurant or dine alfresco at Spike Bar. Practise your swing at the hotel’s award-winning 18-hole golf course designed by Greg Norman, or watch the world go by at the 25-metre lap pool. If you’d rather unwind, the offerings at Château Élan Day Spa are sure to help with relaxation, rejuvenation and recuperation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 70.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 274.0,
    "value": 920.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IeYz6AAF",
    "hero_image": "https://images.luxuryescapes.com/ujbfcb3klip629agjzb4",
    "image_two": "https://images.luxuryescapes.com/271wgkmgug87nzrne1sx",
    "image_three": "https://images.luxuryescapes.com/h8zll291qky4w3p0945",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "Serene Hunter Valley Wellness Retreat with Top-Rated Spa & Retreat Credit + All-Inclusive Dining Upgrades Available",
    "description": "Experience laidback luxury at one of Australia’s leading wellness sanctuaries in the heart of the Hunter Valley's acclaimed wine country. Take a moment for yourself, far from the distractions of daily life, and become completely immersed in nature - and among the vines. Stretch out, relax and take a deep breath with daily wellness classes, soothe your soul with guided tai chi lessons at sunrise and take advantage of pristine Hunter Valley vistas. Whether you are seeking a self-guided adventure or a wellness retreat tailored for one or two guests Elysia Wellness Retreat has unique wellness experiences suited to your needs.\n\nSurrounded by lush greenery in Australia’s oldest wine-making region, Elysia Wellness Retreat is a welcome escape from reality. You'd be forgiven for thinking you were in Italy, with rolling hills and olive groves sprawling out as far as the eye can see, along with cultural sites and World Heritage-listed parks to explore should you choose to venture out from your slice of paradise.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Elysia Wellness Retreat",
    "offer_address": "165 Thompsons Road, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 269.0,
    "value": 441.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000MQqAlAAL",
    "hero_image": "https://images.luxuryescapes.com/o0snpfdy9wbcvq58xexr",
    "image_two": "https://images.luxuryescapes.com/warylmt8pdo2nmtdkxyl",
    "image_three": "https://images.luxuryescapes.com/wccnn0fhkkuva4zcnxt7",
    "vendor_name": "Grand Mercure The Vintage Hunter Valley",
    "title": "Wine Lover's Escape in NSW’s Hunter Valley",
    "description": "Experience the gourmet delights and family friendly fun of the Hunter Valley with two nights for four people staying in a huge 90sqm Two Bedroom Apartment at the Grand Mercure Apartments The Vintage. Includes two bottles of wine, a late midday checkout and fantastic discounts on local experiences.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Cessnock City Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Grand Mercure Apartments The Vintage, Hunter Valley - 2018",
    "offer_address": "Vintage Dr, Rothbury NSW 2320",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 293.0,
    "value": 651.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hNO6AAM",
    "hero_image": "https://images.luxuryescapes.com/7cmpxbyob32ls75mnu6",
    "image_two": "https://images.luxuryescapes.com/w0wbrmzjgd5gx2p5pm",
    "image_three": "https://images.luxuryescapes.com/thktegkmclw6hkxcj7kt",
    "vendor_name": "Oaks Cypress Lakes Resort",
    "title": "Hunter Valley Self-Contained Villa Retreat with Daily Breakfast",
    "description": "Leave city life behind and discover the serene beauty and vibrant rolling hills of the striking Hunter Valley wine region at Oaks Cypress Lakes Resort. Set in the heart of Australia’s premium wine country, this apartment-style oasis is an idyllic hideaway featuring laidback country elegance and high-end gastronomy. Self-contained villas are designed to take full advantage of the location, with private balconies offering an elevated position overlooking the verdant greenery of the rolling hills.\n\nRelish the delights of seasonal local produce and views over the golf course at Cypress Lakes Bistro and Bar or indulge in fine dining at Oak & Vine restaurant. Should the sun be shining, practise your swing at the picturesque public 18-hole golf course, or enjoy a soak in the resort's jacuzzi. While leaving the hotel is optional, there’s more to see further afield - from wine and cheese tastings to early-morning hot air balloon rides and exploring many walking or cycling trails.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Cypress Lakes Resort",
    "offer_address": "15 Thompsons Rd, Pokolbin NSW 2320",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 281.0,
    "value": 614.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxqQFQAZ",
    "hero_image": "https://images.luxuryescapes.com/qsdeimnopx6cz442fsxk",
    "image_two": "https://images.luxuryescapes.com/jnxc6scpou0yrzedluph",
    "image_three": "https://images.luxuryescapes.com/itdspmikn6vazjdmuyzh",
    "vendor_name": "Estate Tuscany",
    "title": "Romantic Hunter Valley Winery Escape, NSW",
    "description": "Indulge in a two-night escape with your special someone at the award-winning four-star Estate Tuscany in the heart of the Hunter Valley. Stamped with a TripAdvisor Certificate of Excellence and home to a restaurant that was the 2017 winner of the Australian Good Food Guide Reader’s Choice Award, the estate is set amongst 26 acres of gorgeous countryside. Experience the best of Hunter wine country from this Tuscan-style accommodation with daily cooked breakfast, two AU$30 credits towards dinner at the esteemed The Mill restaurant, daily Wi-Fi, canapés on arrival and late checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Estate Tuscany - OLD",
    "offer_address": "Mistletoe Ln & Hermitage Rd, Pokolbin NSW 2320",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 159.0,
    "value": 443.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VomuAAC",
    "hero_image": "https://images.luxuryescapes.com/voqcro2lnpib75iqsn5j",
    "image_two": "https://images.luxuryescapes.com/uxiykk5dpb8ikl7gxxqa",
    "image_three": "https://images.luxuryescapes.com/fgkvmofxtrybo1ezh46c",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "All-Inclusive Hunter Valley Wellness Retreat with Mind & Body Classes & Spa Credit",
    "description": "Find your happy place at Elysia Wellness Retreat, Australia’s leading wellness sanctuary in the heart of Hunter Valley wine country. Make time to immerse yourself in the moment, surrounded by breathtaking nature, and connect with your breath on this wellness escape, with unique packages exclusively created for Luxury Escapes’ customers.\n\nNestled in the picturesque Hunter Valley - Australia’s oldest wine-making region - Elysia Wellness Retreat is a welcome escape from reality. Experience laidback, all-inclusive luxury staying at Tripadvisor’s #1 hotel in Pokolbin, where you can relax, recharge and reset. Surrounded by panoramic views of wine country, this retreat focuses on yoga, rest and wholesome meals to soothe your soul.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Cessnock City Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Elysia Wellness Retreat - Early 2021",
    "offer_address": "165 Thompsons Rd, Pokolbin NSW 2320",
    "percentage_discount": 26.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 629.0,
    "value": 847.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RAYruQAH",
    "hero_image": "https://images.luxuryescapes.com/q0wd2erxok4tadwvyxth",
    "image_two": "https://images.luxuryescapes.com/puczcpvynwa5d3h7me4v",
    "image_three": "https://images.luxuryescapes.com/vi4i0snahtkpmyegiykn",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "All-Inclusive Hunter Valley Wellness Retreat",
    "description": "Relax and rejuvenate with a two-night weekend escape to the idyllic Golden Door Elysia Health Retreat & Spa. Boasting a hilltop location with spectacular views overlooking the Hunter Valley in NSW, this highly acclaimed health retreat offers a holistic approach to wellbeing, through a combination of daily activities and classes, seminars, beauty and massage spa treatments and nourishing cuisine. Stay in a one-bedroom villa and enjoy all daily nutritious meals (breakfast, lunch, dinner, morning tea and afternoon tea), daily fitness and wellbeing activities, an AU$50 retreat credit and a complimentary guest speaker session for one adult.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Cessnock City Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Golden Door Elysia Health Retreat & Spa - MARCH 2018",
    "offer_address": "165 Thompsons Rd, Pokolbin NSW 2320",
    "percentage_discount": 26.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 651.0,
    "value": 877.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DRI5SAAX",
    "hero_image": "https://images.luxuryescapes.com/kbg9htei36a5zrtetej",
    "image_two": "https://images.luxuryescapes.com/qrku89838bxohq1vn54r",
    "image_three": "https://images.luxuryescapes.com/giqr8wlbokiqxcu4yeoe",
    "vendor_name": "Oaks Cypress Lakes Resort",
    "title": "Elegant Hunter Valley Villa Retreat with Daily Breakfast & Guaranteed Premier Upgrade",
    "description": "Leave city life behind and discover the vibrant rolling hills and boundless serenity of the Hunter Valley with a villa escape at Oaks Cypress Lakes Resort, perfectly set in the heart of historic Pokolbin, one of Australia's most cherished wine countries. This self-contained apartment-style oasis is an idyllic hideaway featuring laidback country elegance, high-end gastronomy and no shortage of championship golf - villas are designed to take full advantage of the location, with private balconies offering an elevated position overlooking boundless rambling hinterland.\n\nRelish the delights of seasonal plates and golf course views at Cypress Lakes Bistro & Bar, or indulge in a culinary journey inspired by Pokolbin's soaring history at Oak & Vine. Practise your swing at the picturesque 18-hole golf course - the annual host of The Players Series Hunter Valley championship - or enjoy a soak in the resort's steaming Jacuzzi. Journey further afield to discover the Hunter Valley's rich tapestry of bespoke experiences, from wine and cheese tastings to early-morning hot air balloon rides and superb bushwalking trails.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Cypress Lakes Resort",
    "offer_address": "15 Thompsons Road, Pokolbin, Hunter Valley, New South Wales 2320, Australia",
    "percentage_discount": 23.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 299.0,
    "value": 389.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zh1CAAQ",
    "hero_image": "https://images.luxuryescapes.com/rx87dpgrgh0yoiuvsapj",
    "image_two": "https://images.luxuryescapes.com/r6qmyuib4gok3rzwrt69",
    "image_three": "https://images.luxuryescapes.com/xbwd4nfs361mzbke35",
    "vendor_name": "Wandin Valley Estate",
    "title": "Tuscan-Inspired Hunter Valley Group Villa for Eight Guests with Dining Credit & Wine Tasting",
    "description": "Leave it all behind for the vibrant rolling hills of the Hunter Valley at Wandin Valley Estate's Villa Clare - a beautifully designed four-bedroom villa for up to eight guests. Blessed with a spectacular location in the Lovedale area of the Lower Hunter Valley, Wandin Valley Estate brings a little piece of Tuscany to New South Wales, with laidback country elegance and decadent gastronomy.\n\nPerfect for families or groups, this self-contained villa takes full advantage of its location, with a large open-plan living area and private sheltered alfresco space offering unrivalled views over the verdant greenery of Australia’s premium wine country. Cook up feasts in your private kitchen or on the BBQ, or wander over to Wandin Valley Estate's cellar door and restaurant, where Head Chef John Rutherford and his team are happy to do all the hard work for you.\n\n**Your handpicked inclusions:**\n\n- Enjoy A$50 drinks and dining credit per couple for use at the onsite restaurant or cellar door\n- Savour a one-time afternoon premium wine tasting experience for your group\n- Toast your escape with two complimentary bottles of 2019 Wandin Estate Rosé\n- Delight in a delicious cheese platter with a selection of cheeses, quince, Wandin honey and crisps\n\n**Travelling with a larger group?** This villa can accommodate up to 10 guests: two additional guests may stay free of charge (see package for details). Please note, extra guests will not receive inclusions.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Lovedale",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Wandin Valley Estate",
    "offer_address": "12 Wilderness Rd, Lovedale NSW 2320, Australia",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 1259.0,
    "value": 1763.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DoBGsAAN",
    "hero_image": "https://images.luxuryescapes.com/w305ddd0sf0u1tf1zic",
    "image_two": "https://images.luxuryescapes.com/r8esjjq8r9ib59h9b5a",
    "image_three": "https://images.luxuryescapes.com/2i0alcixu9q8ywngqgux",
    "vendor_name": "Chateau Elan",
    "title": "Hunter Valley Tuscan-Inspired Spa Escape with Gourmet Dining, Cellar Door Tastings & Cheese Appreciation Course",
    "description": "Find the true meaning of tranquillity with a stay at Château Élan at The Vintage, a European-inspired retreat set in the picturesque rolling hills of Australia’s premium wine country. This Hunter Valley estate brings a little piece of Tuscany to New South Wales, with rooms designed to take full advantage of the verdant greenery of the valley and The Vintage Golf Course. Situated on an idyllic 100 acres, this property is a romantic rendezvous within two hours of Sydney or just a one-hour drive from Newcastle Airport. \n\nSurrounded by vineyards, meandering cellar door wine trails and home to an elegant restaurant overlooking the fairways, Château Élan at The Vintage is ideal for those seeking luxurious gourmet experiences. Relish the delights of seasonal local produce at Legends Restaurant or dine alfresco at Spike Bar. Practise your swing at the hotel’s award-winning 18-hole golf course designed by Greg Norman, or watch the world go by at the 25-metre lap pool. If you’d rather unwind, The Château Élan Day Spa will help with relaxation, rejuvenation and recuperation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 66.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 289.0,
    "value": 840.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CtmMsYAJ",
    "hero_image": "https://images.luxuryescapes.com/qxfpglhvxgnchwd3jccn",
    "image_two": "https://images.luxuryescapes.com/4hdfiumxwtz4a9jnil8",
    "image_three": "https://images.luxuryescapes.com/bc5opcv16ola1l21mf",
    "vendor_name": "Chateau Elan",
    "title": "Hunter Valley Tuscan-Inspired Spa Escape with Daily Breakfast & Cellar Door Wine Tastings",
    "description": "Find the true meaning of tranquillity with a stay at Château Élan at The Vintage, a European-inspired retreat set in the picturesque rolling hills of the Hunter Valley, New South Wales' premier wine region.\n\nThis estate is a little piece of Tuscany, with rooms designed to take full advantage of the valley's verdant greenery and The Vintage Golf Course. Situated on an idyllic 100 acres, this property is a romantic rendezvous within two hours of Sydney, or just a one-hour drive from Newcastle Airport.\n\nSurrounded by vineyards and meandering cellar door wine trails, and home to an elegant restaurant overlooking the fairways, Château Élan at The Vintage is ideal for those seeking luxurious gourmet experiences. Relish the delights of seasonal local produce at Legends Restaurant or dine alfresco at Spike Bar.\n\nPractise your swing at the hotel’s award-winning 18-hole golf course designed by Greg Norman, or watch the world go by at the 25-metre lap pool. If you’d rather unwind, the offerings at The Spa at Château Élan are sure to help with relaxation, rejuvenation and recuperation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 70.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 279.0,
    "value": 941.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4ZZfQAN",
    "hero_image": "https://images.luxuryescapes.com/mm1guvnyuj3zt1juvcfe",
    "image_two": "https://images.luxuryescapes.com/mimphs5dibekz1ptgkob",
    "image_three": "https://images.luxuryescapes.com/azx1cvumqpcnkftzaubs",
    "vendor_name": "Leisure Inn Pokolbin Hill",
    "title": "Relaxing Break in Australia's Oldest Wine Region",
    "description": "Leave city life behind for fine wine and gourmet dining in the beautiful Hunter Valley - just over a two-hour drive north of Sydney - staying at Leisure Inn Pokolbin, set in 25 scenic countryside acres. Your escape includes tour passes for Tyrell’s Wines historic winery, complimentary tennis court hire, guaranteed late checkout at 11am, complimentary DVD hire up to the value of AU$20, unlimited Wi-Fi and a 10% discount at The Vines Cafe, Bar and Restaurant.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Cessnock City Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "NSW",
    "location_description": "Leisure Inn Pokolbin Hill Nov 2018",
    "offer_address": "485 McDonalds Rd, Pokolbin NSW 2320",
    "percentage_discount": 71.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 116.0,
    "value": 402.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LrlVAAS",
    "hero_image": "https://images.luxuryescapes.com/tub0nib96ce1q41chdrc",
    "image_two": "https://images.luxuryescapes.com/v4rhezo1rkgvrx5n87h9",
    "image_three": "https://images.luxuryescapes.com/ikdgycqpqm91bvll1rgk",
    "vendor_name": "Estate Tuscany",
    "title": "Hunter Valley Tuscan-Inspired Vineyard Escape with Chef-Hatted Restaurant",
    "description": "Enjoy a taste of Italy in the heart of the Hunter Valley at Estate Tuscany, nestled into the rolling green hills of Pokolbin. Surrounded by olive groves and 26 acres of beautiful countryside, this boutique retreat whisks you away from everyday life and into a Tuscan-inspired dream. Take a leisurely stroll from your room to The Mill restaurant, where Executive Chef William Townsend whips up chef-hatted fare to a backdrop of picturesque mountain views. Brokenback Bar is the perfect spot for a post-dinner glass of local wine, before retiring to your room and keeping an eye out for local wildlife grazing by your front door.\n\nSpend lazy days amid the hotel gardens, taking a dip in the outdoor pool or enjoying a tasting at Thomas Wines cellar door. Beyond the estate, the wider delights of the Hunter Valley beckon, from wine tours to nearby Tomaree National Park and Stockton Beach. This is your chance to switch off and make your Italian-inspired daydreams come alive without even leaving the country.\n\n**Your handpicked inclusions**\n\n- Head to The Breakfast Room each morning for a Continental or Tuscan breakfast\n- Try chef-hatted dining at The Mill with A$30 food credit per room, per stay\n- Arrive to welcome canapés at Brokenback Bar\n- Enjoy a leisurely morning with 11am checkout\n- Make the most of local discounts, including 30% off a mini vineyard bus tour\n- Stay connected with free Wi-Fi\n\n**Vineyard-View Upgrade**: Wake to views over the surrounding vineyards when you upgrade to the Vineyard-View Room - this is the ultimate in Hunter Valley romance.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Estate Tuscany",
    "offer_address": "Mistletoe Ln &, Hermitage Rd, Pokolbin NSW 2320",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 185.0,
    "value": 413.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bih1wQAA",
    "hero_image": "https://images.luxuryescapes.com/gpbwx0vzkdllapxvgm2x",
    "image_two": "https://images.luxuryescapes.com/pb5kdjnghrmenh2ms7jr",
    "image_three": "https://images.luxuryescapes.com/daioqfm0mbcdqyoql8aj",
    "vendor_name": "Spicers Guesthouse Hunter Valley",
    "title": "Experience the Hunter Valley’s Elegant New Wine Retreat",
    "description": "Welcome to the Hunter Valley’s newest wine retreat, the sophisticated Spicers Guesthouse. Located in Polkolbin, in the heart of New South Wales’ popular wine region, this elegant new hideaway boasts AU$30 million facilities, including modern rooms and Éremo Italian restaurant led by multi-hatted Executive Chef Cameron Matthews. Enjoy an AU$100 credit towards dinner, plus daily breakfast at Éremo, a bottle of Spicers Retreats vintage wine on departure and a leisurely late midday check-out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "NSW",
    "location_description": "Spicers Guesthouse",
    "offer_address": "Ekerts Rd, Pokolbin NSW 2320",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 200,
    "price": 316.0,
    "value": 670.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000db3tNQAQ",
    "hero_image": "https://images.luxuryescapes.com/qxtr8brh7pck1lv6x1fu8",
    "image_two": "https://images.luxuryescapes.com/ukno5yc2zebwvyeqdzaa",
    "image_three": "https://images.luxuryescapes.com/3fb6rezzypmt5bytvh1e",
    "vendor_name": "Elysia Wellness Retreat",
    "title": "All-Inclusive Health and Wellness Retreat with Daily Dining and Well-being Activities",
    "description": "Whether you’re settling back on the balcony and watching the kangaroos feed at dusk, enjoying the indoor or outdoor pool or relaxing in your luxurious suite, the exclusive, hilltop Elysia Wellness Retreat is a welcome sanctuary from reality. Experience laid back days at Tripadvisor's highest-rated hotel in Pokolbin, Elysia Wellness Retreat, staying in a One Bedroom Suite and enjoy all-inclusive, daily gourmet meals (breakfast, lunch, dinner, morning tea and afternoon tea) designed to nourish and detox the body, daily fitness and wellbeing activities, access to the on-site high-end facilities, a retreat credit and a complimentary guest speaker session on Saturday evening (not applicable to the five-night, mid-week stays).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Cessnock City Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Elysia Wellness Retreat September 2019",
    "offer_address": "165 Thompsons Rd, Pokolbin NSW 2320",
    "percentage_discount": 26.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 609.0,
    "value": 820.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HPubVYAT",
    "hero_image": "https://images.luxuryescapes.com/kmkeazufkn61vzteji0yo",
    "image_two": "https://images.luxuryescapes.com/uxvo2n15w3llneagn2e9",
    "image_three": "https://images.luxuryescapes.com/7qrefl6m8h08c0seudn7",
    "vendor_name": "voco Kirkton Park Hunter Valley , an IHG Hotel",
    "title": "Elegant Hunter Valley Estate with Daily Breakfast, Nightly Cocktails & Local Wine Tastings",
    "description": "Make this elegant Hunter Valley estate your base to explore Pokolbin's renowned cellar doors, artisan food makers and craft distillers, all at your fingertips. Set among 70 acres of beautifully manicured gardens, with the rolling Brokenback Ranges as your backdrop, you’re perfectly placed to explore New South Wales' most cherished wine country.\n\nWatch sunlight filter through the French windows of The Conservatory during breakfast, all while looking out over the rose garden and mountains. Indulge in paddock-to-plate cuisine from the hotel's own gardens at Locavore Dining and curl up by the fire with a glass of regional wine at Epoche Bar & Lounge. \n\nPokolbin has the highest concentration of wineries in the valley and most are under a 10-minute drive from the hotel. Visit Tyrrell's Wines, home to some of the oldest grape vines in Australia, or pop up the street to McLeish Estate's award-winning cellar door before returning to the hotel for a swim in the indoor heated pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "voco Kirkton Park Hunter Valley by IHG",
    "offer_address": "336 Oakey Creek Road, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 259.0,
    "value": 571.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000daZ3OQAU",
    "hero_image": "https://images.luxuryescapes.com/aq5i0xi36f0uhrj1wtv",
    "image_two": "https://images.luxuryescapes.com/blyjgh3ew7ih6qoagnj",
    "image_three": "https://images.luxuryescapes.com/bsfl45rplmeuabnl19p",
    "vendor_name": "Weekenda",
    "title": "Brand-New Villa Retreat in Hunter Valley Wine Country",
    "description": "Indulge in a quintessential vineyard stay in the heart of the world-famous Hunter Valley at IronBark Hill Estate. Perfect for couples looking for romance or groups wanting to experience all the Hunter Valley has to offer, IronBark Hill Estate boasts a collection of one and two-bedroom villas, a cellar door and an onsite bistro and brewery, making this the perfect location for a midweek escape. Enjoy a bottle of Peter Drayton wine on arrival, a leisurely late 12pm checkout and A$50 credit to be used towards food and drinks at IronBark Brewhouse bistro or at the cellar door.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Singleton Shire Council",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "IronBark Hill Estate - Hunter Valley Stays 2019",
    "offer_address": "694 Hermitage Rd, Pokolbin NSW 2320",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 216.0,
    "value": 418.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LnTIAA0",
    "hero_image": "https://images.luxuryescapes.com/47apy5g3l8arn8ykv4k",
    "image_two": "https://images.luxuryescapes.com/sk4yf72rbuqhcriln446",
    "image_three": "https://images.luxuryescapes.com/z0iix66u4c8bqbjq20p",
    "vendor_name": "Weekenda",
    "title": "Midweek Hunter Valley Villa Retreat with A$100 Food & Wine Credit",
    "description": "Indulge in a quintessential vineyard stay in the heart of the world-famous Hunter Valley at IronBark Hill Estate. Perfect for couples looking for romance or groups wanting to experience all the Hunter Valley has to offer, IronBark Hill Estate boasts a collection of beautifully styled villas, a cellar door and an onsite bistro and brewery, making this the perfect location for a midweek escape.\n\nEnjoy a bottle of Peter Drayton wine on arrival, a leisurely late 12pm checkout and A$100 credit to be used towards food and drinks at IronBark Brewhouse bistro or at the cellar door.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "IronBark Hill Estate - Hunter Valley Stays",
    "offer_address": "694 Hermitage Rd, Pokolbin NSW 2320",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 429.0,
    "value": 629.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y318yQAB",
    "hero_image": "https://images.luxuryescapes.com/if2jj5aqfwdpzztcmrlt",
    "image_two": "https://images.luxuryescapes.com/sbixnnihfy2txw6eko0k",
    "image_three": "https://images.luxuryescapes.com/yvdcrgdaccn93pwx738l",
    "vendor_name": "Mercure Resort Hunter Valley Gardens",
    "title": "Wine Country Gourmet Getaway",
    "description": "Discover the serene beauty and vibrant rolling hills of the striking Hunter Valley wine region, brimming with gourmet delights and stunning vineyards. New South Wales’ best wine region awaits with a two or three-night stay at the Mercure Resort Hunter Valley Gardens where you’ll enjoy daily buffet breakfast, two complimentary desserts when dining at the stylish éléments Bar & Dining, a welcome wine or beer on arrival, 50% discount on tickets to the gorgeous Hunter Valley Gardens and a convenient late 12pm checkout allowing you to make the most of your final day.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Mercure Resort Hunter Valley Gardens",
    "offer_address": "2090 Broke Rd, Pokolbin NSW 2320",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 184.0,
    "value": 464.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C1eLhAAJ",
    "hero_image": "https://images.luxuryescapes.com/0z7tguc2adpl8oj20xl",
    "image_two": "https://images.luxuryescapes.com/j5lrk92w2ry1bmbkwtm",
    "image_three": "https://images.luxuryescapes.com/q2i61bq1w4d8fus4kvwl",
    "vendor_name": "Chateau Elan",
    "title": "Hunter Valley Five-Star Tuscan-Inspired Escape with Gourmet Wine & Cheese Tastings",
    "description": "Find the true meaning of tranquility in the picturesque rolling hills of the Hunter Valley at Château Élan at The Vintage Hunter Valley. Set in the heart of Australia’s premium wine country, this European-inspired, five-star retreat brings a little piece of Tuscany to New South Wales, with laidback country elegance. Rooms are designed to take full advantage of the location, with floor-to-ceiling windows, private terraces or balconies offering an elevated position overlooking the verdant greenery of the rolling hills and The Vintage Golf Course.\n\nRelish the delights of seasonal local produce and views over the golf course at Legends Restaurant or dine alfresco at Spike Bar. If the sun is shining, practise your swing at the hotel’s award-winning 18-hole golf course designed by Greg Norman, or watch the world go by at the 25-metre lap pool. If you’d rather unwind, the peaceful Hunter Valley Day Spa will help with relaxation, rejuvenation and recuperation. And while leaving the hotel is optional, there’s more to see further afield - from wine and cheese tastings to early-morning hot air balloon rides (own expense) and exploring many walking or cycling trails.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 283.0,
    "value": 713.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004USdUAAW",
    "hero_image": "https://images.luxuryescapes.com/y3k72pb17gxn3djcfd5k",
    "image_two": "https://images.luxuryescapes.com/shplyx00t59sto8aq5l",
    "image_three": "https://images.luxuryescapes.com/6bukwdybxlp004pofkd",
    "vendor_name": "Chateau Elan",
    "title": "Five-Star Tuscan-Inspired Hunter Valley Escape with Gourmet Wine & Cheese Tastings",
    "description": "Find the true meaning of tranquility in the vibrant rolling hills of the Hunter Valley at Château Élan. Set in the heart of Australia’s premium wine country, this European-inspired five-star retreat brings a little piece of Tuscany to New South Wales, with laidback country elegance and high-end gastronomy. Rooms are designed to take full advantage of the location, with floor-to-ceiling windows, private terraces or balconies offering an elevated position overlooking the verdant greenery of the rolling hills and The Vintage golf course.\n\nRelish the delights of seasonal local produce and views over the golf course at Legends Grill or dine alfresco at Spike Bar. Should the sun be shining, practise your swing at the hotel’s award-winning 18-hole golf course designed by Greg Norman, or watch the world go by at the 25-metre lap pool. If you’d rather unwind, the peaceful Hunter Valley Day Spa will help with relaxation, rejuvenation and recuperation. And while leaving the hotel is optional, there’s more to see further afield - from wine and cheese tastings to early-morning hot air balloon rides and exploring many walking or cycling trails.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 243.0,
    "value": 584.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X91kFQAR",
    "hero_image": "https://images.luxuryescapes.com/k4alxapys2s0rjqxbik7",
    "image_two": "https://images.luxuryescapes.com/unizize9qp0buh7ma0sy",
    "image_three": "https://images.luxuryescapes.com/xstpmtzprzq12gsnjs7x",
    "vendor_name": "Hunter Valley Retreat",
    "title": "Hunter Valley Country Retreat in NSW",
    "description": "Explore the charms of the NSW countryside - from award-winning wineries to stunning National Parks, spending two nights amid nature at Hunter Valley Retreat, a secluded hideaway just 30-minutes from the world-famous Hunter Valley. Enjoy daily breakfast, a bottle of local wine and a leisurely late check-out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Quorrobolong",
    "location_heading": "Hunter Valley",
    "location_subheading": "NSW",
    "location_description": "Hunter Valley Retreat",
    "offer_address": "626 Sandy Creek Rd, Quorrobolong NSW 2325",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 107.0,
    "value": 225.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zX6XAAU",
    "hero_image": "https://images.luxuryescapes.com/gfgn1b45diri0ir11ac",
    "image_two": "https://images.luxuryescapes.com/i56py5s4rfe54j6ww4l",
    "image_three": "https://images.luxuryescapes.com/24zswr204jotldcqtxvf",
    "vendor_name": "Cedars Mount View",
    "title": "Romantic Hunter Valley Adults-Only Villas",
    "description": "Indulge in a year-round romantic escape in the world-famous Hunter Valley wine region at the ultra-luxe Cedars Mount View, a collection of private, self-contained villas dotted amid rolling greenery. Swap the bustle of city life for a glass of shiraz and immerse yourself in the mountainous beauty of regional New South Wales. Discover award-winning wines and epicurean indulgences on a sensual escape through rolling olive groves and vine-laced hills.\n\nAfter a busy day exploring the region, sink into your deep-soaking bathtub or enjoy the tranquility of your surroundings on your private deck. Add on romantic extras to make your stay extra-special: melt away with an in-villa massage or treat yourself to a charcuterie board or champagne, delivered to the comfort of your room.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Mount View",
    "location_heading": "Hunter Valley",
    "location_subheading": "NSW",
    "location_description": "Cedars Mount View",
    "offer_address": "60 Mitchells Rd, Mount View NSW 2325",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 31,
    "price": 750.0,
    "value": 750.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BVT2AAO",
    "hero_image": "https://images.luxuryescapes.com/ydbrx4vswtluyoqe3qxw",
    "image_two": "https://images.luxuryescapes.com/zcvtyh1feksp7ndqhk4i",
    "image_three": "https://images.luxuryescapes.com/cbte56vr8sa02agvku6s",
    "vendor_name": "voco Kirkton Park Hunter Valley , an IHG Hotel",
    "title": "Hunter Valley Wine-Country Estate with Paddock-to-Plate Restaurant",
    "description": "Escape and unwind amid 70 acres of manicured gardens at voco™ Kirkton Park Hunter Valley by IHG, a memorable wine-country escape in the heart of Pokolbin in NSW. Taste the flavours of the Hunter Valley region with estate-to-plate dishes at the onsite Locavore restaurant, sip award-winning wines by the glowing fire in the Epoche Lounge Bar, or indulge in an exclusive high tea served in the sunny Conservatory with views across the rose garden. Other convenient facilities include a modern fitness centre, a Grecian-inspired heated indoor swimming pool and tennis and basketball courts.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "NSW",
    "location_description": "voco™ Kirkton Park Hunter Valley by IHG",
    "offer_address": "336 Oakey Creek Road, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 105.0,
    "value": 105.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zX6rAAE",
    "hero_image": "https://images.luxuryescapes.com/ayedbosmngtym3lvxv4c",
    "image_two": "https://images.luxuryescapes.com/61sb91ftv3djwv2rcy10i",
    "image_three": "https://images.luxuryescapes.com/nrtar0ipa857w0595q0b",
    "vendor_name": "Cedars Mount View",
    "title": "Romantic Hunter Valley Adults-Only Villas",
    "description": "Indulge in a year-round romantic escape in the world-famous Hunter Valley wine region at the ultra-luxe Cedars Mount View, a collection of private, self-contained villas dotted amid rolling greenery. Swap the bustle of city life for a glass of shiraz and immerse yourself in the mountainous beauty of regional New South Wales. Discover award-winning wines and epicurean indulgences on a sensual escape through rolling olive groves and vine-laced hills.\n\nAfter a busy day exploring the region, sink into your deep-soaking bathtub or enjoy the tranquility of your surroundings on your private deck. Add on romantic extras to make your stay extra-special: melt away with an in-villa massage or treat yourself to a charcuterie board or champagne, delivered to the comfort of your room.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Mount View",
    "location_heading": "Hunter Valley",
    "location_subheading": "NSW",
    "location_description": "Cedars Mount View",
    "offer_address": "60 Mitchells Rd, Mount View NSW 2325",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 34,
    "price": 823.0,
    "value": 823.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C2PbFAAV",
    "hero_image": "https://images.luxuryescapes.com/b13fmy4hxh7gi8cvogc",
    "image_two": "https://images.luxuryescapes.com/n6cgcrz6tggav6ddlnss",
    "image_three": "https://images.luxuryescapes.com/7e0anfh28q8qhvcmzqy9",
    "vendor_name": "Spicers Vineyards Estate",
    "title": "Five-Star Hunter Valley Spicers Retreat with Award-Winning French-Inspired Bistro",
    "description": "Experience the wine-flavoured magic of New South Wale's Hunter Valley with a stay at the adults-only Spicers Vineyards Estate, a five-star abode residing on its own private estate of chardonnay, cabernet sauvignon and merlot grapes. Wander elegant gardens, brush past sun-drenched vineyards and be pampered at the onsite day spa. For an award-winning wining and dining experience, reserve a table at the widely applauded Restaurant Botanica, which serves a tantalising menu of modern Australian with a French bistro twist.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Spicers Vineyards Estate",
    "offer_address": "555 Hermitage Rd, Pokolbin NSW Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 230.0,
    "value": 230.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G36UCAAZ",
    "hero_image": "https://images.luxuryescapes.com/4ttu6nyn0x9kxvn7rj0g",
    "image_two": "https://images.luxuryescapes.com/b4ul6c74vdwiju8bhx2i",
    "image_three": "https://images.luxuryescapes.com/948ub49qqq5167x9ird",
    "vendor_name": "Oaks Cypress Lakes Resort",
    "title": "Elegant Hunter Valley Apartment-Style Retreat with Championship Golf Course",
    "description": "Leave city life behind and discover the vibrant rolling hills and boundless serenity of the Hunter Valley with a villa escape at Oaks Cypress Lakes Resort. Perfectly set in the heart of historic Pokolbin, one of Australia's most cherished wine countries, this self-contained apartment-style oasis is an idyllic hideaway featuring laidback country elegance, high-end gastronomy and no shortage of championship golf. Villas are designed to take full advantage of the location, with private balconies offering an elevated position overlooking boundless rambling hinterland.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Oaks Cypress Lakes Resort",
    "offer_address": "15 Thompsons Road, Pokolbin, Hunter Valley, New South Wales 2320, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 106.0,
    "value": 106.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNkMjAAL",
    "hero_image": "https://images.luxuryescapes.com/bz7rhd7n1tv1zzk29cnj",
    "image_two": "https://images.luxuryescapes.com/eunfy5iji267c8cqdy4gw",
    "image_three": "https://images.luxuryescapes.com/6aqlja01p46yrge1mic",
    "vendor_name": "The Convent Hunter Valley",
    "title": "NSW: Hunter Valley Boutique Vineyard Stay",
    "description": "Framed by the verdant vineyards of Pokolbin, The Convent Hunter Valley delivers a luxurious stay and gourmet greatness in a soothing location. Start the morning with a refined breakfast at Restaurant Eighty Eight before entertaining yourself with a relaxed game of boules or an energetic bout of tennis. As evening falls, take in sunset views over manicured gardens before sampling award-winning vintages at Pepper Tree Winery or dining on farm-to-fork organic fare at Circa 1876 restaurant.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "The Convent Hunter Valley",
    "offer_address": "88 Halls Road, Pokolbin 2320, New South Wales, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 106.0,
    "value": 106.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdYn7AAF",
    "hero_image": "https://images.luxuryescapes.com/6xf6elyacob1tdbfy05",
    "image_two": "https://images.luxuryescapes.com/anfj9kfn0bb9slxs1hpg",
    "image_three": "https://images.luxuryescapes.com/ry44v9zgoqkn3flv4fa",
    "vendor_name": "Rydges Resort Hunter Valley",
    "title": "Tranquil Hunter Valley Wine Country Escape with Pool, Spa & Restaurants",
    "description": "Go to where the wine flows, vines are rich and full, and lush hills endlessly roll - Rydges Resort Hunter Valley. Perched among a myriad of cellar doors, this is the ideal countryside hideaway, just a few hours from Sydney. Between vineyard-hopping, sit down to a delicious meal at one of the hotel’s own dining outlets, perfect your swing on the golf course, or enjoy a rejuvenating visit to the tranquil day spa.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Lovedale",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Rydges Resort Hunter Valley",
    "offer_address": "430 Wine Country Drive, Lovedale, New South Wales 2325, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 115.0,
    "value": 115.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FO0MUAA1",
    "hero_image": "https://images.luxuryescapes.com/4jg4pzlxiakh7hadspr",
    "image_two": "https://images.luxuryescapes.com/7ylfgz56eb2fecgqmm6",
    "image_three": "https://images.luxuryescapes.com/b3ve5bob5jnsyozejici",
    "vendor_name": "Tower Lodge",
    "title": "Hunter Valley Spanish-Inspired Luxury Lodge with Acclaimed Restaurant & Whiskey Distillery",
    "description": "Immerse yourself in the magic of the Hunter Valley with a stay at the five-star Tower Lodge, an all-inclusive sanctuary in the Pokolbin wine region. Home to an acclaimed fine dining restaurant - featuring a menu that celebrates the region's intrinsic connection to food and wine - and the Hunter Valley’s first whiskey distillery, this Spanish-inspired stay offers the ultimate home away from home for those seeking the finer things in life. Once you've tasted the region's bounty, deepen your connection to the local area with a range of recreational activities, including hot-air balloon adventures, heli-tours, private tipple tastings and mountain biking adventures.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Tower Lodge",
    "offer_address": "6 Halls Road, Pokolbin 2320, New South Wales, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 501.0,
    "value": 501.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004TBWzAAO",
    "hero_image": "https://images.luxuryescapes.com/5mpglzttjrjqxxtn3hnf",
    "image_two": "https://images.luxuryescapes.com/cuj392ldij9eh7ivs5ef",
    "image_three": "https://images.luxuryescapes.com/rg832fq6zspi6ejuhfj",
    "vendor_name": "Chateau Elan",
    "title": "Five-Star Tuscan-Inspired Golf & Wine Lovers' Escape in the Hunter Valley",
    "description": "Find the true meaning of tranquility in the vibrant rolling hills of the Hunter Valley at Château Élan at The Vintage, Hunter Valley. Set in the heart of Australia’s premium wine country, this European-inspired five-star retreat brings a little piece of Tuscany to New South Wales, with laidback country elegance and high-end gastronomy. Rooms are designed to take full advantage of the location, with floor-to-ceiling windows, private terraces or balconies offering an elevated position overlooking the verdant greenery of the rolling hills and The Vintage golf course.\n\nRelish the delights of seasonal local produce and views over the golf course at Legends Grill or dine alfresco at Spike Bar. Should the sun be shining, practise your swing at the hotel’s award-winning 18-hole golf course designed by Greg Norman, or watch the world go by at the 25-metre lap pool. If you’d rather unwind, the peaceful Hunter Valley Day Spa will help with relaxation, rejuvenation and recuperation. And while leaving the hotel is optional, there’s more to see further afield - from wine and cheese tastings to early-morning hot air balloon rides and exploring many walking or cycling trails.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Pokolbin",
    "location_heading": "Hunter Valley",
    "location_subheading": "New South Wales",
    "location_description": "Château Élan at The Vintage",
    "offer_address": "Vintage Drive, Pokolbin, New South Wales 2320, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 32,
    "price": 117.0,
    "value": 117.0
  }
]