[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zKObAAM",
    "hero_image": "https://images.luxuryescapes.com/30iidnnji8drz5mpn86c",
    "image_two": "https://images.luxuryescapes.com/af6rw3scem8eho6q5nda",
    "image_three": "https://images.luxuryescapes.com/av0a6op6qddnpldcaa5n",
    "vendor_name": "Wyndham Garden Christchurch City",
    "title": "Christchurch Brand-New City Break with Daily Breakfast & Daily Dining Credit",
    "description": "Experience a new level of comfort in Christchurch, with a stay at Wyndham Garden Christchurch City, a new opening in the heart of the city.\n\nWander to the nearby Riverside Market, learn more about the city’s history at the Canterbury Museum, or visit the Bridge of Remembrance and Cathedral Square, all just minutes away. Before you begin exploring the South Island's largest city, stop by Wyndham's The Spire Cafe for breakfast or lunch, or get the heart racing at the fitness centre. Onsite parking also makes exploring the spectacular Canterbury region easy. Venture north to Hanmer Springs for a thermal soak, or head to the quaint coastal town of Kaikōura to encounter the incredible local wildlife.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Wyndham Garden Christchurch City",
    "offer_address": "64 Kilmore Street, Christchurch Central City, Christchurch 8013, New Zealand",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 239.0,
    "value": 505.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007ln0qAAA",
    "hero_image": "https://images.luxuryescapes.com/nd2sytgr45fkx50um9",
    "image_two": "https://images.luxuryescapes.com/uj2ltp70favw2ug6dtl",
    "image_three": "https://images.luxuryescapes.com/jzzomcw7zjnfmib71se",
    "vendor_name": "Eliza's Manor",
    "title": "Boutique Christchurch Manor Retreat with Daily Breakfast, Nightly Cocktails & Canapés",
    "description": "For a touch of sophistication, a flourish of indulgence and a sprinkling of historic flair, enjoy a stay at Eliza’s Manor, a magnificent heritage manor in Christchurch. Ranked in the top 5 inns in Christchurch and stamped with a Tripadvisor Travellers’ Choice 2021 award, Eliza’s Manor is the epitome of boutique luxury. Having undergone a complete refurbishment in 2021, this grand 160-year-old manor looks as fresh as it did when it first opened its doors in 1861. Feel like royalty during High Tea every Saturday afternoon (charges apply), take a stroll around the immaculate grounds, sip Pimms in the courtyard, and indulge in a decadent fine-dining experience at Miro at the Manor.\n\nWhen you’re ready to tear yourself away from your incredible manor stay, the splendours of Christchurch are at your fingertips. Spend a day exploring the blossoming blooms and incredible garden displays at the city’s botanical gardens, satisfy your inner history buff with a visit to the Canterbury Museum and stroll down Victoria Street, home to the city’s best restaurants and bars.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Eliza's Manor",
    "offer_address": "82 Bealey Avenue, Christchurch Central City, Christchurch 8013, New Zealand",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 333.0,
    "value": 534.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zKPAAA2",
    "hero_image": "https://images.luxuryescapes.com/j5s16wfvbmv3j3o4n8cm",
    "image_two": "https://images.luxuryescapes.com/8kdgop1v09ht8zk2c9rc",
    "image_three": "https://images.luxuryescapes.com/02sl3a8yppi94o8copkd",
    "vendor_name": "Hotel Montreal",
    "title": "Christchurch Boutique Self-Contained Suites with Daily Breakfast & Guaranteed Room Upgrade",
    "description": "Discover the secrets of the 'Garden City’ from the centre of it all at Christchurch's stylish Hotel Montreal, which combines the best of European style with contemporary design. Recognised for its five-star comforts, this city haven invites you to experience a new meaning of luxury. The self-contained suites offer everything you need for a comfortable escape, including a stylish kitchenette, expansive wardrobe area and inviting lounge seating. The fun polo-inspired theme won’t go unnoticed, and odes to the sport are represented in artwork around the hotel, along with a croquet set you can borrow.\n\nModern, creative, urban and thriving - the flourishing city of Christchurch is known for its art galleries and beautiful gardens, cool street art and stylish cafés all set against a majestic alpine and ocean background, and the hotel's superb location couldn’t be better. Visit the Christchurch Art Gallery and Canterbury Museum, stroll on down to the verdant Hagley Park or trace Christchurch’s Avon River; all within a few minutes walk from your door.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Montreal",
    "offer_address": "363 Montreal Street, Christchurch 8013, New Zealand",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 379.0,
    "value": 782.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DSiQAAW",
    "hero_image": "https://images.luxuryescapes.com/hb9re0avtxaxxx55dqa",
    "image_two": "https://images.luxuryescapes.com/e449lvzq69x731c7c0e0e",
    "image_three": "https://images.luxuryescapes.com/tddiz8h0rp766axsn9m",
    "vendor_name": "The Mayfair",
    "title": "Grand Opening: Christchurch's Newest Boutique Hotel with Daily Breakfast",
    "description": "Uncover elegance and boutique luxury at The Mayfair, a contemporary hotel in the heart of Christchurch that first opened its doors in July 2022. Blending thoughtful design and attentive service, The Mayfair features modern rooms and suites that act as the perfect launchpad for exploring the city's best sights. At this superb central location, you're within close proximity of landmarks like Canterbury Museum, Hagley Park, and the eye-catching Christchurch Botanic Gardens, with shops, restaurants and bars within easy walking distance. Spend a day relaxing by the Avon River, exploring Port Hills or venture further afield into the vineyards of Waipara, Sumner Beach or the nearby ski areas.\n\nBack at the hotel, visit the elegant Majestic at Mayfair - serving coffee, tea and à la carte breakfast by day and vibrant cocktails by night. For the ultimate indulgence, partake in a high tea experience and nibble on decadent pastries, delicious sweets, savoury mini burgers and more.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "The Mayfair",
    "offer_address": "155 Victoria Street, Christchurch 8013, New Zealand",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 303.0,
    "value": 473.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FlJ2qAAF",
    "hero_image": "https://images.luxuryescapes.com/d67qkjl5hspjxt8p63",
    "image_two": "https://images.luxuryescapes.com/21cfhfqoccke6n8xrdya",
    "image_three": "https://images.luxuryescapes.com/b0w0kxjucfnoy7o3sbt",
    "vendor_name": "Hotel Montreal",
    "title": "Christchurch Boutique Self-Contained Suites with Daily Breakfast, Welcome Wine & Guaranteed Room Upgrade",
    "description": "Discover the secrets of the 'Garden City’ from the centre of it all at Christchurch's stylish Hotel Montreal, which combines the best of European style with contemporary design. Recognised for its five-star comforts, this city haven invites you to experience a new meaning of luxury. The self-contained suites offer everything you need, including stylish kitchenettes, expansive wardrobe areas and inviting lounge seating. The fun polo-inspired theme won’t go unnoticed, and odes to the sport are represented in artwork around the hotel.\n\nModern, creative and thriving, the flourishing city of Christchurch is known for its art galleries and beautiful gardens, cool street art and stylish cafes, all set against a majestic alpine and ocean background. The hotel's superb location couldn’t be better: visit Christchurch Art Gallery and Canterbury Museum, stroll down to the verdant Hagley Park or trace Christchurch’s Avon River - all within a few minutes' walk from your door.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Montreal",
    "offer_address": "363 Montreal Street, Christchurch 8013, New Zealand",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 408.0,
    "value": 671.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CuvR0AAJ",
    "hero_image": "https://images.luxuryescapes.com/se8eeh5rcsbfktmqrsqqe",
    "image_two": "https://images.luxuryescapes.com/6f3g8ya2ye07p4vfzcus",
    "image_three": "https://images.luxuryescapes.com/1i8hd9pujai4rc2nxzri",
    "vendor_name": "Hotel Montreal",
    "title": "Christchurch Boutique Self-Contained Suites with Daily Breakfast, Welcome Wine & Guaranteed Room Upgrade",
    "description": "Discover the secrets of the 'Garden City’ from the centre of it all at Christchurch's stylish Hotel Montreal, which combines the best of European style with contemporary design. Recognised for its five-star comforts, this city haven invites you to experience a new meaning of luxury. The self-contained suites offer everything you need, including a stylish kitchenette, expansive wardrobe area and inviting lounge seating. The fun polo-inspired theme won’t go unnoticed, and odes to the sport are represented in artwork around the hotel.\n\nModern, creative, urban and thriving - the flourishing city of Christchurch is known for its art galleries and beautiful gardens, cool street art and stylish cafes all set against a majestic alpine and ocean background. The hotel's superb location couldn’t be better: visit Christchurch Art Gallery and Canterbury Museum, stroll down to the verdant Hagley Park or trace Christchurch’s Avon River; all within a few minutes walk from your door.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Montreal",
    "offer_address": "363 Montreal Street, Christchurch 8013, New Zealand",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 454.0,
    "value": 752.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UJ3cyQAD",
    "hero_image": "https://images.luxuryescapes.com/sxc8sdjm44qa9muxgrko",
    "image_two": "https://images.luxuryescapes.com/j8v5wpgfeecunqfptlwg",
    "image_three": "https://images.luxuryescapes.com/xkckvary7dvbp5xaq7yg",
    "vendor_name": "Rendezvous Hotel Christchurch",
    "title": "Escape to the Heart of Christchurch",
    "description": "Experience the natural beauty and modern city life of Christchurch, New Zealand, with a two or three-night getaway at Rendezvous Hotel Christchurch. Rediscover the city, or base yourself here and explore the stunning surroundings of the Canterbury Region. Includes daily buffet breakfast, a food and beverage credit, leisurely late midday checkout and luxurious valet parking.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Rendezvous Hotel Christchurch 2019",
    "offer_address": "166 Gloucester Street Christchurch New Zealand, 8011",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 189.0,
    "value": 451.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pT5DAAU",
    "hero_image": "https://images.luxuryescapes.com/ydhevggkdxmut5jory",
    "image_two": "https://images.luxuryescapes.com/u0q79m4au92zctihs1ia",
    "image_three": "https://images.luxuryescapes.com/enkxtpc4rrl1mc3dqdt",
    "vendor_name": "Fable Christchurch",
    "title": "Brand-New Five-Star Christchurch Luxury with Dining Credit & Daily Breakfast",
    "description": "Uncover five-star elegance and artistic luxury at the newly opened Fable Christchurch, a design-led transformative hotel in the heart of the CBD. Here you’ll find an unbeatable onsite restaurant headed by award-winning Executive Chef Jinu Abraham, who creates mouthwatering dishes using fresh produce from the Canterbury region. For gin connoisseurs, The Gin Bar serves up artisanal cocktails in a sultry setting.\n\nYou’re perfectly placed to explore the city thanks to Fable’s superb central location. Stay within close proximity of landmarks like Cathedral Square, Victoria Square and the tramway, with shops, restaurants and bars within easy walking distance. Spend a day exploring the eye-catching floral displays at the Botanic Gardens, relax at Hagley Park or venture further afield into the vineyards of Waipara, Sumner Beach or the nearby ski areas.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Fable Christchurch",
    "offer_address": "166 Gloucester Street, Christchurch Central City Christchurch Canterbury 8011 New Zealand",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 11,
    "price": 247.0,
    "value": 461.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cLFG5QAO",
    "hero_image": "https://images.luxuryescapes.com/6f1m9i8yiprfvlcy8qk8",
    "image_two": "https://images.luxuryescapes.com/onmmlbu5dab9r744jvua",
    "image_three": "https://images.luxuryescapes.com/xf4jd5k7zcmz94yef5cn",
    "vendor_name": "The Classic Villa",
    "title": "Romantic Boutique Stay in the Heart of Christchurch",
    "description": "Stay a stone’s throw from all that Christchurch has to offer at The Classic Villa Christchurch - an intimate property that has been stamped with a TripAdvisor Certificate of Excellence for nine consecutive years. Their approach to sustainability and energy conservation fused with their Italian-style ambiance and 1800’s heritage has them standing out from other properties. Indulge in daily continental breakfast, welcome bottle of wine on arrival, guaranteed late 1pm checkout and much more.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "The Classic Villa Christchurch July 2019",
    "offer_address": "17 Worcester Blvd, Christchurch Central, Christchurch 8013, New Zealand",
    "percentage_discount": 70.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 180.0,
    "value": 604.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HuobIAC",
    "hero_image": "https://images.luxuryescapes.com/09c00kxw3ll9e98nietj",
    "image_two": "https://images.luxuryescapes.com/jlsegtg0wa2j7j9x95rib",
    "image_three": "https://images.luxuryescapes.com/2ab1q07mflefjdcjwwy",
    "vendor_name": "Hotel Montreal",
    "title": "Boutique Central Christchurch Suites with NZ$100 Dining Credit & Guaranteed Room Upgrade",
    "description": "Unveil the mysteries of the 'Garden City' from the heart of the action in this chic accommodation, seamlessly blending European elegance with modern flair. Renowned for its luxurious amenities, this Christchurch retreat redefines opulence. Each self-contained suite is equipped with all the essentials, from sleek kitchenettes to spacious closets and cozy lounges, ensuring an unparalleled stay.\n\nContemporary, creative and thriving, the flourishing city of Christchurch is known for its art galleries and beautiful gardens, cool street art and cosy cafes, all set against a majestic alpine and ocean background. Visit Christchurch Art Gallery and Canterbury Museum, stroll down to the verdant Hagley Park or trace Christchurch’s Avon River for beautiful days out.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Montreal",
    "offer_address": "363 Montreal Street, Christchurch 8013, New Zealand",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 369.0,
    "value": 683.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000QaTmGAAV",
    "hero_image": "https://images.luxuryescapes.com/fuvbypxspdmx84wn3wwn",
    "image_two": "https://images.luxuryescapes.com/at7ogqisdbgasf9swjyf",
    "image_three": "https://images.luxuryescapes.com/fiq3vaxxnparsbfbyl3v",
    "vendor_name": "Hotel Montreal",
    "title": "Boutique Luxury in the Heart of Christchurch",
    "description": "Experience the natural beauty and modern city life of Christchurch, New Zealand, with two nights in a suite at the boutique Hotel Montreal. Includes a bottle of wine and local cheese board on arrival, daily breakfasts, credit to use at the hotel’s stylish restaurant and bar, and complimentary Wi-Fi.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Montreal - April 2018",
    "offer_address": "351 Montreal St, Christchurch Central, Christchurch 8013, New Zealand",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 399.0,
    "value": 813.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008IvnWAAS",
    "hero_image": "https://images.luxuryescapes.com/zvn8mpvsjyyltnk78rd",
    "image_two": "https://images.luxuryescapes.com/sm4efv5q86wjkib5nafq",
    "image_three": "https://images.luxuryescapes.com/83e1dstx4vp5nf8tqab",
    "vendor_name": "Fable Terrace Downs Resort",
    "title": "South Island Five-Star Canterbury Golf Resort with Daily Breakfast & Dining Credit",
    "description": "Soak up the beauty of Canterbury’s picturesque Southern Alps while indulging in an ultra-luxe escape at the blissfully secluded Fable Terrace Downs Resort. Here, luxurious relaxation meets stunning scenery at this five-star stay, ranked within the top 10% of properties on Tripadvisor.\n\nAvid golfers can revel in the chance to play on a high country 18-hole championship golf course designed by Sid Puddicombe, with 10 lakes and more than 60 bunkers, listed by Zealand Golf magazine as one of the country’s top five courses. After hours winding your way along the green, refuel at The Clubhouse Restaurant for locally sourced produce with a contemporary take on classic favourites. Soak up the natural wonders of the region, or try your hand at a round of archery, a casual match of tennis, or hire a mountain bike and trace the trails to admire the beauty of the Rakaia River and Mt Hutt.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Windwhistle",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Fable Terrace Downs Resort",
    "offer_address": "623 Coleridge Road, Windwhistle 7572, New Zealand",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 344.0,
    "value": 740.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LuCMAA0",
    "hero_image": "https://images.luxuryescapes.com/j2crefl84h9nsslqfyd",
    "image_two": "https://images.luxuryescapes.com/99mtwp33r9bn51ugd4l",
    "image_three": "https://images.luxuryescapes.com/cugz08n6qcyngjhk8ldt",
    "vendor_name": "Rydges Latimer Christchurch",
    "title": "Stylish Stay in the Heart of Christchurch with Daily Breakfast",
    "description": "The secrets of the ‘Garden City’ are yours to uncover from the stylish Rydges Latimer Christchurch. Surrounded by the lush gardens of Latimer Square - one of Christchurch's most-visited sites - this modern sanctuary boasts one of the best addresses in the city and takes you a stone’s throw from funky bars, art galleries and fine-dining restaurants.\n\nYour first-class stay includes daily breakfast, a bottle of Marlborough wine on arrival, NZ$15 drinks and dining credit per room to spend at the acclaimed Bloody Mary's restaurant (with bonus credit for longer stays) and a leisurely late 1pm checkout.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Rydges Latimer Christchurch",
    "offer_address": "30 Latimer Square, Christchurch, 8011, New Zealand",
    "percentage_discount": 66.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 137.0,
    "value": 401.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HglOvYAJ",
    "hero_image": "https://images.luxuryescapes.com/1664u0oohu79lq9fp0m",
    "image_two": "https://images.luxuryescapes.com/q5krpsqq66my8z0iwu9",
    "image_three": "https://images.luxuryescapes.com/n1ggpfyavhthpagghqit",
    "vendor_name": "Hotel Montreal",
    "title": "Boutique Christchurch Suites with Daily Breakfast & Daily NZ$25 Dining Credit",
    "description": "Unveil the mysteries of the 'Garden City' from the heart of the action in this chic accommodation, blending European elegance with modern flair. Each self-contained suite is equipped with all the essentials, from spacious wardrobes to cosy lounges. Unwind at The Montreal Bar & Restaurant, where locally sourced, seasonal fare meets chic courtyard dining and live music.\n\nThe flourishing city of Christchurch is known for its art galleries, beautiful gardens, cool street art and cosy cafes, set against a majestic alpine and ocean landscape. Visit Christchurch Art Gallery and Canterbury Museum, stroll down to the verdant Hagley Park or trace Christchurch’s Avon River for beautiful days out.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Montreal",
    "offer_address": "363 Montreal Street, Christchurch Central, Christchurch 8013, New Zealand",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 339.0,
    "value": 622.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005ITUMAA4",
    "hero_image": "https://images.luxuryescapes.com/1recjr8zoclazytcz6u",
    "image_two": "https://images.luxuryescapes.com/gr6a2oypqokb9ez6yn8",
    "image_three": "https://images.luxuryescapes.com/whxqgzkgsk3qkm25b3pu",
    "vendor_name": "Rendezvous Hotel Christchurch",
    "title": "Sky-High Stay in the Heart of Christchurch with Daily Breakfast & Nightly Drinks",
    "description": "Discover the many charms of Christchurch with a stay at the famed Rendezvous Hotel Christchurch, perfectly positioned in the city's historic centre. Pairing unparalleled elegance and modern facilities with sophistication and glamour, the hotel offers guests a first-class experience through its state-of-the-art amenities and outstanding service. With its classic architecture, renowned Straits Restaurant and Junction Bar, luxe sauna and fitness room, and rustic ambience, this might just become your new go-to in New Zealand's biggest southern city.\n\nLet Rendezvous Hotel Christchurch be your launchpad as you discover a contemporary reboot of New Zealand's most gracious and historic city. You'll be perfectly placed to explore everything there is to see: seek out the best street-art scene or cafés at innovative post-earthquake precincts such as the SALT District and South Town; admire important New Zealand art at the Christchurch Art Gallery Te Puna o Waiwhetū; jump on a restored vintage Christchurch Tramway for a tour around the city; and hear of inspiring memories at Quake City, which details the earthquakes that rocked the city in 2010 and 2011.\n\n**Your handpicked inclusions:**\n\n- Wake up to delicious daily breakfast, served at the charming Straits Restaurant\n- Toast your escape with a daily glass of wine, beer or soft drink per person\n\n**Travelling as a family?** Upgrade to a spacious Guest Twin Room, for up to two adults and two children (11 and under).\n\n**Upgrade bonus:** Upgrade to either the Guest Twin Room or Deluxe Balcony View Room and you'll enjoy a one-time A$25 food and drink credit per package to use at the onsite restaurant or bar.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Rendezvous Hotel Christchurch",
    "offer_address": "166 Gloucester Street Christchurch New Zealand, 8011",
    "percentage_discount": 66.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 189.0,
    "value": 552.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Ef5uAAC",
    "hero_image": "https://images.luxuryescapes.com/0hycuy1b4f9ykbksbh6",
    "image_two": "https://images.luxuryescapes.com/e5l0hhi46856fh61427",
    "image_three": "https://images.luxuryescapes.com/c2kvcf1irn489xhmwup",
    "vendor_name": "The Classic Villa",
    "title": "Five-Star Boutique Luxury in the Heart of Christchurch with Daily Breakfast",
    "description": "Stay a stone’s throw from all Christchurch has to offer at The Classic Villa - an intimate property that has been stamped with a Tripadvisor Certificate of Excellence for 10 consecutive years. An innovative approach to sustainability and energy conservation fused with Italian-style ambience and 1800s heritage ensures this five-star boutique hotel stands out from the crowd.\n\nIndulge in daily continental breakfast, a welcome bottle of wine and chocolates on arrival, guaranteed 1pm checkout and handpicked discounts at local restaurants.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "The Classic Villa",
    "offer_address": "17 Worcester Boulevard, Christchurch Central, Christchurch 8013, New Zealand",
    "percentage_discount": 68.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 169.0,
    "value": 532.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GukEdAAJ",
    "hero_image": "https://images.luxuryescapes.com/qxoscb57bue403k4pldb",
    "image_two": "https://images.luxuryescapes.com/vkpkeff20lhzvuxeffur",
    "image_three": "https://images.luxuryescapes.com/4c217sqihqwz8wahzdfp",
    "vendor_name": "Hotel Montreal",
    "title": "Boutique Central Christchurch Suites with Daily Breakfast & Guaranteed Room Upgrade",
    "description": "Unveil the mysteries of the 'Garden City' from the heart of the action in this chic accommodation, seamlessly blending European elegance with modern flair. Renowned for its luxurious amenities, this urban retreat redefines opulence. Each self-contained suite is equipped with all the essentials, from sleek kitchenettes to spacious closets and cozy lounges, ensuring an unparalleled stay experience. Contemporary, creative and thriving, the flourishing city of Christchurch is known for its art galleries and beautiful gardens, cool street art and cosy cafes, all set against a majestic alpine and ocean background. Visit Christchurch Art Gallery and Canterbury Museum, stroll down to the verdant Hagley Park or trace Christchurch’s Avon River for beautiful days out.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Montreal",
    "offer_address": "363 Montreal Street, Christchurch 8013, New Zealand",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 349.0,
    "value": 666.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LgiTAAS",
    "hero_image": "https://images.luxuryescapes.com/zeh8x9c2vt8mue1b3tsv",
    "image_two": "https://images.luxuryescapes.com/b0qh6lbtolfdqszbi6e",
    "image_three": "https://images.luxuryescapes.com/4wt5ytosang2kw530go",
    "vendor_name": "Hotel Montreal",
    "title": "Award-Winning Stay in the Heart of Christchurch",
    "description": "Discover the secrets of the 'Garden City’ from the centre of it all at Christchurch's award-winning Hotel Montreal, which combines the best of European style with contemporary design. Your first-class stay includes a complimentary upgrade to a palatial Junior Suite, daily breakfast, a bottle of wine and cheese board, and a NZ$50 food credit to be used at The Polo Bar & Restaurant.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Montreal",
    "offer_address": "363 Montreal Street, Christchurch 8013, New Zealand",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 371.0,
    "value": 755.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007p1IkAAI",
    "hero_image": "https://images.luxuryescapes.com/aliy9qhdynsovkmoo11w",
    "image_two": "https://images.luxuryescapes.com/s6wvyco29ibhtilqsof",
    "image_three": "https://images.luxuryescapes.com/lo4adejdccl3xpyge5v8",
    "vendor_name": "Eliza's Manor",
    "title": "Boutique Heritage Christchurch Manor",
    "description": "For a touch of opulent sophistication and a sprinkling of historic flair, enjoy a stay at Eliza’s Manor, a magnificent heritage manor in Christchurch. Ranked in the top five boutique stays in Christchurch and listed as one of the top 10% of properties on Tripadvisor, this certified eco-friendly manor is the epitome of boutique luxury.\n\nHaving undergone a complete refurbishment in 2021, this grand 19th-century manor has all the charm of yesteryear with the modern conveniences of today. Feel like royalty during an authentic High Tea every Saturday afternoon (charges apply), take a stroll around the immaculate grounds, sip Pimms in the courtyard, and indulge in an exceptional fine-dining experience at Miro at the Manor. When you’re ready to tear yourself away, the splendours of Christchurch are at your fingertips. Explore the blossoming blooms and incredible garden displays at the city’s botanical gardens, satisfy your inner history buff with a visit to the Canterbury Museum and stroll down Victoria Street, home to the city’s best restaurants and bars.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Eliza's Manor",
    "offer_address": "82 Bealey Avenue, Christchurch Central City, Christchurch 8013, New Zealand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 15,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oUPoAAM",
    "hero_image": "https://images.luxuryescapes.com/drcesr6j7enrygrlaf",
    "image_two": "https://images.luxuryescapes.com/20lyftznxny6nu0rkcln",
    "image_three": "https://images.luxuryescapes.com/x8utbxb25psjiiqi00k",
    "vendor_name": "Hotel Montreal",
    "title": "Christchurch Five-Star Self-Contained Suites near Hagley Park & Avon River",
    "description": "Discover the secrets of the 'Garden City’ from the centre of it all: Christchurch's stylish Hotel Montreal, which combines the best of European style with contemporary design. Recognised for its five-star comforts, this city haven invites you to experience a new meaning of luxury. The self-contained suites offer everything you need for a comfortable escape, and the fun polo-inspired theme won’t go unnoticed, and odes to the sport are represented in artwork around the hotel, along with a croquet set you can borrow.\n\nModern, creative, urban and thriving - the flourishing city of Christchurch is known for its art galleries and beautiful gardens, cool street art and stylish cafés all set against a majestic alpine and ocean background, and the hotel's superb location couldn’t be better. Visit the Christchurch Art Gallery and Canterbury Museum, stroll on down to the verdant Hagley Park or trace Christchurch’s Avon River; all just a few minutes' walk from your door.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Montreal",
    "offer_address": "363 Montreal Street, Christchurch 8013, New Zealand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 15,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRewWAAT",
    "hero_image": "https://images.luxuryescapes.com/6i4duw32lmie88j732mi",
    "image_two": "https://images.luxuryescapes.com/5f7ce7t9bo5qr4rwhbn",
    "image_three": "https://images.luxuryescapes.com/sjqegdvs285jic9g2sfp",
    "vendor_name": "Peppers Clearwater Resort Christchurch",
    "title": "Christchurch Lakeside Resort with Championship Golf Course, Onsite Restaurant & Bar",
    "description": "Step into lakeside luxury with a tranquil stay on the banks of Lake Kaikainui, right outside of Christchurch. With the perfect blend of outdoor living and proximity to city comforts, you can tee off at the onsite golf course one day and discover the natural beauty and innovative urban design of Christchurch the next. Indulge in local flavours and mountain views at Lume Restaurant or a casual cocktail at The Sprig Bar and Cafe.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Peppers Christchurch Clearwater Resort",
    "offer_address": "Clearwater Avenue, Northwood, Christchurch 8053, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 86.0,
    "value": 86.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwfIAC",
    "hero_image": "https://images.luxuryescapes.com/mp459ttd2912dvbtkl2r",
    "image_two": "https://images.luxuryescapes.com/b18uegrevehjbdzlh",
    "image_three": "https://images.luxuryescapes.com/3amuwwqgkevtgvr533ns",
    "vendor_name": "Novotel Christchurch Cathedral Square",
    "title": "Central Christchurch Contemporary Stay near Convention Centre with Onsite Restaurant",
    "description": "Find yourself in the centre of it all from this sophisticated Christchurch urban haven, perfectly located in the heart of the CBD, within easy walking distance of the Te Pae Christchurch Convention Centre. Soak up the views of the historic Cathedral Square and the distant Southern Alps as you relax and unwind in the bright, airy rooms and feel right at home.\n\nIf you're looking to explore, the best of New Zealand's 'Garden City' awaits at your doorstep: visit the vibrant Riverside Market, admire the beauty of the Christchurch Botanic Gardens or hop onboard a vintage tram and see the popular landmarks. After a day of exploration, return to your hotel to savour local flavours at The Square Restaurant and pair them with refreshing drinks from the bar.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Novotel Christchurch Cathedral Square",
    "offer_address": "52 Cathedral Square, Christchurch 8011, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 92.0,
    "value": 92.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRexFAAT",
    "hero_image": "https://images.luxuryescapes.com/fdxpyquzvicwch438l9",
    "image_two": "https://images.luxuryescapes.com/v0jpw78hsfez46vtutvx",
    "image_three": "https://images.luxuryescapes.com/m314pptf5p4hu0esa6y",
    "vendor_name": "BreakFree on Cashel in Christchurch",
    "title": "Vibrant Urban Christchurch Stay Moments from the City Centre with Onsite Cafe & Bar",
    "description": "Experience the vibrant Christchurch from this contemporary-cool escape in the heart of the city. Offering modern comfort with a unique and colourful urban design, this central stay is the perfect launchpad to explore the bustling CBD, and the perfect reprieve after days of adventure.\n\nEnjoy the convenience of the onsite Cafe & Bar 165, serving up delicious breakfast each morning and becoming a fun social spot in the evenings. When you're ready to explore, find yourself within easy reach of the city's highlights including the Christchurch Art Gallery, the Canterbury Museum and the lively Riverside Market.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "BreakFree on Cashel Christchurch",
    "offer_address": "165 Cashel Street, Christchurch 8011, New Zealand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pTkQAAU",
    "hero_image": "https://images.luxuryescapes.com/kq9p5d5sqenvv5awz6i",
    "image_two": "https://images.luxuryescapes.com/0e2jh96xzhyylpkq7i4n",
    "image_three": "https://images.luxuryescapes.com/x9bqfss7u88e034xefhe",
    "vendor_name": "Eliza's Manor",
    "title": "Boutique Christchurch Retreat in Eco-Friendly Heritage Manor",
    "description": "For a touch of opulent sophistication and historic flair, enjoy a stay at Eliza’s Manor, a magnificent heritage estate in Christchurch. Ranked within the top 10% of properties on Tripadvisor, this certified eco-friendly manor is the epitome of boutique luxury.\n\nThe hotel first opened its doors in 1861 and has undergone a complete refurbishment. Feel like royalty during an authentic high tea every Saturday afternoon (charges apply), take a stroll around the immaculate grounds, sip Pimms in the courtyard, and indulge in an exceptional fine-dining experience at the onsite restaurant. When you’re ready to tear yourself away, the splendours of Christchurch are at your fingertips. Spend a day exploring the blossoming blooms and incredible garden displays at the city’s botanical gardens, satisfy your inner history buff with a visit to the Canterbury Museum, and stroll down Victoria Street, home to the city’s best restaurants and bars.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Eliza's Manor",
    "offer_address": "82 Bealey Avenue, Christchurch Central City, Christchurch 8013, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 178.0,
    "value": 178.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMWOkAAP",
    "hero_image": "https://images.luxuryescapes.com/nr5sothvzcrhwb2q0p25",
    "image_two": "https://images.luxuryescapes.com/sg0y6kr0to5aaskf0pj",
    "image_three": "https://images.luxuryescapes.com/yxha20b33abe42ux7v4t",
    "vendor_name": "Fable Christchurch",
    "title": "Five-Star Christchurch CBD Stay with Award-Winning Restaurant & Gin Bar",
    "description": "Discover Fable Christchurch, a design-focused five-star haven boasting an exquisite restaurant led by renowned chef, Jinu Abraham. Indulge in locally sourced delights at the restaurant and sip artisanal cocktails in The Gin Bar’s intimate ambiance. Ideal for exploring, this central gem offers proximity to Cathedral Square, Victoria Square, and the tramway, along with shops and dining. Unwind at the Botanic Gardens or venture to Waipara's vineyards, Sumner Beach, or nearby ski spots.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Fable Christchurch",
    "offer_address": "166 Gloucester Street, Christchurch Central City, Christchurch 8011, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 134.0,
    "value": 134.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008fSIiAAM",
    "hero_image": "https://images.luxuryescapes.com/6s4a9rs1kx4i1ofog1q",
    "image_two": "https://images.luxuryescapes.com/fn1kgbku0hbin57yhtjf",
    "image_three": "https://images.luxuryescapes.com/yv7bfe0fznchz4420tlu",
    "vendor_name": "Hotel Montreal",
    "title": "Five-Star All-Suite City Break in Heart of Christchurch",
    "description": "Discover the secrets of the Garden City at Christchurch's stylish Hotel Montreal, which combines the best of European style with contemporary design. Recognised for its five-star comforts, this suite-only hotel invites you to experience a new meaning of laidback luxury, with stylish and self-contained havens that offer everything you need for a comfortable escape, including a kitchenette, expansive wardrobe area and inviting lounge seating. The fun polo-inspired theme won’t go unnoticed, with odes to the sport are represented in artwork around the hotel, along with a croquet set you can borrow.\n\nYour stay, right in the heart of this vibrant city, is only moments from Hagley Park - 165 hectares of wide-open spaces and woodlands. From Hotel Montreal, take a short walk to board one of the beautifully restored trams and enjoy a 17-stop loop, departing every 15 minutes, taking in a host of city highlights including Cathedral Square and New Regent St.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Hotel Montreal",
    "offer_address": "363 Montreal Street, Christchurch 8013, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 154.0,
    "value": 154.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v1ZtAAI",
    "hero_image": "https://images.luxuryescapes.com/7ke9xuxlbzodpasfzyq",
    "image_two": "https://images.luxuryescapes.com/gvzwh11jvrzzng2ibhbj",
    "image_three": "https://images.luxuryescapes.com/totkxfgb8mqljuq95j69",
    "vendor_name": "Rydges Latimer Christchurch",
    "title": "Stylish Stay in the Heart of Christchurch",
    "description": "The many charms of the Garden City are yours to enjoy from the stylish Rydges Latimer Christchurch. Surrounded by the lush gardens of Latimer Square, this modern sanctuary boasts one of the best addresses in the city, a stone’s throw from the iconic Cardboard Cathedral and funky bars, art galleries and fine-dining restaurants, and a leisurely stroll from the Botanic Gardens and Canterbury Cathedral. Make use of the onsite fitness centre and premium steakhouse, Bloody Mary’s - one of the city’s most-loved restaurants.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Rydges Latimer Christchurch",
    "offer_address": "30 Latimer Square, Christchurch, 8011, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 76.0,
    "value": 76.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt6kAAB",
    "hero_image": "https://images.luxuryescapes.com/od5xt9s0l5cuisblm6",
    "image_two": "https://images.luxuryescapes.com/swgzc775nqual5kfpyda",
    "image_three": "https://images.luxuryescapes.com/pzrqop9hlbqx3k4jqofm",
    "vendor_name": "Crowne Plaza Christchurch",
    "title": "Christchurch Modern City Break overlooking Victoria Square with Skyline Views",
    "description": "Take a South Island city escape to Crowne Plaza Christchurch, masterfully positioned at the centre of one of New Zealand’s funkiest cities. This stylish base overlooks the historic fountains of Victoria Square and the gentle waters of the Avon River, and the is the perfect spot to discover the Garden City's vast wealth of trendy bars, refined restaurants, cool cafés and vivid street art. After a day exploring the city’s many treasures, retreat to Market Place Restaurant and Bar for exquisite plates backed entirely by local butchers, fishmongers and growers, or head to the Cafe 1851 for a coffee or Social Wine Bar for sauvignon blanc and sensational cocktails.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Christchurch",
    "location_heading": "Christchurch",
    "location_subheading": "New Zealand",
    "location_description": "Crowne Plaza Christchurch",
    "offer_address": "764 Colombo Street, Christchurch Central City, Christchurch 8011, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 81.0,
    "value": 81.0
  }
]