[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004hkkQAAQ",
    "hero_image": "https://images.luxuryescapes.com/crtibua8co9jupy3tg0h",
    "image_two": "https://images.luxuryescapes.com/zsr8nwhn5t0u0qyqpti",
    "image_three": "https://images.luxuryescapes.com/emji4x42jvr4sjyigq6",
    "vendor_name": "Paihia Beach Resort & Spa Hotel",
    "title": "Five-Star Oceanfront Bay of Islands Retreat with Daily Breakfast",
    "description": "The natural beauty of the Bay of Islands is yours to explore from a five-star launchpad: Paihia Beach Resort & Spa - a waterfront oasis boasting one of the best locations in New Zealand's North Island. Ideally situated a short walk from Paihia's quaint shops, excellent restaurants and extensive outdoor activities, this lavish property is the perfect springboard for discovering the wonders of the region and an excellent base to retreat to after days filled with sun-kissed adventures.\n\nStamped with a Tripadvisor Travellers' Choice 2021 award, Paihia Beach Resort & Spa offers guests a first-class experience through its luxe amenities and outstanding service - from the lavish outdoor pool and relaxing treatments at La Spa Naturale, to the expert chefs preparing signature dishes at Glasshouse Kitchen & Bar - that ensure your every need is met.\n\n**Your handpicked inclusions:**\n\n- Prepare for a day of indulgence with a gourmet buffet breakfast at the Glasshouse Kitchen & Bar\n- Make the most of a NZ$30 credit per package for use at either the Glasshouse Kitchen & Bar or La Spa Naturale\n- Celebrate your escape with a welcome drink (beer or wine) each on arrival\n\n**Travelling with family or friends?** Upgrade to a Two-Bedroom Apartment for up to four guests.\n\n**Extended Stay Bonus:** Enjoy NZ$50 credit per package to use at the Glasshouse Kitchen & Bar or La Spa Naturale when you stay for nights or more.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Northland",
    "offer_geo_area_level_2": "Paihia",
    "location_heading": "Paihia",
    "location_subheading": "New Zealand",
    "location_description": "Paihia Beach Resort & Spa Hotel",
    "offer_address": "130 Marsden Road, Bay Of Islands, Paihia 0200, New Zealand",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 255.0,
    "value": 486.0
  }
]