[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IQYJIA4",
    "hero_image": "https://images.luxuryescapes.com/1m4la9qaaeujmo60ul",
    "image_two": "https://images.luxuryescapes.com/4fm216h1wod3csn7xaa",
    "image_three": "https://images.luxuryescapes.com/oufky6m7k6vdpxmtaycg",
    "vendor_name": "Sun Ranch",
    "title": "Byron Bay Hinterland Retro Ranch-Style Retreat with Daily Breakfast & Nightly Cocktails",
    "description": "Amid the northern hinterland of New South Wales, just outside Byron Bay, lies a ranch-style accommodation that combines '70s California vibes with laidback luxury. Set on a sprawling 55-acre estate, this retreat embodies the charm of chic ranch houses with a touch of retro flair, offering an idyllic escape from the everyday.\n\nGuests can find their inner zen with complimentary daily yoga classes, followed by a relaxing session in the woodfired, floating sauna, or an invigorating dip in the refreshingly cold plunge pool. For a unique dining experience, The Field House serves rustic, home-style alfresco meals with endless views of the rolling countryside. \n\nDiscover The Pool Club, a breathtaking example of architectural brilliance, and the opulent Whiskey Lounge, featuring exquisite low-set designer furniture, then wander through the onsite poultry farm and lemon orchard, both maintained with sustainable farming practices. Whether you're a music lover, foodie or wellness enthusiast, Sun Ranch promises a serene and indulgent retreat for all.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Coopers Shoot",
    "location_heading": "Coopers Shoot",
    "location_subheading": "New South Wales",
    "location_description": "Sun Ranch",
    "offer_address": "17 Byron Creek Road, Coopers Shoot, New South Wales 2479, Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 369.0,
    "value": 658.0
  }
]