[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005J9bNAAS",
    "hero_image": "https://images.luxuryescapes.com/0monv1vt14cv9vnygsln",
    "image_two": "https://images.luxuryescapes.com/p4m7mm2k6v8z6ul9g9f",
    "image_three": "https://images.luxuryescapes.com/ns22s8ef7py3w311tx6",
    "vendor_name": "The Links Lady Bay",
    "title": "Fleurieu Peninsula Coastal Escape with Championship Golf Course & Daily Breakfast",
    "description": "Swing into your next escape at Links Lady Bay, a coastal retreat hidden where the vines meet the sea in the bountiful Fleurieu Peninsula. Under 90 minutes from Adelaide's glittering CBD, this seaside escape feels a world away from the city buzz with a tranquil championship PGA-rated links 18-hole golf course and kangaroos bounding across the property. When you're not whiling away an afternoon on one of Australia's top 100 golf courses in 2021 - as ranked by Golf Australia, take a meander down to the coral-white beachfront or float away in the hotel swimming pool.\n\nBeyond the hotel, Fleurieu Peninsula is a playground of possibilities. Within a five-minute drive, you'll find some of the region’s most beautiful beaches in Normanville and an abundance of walking and cycling tracks. Drive just half an hour and you'll descend into one of South Australia's most celebrated food and wine regions: McLaren Vale - home to the famous d'Ardenberg's Cube, more than 80 cellar doors and a collection of hidden restaurants on clifftops and down dirt roads. Find your very own seaside haven, golfer’s paradise or wine lover's escape from Links Lady Bay.\n\n**Your handpicked inclusions:**\n\n- Wake up each day to a delicious daily breakfast\n- Celebrate your escape with a welcome drink of beer, wine or soft drink on arrival\n- Enjoy one mouth-watering two-course à la carte dinner for two at Lady Bay Hotel restaurant\n- Relax up until the last moment with guaranteed 12pm late checkout\n\n**Championship Golf Upgrade available:** Keen golfers will want to make the most of the championship course at Links Lady Bay with our Championship Golf Upgrade, which includes a daily round of golf each and one-time buggy hire to zip across the green with ease. See the Fine Print for details.\n\n**Longer Stay Bonus:** Extend your stay to receive bonus dining and drinks credit per package for Lady Bay Hotel restaurant. See individual packages for details.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Normanville",
    "location_heading": "Normanville",
    "location_subheading": "South Australia",
    "location_description": "Links Lady Bay Jun21",
    "offer_address": "73 St Andrews Boulevard, Normanville SA 5204",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 220.0,
    "value": 390.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C48clAAB",
    "hero_image": "https://images.luxuryescapes.com/w513dn0skm3eyh95kmoe",
    "image_two": "https://images.luxuryescapes.com/l2qbfbqqpj6zxagmixd5",
    "image_three": "https://images.luxuryescapes.com/k9zjl7d1qrsezykuprg",
    "vendor_name": "The Links Lady Bay",
    "title": "Fleurieu Peninsula Coastal Escape with Championship Golf Course & Daily Breakfast",
    "description": "Swing into your next escape at Lady Bay Resort, a coastal retreat hidden on the Fleurieu Peninsula. Under 90 minutes from Adelaide's glittering CBD, this seaside escape feels a world away from the city buzz with a tranquil championship PGA-rated links 18-hole golf course and kangaroos bounding across the property. When you're not spending time on one of Australia's top 100 golf courses, wander down to the coral-white beachfront or float away in the hotel pool.\n\nBeyond the hotel, Fleurieu Peninsula is a playground of possibilities. Within a five-minute drive, you'll find some of the region’s most beautiful beaches and an abundance of walking and cycling tracks. Drive just half an hour and you'll descend into one of South Australia's most celebrated food and wine regions: McLaren Vale - home to more than 80 cellar doors.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Normanville",
    "location_heading": "Normanville",
    "location_subheading": "South Australia",
    "location_description": "Lady Bay Resort",
    "offer_address": "73 St Andrews Blvd, Normanville SA 5204",
    "percentage_discount": 19.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 220.0,
    "value": 271.0
  }
]