[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004iN9uAAE",
    "hero_image": "https://images.luxuryescapes.com/temxgj8c7kobtp9lc22",
    "image_two": "https://images.luxuryescapes.com/yhov8qf3bd3uncbdtzan",
    "image_three": "https://images.luxuryescapes.com/qhftqyvqa2yc49s7il9",
    "vendor_name": "Azerai Can Tho",
    "title": "Vietnam Five-Star Riverfront Island Retreat in the Mekong Delta Region",
    "description": "Soak up the sun and discover new levels of luxury at the five-star Legacy Mekong - an award-winning, zen-inducing retreat in the vibrant Mekong Delta region of Vietnam. Spread over an islet on the Hau River, this leafy idyll offers luxurious accommodation and outstanding facilities away from the urban bustle of the mainland. Winner of a Tripadvisor Travellers' Choice 2021 award and ranked among the top 10% of properties worldwide on the review site, Legacy Mekong ensures guests stay in style.\n\nSet amid eight hectares of lush tropical flora, with a calming infinity pool, riverside tennis court, lavish spa, state-of-the-art pilates studio and gym, yoga pavilion, and three remarkable restaurants and bars, this secluded sanctuary allows guests to get away from it all. Spacious villas dial the escapism up a notch, offering a completely private space that flaunts verdant views and marries local and traditional materials with modern luxuries. Find your perfect patch of peace by the lotus-flecked lake or in the lush gardens, dotted with banyan trees. Looking to explore? A short ferry ride takes you to the city, where lively markets beckon, or make your way to the nearby Pitu Khosa Rangsay Pagoda - one of the most important places of worship in the Mekong Delta.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Cần Thơ",
    "offer_geo_area_level_2": "Can Tho",
    "location_heading": "Cần Thơ",
    "location_subheading": "Vietnam",
    "location_description": "Legacy Mekong",
    "offer_address": "Cồn Ấu, Cái Răng, Cần Thơ, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 223.0,
    "value": 223.0
  }
]