[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EhI4rYAF",
    "hero_image": "https://images.luxuryescapes.com/pkaxfpbkhpm1k5xuuws",
    "image_two": "https://images.luxuryescapes.com/tqqpf917rdlkcm7zwnrs",
    "image_three": "https://images.luxuryescapes.com/eyu0w2r14am1dt4khldp",
    "vendor_name": "Fairmont Ajman",
    "title": "Ajman Arabian Opulence near Dubai with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Escape to a world of refined Arabian luxury with a stay at this beachfront haven, perfectly situated on the Ajman Corniche, overlooking the shimmering waters of the Arabian Gulf. Catch epic sunsets from the seaside infinity pool, head straight to the private beach right on your doorstep, or indulge like never before at the onsite spa.\n\nWhen hunger strikes, head to Gioia for authentic Italian delicacies, relish a buffet at Spectrum, feast on Turkish delights at Kiyi or choose between the lively Xolo Sports Bar or Salt & Sea for refreshing sips in the sun.\n\nShould you wish to venture further afield, the Corniche beckons with leisurely seaside strolls and inviting cafes, while Dubai's world-class shopping and iconic landmarks are just an hour away.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Ajman",
    "offer_geo_area_level_2": "Ajman",
    "location_heading": "Ajman",
    "location_subheading": "United Arab Emirates",
    "location_description": "Fairmont Ajman",
    "offer_address": "Sheikh Humaid Bin Rashid, Al Nuaimi Street, Al Nakhil 2, Ajman 97555, United Arab Emirates",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 489.0,
    "value": 1579.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2z8IAC",
    "hero_image": "https://images.luxuryescapes.com/gf586qrpa3aara4wbm29",
    "image_two": "https://images.luxuryescapes.com/o6agzfix18qlc5tfne3x",
    "image_three": "https://images.luxuryescapes.com/ol549245l6a1jshisn2d",
    "vendor_name": "Fairmont Ajman",
    "title": "Ajman Private Beach Opulence with Seven Dining Venues & World-Class Spa",
    "description": "Embrace beachfront grandeur at this regal hotel on the pristine shores of the Arabian Gulf. Enjoy the hotel's private shoreline and glistening outdoor pool, or venture to the nearby Ajman Museum for a taste of local history.\n\nSavour world-class international dining at Spectrum, dine on classic Italian cuisine at Gioia, catch a game at the Xolo Sports Bar or indulge in a rejuvenating treatment at the Willow Stream Spa. For shopping enthusiasts, the Ajman city centre is just a short drive away.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Ajman",
    "offer_geo_area_level_2": "Ajman",
    "location_heading": "Ajman",
    "location_subheading": "UAE",
    "location_description": "Fairmont Ajman",
    "offer_address": "Sheikh Humaid Bin Rashid Al Nuaimi Street, Ajman 97555, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 116.0,
    "value": 116.0
  }
]