[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcXqzAAF",
    "hero_image": "https://images.luxuryescapes.com/u0coyhso2p3bq2rbgtel",
    "image_two": "https://images.luxuryescapes.com/olxeh16ipprk67pvirwq",
    "image_three": "https://images.luxuryescapes.com/4xsgq0pflds3fh2p1jr",
    "vendor_name": "Tapovana Heritage Resorts and SPA",
    "title": "Serene Sakleshpur Heritage Escape with Daily Breakfast, One Lunch/Dinner & a Coffee Plantation Walk",
    "description": "Cocooned amid misty coffee plantations, Tapovana Heritage Resorts and Spa is a tranquil escape in Sakleshpur, a short five-hour drive from Bengaluru. Reminiscent of South Indian ancestral homes, the exquisite Malnad architecture, featuring sloping roofs, exposed wooden beams and intricate carvings evokes a nostalgic charm. A four-hour drive from Mangaluru International Airport (IXE), the property is the epitome of heritage luxury and offers breathtaking views of the Western Ghats and boasts thoughtfully designed rooms with all modern amenities. Go for a rejuvenating swim in the infinity pool with a heated jacuzzi or destress at the spa with therapeutic treatments or delight your tastebuds with delicious food fare at the multi-cuisine restaurant, Navarasa.\n\nLulled by lush greenery and endless vistas of coffee and spice plantations, Tapovana Resorts and Spa makes for an ideal base to explore the gems of Sakleshpur. Take a leisurely stroll through many a nature trail or venture outdoors and visit Manjarabad Fort (a 30-minute drive), Manjehalli Falls (a 45-minute drive) and Bisle Ghat Viewpoint (an hour’s drive).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Sakleshpur",
    "location_heading": "Sakleshpur",
    "location_subheading": "India",
    "location_description": "Tapovana Heritage Resorts and Spa",
    "offer_address": "Survey No. 66 Near Chimmecool Estate, Chimmecool Road, Agni Village Hanbal, Hobli, Sakleshpura, Karnataka - 573134 India",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 247.0,
    "value": 351.0
  }
]