[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PmuWAAS",
    "hero_image": "https://images.luxuryescapes.com/ejrvxnqe6c25edbz7w8",
    "image_two": "https://images.luxuryescapes.com/h89g4iigif2c73op0h4j",
    "image_three": "https://images.luxuryescapes.com/viurll52xcn8e05c265",
    "vendor_name": "Koendidda Country House",
    "title": "Rutherglen Heritage Victoria Wine Country Escape with Daily Breakfast",
    "description": "In the heart of the Rutherglen wine region, Koendidda Country House offers a luxuriously charming escape in rural Victoria. Built with Gold Rush fortune in the 1850s, this is a slice of old-world serenity, with warm open fireplaces to cosy up in front of with a glass of red and a gorgeous formal dining room to enjoy a fancy feast. \n\nKoendidda Country House is a place to savour at leisure, strolling the immaculate gardens, listening to the chorus of birds first thing in the morning and revelling in the quiet ambience of rural Victoria. Leave the world behind in the quaint town of Barnawartha, a three-hour drive from Melbourne. Drive 25 minutes from the estate to Rutherglen’s premier wine region, home to over 20 award-winning vineyards with outstanding restaurants and cafés. Discover the delicious aged muscat at the vine-covered All Saints Estate, linger for a bite at De Bortoli and hire a vintage bike at St Leonards Vineyard to explore Rutherglen at your own pace.\n\n**Your handpicked inclusions:**\n\n- Wake up to a delicious continental and à la carte breakfast each morning\n- Celebrate your escape with a welcome glass of Rutherglen wine\n- The celebrations continue with a bottle of wine waiting for you in your room\n- Feast on an indulgent cheese platter to share\n- Relax right up until the last minute with guaranteed 12pm late checkout\n\n**This deal has NO peak surcharges:** Travel any time for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Indigo Valley",
    "location_heading": "Rutherglen Wine Region",
    "location_subheading": "Victoria",
    "location_description": "Koendidda Country House JUL21",
    "offer_address": "79 Pooleys Rd Indigo Valley Wodonga Victoria 3688 Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 247.0,
    "value": 443.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Edi3AAC",
    "hero_image": "https://images.luxuryescapes.com/cauftqiuen006hdtt97p",
    "image_two": "https://images.luxuryescapes.com/n6jdoa5k3pwvf405b8bt",
    "image_three": "https://images.luxuryescapes.com/2mbcuw7stay8nf69ayhn",
    "vendor_name": "Koendidda Country House",
    "title": "Historic Victorian Wine Country Stay with Daily Breakfast",
    "description": "In the heart of Rutherglen wine region, Koendidda Country House offers a luxuriously charming escape in rural Victoria. Built with Gold Rush fortune in the 1850s, this is a slice of old-world serenity, with warm open fireplaces and perfectly manicured storybook gardens. Leave the world behind in the quaint town of Barnawartha, a three-hour drive from Melbourne.\n\nBe welcomed in style with a drink each on arrival and a bottle of wine in-room (choice of Rutherglen red, white or sparkling), and enjoy daily cooked and continental breakfast, a cheese plate to share and guaranteed 12pm late checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Indigo Valley",
    "location_heading": "Rutherglen Wine Region",
    "location_subheading": "Victoria",
    "location_description": "Koendidda Country House - May 20",
    "offer_address": "79 Pooleys Rd, Barnawartha VIC 3688",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 239.0,
    "value": 380.0
  }
]