[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IygJIAS",
    "hero_image": "https://images.luxuryescapes.com/d7cmtow3r1lsden6kdh",
    "image_two": "https://images.luxuryescapes.com/2vt4svr3wsk7n3zv3ym",
    "image_three": "https://images.luxuryescapes.com/gwzr7e5losyc9bgyr6aw",
    "vendor_name": "InterContinental Khao Yai Resort",
    "title": "Boutique Thailand Rail-Inspired Retreat in UNESCO National Park with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Discover railroad-inspired resplendence on the boundary of the UNESCO World Heritage-listed Khao Yai National Park at this spectacular five-star resort, crafted by renowned architect and interior designer Bill Bensley.\n\nBoasting just 64 boutique luxury rooms, each celebrating Thailand's Golden Age of Rail, this sophisticated resort, located just three hours drive from Bangkok, is like nowhere else in the world. Wander past koi ponds and pig-tailed macaques in the resort’s Swan Lake Botanical Garden, be pampered during treatments at the spa and savour the unique experience of sleeping in a room replicating a luxury railcar.\n\nIndulge in refined French plates at Poirot Brasserie, dine al fresco at Somying's Kitchen or take refreshments in style at the Tea Carriage. Further into Khao Yai, discover elephants roaming in the wild and the majestic Hornbill fluttering along the UNESCO-listed treeline.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Nakhon Ratchasima Province",
    "offer_geo_area_level_2": "Pak Chong",
    "location_heading": "Khao Yai",
    "location_subheading": "Thailand",
    "location_description": "InterContinental Khao Yai Resort, an IHG Hotel",
    "offer_address": "262 Moo 6, Pong Talong, Pak Chong, Nakhon Ratchsima 30450, Thailand",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 599.0,
    "value": 1708.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000KEHrtYAH",
    "hero_image": "https://images.luxuryescapes.com/tzwmlbnufh1p9i3f7iak",
    "image_two": "https://images.luxuryescapes.com/csv4s4nh2eg0lik45cq",
    "image_three": "https://images.luxuryescapes.com/4tiwmqvw77mfs4359wvh",
    "vendor_name": "InterContinental Khao Yai Resort",
    "title": "Boutique Thailand Rail-Inspired Retreat in UNESCO National Park with Daily Breakfast, Dinner & Cocktails",
    "description": "Discover railroad-inspired resplendence on the boundary of the UNESCO World Heritage-listed Khao Yai National Park at this spectacular five-star resort, crafted by renowned architect and interior designer Bill Bensley. Boasting just 64 boutique luxury rooms, each celebrating Thailand's Golden Age of Rail, this sophisticated resort, located just three hours' drive from Bangkok, is like nowhere else in the world.\n\nWander past koi ponds and pig-tailed macaques in the resort’s Swan Lake Botanical Garden, be pampered at the spa and savour the unique experience of sleeping in a room replicating a luxury railcar. Indulge in refined French plates at Poirot Brasserie, dine al fresco at Somying's Kitchen or take refreshments in style at the Tea Carriage. Further into Khao Yai, discover elephants roaming in the wild and the majestic Hornbill fluttering along the treeline.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Nakhon Ratchasima Province",
    "offer_geo_area_level_2": "Pak Chong",
    "location_heading": "Khao Yai",
    "location_subheading": "Thailand",
    "location_description": "InterContinental Khao Yai Resort, an IHG Hotel",
    "offer_address": "262 Moo 6, Pong Talong, Pak Chong, Nakhon Ratchsima 30450, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 609.0,
    "value": 1597.0
  }
]