[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQJZQAA5",
    "hero_image": "https://images.luxuryescapes.com/xtg9pin2lpvnj22wvak",
    "image_two": "https://images.luxuryescapes.com/uiztt9kara2h7engwbzac",
    "image_three": "https://images.luxuryescapes.com/l66v767r3mkxshjw4t0g",
    "vendor_name": "Crowne Plaza Copenhagen Towers",
    "title": "Copenhagen Sustainable Retreat near Denmark's Largest Shopping Mall",
    "description": "A pioneer in Danish sustainability without sacrificing style or comfort, Crowne Plaza Copenhagen Towers, an IHG Hotel, is minutes from the city centre and the airport. Savour locally-sourced Nordic cuisine in true American diner fashion at BARK restaurant. Then, splurge on some retail therapy at Field's, Denmark's largest shopping mall, less than a five-minute walk from the hotel, or head out to soak up the picturesque architecture and canals of this modern Scandinavian city.",
    "offer_country_name": "Denmark",
    "offer_country_code_alpha_2": "DK",
    "offer_geo_area_level_1": "Hovedstaden",
    "offer_geo_area_level_2": "Copenhagen",
    "location_heading": "Copenhagen",
    "location_subheading": "Denmark",
    "location_description": "Crowne Plaza Copenhagen Towers, an IHG Hotel",
    "offer_address": "Copenhagen Towers, Orestads Blvd. 114-118, 2300 Copenhagen, Denmark",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 135.0,
    "value": 135.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008JBHPAA4",
    "hero_image": "https://images.luxuryescapes.com/av09ppa1ownylsd2he",
    "image_two": "https://images.luxuryescapes.com/j6rw1u6qxljqon8chsug",
    "image_three": "https://images.luxuryescapes.com/z26cj2qk0er8bi3obvb9",
    "vendor_name": "Hotel Skt Petri",
    "title": "Five-Star Copenhagen Stay Near Rosenborg Castle with Rooftop Garden Bar",
    "description": "Uncover the culture and history of Copenhagen from your stylish base, the five-star Hotel Skt. Petri - perfectly positioned just a short stroll from some of the city's best sights including the Round Tower, Tivoli Gardens and Rosenborg Castle. Built within a former department store, this trendy property combines Danish stylings with modern amenities and features ultra-cool rooms or suites, an impressive restaurant and cocktail bar, a modern fitness centre, New York-inspired rooftop beer garden and onsite bicycle hire so you can roll through the history-lined streets.\n\nLocated with one foot in the trendy Latin Quarter and the other within the historic-filled part of Copenhagen, Skt. Petri is the ultimate launchpad for discovering the Danish capital. Visit The Little Mermaid statue, marvel at the coloured buildings in Nyhavn or catch a train at the nearby Nørreport Station for a day trip beyond the city limits.",
    "offer_country_name": "Denmark",
    "offer_country_code_alpha_2": "DK",
    "offer_geo_area_level_1": "Hovedstaden",
    "offer_geo_area_level_2": "Copenhagen",
    "location_heading": "Copenhagen",
    "location_subheading": "Denmark",
    "location_description": "Hotel Skt. Petri",
    "offer_address": "Krystalgade 22, 1172 Copenhagen, Denmark",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]