[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cJouoQAC",
    "hero_image": "https://images.luxuryescapes.com/3mom2zqvlvq6irwy1v256",
    "image_two": "https://images.luxuryescapes.com/s61w6nqzbmg3vkic44a",
    "image_three": "https://images.luxuryescapes.com/9cz5j74obmh1xkg33s1g",
    "vendor_name": "Chedi Lustica Bay",
    "title": "A Luxe Getaway on the Adriatic Sea with Daily Dining Experiences",
    "description": "It’s time to treat yourself to a Mediterranean retreat with a difference. Tucked away on the Adriatic Coast is Montenegro, a stunning country home to beautiful beaches, medieval architecture and rich culture, perfect for a European getaway. Nestled in the picturesque town of Luštica Bay is The Chedi Luštica Bay, a five-star hotel offering a luxe coastal experience, complete with access to a private beach. Enjoy a daily buffet breakfast of Mediterranean cuisine, daily buffet breakfast, a EUR€20 spa credit, a welcome drink on arrival and a welcome gift of fresh fruit.",
    "offer_country_name": "Montenegro",
    "offer_country_code_alpha_2": "ME",
    "offer_geo_area_level_1": "Opština Herceg Novi",
    "offer_geo_area_level_2": "",
    "location_heading": "Luštica Bay",
    "location_subheading": "Montenegro",
    "location_description": "The Chedi Luštica Bay 2018",
    "offer_address": "Luštica Bay Marina, Radovići 85323, Montenegro",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 475.0,
    "value": 1294.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004CPlXAAW",
    "hero_image": "https://images.luxuryescapes.com/dqngns3w8r875g18mro",
    "image_two": "https://images.luxuryescapes.com/70r46sv523cu91qcjr8",
    "image_three": "https://images.luxuryescapes.com/7o9i02xcvgbtyt8d2dar",
    "vendor_name": "Chedi Lustica Bay",
    "title": "Five-Star Montenegro Waterfront Escape with Private Beach Overlooking the Adriatic Sea",
    "description": "Strike the perfect balance between crystal-clear Adriatic waters, Mediterranean-inspired culture and nearly year-round sunshine in Montenegro at the five-star boutique Chedi Luštica Bay. Stretched along the waterfront of Luštica Bay, this luxury hotel is cradled by the tranquil embrace of the recently built Trašte Bay - where the striking Montenegrin coast meets the azure Adriatic Sea. Here, you will find some of the country's best restaurants and boutiques, and a sublime, right-off-the-yacht marina.\n\nEach of the 111 designer rooms redefines breezy-chic and reflects Chedi’s maritime environment, drawing on architecture from the local villages, a subdued palette of aquamarine, grey and white, and views of the surrounding water and/or mountains. Channelling a contemporary look, the hotel's luxurious interiors are spacious, stylish and sunlit.\n\nDuring your stay, choose to relish the delights of refined, regional cuisine at The Restaurant or dine on an alfresco lunch at The Spot. Equally mesmerising is The Rok, a dramatic bar carved into a natural rock on the soft sands of The Chedi's incredible private beach. Should the sun be shining, the heated outdoor infinity pool that cascades across three levels is the perfect place to watch the world go by, while The Spa, with a gym and four calming treatment rooms, will relieve stress and restore strength. While leaving the hotel is optional, there’s more to explore further afield - from wine and olive oil tastings to visiting the medieval town of Kotor, just 20 minutes’ drive away.\n\n**Luxury Escapes inclusions (select packages)**\n\n- **Daily buffet breakfast** of fresh fruit, juices, pastries, made-to-order eggs, pancakes and waffles at The Restaurant\n- Toast your coastal escape in style with a **welcome drink** served on arrival in the lobby\n- Be greeted with a **fresh fruit platter**\n- Indulge with **EUR20 dining credit** per package for onsite restaurants and bars (for stays of 3+ nights)\n- Sink into a world of relaxation with a **50-minute Asian-inspired massage per person** at the award-winning spa (for stays of 7+ nights)\n\n**Penthouse upgrade available**: Choose to stretch out in the largest accommodation at The Chedi Luštica Bay in a Luštica Bay Penthouse - with two bedrooms, two bathrooms and a spacious living area.",
    "offer_country_name": "Montenegro",
    "offer_country_code_alpha_2": "ME",
    "offer_geo_area_level_1": "Tivat Municipality",
    "offer_geo_area_level_2": "Radovići",
    "location_heading": "Luštica Bay",
    "location_subheading": "Montenegro",
    "location_description": "The Chedi Luštica Bay",
    "offer_address": "Luštica Bay Marina Radovići, 85323, Montenegro",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 174.0,
    "value": 174.0
  }
]