[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JCpaIAG",
    "hero_image": "https://images.luxuryescapes.com/9tjai3r7ho3vp7kyntam",
    "image_two": "https://images.luxuryescapes.com/jt2rs8azolnqq9b7lw6r",
    "image_three": "https://images.luxuryescapes.com/oh75zgfvrd8jivj3r9xw",
    "vendor_name": "Discovery Resorts -  Kings Canyon",
    "title": "Unmissable Kings Canyon Outback Retreat with Daily Breakfast & Bruce Munro's Light-Towers Experience",
    "description": "Experience a one-of-a-kind escape to a true outback oasis just a stone's throw from the ancient geological wonders of Watarrka National Park and George Gill Range. Explore the renowned Light-Towers installation, an enchanting maze of sound and light by acclaimed artist Bruce Munro, then soothe your muscles in the refreshing, lagoon-style swimming pool.\n\nAdventurous travellers looking to explore the heart of Australia's Red Centre can experience unparalleled seclusion - the resort is a 3.5-hour drive from Uluṟu - while still being within easy reach of some of the country's best outback sights.\n\nEnjoy day trips to the awe-inspiring neighbouring Uluṟu-Kata Tjuṯa National Park or relax in the comfort of your unique accommodation. Savour dishes crafted from native ingredients at Carmichael's Restaurant and clink your glasses to your memorable stay at the newly refurbished Kings Canyon Bar & Grill.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Petermann",
    "location_heading": "Kings Canyon",
    "location_subheading": "Northern Territory",
    "location_description": "Discovery Resorts - Kings Canyon",
    "offer_address": "Luritja Road, Petermann, Northern Territory 0872, Australia",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 429.0,
    "value": 891.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004umYQAAY",
    "hero_image": "https://images.luxuryescapes.com/n56iiozh0d589z8hkle",
    "image_two": "https://images.luxuryescapes.com/x7jghrawxkhhx6lk7bx5",
    "image_three": "https://images.luxuryescapes.com/iypz9w1smf3cxbd3vdud",
    "vendor_name": "Discovery Resorts -  Kings Canyon",
    "title": "Unmissable Kings Canyon Outback Retreat with Dinner, Guided Rim Walk & Daily Breakfast",
    "description": "Experience a one-of-a-kind escape to a true outback oasis at Discovery Kings Canyon, a remote resort designed and developed to ensure maximal comfort. Marvel at the majestic beauty of the Australian outback that has the power to take your breath away thanks to its vast and ancient landscape, then soothe your muscles in the refreshing, lagoon-style pool.\n\nAdventurous travellers looking to explore the heart of Australia can experience unparalleled remoteness (3.5 hours from Alice Springs) within easy reach of some of the best outback sights. Traverse the Mars-like landscape to the 440-million-year-old Kings Canyon, which rises 270 metres above sea level to create a spectacular natural phenomenon. Take a day trip to the awe-inspiring Uluru or relax in the comforts of your unique accommodation, where you can savour dishes crafted from native ingredients at Carmichael's Restaurant and clink your glasses to your memorable stay at the newly refurbished Kings Canyon Bar and Grill.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Petermann",
    "location_heading": "Kings Canyon",
    "location_subheading": "Northern Territory",
    "location_description": "Discovery Resorts - Kings Canyon",
    "offer_address": "Luritja Road, Petermann, Northern Territory 0872, Australia",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 669.0,
    "value": 1059.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcrYOAAZ",
    "hero_image": "https://images.luxuryescapes.com/1ooaq6dku6zr7xdyojg",
    "image_two": "https://images.luxuryescapes.com/9ioq25rubrrsyockygnj",
    "image_three": "https://images.luxuryescapes.com/pynjgtt3n5jd6tr417o",
    "vendor_name": "Discovery Resorts -  Kings Canyon",
    "title": "Unmissable Kings Canyon Outback Retreat with Daily Breakfast & Renowned Light-Towers Experience",
    "description": "Experience a one-of-a-kind escape to a true outback oasis at Discovery Resorts - Kings Canyon, a remote resort located just a stone's throw from the ancient canyon that has been completely refurbished to ensure maximal comfort. Explore the renowned Light-Towers installation, an enchanting maze of sound, light, and energy by acclaimed artist Bruce Munro, then soothe your muscles in the refreshing, lagoon-style swimming pool.\n\nAdventurous travellers looking to explore the heart of Australia's red centre can experience unparalleled remoteness (3.5 hours from Alice Springs) within easy reach of some of the best outback sights. Guests with select packages can traverse the 440-million-year-old Kings Canyon, which rises 270 metres above sea level, on a spectacular guided rim walk. Take your own day trip to the awe-inspiring Uluru or relax in the comfort of your unique accommodation, where you can savour dishes crafted from native ingredients at Carmichael's Restaurant and clink your glasses to your memorable stay at the newly refurbished Kings Canyon Bar & Grill.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Northern Territory",
    "offer_geo_area_level_2": "Petermann",
    "location_heading": "Kings Canyon",
    "location_subheading": "Northern Territory",
    "location_description": "Discovery Resorts - Kings Canyon",
    "offer_address": "Luritja Road, Petermann, Northern Territory 0872, Australia",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 569.0,
    "value": 890.0
  }
]