[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HuA69YAF",
    "hero_image": "https://images.luxuryescapes.com/spmxrtox2l5nld2sqq7",
    "image_two": "https://images.luxuryescapes.com/bzq3d5m3oisbryw291",
    "image_three": "https://images.luxuryescapes.com/ljpsm6fahkmqmiumobuy",
    "vendor_name": "Centara Mirage Resort Mui Ne Vietnam",
    "title": "Vietnam Family-Friendly All-Inclusive Bliss with Massages, Free-Flow Drinks & Return Transfers",
    "description": "Families and honeymooners alike will be drawn to this exquisite resort nestled along Mui Ne's pristine coastline. Sprawled across flower-packed gardens with the East Sea as your backdrop, this place throws boring beach holidays out the window and serves up pure indulgence and magic in spades.\n\nThe kids will lose their minds over the epic waterpark while you're busy perfecting your poolside lounging technique. When you need to fully decompress, SPA Cenvaree beckons with next-level relaxation. With return airport transfers from Tan Son Nhat International Airport in Ho Chi Minh City and all-inclusive indulgence, everything is completely taken care of.\n\nYou're close enough to civilisation but far enough to disconnect and dive into legendary sand dune adventures. Food-wise, Mundo's breakfast is like a morning feast, while Faro Cafe keeps the caffeine flowing when you need that afternoon pick-me-up. With four bars around the resort, finding the perfect sunset cocktail spot becomes the easiest task of the day.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Thuan Province",
    "offer_geo_area_level_2": "Phan Thiet",
    "location_heading": "Mui Ne",
    "location_subheading": "Vietnam",
    "location_description": "Centara Mirage Resort Mui Ne",
    "offer_address": "Huỳnh Thúc Kháng Street, Bình Thuận 77100, Vietnam",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 729.0,
    "value": 2892.0
  }
]