[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMk6oAAD",
    "hero_image": "https://images.luxuryescapes.com/qp8f6xbbuwcovci3d1as",
    "image_two": "https://images.luxuryescapes.com/ayp368fwvfbvcjc85pbz",
    "image_three": "https://images.luxuryescapes.com/9lxup0l88issuql0e5c",
    "vendor_name": "Spa Village Resort Tembok Bali",
    "title": "Northern Bali Adults-Only Retreat with All-Inclusive Dining, Daily Massages & Roundtrip Transfers",
    "description": "Retreat to the north-eastern coast of Bali and enjoy a rejuvenating, soul-nurturing stay at Spa Village Resort Tembok Bali, part of the exclusive collection of Small Luxury Hotels of the World. This adults-only haven has it all: exceptional facilities including a dazzling infinity pool that seems to disappear into the ocean, exciting onsite dining at Wantilan with a wide variety of Indonesian fusion and Western plates, a state-of-the-art spa for head-to-toe pampering and a host of exciting activities available to guests, including yoga and cooking classes.\n\nTemporarily leave it all behind and discover some of Bali's best-kept secrets. Wake early to hike Mount Batur at sunrise, marvel at Les Waterfalls or embark on a diving or snorkelling adventure at Tulamben to explore the Liberty Shipwreck.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tejakula",
    "location_heading": "Tembok",
    "location_subheading": "Bali",
    "location_description": "Spa Village Resort Tembok Bali",
    "offer_address": "Jalan Singaraja-Amlapura, No. 100 Desa Tembok, Tejakula Buleleng, Bali, Indonesia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 648.0,
    "value": 1204.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRw3qAAD",
    "hero_image": "https://images.luxuryescapes.com/td5gwc18adk7l56ld205",
    "image_two": "https://images.luxuryescapes.com/ku6frsvm9umlwuxlyjc",
    "image_three": "https://images.luxuryescapes.com/tdtk86cv7hj969083mwg",
    "vendor_name": "Spa Village Resort Tembok Bali",
    "title": "Bali North Coast Adults-Only Retreat with All-Inclusive Dining, Daily Massages & Return Transfers",
    "description": "Retreat to the northeastern coast of Bali and enjoy a rejuvenating, soul-nurturing stay at this romantic spa resort. Part of the exclusive collection of Small Luxury Hotels of the World, this adults-only haven has it all: exceptional facilities including a dazzling infinity pool that seems to disappear into the ocean, exciting onsite dining at Wantilan, a state-of-the-art spa for head-to-toe pampering and a host of exciting activities available to guests.\n\nThe tranquil ambience is sure to leave you feeling instantly soothed from the moment you arrive. Admire the swaying palms set against the black volcanic sands and towering peaks in the distance, or temporarily leave it all behind to reach of some of Bali's best-kept secrets.\n\nWant to explore further afield, wake early to hike Mount Batur at sunrise, marvel at Les Waterfalls or embark on a diving or snorkelling adventure at Tulamben to explore the Liberty Shipwreck.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tejakula",
    "location_heading": "Tembok",
    "location_subheading": "Bali",
    "location_description": "Spa Village Resort Tembok Bali",
    "offer_address": "Jalan Singaraja-Amlapura, No. 100 Desa Tembok, Tejakula Buleleng, Bali, Indonesia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 669.0,
    "value": 1224.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPsJDAA1",
    "hero_image": "https://images.luxuryescapes.com/pi8tgft9cbzje6cj98q",
    "image_two": "https://images.luxuryescapes.com/equohhc79wdnn2zpeg2c",
    "image_three": "https://images.luxuryescapes.com/sc8ne1xhxdlneqc7kvk3",
    "vendor_name": "Spa Village Resort Tembok Bali",
    "title": "Adults-Only Bali Retreat with All-Inclusive Dining, Daily Massages & Roundtrip Transfers",
    "description": "Retreat to the northeast coast of Bali and enjoy a rejuvenating, soul-nurturing stay at Spa Village Resort Tembok, part of the exclusive collection of Small Luxury Hotels of the World. Set against a tranquil backdrop of swaying palms, black volcanic sands and towering peaks, this adults-only haven has all the ingredients for ultimate relaxation and romance, and has previously welcomed A-list guests such as Keira Knightley. Discover a dazzling infinity pool that seamlessly flows into the ocean, fresh seafood and organic local fare at Wantilan, a state-of-the-art spa for head-to-toe pampering, and a host of authentic Balinese activities, including yoga and cooking classes.\n\nWhen adventure calls, discover some of Bali's best-kept secrets. Wake early to hike Mount Batur at sunrise, marvel at Les Waterfalls or embark on a diving or snorkelling adventure at Tulamben to explore the Liberty Shipwreck.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tejakula",
    "location_heading": "Tembok",
    "location_subheading": "Bali",
    "location_description": "Spa Village Resort Tembok Bali",
    "offer_address": "Jalan Singaraja-Amlapura, No. 100 Desa Tembok, Tejakula Buleleng, Bali, Indonesia",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 831.0,
    "value": 1467.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BqAEAA0",
    "hero_image": "https://images.luxuryescapes.com/8adp8oot5jto3qcfqdi",
    "image_two": "https://images.luxuryescapes.com/fipwym92nmetavh7w6y",
    "image_three": "https://images.luxuryescapes.com/smlpieuwsjzojm1o7h5r",
    "vendor_name": "Spa Village Resort Tembok Bali",
    "title": "Adults-Only Bali Retreat with All-Inclusive Dining, Daily Massages & Roundtrip Transfers",
    "description": "Retreat to the north-eastern coast of Bali and enjoy a rejuvenating, soul-nurturing stay at Spa Village Resort Tembok, part of the exclusive collection of Small Luxury Hotels of the World. This adults-only haven has it all: exceptional facilities including a dazzling infinity pool that seamlessly flows into the ocean, exciting onsite dining at Wantilan, a state-of-the-art spa for head-to-toe pampering and a host of exciting activities available to guests, including yoga and cooking classes.\n\nThe tranquil ambience is sure to leave you feeling instantly soothed from the moment you arrive. Admire the swaying palms set against the black volcanic sands and towering peaks in the distance, or temporarily leave it all behind to reach of some of Bali's best-kept secrets. Wake early to hike Mount Batur at sunrise, marvel at Les Waterfalls or embark on a diving or snorkelling adventure at Tulamben to explore the Liberty Shipwreck.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tejakula",
    "location_heading": "Tembok",
    "location_subheading": "Bali",
    "location_description": "Spa Village Resort Tembok Bali",
    "offer_address": "Jalan Singaraja-Amlapura, No. 100 Desa Tembok, Tejakula Buleleng, Bali, Indonesia",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 859.0,
    "value": 1536.0
  }
]