[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pS1KAAU",
    "hero_image": "https://images.luxuryescapes.com/vx526wnmji9xc140m79q",
    "image_two": "https://images.luxuryescapes.com/jtjubp12eoo5r85z6zwn",
    "image_three": "https://images.luxuryescapes.com/y7ysyk24xrf66doaaqh",
    "vendor_name": "Pineapple Tours",
    "title": "Mount Tamborine Full-Day Winery Tour with Guided Tastings & Two-Course Gourmet Lunch",
    "description": "Indulge in fine wine and gourmet culinary creations on a full-day winery tour to gorgeous Mount Tamborine. Southeast Queensland’s Hinterland is a captivating mix of lush rainforest, waterfalls, national parks and mountains - capped off with an abundance of wineries and delicious local produce.\n\nMeet your driver at your pickup location in Brisbane or the Gold Coast and be whisked to the evergreen hinterland, where you’ll have plenty of opportunity to stop at scenic lookouts and admire sweeping panoramas. Deep in the heart of the hinterland is where the true fun begins. Stop at four award-winning and family-owned wineries and distilleries where, after guided tastings, you’ll become a connoisseur of Southeast Queensland wines. Your tour will make four stops: Witches Falls Winery, Cedar Creek Estate, Hampton Estate Wines and Tamborine Mountain Distillery. A gourmet two-course lunch, created by a celebrated chef and paired with a glass of wine, will send your tastebuds into a spin. Lovers of a stronger liquor will enjoy a stop in at Tamborine Mountain Distillery, where tastings of gin and rum are on offer. A cheese platter and handmade chocolates are the perfect way to cap off this mouth-watering gourmet adventure.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Tamborine Mountain",
    "location_heading": "Mount Tamborine",
    "location_subheading": "Queensland",
    "location_description": "Pineapple Tours",
    "offer_address": "Mount Tamborine",
    "percentage_discount": 17.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 254.0,
    "value": 307.0
  }
]