[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zJaSAAU",
    "hero_image": "https://images.luxuryescapes.com/dn15vwzuba0hja4vbcdd",
    "image_two": "https://images.luxuryescapes.com/08zkgr4o1honq7fu1uei",
    "image_three": "https://images.luxuryescapes.com/xkg2qjedxtd68jlukq2k",
    "vendor_name": "Ramada, Udaipur",
    "title": "Serene Udaipur Retreat near Lake Pichola with Daily Breakfast",
    "description": "Perched between serene Lake Pichola and the stunning Aravalli Range is Ramada by Wyndham Udaipur Resort and Spa, a picturesque retreat that promises total comfort and relaxation. Stylish accommodation meets charming views of the lake and the surrounding Udaipur landscape, along with a decadent dining scene. This is the perfect short break for both couples and families looking for a quick escape.\n\nYour package includes daily breakfast, one evening high tea with two snacks, once per stay, and complimentary Wi-Fi. Plus, one child (aged five years and under) stays free with breakfast.\n\n**Family Upgrade**: Upgrade to a package for two adults and one child (aged nine years and under). Family Upgrades will also enjoy nightly dinner, daily high tea with two snacks and one hour of unlimited local/IMFL liquor daily (6.30pm-7.30pm) with two snacks (liquor hour may be switched for lunch if preferred).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Ramada by Wyndham Udaipur Resort and Spa",
    "offer_address": "Rampura Circle Khodiyat Road, Udaipur, Rajasthan 313001",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 119.0,
    "value": 284.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004iOqBAAU",
    "hero_image": "https://images.luxuryescapes.com/k0slotctr6f2wute7o4v",
    "image_two": "https://images.luxuryescapes.com/hw39zhxrbyru7szwhsm",
    "image_three": "https://images.luxuryescapes.com/bj89de7v3o3td8silq5",
    "vendor_name": "Tree of Life Vantara Resort Udaipur",
    "title": "Secluded Udaipur Aravalli Hills Escape with Decadent Dining",
    "description": "Craving a secluded vacation in the lap of nature? Look no further than Tree of Life Resort, Udaipur, a serene hideaway nestled in the magnificent Aravalli Hills in Udaipur. Enjoy total luxury and seclusion in one of just 16 rooms scattered across four acres of a stunning landscape. Just a 12-hour drive from Delhi and a six-hour drive from Ahmedabad, this unmatched getaway is the perfect cure for daily life. Bid goodbye to the crowds and embrace serenity amid the resort's quiet corners, with fabulous views of the surrounding Aravalli Hills for company.\n\n**Your handpicked inclusions:**\n\n- Settle in with a refreshing non-alcoholic welcome drink on arrival\n- Begin your adventures with daily breakfast at The Aravali Restaurant\n- Kick back with an evening high-tea experience by the poolside, once during your stay\n- Savour a delicious three-course dinner at The Aravali Restaurant, once during your stay\n- Indulge in more delicacies with a 15% discount on drinks and dining\n- Stay connected with loved ones with complimentary Wi-Fi\n\n**Travelling with family?** Two children (6 and under) stay free on existing bedding with all inclusions as per package purchased.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Nathdwara",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Tree of Life Vantara Resort Udaipur",
    "offer_address": "Velagarh, Jheendoli Road, Rama, Udaipur, Rajasthan Udaipur 313024 India",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 118.0,
    "value": 174.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003IBoyAAG",
    "hero_image": "https://images.luxuryescapes.com/y5hqac9piq29izroyv",
    "image_two": "https://images.luxuryescapes.com/5acxqpx72du41xt5fia",
    "image_three": "https://images.luxuryescapes.com/glxratn5rkw3nmwkes3p",
    "vendor_name": "Tree of Life Vantara Resort Udaipur",
    "title": "Tranquil Udaipur Stay in the Aravallis with Daily Breakfast & Dining Discount",
    "description": "Craving a secluded vacation in the lap of nature? Look no further than Tree of Life Vantara Resort, a serene resort nestled in the magnificent Aravalli Hills. Enjoy total luxury and seclusion in one of just 15 rooms scattered across four acres of stunning landscapes. Just a 12-hour drive from Delhi and a six-hour drive from Ahmedabad, this unmatched getaway is the perfect cure for your stress. Bid goodbye to the crowds and embrace serenity in this resort's quiet corners with fabulous views of the surrounding Aravalli Hills for company.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Tree of Life Resort Udaipur OLD",
    "offer_address": "Airport Rd, near RAC Bataliyan Camp, Debari, Rajasthan 313024",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 133.0,
    "value": 189.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zIm9AAE",
    "hero_image": "https://images.luxuryescapes.com/bqjfako7r4kuqi50f",
    "image_two": "https://images.luxuryescapes.com/wc5fqqooljlrxyzatrn",
    "image_three": "https://images.luxuryescapes.com/vfsgbkjfxoqiu06g5abq",
    "vendor_name": "Radisson Blu Udaipur",
    "title": "Radisson Udaipur Stay Overlooking Fateh Sagar Lake with Decadent Dining",
    "description": "Discover the romantic lakes, ancient architectural wonders and decadent cuisine of Udaipur with a stay at Radisson Blu Udaipur Palace Resort and Spa, an elegant property overlooking the serene Fateh Sagar Lake. Promising luxury synonymous with the Radisson group, this sophisticated resort is ideal for families, couples and honeymooners.\n\nYour stay includes daily breakfast, one glass of house wine or beer per adult, once during the stay, one three-course dinner once during the stay, and complimentary Wi-Fi.\n\n**Travelling with family?** Two kids (aged five years and under) stay free in existing bedding with meals per package inclusions.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Radisson Blu Udaipur Palace Resort and Spa OLD",
    "offer_address": "B-1, Ambamata Scheme - A Rd, opp. Aravali Hospital, Malla Talai, Udaipur, Rajasthan 313001",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 109.0,
    "value": 249.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GK6jAAG",
    "hero_image": "https://images.luxuryescapes.com/2vscsje3tsboas4i0t1l",
    "image_two": "https://images.luxuryescapes.com/mrvh3gmiqrz86gi3mqo",
    "image_three": "https://images.luxuryescapes.com/eese02aaukxjr4ps5wf",
    "vendor_name": "Fateh Garh",
    "title": "Luxe Udaipur Renaissance Palace Stay with Daily Breakfast & Nightly Drinks",
    "description": "Set on a hilltop just outside the buzzing city of Udaipur and surrounded by the alluring Aravalli Range, Fateh Garh is a heritage Rajasthani palace reimagined in Renaissance style. With 360-degree views of the lush valley and serene Lake Pichola, this serene resort offers an unforgettable escape for families, friends and couples. Far away from urban buzz, this 25-acre multi-tiered property is perfect for those seeking a secluded and relaxing vacation... with an eco twist.\n\nWithin this luxurious palace, you'll find a resort that utilises natural elements for more than 50% of its electricity needs and reuses restored antique doors, locally sourced stones and recycled woods... but also boasts its own private vintage car collection and a zipline for views over the 200-year-old City Palace.\n\n**Your handpicked inclusions:**\n\n- Begin every morning with buffet breakfast at either Baradari or Prasadam restaurant (depending on weather conditions)\n- Enjoy a buffet/three-course dinner once during the stay at either Baradari or Prasadam restaurant (depending on weather conditions)\n- Unwind every evening with a glass of wine or beer each at Amritam Bar (one drink per adult)\n- Make the most of your stay with a 20% discount on food, soft drinks and spa treatments\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** Two children (5 and under) stay free on existing bedding with all inclusions (excluding alcohol).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Fateh Garh",
    "offer_address": "Sisarma - Bujra, Road, Udaipur, Rajasthan 313001",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 155.0,
    "value": 242.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070zMtAAI",
    "hero_image": "https://images.luxuryescapes.com/qn6fb2bf5ino9fro04lb",
    "image_two": "https://images.luxuryescapes.com/rihbog6lbb6cxahh9vdj",
    "image_three": "https://images.luxuryescapes.com/o6uxtf0dqlwgjp5ya0e",
    "vendor_name": "Raffles Udaipur",
    "title": "Grand Opening Raffles Private Island Escape in Udaipur with Daily Breakfast & Daily Lunch or Dinner",
    "description": "Calling all luxury connoisseurs to come and experience India's first Raffles property in Udaipur. Located on a 21-acre private island in the famed Udai Sagar Lake and in the shadow of the verdant Aravallis, Raffles Udaipur is an oasis of opulence and luxury. A 20-minute drive from Udaipur Airport and a luxurious boat ride away from the Udai Sagar Lakeshore, this magnificent island resort features 101 lavish rooms and suites interspersed with ultra-luxe amenities and never-ending panoramic views.\n\nThe awe-inspiring architecture includes Rajasthani heritage features while you can expect signature Raffles hospitality with a Raffles Butlers service, where a butler will take care of all your needs from packing and unpacking your bags to serving you sumptuous delicacies and premium beverages and preparing your room as per your preferences. For gourmands, there are eight dining options to choose from including The Sawai Kitchen for local specialty dishes.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Raffles Udaipur",
    "offer_address": "Island Village Tilakheda Gram Mantoon Udaipur, Rajasthan 313024 India",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 1049.0,
    "value": 2306.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GkwbAAC",
    "hero_image": "https://images.luxuryescapes.com/k4xkmhho5859qbwqc8x9",
    "image_two": "https://images.luxuryescapes.com/dj539cskjh0lu2eex9wc",
    "image_three": "https://images.luxuryescapes.com/zu535kx8ze8xzpviqmc3",
    "vendor_name": "Aurika Udaipur",
    "title": "Ultimate Udaipur Palace Stay with Daily Dining",
    "description": "Perched on a hilltop in the majestic Aravalli range and overlooking Fateh Sagar Lake, Lake Pichola and the Monsoon Palace, the magnificent Aurika Udaipur is fit for a king. An upscale retreat, this modern-day palace hotel is royalty reimagined. Step back in time in this five-acre resort that will charm you with its quintessential Rajasthani arches and domes, grand courtyards, terraced gardens, sandstone and marble flooring and beautiful motifs. Contemporary comforts add a dash of modernity to this brand-new royal retreat, ideal for a romantic or family escape.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Aurika Udaipur OLD",
    "offer_address": "1, Kala Rohi, Rani Rd, Udaipur, Rajasthan 313001",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 270.0,
    "value": 545.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AabCWAAZ",
    "hero_image": "https://images.luxuryescapes.com/s7gcj43tuuatyrv78rha",
    "image_two": "https://images.luxuryescapes.com/dppg8and7sggir4b9nnd",
    "image_three": "https://images.luxuryescapes.com/u9gyw3jvqbfc6c9h5dr",
    "vendor_name": "The Artist House Udaipur",
    "title": "Regal Udaipur Stay within Restored Theatre with Daily Breakfast & One Dinner",
    "description": "Infusing old-world charm with contemporary glam, The Artist House Udaipur provides the best of Rajasthani hospitality. This stunning escape existed in a former life as a traditional theatre to entertain the elite and royals of Udaipur, and today has been transformed into a chic and stylish hotel. Located an overnight drive from Delhi and approximately 6.5 hours from the Pink City, Jaipur, the hotel boasts elegant rooms with pleasing views, an evening club for dancing, a relaxing bar offering an array of drinks, as well as an onsite restaurant that serves Indian and international cuisine. \n\nThe hotel's proximity to the city centre makes it an excellent choice for those looking to explore Udaipur's must-see sights, including Lake Pichola and the City Palace. This one-of-a-kind experience will keep you entertained during your visit to Udaipur and ensure a stay to remember.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "The Artist House Udaipur",
    "offer_address": "The Artist’s House, Surajpole Udaipur, Rajasthan, 313001 India",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 113.0,
    "value": 184.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xBEjAAM",
    "hero_image": "https://images.luxuryescapes.com/cyrdtmql9m1m08ih7n",
    "image_two": "https://images.luxuryescapes.com/uwwp259egn2lj94e51",
    "image_three": "https://images.luxuryescapes.com/gjql3pwpqualv3x8pi9",
    "vendor_name": "Radisson Blu Udaipur",
    "title": "Luxe Radisson Udaipur Palace Stay Overlooking Fateh Sagar Lake with Daily Breakfast",
    "description": "Discover the romantic lakes, ancient architectural wonders and decadent cuisine of Udaipur with a stay at Radisson Blu Udaipur Palace Resort and Spa, an elegant resort ranked within the top 10% of properties on Tripadvisor, overlooking the serene Fateh Sagar Lake.\n\nPromising luxury synonymous with the Radisson group, this sophisticated hotel is the perfect escape for both families and couples. A popular celebrity haunt, it has been the choice for many high-profile weddings. Dive into the stunning two-tier outdoor pool, relax in the spa and wellness centre or enjoy the many multiple dining options. The resort also provides easy accessibility to the many attractions of the 'City of Lakes' including the imposing City Palace, and picturesque ornamental gardens like Saheliyon-ki-Bari.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Radisson Blu Udaipur Palace Resort and Spa",
    "offer_address": "B-1, Ambamata Scheme - A Rd, opp. Aravali Hospital, Malla Talai, Udaipur, Rajasthan 313001",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 181.0,
    "value": 420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Eb6IAAS",
    "hero_image": "https://images.luxuryescapes.com/0pu8agjspqdqk1iw2itn",
    "image_two": "https://images.luxuryescapes.com/u89ed4oaiabs2lbaexpl",
    "image_three": "https://images.luxuryescapes.com/wmsby2j8ubfq5fjc7i3",
    "vendor_name": "The Ananta Udaipur",
    "title": "Secluded Hillside Udaipur Escape with Daily Breakfast & Nightly Drinks",
    "description": "Set against the picturesque Aravalli Range and spread across 75 acres of verdant landscape, The Ananta Udaipur is the crown jewel of Udaipur. Unwind in the lap of nature in this luxurious haven, located on the outskirts of the 'City of Lakes'. Forget the crowds and the hustle-bustle of the city and experience a truly secluded vacation in this private sanctuary, an active member of The Registry Collection.\n\nYour escape includes daily breakfast, one three-course dinner for two per stay, one glass of house wine or beer per adult every evening, and complimentary Wi-Fi.\n\n**Travelling with friends or family?** Upgrade to the two-bedroom package for four guests.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "The Ananta Udaipur",
    "offer_address": "Village Bujhda, Tehsil Girwa, Kodiyat Main Rd, Udaipur, Rajasthan 313031",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 157.0,
    "value": 319.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QLy8AAG",
    "hero_image": "https://images.luxuryescapes.com/i21mxn6f3gqavv865mdj",
    "image_two": "https://images.luxuryescapes.com/qe2h56w35snxl2ltgm6o",
    "image_three": "https://images.luxuryescapes.com/n9h6vo9fe1qkpmnr2g",
    "vendor_name": "Aurika Udaipur",
    "title": "Ultimate Udaipur Palace Stay with Daily Breakfast, Dinner & Nightly Drinks",
    "description": "Perched on a hilltop in the majestic Aravalli range and overlooking Fateh Sagar Lake, Lake Pichola and the Monsoon Palace, the magnificent Aurika Udaipur is fit for a king. An upscale retreat, this modern-day palace hotel is royalty reimagined. Step back in time in this five-acre resort that will charm you with its quintessential Rajasthani arches and domes, grand courtyards, terraced gardens, sandstone and marble flooring and beautiful motifs.\n\nContemporary comforts add a dash of modernity to this royal retreat complete with its own restaurant, bar, swimming pool and spa, ideal for a romantic or family escape.\n\n**Your handpicked inclusions:**\n\n- Be welcomed with a non-alcoholic welcome drink each on arrival\n- Begin the day's adventures with set-menu or buffet breakfast at Mirasa restaurant\n- Enjoy one daily 'cocktail of the day' or glass of local beer or house wine per adult (one drink per adult, per day) at Ariva bar\n- Every evening will be a decadent affair with nightly dinner\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** One child (7-12) OR two infants (under 7) stay free on existing bedding with all inclusions except alcohol.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Aurika Udaipur",
    "offer_address": "1, Kala Rohi, Rani Rd, Udaipur, Rajasthan 313001",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 296.0,
    "value": 466.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgpmoQAA",
    "hero_image": "https://images.luxuryescapes.com/mcpsrbjdnplfy2abgium",
    "image_two": "https://images.luxuryescapes.com/iharg3orb4mr0aqzafun",
    "image_three": "https://images.luxuryescapes.com/yxacb40fyes7jqykewuj",
    "vendor_name": "Ramada, Udaipur",
    "title": "A Tranquil Udaipur Oasis Near Lake Pichola",
    "description": "Nestled between the gorgeous Lake Pichola and stunning Aravalli Ranges sits Ramada Udaipur Resort & Spa, a haven of peace and tranquillity. This beautiful hotel boasts stunning lakeside views and elegantly designed rooms, perfect for a relaxing Escapes Club holiday with your loved one. Includes daily buffet breakfast, one three-course dinner, one drink every evening during your stay, a traditional welcome drink on arrival and more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Ramada Udaipur Resort & Spa OLD",
    "offer_address": "Rampura Circle Khodiyat Road, Udaipur, Rajasthan 313001, India",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 207.0,
    "value": 393.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EwGXOAA3",
    "hero_image": "https://images.luxuryescapes.com/8h7s9dprb7rg88n71yc",
    "image_two": "https://images.luxuryescapes.com/f2p2m62kb1je5soilho",
    "image_three": "https://images.luxuryescapes.com/ee5l9bh0ltwpeww464",
    "vendor_name": "The Leela Palace Udaipur",
    "title": "Five-Star Leela Udaipur Escape on Lake Pichola with Daily Breakfast, Daily Drinks & One Dinner",
    "description": "Transport yourself to an era of regal opulence at The Leela Palace Udaipur, poised along the pristine Lake Pichola, with the stunning Aravallis as its backdrop. A 45-minute drive from Maharana Pratap Airport Udaipur (UDR) and a six-hour drive from Jaipur, this palatial hotel exemplifies Rajasthani architecture and evokes the grandeur of Udaipur's rich and royal heritage. The hotel's rich architecture, hand-carved artwork, and artisanal crafts boost its majestic, unmistakable allure, making it seem as though it just stepped out of a dream. Enjoy an escape fit for royalty as you relax in the exquisitely built rooms, take a swim in the lake-facing pool, pamper yourself with traditional Indian spa treatments, and relish a variety of international cuisines on your plate.\n\nSet in the heart of ‘The City of Lakes’, The Leela Palace Udaipur will enchant you with its magnificent architecture and heartwarming hospitality. Lying less than 30 minutes from the popular tourist gems like Udaipur City Palace, Bagore Ki Haveli, and Saheliyon Ki Bari, The Leela Palace Udaipur is the perfect base for your Udaipur explorations.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "The Leela Palace Udaipur",
    "offer_address": "Lake Pichola Udaipur Rajasthan 313001 India",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 672.0,
    "value": 1278.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csyXUQAY",
    "hero_image": "https://images.luxuryescapes.com/kmpncd38sere9g9pkl8",
    "image_two": "https://images.luxuryescapes.com/ui06gxx4qlyzz8pao1j",
    "image_three": "https://images.luxuryescapes.com/j1qoqlzhjenksydqyk8",
    "vendor_name": "Oberoi Udaivilas",
    "title": "Royal Oberoi Escape on Lake Pichola with All-Inclusive Dining",
    "description": "Everyone deserves royal treatment every so often - and you will find it at The Oberoi Udaivilas, Udaipur. Located on the banks of Lake Pichola, the resort is spread over 30 acres of lush gardens, with an intricate layout of interconnecting domes and corridors that reflect the layout of Udaipur itself, whose seven lakes are linked by canals. Includes daily breakfast, daily three-course lunch and daily three-course dinner, one cocktail, beer or glass of wine per adult each evening, a boat ride on Lake Pichola and return airport transfers. Plus up to two children (aged 11 years and under) stay free on existing bedding.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "The Oberoi Udaivilas",
    "offer_address": "Badi-Gorela-Mulla Talai Rd, Haridas Ji Ki Magri, Pichola, Udaipur, Rajasthan 313001, India",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 1504.0,
    "value": 3514.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNIvvAAH",
    "hero_image": "https://images.luxuryescapes.com/s8fyagqy4j9jkp05w02",
    "image_two": "https://images.luxuryescapes.com/8tzei7htbklrpsk4unj",
    "image_three": "https://images.luxuryescapes.com/dkdand92ji97088svbac",
    "vendor_name": "Tree of Life Vantara Resort Udaipur",
    "title": "Serene Udaipur Aravalli Hills Retreat with Daily Breakfast, One Lunch/Dinner & Daily High Tea",
    "description": "In the quiet refuge of Rajasthan's Aravalli Hills, stumble upon Tree of Life Vantara Resort Udaipur, a luxurious retreat perfect for solitude-seekers. You are welcomed to a utopia away from the bustle of Udaipur by 33 beautiful rooms that are spread across five acres of a lush landscape and offer pristine views of the surroundings. After a long day of sightseeing, treat yourself to dinner at the hotel's multi-cuisine restaurant, which serves delectable dishes including the renowned Laal Maas. Try a therapy or two at the gorgeous spa or wade in the pool as you let go of all your worries. With its tranquil atmosphere and luxurious amenities, Tree of Life Vantara Resort Udaipur is the perfect place to relax and unwind. \n\nDid we mention the resort is pet-friendly? You don't have to leave your four-legged friends behind anymore.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Nathdwara",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Tree of Life Vantara Resort Udaipur",
    "offer_address": "Velagarh, Jheendoli Road, Rama, Udaipur, Rajasthan Udaipur 313024 India",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 127.0,
    "value": 224.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id0nTAAR",
    "hero_image": "https://images.luxuryescapes.com/efrf5sk71o7vbp309ahm",
    "image_two": "https://images.luxuryescapes.com/rcpyb624xhj7dqd9og2d",
    "image_three": "https://images.luxuryescapes.com/syhcq2axvmbi48hrawmi",
    "vendor_name": "Oberoi Udaivilas",
    "title": "Palatial Lakeside Oberoi Udaipur Opulence with Glittering Pool & Three Onsite Restaurants",
    "description": "Unveiling a world of grandeur, soak up the charms of the 'City of Lakes', Udaipur, at this sprawling five-star haven, perched on the tranquil banks of Lake Pichola. From resplendent domes and arches to manicured gardens and ponds, the hotel's awe-inspiring architecture is a testament to Rajasthan's rich heritage. Take a dip in the sparkling outdoor pool, pamper yourself with treatments at the spa and savour a range of culinary delights at the three onsite restaurants.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "The Oberoi Udaivilas, Udaipur",
    "offer_address": "Badi-Gorela-Mulla Talai Road, Haridas Ji Ki Magri, Pichola, Udaipur, Rajasthan 313001, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 341.0,
    "value": 341.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DK8dAAG",
    "hero_image": "https://images.luxuryescapes.com/o9tfhe50kjqe2sz7cvi",
    "image_two": "https://images.luxuryescapes.com/bktql03ojex0n9tsnjs",
    "image_three": "https://images.luxuryescapes.com/zukmhkt9y9bs0z9dpv",
    "vendor_name": "The Leela Palace Udaipur",
    "title": "Five-Star Rajasthan Palace Escape on Tranquil Lake Pichola",
    "description": "Prepare to be blown away by The Leela Palace Udaipur, a palatial hotel poised alongside the freshwater Lake Pichola. Grandeur imbues every corner of this majestic palace, taking the form of traditional wall embellishments, hand-carved artwork, and artisanal crafts inspired by Rajasthan’s rich culture. Savour an eclectic mix of international flavours at the Dining Room, complete with a walk-in wine cellar, or pamper yourself with traditional Indian spa treatments designed to rejuvenate your body and soul. Before sunset, enjoy the evening ritual of Rajasthan folk music and dance before taking in the stunning lake and city views, accompanied by world-class service and ultra-modern facilities that make your stay truly fit for royalty.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "Rajasthan",
    "location_description": "The Leela Palace Udaipur",
    "offer_address": "88, Naga Nagri, Outside Chandpole, Udaipur, Rajasthan, 313001, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 339.0,
    "value": 339.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcDPrAAN",
    "hero_image": "https://images.luxuryescapes.com/k3nwvhftytset4jrq5sb",
    "image_two": "https://images.luxuryescapes.com/2fnkbbqrnkij9s5ak7dy8",
    "image_three": "https://images.luxuryescapes.com/ahk8snakjwvxgdxwunbf",
    "vendor_name": "RAAS Devigarh",
    "title": "Heritage Five-Star Indian Palace Retreat Overlooking Aravalli Mountains",
    "description": "The best in boutique luxury can be found among India’s Aravalli mountain ranges at the five-star RAAS Devigarh - a converted palace with delightful hillside views. Constructed in the 1700s, this heritage oasis offers a blissful immersion into wellness and relaxation, with a spectacular pool and specialty yoga programs. Eat and drink to your heart's content at the multiple dining venues on site, all of which celebrate seasonal ingredients, hand-picked from the kitchen garden.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "RAAS Devigarh",
    "offer_address": "NH8, Near Eklingji Temple, Delwara, Udaipur, Rajasthan 313202, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 276.0,
    "value": 276.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id0mUAAR",
    "hero_image": "https://images.luxuryescapes.com/e6vi69ly8mieydoogekq",
    "image_two": "https://images.luxuryescapes.com/atm4t2ba07fcunt8kh3q",
    "image_three": "https://images.luxuryescapes.com/mw8c8tmdzmuxdzhdtjjo",
    "vendor_name": "Trident, Udaipur",
    "title": "Sprawling Lakeside Luxury Retreat in Udaipur with Aravalli Views, Restaurants & Grand Outdoor Pool",
    "description": "Experience the regal charm of Udaipur with a stay at this palatial retreat on the shores of Lake Pichola. Savour the flavours of traditional Rajasthani cuisine at Aravalli or dine under the stars at The Terrace, offering panoramic views of the majestic City Palace. Relax by the lavish outdoor pool, indulge in ancient Ayurvedic treatments at Trident Spa or simply unwind in the comfort of your room, admiring views of the nearby Aravalli Range.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Udaipur",
    "location_subheading": "India",
    "location_description": "Trident, Udaipur",
    "offer_address": "Malla Talai Chowk, Trident Rd, Haridas Ji Ki Magri, Udaipur, Rajasthan 313001, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 114.0,
    "value": 114.0
  }
]