[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ImcNEYAZ",
    "hero_image": "https://images.luxuryescapes.com/c3zru0boiiu4u1ke1hds",
    "image_two": "https://images.luxuryescapes.com/mwpnqpcc8uw3ti9gi1go",
    "image_three": "https://images.luxuryescapes.com/0vrmavig0ayivs88jr5",
    "vendor_name": "Gateway Hotel by Nightcap Plus",
    "title": "Central Devonport Stay near Mersey River with Daily Breakfast",
    "description": "Enjoy peace and quiet in the comfortable confines of this hotel situated in a convenient spot in central Devonport. This modern hotel is just a short drive to the Devonport Ferry Terminal, Mersey River and the Devonport Airport; it's the perfect beginning or ending of a Tasmanian escape.\n\nAfter exploring Roundhouse Park, Mersey Bluff Lighthouse and the Spirit of the Sea sculpture and lookout, try out tasty meals and refreshing drinks from Tasmanian producers at the Gateway Bistro Bar and Grill. For your convenience, complimentary on-site parking is available.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Devonport",
    "location_heading": "Devonport",
    "location_subheading": "Tasmania",
    "location_description": "Gateway Hotel by Nightcap Plus",
    "offer_address": "16 Fenton Street, Devonport, Tasmani 7310, Australia",
    "percentage_discount": 65.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 142.0,
    "value": 402.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HIi3AAG",
    "hero_image": "https://images.luxuryescapes.com/5et9wteo3kj2gwlsram",
    "image_two": "https://images.luxuryescapes.com/ol2mr1excg51u7wbalu",
    "image_three": "https://images.luxuryescapes.com/6e6n72lig506kz4m0m84",
    "vendor_name": "The Cove Tasmania",
    "title": "Grand Opening: Adults-Only Clifftop Devonport Glamping Retreat with Daily Breakfast Hamper",
    "description": "Wake up to the whoosh of the ocean crashing against the sand in your cliffside perch at The Cove Tasmania, a brand-new, adults-only glamping retreat. Set on 15 acres of breathtaking coastline and grass-covered hills just outside of Devonport, home to the iconic Spirit of Tasmania, and with a limited number of glamping tents, hillside cabins and grand clifftop chalets, The Cove has an exclusive, secluded feel.\n\nExperience the penguins returning at dusk from your private balcony, unwind in the shared Alexander Lounge with fire pits, a courtyard on one side and a state-of-the-art kitchen on the other, and find inner calm in The Buttershed wellness space. When you're ready to discover the beauty of Tasmania, a number of walking trails are available from The Cove, tracing the coastline and offering breathtaking panoramas. Pristine beaches, penguin-viewing platforms and Tasmania’s world-renowned produce and wine are also at your fingertips along the Northern Forage trail. Come here to relax, recharge and reconnect with nature - in the most glamorous way possible.\n\n**Your handpicked inclusions:**\n\n- Wake up each morning to a gourmet breakfast hamper\n- Celebrate your escape with a bottle of Tasmanian wine on arrival\n- Be welcomed with decadent artisan House of Anvers chocolates\n- Feast on a delicious cheeseboard made up of a selection of Tasmanian cheeses to share\n\n**Upgrades available:** Make the most of your escape when you upgrade to a Clifftop Chalet, featuring glorious ocean views, a private deck with a daybed and a private bathroom.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Devonport",
    "location_heading": "Devonport",
    "location_subheading": "Tasmania",
    "location_description": "The Cove Tasmania",
    "offer_address": "256 Waverley Rd, Devonport Tasmania 7310 Australia",
    "percentage_discount": 39.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 287.0,
    "value": 468.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BdOoMAAV",
    "hero_image": "https://images.luxuryescapes.com/q0gqupxhdpiw25bn6mcd",
    "image_two": "https://images.luxuryescapes.com/gy4yt7t78o0i2ev19lsdvm",
    "image_three": "https://images.luxuryescapes.com/cxdmoy9j0g32sp7cmis",
    "vendor_name": "The Cove Tasmania",
    "title": "Devonport Adults-Only Clifftop Retreat with Daily Breakfast Hamper",
    "description": "Wake up to the whoosh of the ocean crashing against the sand in your cliffside accommodation at The Cove Tasmania, a new, adults-only retreat just outside Devonport, Tasmania. Feel blissfully secluded in one of a limited number of boutique hillside cabins and grand clifftop chalets, all set amid 15 acres of breathtaking coastline and grass-covered hills.\n\nExperience the penguins returning at dusk from your private balcony, unwind in the shared Alexander Lounge with fire pits, a courtyard on one side and a state-of-the-art kitchen on the other, and find inner calm in The Buttershed wellness space. When you're ready to discover the beauty of Tasmania, a number of walking trails are available from The Cove, tracing the coastline and offering breathtaking panoramas. Pristine beaches and Tasmania’s world-renowned produce and wine are also at your fingertips along the Northern Forage trail. Come here to relax, recharge and reconnect with nature - in the most glamorous way possible.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Devonport",
    "location_heading": "Devonport",
    "location_subheading": "Tasmania",
    "location_description": "The Cove Tasmania",
    "offer_address": "256 Waverley Rd, Devonport Tasmania 7310 Australia",
    "percentage_discount": 20.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 401.0,
    "value": 502.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FNGomAAH",
    "hero_image": "https://images.luxuryescapes.com/ssy40kv5nebldzt4poug",
    "image_two": "https://images.luxuryescapes.com/xnill0eywrouxrwoqc",
    "image_three": "https://images.luxuryescapes.com/nhp207aaqorldm2vdktr",
    "vendor_name": "Gateway Hotel by Nightcap Plus",
    "title": "Comfortable Central Devonport Stay near Mersey River with Daily Breakfast",
    "description": "Enjoy peace and quiet in the comfortable confines of the Gateway Hotel by Nightcap Plus, situated in a convenient spot in central Devonport. This modern hotel is just a short drive to the Devonport Ferry Terminal, Mersey River and the Devonport Airport, and a casual walk to harbourfront dining and exciting shopping precincts. When you’re not exploring the city, try out tasty meals and refreshing drinks from Tasmanian producers at the Gateway Bistro Bar and Grill, or pump some iron in the well-equipped gym.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Devonport",
    "location_heading": "Devonport",
    "location_subheading": "Tasmania",
    "location_description": "Gateway Hotel by Nightcap Plus",
    "offer_address": "16 Fenton Street, Devonport, Tasmani 7310, Australia",
    "percentage_discount": 23.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 218.0,
    "value": 282.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EC9LJAA1",
    "hero_image": "https://images.luxuryescapes.com/cej7h43hj6mud5j4mtgm",
    "image_two": "https://images.luxuryescapes.com/9569rh1uzjyffgc8ktv",
    "image_three": "https://images.luxuryescapes.com/2gua75rzt38a9mw3683z",
    "vendor_name": "Novotel Devonport",
    "title": "Grand Opening: Waterfront Retreat at Gateway to Spirit of Tasmania with Ocean-View Upgrade, Daily Breakfast & Nightly Drinks",
    "description": "Venture to the land of fresh air and be one of the first to discover the beauty of Novotel Devonport, the newest and largest hotel in the beating heart of Tasmania’s waterfront wonder, Devonport. Just minutes from the Spirit of Tasmania Wharf terminal, this contemporary hotel is the natural start to an island journey full of incredible food, local wines and magnificent water views. \n\nEmbark on an exciting adventure around the breathtaking city and its surroundings by taking advantage of the region’s nearby walking and cycling tracks, winding drives, lush reserves, flowing rivers and sparkling beaches. Toast to an incredible Tasmanian voyage with a glass of bubbles and a delicious Asain-inspired bite as you look out over the glimmering water at Mr Good Guy Restaurant and Bar.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Devonport",
    "location_heading": "Devonport",
    "location_subheading": "Tasmania",
    "location_description": "Novotel Devonport",
    "offer_address": "2 Best Street, Devonport 7310, Tasmania, Australia",
    "percentage_discount": 31.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 224.0,
    "value": 326.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2xnIAC",
    "hero_image": "https://images.luxuryescapes.com/9fkw1r2szgt03o1b6gbd",
    "image_two": "https://images.luxuryescapes.com/f00rkxklpz8cyyuaitya",
    "image_three": "https://images.luxuryescapes.com/syhljc8h4unuxom89tu",
    "vendor_name": "Novotel Devonport",
    "title": "Devonport Waterfront Haven Minutes from Spirit of Tasmania Wharf with Onsite Restaurant",
    "description": "Venture to the land of fresh air and discover the beauty of Devonport, in the largest hotel along Tasmania’s waterfront. Just minutes from the Spirit of Tasmania Wharf terminal, this contemporary hotel is the natural start to an island journey full of incredible food, local wines and magnificent water views.\n\nEmbark on an exciting adventure around the breathtaking city and its surroundings by taking advantage of the region’s nearby walking and cycling tracks, winding drives, lush reserves, flowing rivers and sparkling beaches. Then, when it's time to refuel, indulge in a delicious Asian-inspired meal as you look out over the glimmering water at Mr Good Guy Restaurant and Bar.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Devonport",
    "location_heading": "Devonport",
    "location_subheading": "Tasmania",
    "location_description": "Novotel Devonport",
    "offer_address": "2 Best Street, Devonport, Tasmania 7310, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 102.0,
    "value": 102.0
  }
]