[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LhvKAAS",
    "hero_image": "https://images.luxuryescapes.com/0e5aws71fkuk3jk2iam",
    "image_two": "https://images.luxuryescapes.com/ibxn7mfish03ttbw95gfl",
    "image_three": "https://images.luxuryescapes.com/9y52p18jj3vbu2ebx0q",
    "vendor_name": "Salt at South West Rocks",
    "title": "Grand Opening: Coastal NSW Waterfront Villas Ideal for Groups or Families",
    "description": "Revel in the unspoilt golden shores, the crash of the ocean and grand heritage of South West Rocks - home to the Trial Bay Gaol and Smokey Cape Lighthouse - from a chic, brand-new launchpad, concealed in native bushland in a private gated community. The newest addition in New South Wales’ Trial Bay, the luxurious, newly opened Salt @ South West Rocks is is a cocoon of elegant beach-style villas in an unbeatable location on banks of the Macleay River. Your waterfront escape is perfect for the whole family with a stay in an elegant One-Bedroom Villa for two adults and two children with a bottle of wine on arrival and a guaranteed, leisurely late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Kempsey Shire Council",
    "location_heading": "South West Rocks",
    "location_subheading": "New South Wales",
    "location_description": "Salt @ South West Rocks 2020",
    "offer_address": "73 Marlin Dr, South West Rocks NSW 2431",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 266.0,
    "value": 864.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QYCEAA4",
    "hero_image": "https://images.luxuryescapes.com/wuc22ai07dw60sopm2r",
    "image_two": "https://images.luxuryescapes.com/h1wj5038zp0msr77xgu",
    "image_three": "https://images.luxuryescapes.com/20di3zm0iallga9snvm",
    "vendor_name": "Salt at South West Rocks",
    "title": "Self-Contained South West Rocks Waterfront Villas with Stunning River Views",
    "description": "Discover the unspoilt golden shores and grand heritage of South West Rocks with a stay at the luxurious Salt at South West Rocks, recently expanded and reopened in November 2020 to include brand-new waterfront villas. Nestled amid native bushland, in an unbeatable location on the banks of the Macleay River - just over an hour from Port Maquarie, these exclusive villas sit in a private gated community with impeccable shared facilities. 16 beautifully appointed villas are lined up along the riverbank and evoke an elegant beach-house aesthetic. When you’re not cooking up a storm in your villa’s fully equipped kitchen, dine alfresco using the onsite BBQ facilities, take a dip in the onsite pool, relax on your private deck or go cycling along the river.\n\nFringed by wilderness and perched on the edge of a beautiful river, with activities aplenty along the waterway - think fishing, snorkelling and historic sites just waiting to be discovered - South West Rocks is a serene launchpad to NSW’s coastal beauty, renowned surf beaches and dramatic scenery.\n\n**Your handpicked inclusions:**\n\n- Toast your coastal escape with a welcome bottle of wine\n- Explore the region with ease thanks to daily bicycle hire per person\n\n**Travelling as a group?** Upgrade to a Two-Bedroom Villa for up to four guests or a Three-Bedroom Villa for up to six.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "South West Rocks",
    "location_heading": "South West Rocks",
    "location_subheading": "New South Wales",
    "location_description": "Salt @ South West Rocks",
    "offer_address": "73 Marlin Drive, South West Rocks 2431, New South Wales, Australia",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 304.0,
    "value": 494.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzPCYAA3",
    "hero_image": "https://images.luxuryescapes.com/1vg7zer5497i1u26your",
    "image_two": "https://images.luxuryescapes.com/52duavotl78pe20j2k5",
    "image_three": "https://images.luxuryescapes.com/jo14dgax7j0h7r5d3hwn",
    "vendor_name": "Salt at South West Rocks",
    "title": "NSW Coastal Chic Waterfront Villas One Hour from Port Macquarie",
    "description": "Discover the unspoilt golden shores and grand heritage of South West Rocks with a stay at the luxurious Salt @ South West Rocks, a collection of stylish Hamptons-inspired waterfront villas. Nestled amid native bushland, in an unbeatable location on the banks of the Macleay River - just over an hour from Port Macquarie - these exclusive villas sit within a private gated community and boast impeccable shared facilities. Edging the sparkling riverbank, each self-contained space evokes an elegant beach house aesthetic. When you’re not cooking up a storm in your villa’s fully equipped kitchen, dine alfresco using the onsite BBQ facilities, take a dip in one of two heated mineral pools or relax on your private balcony with a bottle of local wine.\n\nDiscover the heart of this incredible location with a cycling adventure along the river, stopping along the way to admire native wildlife and incredible landforms that make for perfect photo opportunities. Fringed by wilderness and perched on the edge of a beautiful river, with activities aplenty along the waterway - think fishing, snorkelling and historic sites just waiting to be discovered - South West Rocks is a serene launchpad to the coastal beauty of New South Wales.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "South West Rocks",
    "location_heading": "South West Rocks",
    "location_subheading": "New South Wales",
    "location_description": "Salt @ South West Rocks",
    "offer_address": "73 Marlin Drive, South West Rocks 2431, New South Wales, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 309.0,
    "value": 601.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ExKQXAA3",
    "hero_image": "https://images.luxuryescapes.com/vq5bsn8mthxm2ulmc0zo",
    "image_two": "https://images.luxuryescapes.com/k7yzyldnttonpa2qe2j",
    "image_three": "https://images.luxuryescapes.com/v4oqveiz361678myp7vh",
    "vendor_name": "Ingenia Holidays South West Rocks",
    "title": "Family-Friendly NSW Waterfront Villas One Hour from Port Macquarie",
    "description": "Create wholesome family memories in cosy, home-away-from-home cabins at Ingenia Holidays South West Rocks in New South Wales. Stay in spacious self-contained accommodation for up to eight people with your own undercover entertaining area, perfect for evening BBQ's. Tired of cooking? Grab some delicious fish and chips or dine at the lifesaving club in town just a short drive away. Entertain the whole family with an outdoor swimming pool, community playground and games room on site, or spend the day at the nearby Trial Bay front or back beaches.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "South West Rocks",
    "location_heading": "South West Rocks",
    "location_subheading": "New South Wales",
    "location_description": "Ingenia Holidays South West Rocks",
    "offer_address": "Gordon Young Drive, South West Rocks NSW 2431 Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 243.0,
    "value": 437.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mxqVAAQ",
    "hero_image": "https://images.luxuryescapes.com/0u097lanp8jocex6wi5",
    "image_two": "https://images.luxuryescapes.com/3ylhoi2wymhwfufl37i",
    "image_three": "https://images.luxuryescapes.com/n8skiey1jlmhmkfyzd5a",
    "vendor_name": "Salt at South West Rocks",
    "title": "Self-Contained South West Rocks Waterfront Villas with Stunning River Views",
    "description": "Discover the unspoilt golden shores and grand heritage of South West Rocks with a stay at the luxurious Salt at South West Rocks. Nestled amid native bushland, in an unbeatable location on the banks of the Macleay River, just over an hour from Port Macquarie, these exclusive villas sit in a private gated community with impeccable shared facilities. Sixteen beautifully self-contained villas are lined up along the riverbank, evoking an elegant beach-house aesthetic. When you’re not cooking up a storm in your villa’s fully equipped kitchen, dine alfresco using the onsite BBQ facilities, take a dip in the pool, relax on your private deck or go cycling along the river.\n\nFringed by wilderness and perched on the edge of a beautiful river, with activities aplenty along the waterway - think fishing, snorkelling, and historic sites just waiting to be discovered - South West Rocks is a serene launchpad to NSW’s coastal beauty, renowned surf beaches and dramatic scenery.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "South West Rocks",
    "location_heading": "South West Rocks",
    "location_subheading": "New South Wales",
    "location_description": "Salt @ South West Rocks",
    "offer_address": "73 Marlin Drive, South West Rocks 2431, New South Wales, Australia",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 362.0,
    "value": 639.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cJJmHQAW",
    "hero_image": "https://images.luxuryescapes.com/qrsaf6tsaslz4x6imdyk",
    "image_two": "https://images.luxuryescapes.com/4padb6rfxx9cl0lnvpb",
    "image_three": "https://images.luxuryescapes.com/j89cdtjfamxoeuulj35",
    "vendor_name": "BIG4 Sunshine South West Rocks",
    "title": "Family-Friendly Fun on the Coast",
    "description": "Experience fun for the whole family at Big 4 Sunshine Resort South West Rocks - located on the sparkling coastline of New South Wales, perched between Coffs Harbour and Port Macquarie. Offering something for everyone, enjoy a three or five-night escape for four people with access to the resort’s many facilities like the Shipwreck Island Water Park, mini golf, tennis, games room and movie room; plus enjoy a welcome bottle of wine on arrival and a guaranteed late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "South West Rocks",
    "location_heading": "South West Rocks",
    "location_subheading": "NSW",
    "location_description": "BIG4 Sunshine Resort South West Rocks",
    "offer_address": "161 Phillip Dr, South West Rocks NSW 2431",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 142.0,
    "value": 273.0
  }
]