[
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070NitAAE",
    "hero_image": "https://images.luxuryescapes.com/xa4f0tjp9l69soxs0if",
    "image_two": "https://images.luxuryescapes.com/ofu6cgut212jfol2qne",
    "image_three": "https://images.luxuryescapes.com/f8yywhzhk3wvy0dgmvu",
    "vendor_name": "Domaine Chandon Australia",
    "title": "Domaine Chandon Sparkling Wine Tasting for Two People with Four-Course Lunch and a Glass of Vintage Chandon",
    "description": "Indulge your senses with a unique sparkling wine tasting and gourmet lunch at Domaine Chandon, Australia’s leading premium sparkling wine producer. Situated on a picturesque site in the heart of Victoria’s Yarra Valley, the estate exclusively produces sparkling wines with grapes grown on its three Victorian vineyards. Every Chandon tasting experience is a meticulously crafted journey, and your Exploration Tasting Experience takes inspiration from the traditional methods, while letting you sample innovative new flavours. With five unexpected sparkling varieties to try, you’ll explore the interplay of vineyard, varietal, winemaker and time. Crafted by chief winemaker, Dan Buckle, the wines include unique varieties, aged cellar releases and innovative new creations to excite every bubbles fan.\n\nNext, relax in the estate's restaurant with unfettered views of the vineyards and Yarra Ranges, and enjoy a delightful four-course lunch, including dessert. Choose between al fresco dining or indoor serenity, where you'll be greeted by 270-degree views. Head Chef Josh Smythe's menu is inspired by the form of the landscape along with the exquisite local produce of the Yarra Valley and surrounds. Your lunch will be accompanied by your choice from the vintage range of wines: Vintage Brut, Vintage Rosé or Vintage Blanc de Blancs.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Coldstream",
    "location_subheading": "Victoria",
    "location_description": "Domaine Chandon Australia",
    "offer_address": "727 Maroondah Highway, Coldstream, VIC, 3770",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 156.0,
    "value": 1.0
  }
]