[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PyllAAC",
    "hero_image": "https://images.luxuryescapes.com/r3f30kfmmz0a7tyad5",
    "image_two": "https://images.luxuryescapes.com/xis24v0hqeagwlftmj",
    "image_three": "https://images.luxuryescapes.com/6enmgxt74m71x0qwe9",
    "vendor_name": "Bay of Fire Apartments",
    "title": "Tasmania Boutique Bay of Fires Suites with Gourmet Cheese Platter & Nightly Dining Credit",
    "description": "Explore Tasmania's gorgeous East Coast from the luxurious Bay of Fires Apartments, an intimate collection of recently refurbished suites in the heart of popular St Helens. Two hours from Launceston and 2.5 hours from Hobart, this stunning part of Australia's island state makes the ideal addition to any Tasmania itinerary. Spend active days hiking through stunning conservation areas and along stretches of impossibly beautiful beaches, then take time out with tastings at local wineries.\n\nPositioned just moments from the iconic lichen-cloaked boulders and turquoise shores of Binalong Bay and the region's powder-white coastline, this luxe accommodation promises an effortless collaboration of comfort and style. Enjoy a convenient location, just a short stroll from supermarkets and local restaurants serving St Helens' speciality - freshly caught seafood. Sink your teeth into buttery lobster, explore underwater caves and kelp forests on a diving adventure, or take the car for a trip to the Bay of Fires - just a five-minute drive away.\n\n**Your** **handpicked inclusions:**\n\n- Celebrate on arrival with a bottle of wine and a gourmet platter of local cheese and charcuterie\n- Satisfy your sweet tooth with a selection of welcome chocolates\n- Treat yourself to Japanese fusion at Raida restaurant with A$20 nightly dining credit per package\n- Sleep in on your final morning with guaranteed 12pm late checkout\n\n**Travelling with kids?** Upgrade to Family Suite for up to two adults and two children (12 and under).\n\n**This deal has NO peak surcharges:** Travel any time for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "St Helens",
    "location_heading": "Bay of Fires",
    "location_subheading": "Tasmania",
    "location_description": "Bay of Fires Apartments",
    "offer_address": "55 Cecilia St, St Helens TAS 7216",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 213.0,
    "value": 369.0
  }
]