[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cqSXuQAM",
    "hero_image": "https://images.luxuryescapes.com/9hz9ymc4q4ku6f92wbgb",
    "image_two": "https://images.luxuryescapes.com/k56keu36iey0nq366",
    "image_three": "https://images.luxuryescapes.com/xoeqbebsdmywowucl1c1g",
    "vendor_name": "Le Grand Bellevue",
    "title": "Discover Five-Star Swiss Excellence in Summer or Winter",
    "description": "Holiday like a celebrity in Switzerland’s famous town of Gstaad where you’ll discover stunning landscapes on a romantic retreat in your choice of winter or summer. Oozing sophistication and high-end luxury indulge in an escape to Le Grand Bellevue and enjoy daily buffet breakfast, local transfers, private screening at the hotel’s cinema, welcome drink on arrival, daily replenished minibar and more.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Bern",
    "offer_geo_area_level_2": "Saanen",
    "location_heading": "Gstaad",
    "location_subheading": "Switzerland",
    "location_description": "Le Grand Bellevue JUNE 2019",
    "offer_address": "Le Grand Bellevue Untergstaadstrasse 17 3780 Gstaad, Switzerland",
    "percentage_discount": 44.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 1366.0,
    "value": 2422.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eKyhhQAC",
    "hero_image": "https://images.luxuryescapes.com/qesbpugxx7n1sscw3pq",
    "image_two": "https://images.luxuryescapes.com/8tri0xqld60n5vnvtxa",
    "image_three": "https://images.luxuryescapes.com/q8zw5t6vn9m73h8kq1n2",
    "vendor_name": "Le Grand Bellevue",
    "title": "Five-Star Swiss Summer or Winter Retreat with Daily Breakfast and Spa Access",
    "description": "Find Swiss Alpine heaven in Switzerland’s famous town of Gstaad where you’ll discover stunning landscapes on a romantic retreat in your choice of winter or summer. Oozing sophistication with a grandiose, five-star Swiss charm, indulge in an escape to Le Grand Bellevue and enjoy daily buffet breakfast, a welcome drink upon arrival, access to Le Grand Spa, complimentary local transfers during your stay, a private screening at the hotel’s cinema and complimentary mini-bar replenished daily. Plus, stay during winter and be treated to nightly three-course dinners at the Michelin-starred LEONARD'S restaurant.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Bern",
    "offer_geo_area_level_2": "Saanen",
    "location_heading": "Gstaad",
    "location_subheading": "Switzerland",
    "location_description": "LE GRAND BELLEVUE Dec 2019",
    "offer_address": "Le Grand Bellevue Untergstaadstrasse 17 3780 Gstaad, Switzerland",
    "percentage_discount": 25.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 1361.0,
    "value": 1811.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003u0gfAAA",
    "hero_image": "https://images.luxuryescapes.com/g4yn46fvl917lkcrztdd",
    "image_two": "https://images.luxuryescapes.com/4ba5ckbydz2dh4rfun",
    "image_three": "https://images.luxuryescapes.com/vaa18rnj1tesnf4s63fg",
    "vendor_name": "Le Grand Bellevue",
    "title": "Five-Star Switzerland Alpine Elegance with In-House Cinema in the Stylish Ski Village of Gstaad",
    "description": "Early 20th-century grandeur meets contemporary style at Le Grand Bellevue, perched amid beautifully manicured parkland in the captivating alpine setting of Gstaad and ranked in the top 1% of properties worldwide on Tripadvisor. Ensconce yourself in sumptuous textiles, eclectic furnishings and effortlessly elegant interiors as the hotel's classic buttercup-yellow façade and exquisite Murano glass chandelier anchoring the central stairwell invite you to unwind in Swiss sophistication. Each of the 57 charming rooms redefines a stylish and relaxed country-house ambience, with stunning mountain and garden panoramas sure to delight even the most seasoned ski-lovers. Visiting in the summer months? Make use of the brand-new padel club or hire an e-bike and explore the surroundings on two wheels (charges apply).\n\nTake advantage of second-to-none service and an outstanding array of amenities, including international cuisine at gastronomic restaurant LEONARD's, Swiss classics in the log-cabin restaurant Le Petit Chalet, delicacies from the Sushi Bar or signature cocktails in the Art Deco bar that could be straight out of a Wes Anderson film. The hotel’s standout feature (besides its in-house cinema) is Le Grand Spa: a 3,000 sqm, state-of-the-art wellness facility, with eight saunas and hammams, a yoga and pilates studio, jacuzzi and indoor and outdoor pools set against a breathtaking mountain backdrop.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Canton of Bern",
    "offer_geo_area_level_2": "Saanen",
    "location_heading": "Gstaad",
    "location_subheading": "Switzerland",
    "location_description": "Le Grand Bellevue",
    "offer_address": "Untergstaadstrasse 17, 3780 Gstaad, Switzerland",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 7,
    "price": 747.0,
    "value": 747.0
  }
]