[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HRw5IAG",
    "hero_image": "https://images.luxuryescapes.com/1i2asl4pkpcvcn1fof",
    "image_two": "https://images.luxuryescapes.com/b6t5566excqrr0ioip8",
    "image_three": "https://images.luxuryescapes.com/y409f8byssapvkgt3eji",
    "vendor_name": "Warwick Fiji",
    "title": "Fiji Coral Coast Oasis with All-Inclusive Dining, Nightly Cocktails & Two Kids Stay Free",
    "description": "Surround yourself with the unspoiled beauty of Fiji’s Coral Coast, where glittering turquoise waters, towering palm trees and long stretches of golden sand provide the perfect setting for an unforgettable escape. Within moments of arrival, prepare to be met with warm Fijian hospitality and exceptional service as you slip into the rhythm of island time.\n\nHere, all you need to think about is which corner of the pool you should laze by, where your next day trip will be or which of the many mouthwatering onsite restaurants you should visit tonight - will it be freshly caught seafood delights at Wicked Walu, Japanese fine dining at Sazanami or international favourites at Bula Brasserie?\n\nCouples or honeymooners will love this romantic tropical haven, with days spent in the dedicated adults-only corner of the hotel or indulging in a lavish treatment at the Warwick Spa overlooking a serene lagoon. Meanwhile, families are well catered for with an array of activities for all ages, including a complimentary kids' club and pool.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "Warwick Fiji",
    "offer_address": "Queen's Road, Korolevu, Coral Coast, Viti Levu, Korolevu, Fiji",
    "percentage_discount": 65.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 1199.0,
    "value": 3407.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3EFaQAN",
    "hero_image": "https://images.luxuryescapes.com/okdz1hshheeo3gtrkiks",
    "image_two": "https://images.luxuryescapes.com/y0dx8kz6iqjlkcjs66xb",
    "image_three": "https://images.luxuryescapes.com/vyc8ocsiifuyatycweks",
    "vendor_name": "The Naviti Resort Fiji",
    "title": "The Ultimate Family Holiday with All-Inclusive Dining & Drinks",
    "description": "Set your watch to island time and experience the ultimate all-inclusive island escape at the sophisticated Naviti Resort, a beachfront paradise nestled amid tropical gardens. Embrace the holiday luxury with all your gourmet meals and all draught beers, house wines and soft drinks included, two cocktail vouchers per adult, a round of golf with complimentary club and buggy hire, complimentary use of all non-motorized sports equipment throughout your stay, and more. PLUS, two children aged 12 years and under stay, play and eat all meals for free - with unlimited ice-cream during lunch and dinner!",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Nadroga-Navosa",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "The Naviti Resort - 2019",
    "offer_address": "Coral Coast, Sigatoka, Korolevu, Fiji",
    "percentage_discount": 43.0,
    "min_duration": 6,
    "max_duration": 8,
    "price": 1353.0,
    "value": 2393.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CI0kGYAT",
    "hero_image": "https://images.luxuryescapes.com/06z407ukwet6o82dhp9l",
    "image_two": "https://images.luxuryescapes.com/x2zajdue9bvi5ltt2m1",
    "image_three": "https://images.luxuryescapes.com/w1gy5evu9s7nlfwx8sus",
    "vendor_name": "The Naviti Resort Fiji",
    "title": "All-Inclusive Bliss: Fiji Coral Coast Escape with All Meals & Unlimited Free-Flow Drinks",
    "description": "Soak up the sun, escape the crowds and set your watch to island time on Fiji’s Coral Coast at this beachfront retreat. Spread across 38 acres of paradisiacal palms, with a private stretch of sugar-fine sand, the resort’s unbeatable location will whisk you away from the rest of the world.\n\nHere, every family member will find their slice of tropical paradise. Splash in the lagoon-style pool, lounge at the swim-up bar or let any stresses melt away with a treatment at the Joy Spa. Soak up the sun with a round of golf on the nine-hole course or cool off in the azure Fijian waters.\n\nEvery day, rest assured knowing that a world-class breakfast, lunch and dinner will be waiting for you at the laid-back beachfront Nukunuku Restaurant, along with boundless sips of your favourite drinks. Then, when you're in the mood for something new, indulge in the romance of Talei Restaurant’s fine dining.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "The Naviti Resort",
    "offer_address": "Queens Road, Coral Coast, Korolevu, Viti Levu, Fiji",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1399.0,
    "value": 2827.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070ow7AAA",
    "hero_image": "https://images.luxuryescapes.com/kc0dzet179krsdvq9yfa",
    "image_two": "https://images.luxuryescapes.com/0j7rnnvrufi6ya8jdsx",
    "image_three": "https://images.luxuryescapes.com/ljcxjmxmomp9q40y6ts",
    "vendor_name": "Fiji Hideaway Resort & Spa",
    "title": "Fiji Coral Coast Traditional Bures with Daily Breakfast, Nightly Drinks & Massages",
    "description": "Soak up the sun and let your troubles fall away as you escape to the Fiji Hideaway Resort & Spa. A true hidden gem, the resort boasts traditional Fijian-style beachside bures and unparalleled access to the island's unspoilt Coral Coast, where the water never drops below a balmy 20°C. You'll be perfectly situated for adventure: zipline through lush forest, take a safari into the Sigatoka Valley, catch some world-class waves and snorkel to your heart's content. If you'd rather take things slow, spend a day at the onsite spa and indulge in a complete relaxation experience before cooling off in the pool.\n\nAfter your day of adventure, dine on a range of Melanesian and international classics at the onsite restaurant and enjoy nightly traditional Fijian entertainment, including Meke fire dancing and folk music. Take in the magic of night under the spellbinding Fijian stars, and finish each evening in comfort within your authentic thatched-roof bungalow accommodation, content in the knowledge that you can wake up tomorrow and do it all again.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "Fiji Hideaway Resort & Spa",
    "offer_address": "Coral Coast Sigatoka Queens Road Korolevu Nadroga, Navosa, Fiji",
    "percentage_discount": 42.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 506.0,
    "value": 868.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CNyiSAAT",
    "hero_image": "https://images.luxuryescapes.com/ybvke3c1rj3em41gtlk",
    "image_two": "https://images.luxuryescapes.com/xepvtdgouchxk4h0ci2l",
    "image_three": "https://images.luxuryescapes.com/wc3clkwpcnuld4o8c4xvj",
    "vendor_name": "Warwick Fiji",
    "title": "Five-Star Fiji Coral Coast Oasis with Massages, Daily Breakfast & Nightly Drinks",
    "description": "Surround yourself with the unsurpassed beauty of Fiji’s Coral Coast, where glittering turquoise waters, towering palm trees and long stretches of golden sand provide the perfect setting for an unforgettable escape at the five-star Warwick Fiji. Here, all you need to think about is which corner of the pool you should laze by, where your next day trip will be to or which of the many mouthwatering, highly-rated onsite restaurants you should visit tonight - will it be fresh-caught oceanfront seafood delights at Wicked Walu, Japanese fine dining at Sazanami or international favourites at Bula Brasserie?\n\nCouples or honeymooners will love this romantic tropical haven, with days spent in the dedicated, adults-only corner of the hotel or indulging in a luxurious spa treatment at Warwick Fiji’s superior spa, perched on the edge of the ocean overlooking a serene lagoon. Meanwhile, families will be well catered for with an array of onsite activities for all ages, including a dedicated Kids' Club and pool. Within moments of arrival, prepare to be met with warm Fijian hospitality and exceptional service as you slip into the rhythm of island time.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "Warwick Fiji",
    "offer_address": "Queen's Road, Korolevu, Coral Coast, Viti Levu, Korolevu, Fiji",
    "percentage_discount": 61.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 767.0,
    "value": 1963.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FXO4YYAX",
    "hero_image": "https://images.luxuryescapes.com/tyfdm4b5psgvribe7ay7",
    "image_two": "https://images.luxuryescapes.com/c97zlc4va6kuhe80zxsu",
    "image_three": "https://images.luxuryescapes.com/x0yu5tmds8hyo9i9ns7j",
    "vendor_name": "Fiji Hideaway Resort & Spa",
    "title": "Idyllic Fiji Coral Coast Escape with Daily Breakfast, Nightly Cocktails & Dining Credit",
    "description": "Discover a tropical oasis steeped in Fijian charms, perched along the Coral Coast and gently lapped by the turquoise waters of the Pacific Ocean. This beachfront haven boasts traditional thatched-roof bures ideally set amid lush gardens and swaying palm trees.\n\nSpend your days lounging by the expansive pool and exploring the vibrant coral reefs by snorkel, scuba or kayak. If you're looking to pamper yourself, indulge in soothing treatments at the day spa while the little ones are entertained at the Hermit Crab Kids' Club. For a taste of culture, enjoy a Kava ceremony, watch a Meke performance or embark on a spearfishing adventure.\n\nWhen hunger strikes, relish Japanese-style robatayaki fare at Yuhi Robata Grill or savour aromatic Indian flavours at Tandoori Oven. At Chiefs Restaurant, fresh seafood platters and local Fijian delicacies like kokoda await, while Cocos Bar is your ideal spot for epic ocean sunsets.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "Fiji Hideaway Resort & Spa",
    "offer_address": "Coral Coast Sigatoka Queens Road Korolevu Nadroga, Navosa, Fiji",
    "percentage_discount": 54.0,
    "min_duration": 5,
    "max_duration": 12,
    "price": 599.0,
    "value": 1301.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GgmDVYAZ",
    "hero_image": "https://images.luxuryescapes.com/xqcecipgitbklnazhlk",
    "image_two": "https://images.luxuryescapes.com/296qiufznkxbmnwfli6f",
    "image_three": "https://images.luxuryescapes.com/0ahq9cevryxztusvdmg",
    "vendor_name": "The Naviti Resort Fiji",
    "title": "Fiji Coral Coast Bliss with All-Inclusive Dining, Unlimited Free-Flow Drinks & Two Kids Stay Free",
    "description": "Soak up the sun, escape the crowds and set your watch to island time on Fiji’s Coral Coast at this beachfront retreat. Spread across 38 acres of paradisiacal palms, with a private stretch of sugar-fine sand, the resort’s unbeatable location will whisk you away from the rest of the world.\n\nHere, every family member will find their slice of tropical paradise. Splash in the lagoon-style pool, lounge at the swim-up bar or let any stresses melt away with a treatment at the Joy Spa. Soak up the sun with a round of golf on the nine-hole course or cool off in the azure Fijian waters.\n\nEvery day, rest assured knowing that a world-class breakfast, lunch and dinner will be waiting for you at the laid-back beachfront Nukunuku Restaurant, along with boundless sips of your favourite drinks. Then, when you're in the mood for something new, indulge in the romance of Talei Restaurant’s fine dining.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "The Naviti Resort",
    "offer_address": "Queens Road, Coral Coast, Korolevu, Viti Levu, Fiji",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 25,
    "price": 1399.0,
    "value": 2740.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000H0FepYAF",
    "hero_image": "https://images.luxuryescapes.com/zjqsa29ero2rx8z7qs67",
    "image_two": "https://images.luxuryescapes.com/qmcvzrxl3lsl4a0helaf",
    "image_three": "https://images.luxuryescapes.com/dkrn8xvqyglbyy1ny4d",
    "vendor_name": "Warwick Fiji",
    "title": "Fiji Coral Coast Oasis with All-Inclusive Dining, Nightly Cocktails & Two Kids Stay Free",
    "description": "Surround yourself with the unspoiled beauty of Fiji’s Coral Coast, where glittering turquoise waters, towering palm trees and long stretches of golden sand provide the perfect setting for an unforgettable escape. Within moments of arrival, prepare to be met with warm Fijian hospitality and exceptional service as you slip into the rhythm of island time.\n\nHere, all you need to think about is which corner of the pool to laze by, where your next day trip will be or which of the many mouthwatering onsite restaurants you should visit tonight - will it be freshly caught seafood at Wicked Walu, Japanese fine dining at Sazanami or international favourites at Bula Brasserie?\n\nCouples or honeymooners will love this romantic tropical haven, with days spent in the dedicated adults-only corner of the hotel or indulging in a lavish treatment at the Warwick Spa overlooking a serene lagoon. Meanwhile, families are well catered for with an array of activities for all ages, including a complimentary kids' club and pool.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "Warwick Fiji",
    "offer_address": "Queen's Road, Korolevu, Coral Coast, Viti Levu, Korolevu, Fiji",
    "percentage_discount": 61.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 1119.0,
    "value": 2876.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006z4AeAAI",
    "hero_image": "https://images.luxuryescapes.com/qcbrw6uwnpzmk7efo77",
    "image_two": "https://images.luxuryescapes.com/48e7xutruvmulwzz2g1",
    "image_three": "https://images.luxuryescapes.com/17j3957q1il0z0m681e",
    "vendor_name": "Warwick Fiji",
    "title": "Five-Star Fiji Coral Coast Oasis with All-Inclusive Gourmet Dining, Free-Flow Drinks & Roundtrip International Flights with Fiji Airways for Two Adults",
    "description": "Surround yourself with the unsurpassed beauty of Fiji’s Coral Coast, where glittering azure waters, towering palm trees and long sandy stretches provide the perfect setting for an unforgettable escape at the five-star Warwick Fiji - ranked among the world's top 10% at the 2021 Tripadvisor Travellers’ Choice awards.\n\nWithin moments of arrival, prepare to be met with warm Fijian hospitality and exceptional service as you slip into the rhythm of island time. Here, all you need to think about is which corner of the pool you should laze by, where your next day trip will be to or which of the many mouthwatering, highly rated restaurants onsite you should visit tonight (Wicked Wula is ranked among the top 1% worldwide in Tripadvisor's 2021 Best of the Best awards). Couples or honeymooners will love this romantic tropical haven, with days spent in the dedicated adults-only corner of the hotel or indulging in a luxurious spa treatment. Meanwhile, families will be well catered for with an array of onsite activities for all ages, including a dedicated Kids' Club and pool.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "Warwick Fiji",
    "offer_address": "Queen's Road, Korolevu, Coral Coast, Viti Levu, Korolevu, Fiji",
    "percentage_discount": 0.0,
    "min_duration": 5,
    "max_duration": 16,
    "price": 1323.0,
    "value": 0.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005IIOGAA4",
    "hero_image": "https://images.luxuryescapes.com/no3ll17egw92ubqo5naj",
    "image_two": "https://images.luxuryescapes.com/scjrbsidccwq4vzsyyag",
    "image_three": "https://images.luxuryescapes.com/4046zuuams2dbj0qwe6",
    "vendor_name": "Warwick Fiji",
    "title": "Top-Rated Five-Star Fiji Paradise with Daily Gourmet Dining & Daily Drinks",
    "description": "Surround yourself with the unsurpassed beauty of Fiji’s Coral Coast, where glittering azure waters, towering palm trees and long sandy stretches provide the perfect setting for an unforgettable escape at the five-star Warwick Fiji - named among the top 10% hotels worldwide at the 2021 Tripadvisor Travellers’ Choice awards.\n\nWithin moments of arrival, prepare to be met with warm Fijian hospitality and exceptional service as you slip into the rhythm of island time. Here, all you need to think about is which corner of the pool you should laze by, where your next day trip will be or which of the many mouth-watering, highly rated restaurants onsite you should visit tonight. Couples or honeymooners will love this romantic tropical haven, with days spent lazing by the pool in the dedicated adults-only corner of the hotel or indulging in a luxurious spa treatment. Meanwhile, families will enjoy the array of onsite activities for all ages, including the dedicated Kids' Club and pool, with the option to venture beyond the hotel to the Mamanuca Islands for a fun-filled day trip.\n\n**Your handpicked inclusions:**\n\n- Daily buffet breakfast at Bula Brasserie for two adults\n- Enjoy two à la carte lunches (one course) at selected restaurants onsite for two adults\n- Indulge with two à la carte dinners (two courses) at selected restaurants onsite for two adults\n- Unwind with a daily drink (glass of wine, beer or soft drink) per adult at Sunset Bar\n- Pamper yourself with four 30-minute massages per package\n- Up to two children (12 and under) stay, play and eat free with daily breakfast, lunch and dinner from designated children's buffet or set menu at nominated restaurants\n\n**Upgrade & longer stay bonuses:** Extend your stay to seven nights or more or upgrade and enjoy bonus dining inclusions. See individual packages for details.\n\n**Adults-only upgrades available:** Upgrade to the Warwick Deluxe Room or Warwick Suite, both located in the hotel's adults-only wing, and enjoy Executive Warwick Lounge access offering daily afternoon tea, nightly pre-dinner drinks and more. Rooms in the adults-only wing also enjoy additional comforts including welcome amenities, concierge service and daily turndown.\n\n**Book with 100% Confidence**: If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "Warwick Fiji Jun 2021",
    "offer_address": "Queen's Road, Korolevu, Coral Coast, Viti Levu, Korolevu, Fiji",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 12,
    "price": 735.0,
    "value": 1843.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GNHNXAA5",
    "hero_image": "https://images.luxuryescapes.com/7y1vnmqbcx3z10oi0tne",
    "image_two": "https://images.luxuryescapes.com/vz6bo9a12mtgfsztzh7r",
    "image_three": "https://images.luxuryescapes.com/jkmiiqpi50rv7tbieq",
    "vendor_name": "Tambua Sands Beach Resort",
    "title": "Coral Coast Villa Hideaway with Guided Reef Walk & Daily Breakfast",
    "description": "Serenity is on the menu at the Tambua Sands Beach Resort, a pocket of paradise along the Coral Coast. Savour moments spent sprawled on the private beach or splashing in the ocean. Lunch and dinner are a casual affair at Tambua Sands Restaurant, where fresh seafood, traditional Fijian dishes and an extensive drinks list are perfectly accompanied by the ocean backdrop. Cool off in the vast freshwater pool, sip tropical cocktails on a sun lounger or try your hand at beach volleyball. When it's time to shake things up, nearby you can discover walking trails, sand dunes, adventure parks and a nine-hole golf course. If it's ocean magic you're after, there's snorkelling, canoeing and kayaking available.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korotogo",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "Tambua Sands Beach Resort",
    "offer_address": "Queens Road, Coral Coast, Sigatoka, Fiji",
    "percentage_discount": 27.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 589.0,
    "value": 807.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GqfcAAC",
    "hero_image": "https://images.luxuryescapes.com/k7vpwn8nqc5gny9rz2",
    "image_two": "https://images.luxuryescapes.com/au21ytwp2g3ovnvazzaw",
    "image_three": "https://images.luxuryescapes.com/7du8bt2m4gkjtvv0gj1d",
    "vendor_name": "The Naviti Resort Fiji",
    "title": "Award-Winning Family Escape on Fiji's Coral Coast with Gourmet Dining & Nightly Drinks",
    "description": "Soak up the sun, escape the crowds and set your watch to island time on Fiji's Coral Coast at Naviti Resort - a beachfront paradise stamped with a Tripadvisor Travellers' Choice 2021 award. Nestled amid tropical gardens, with a private stretch of sugar-fine sand, Naviti Resort’s unbeatable location will instantly make you forget the outside world. Spread across 38 acres of tropical palms, with an exceptional swimming pool, swim-up bar, four distinct food and drink outlets, the indulgent Joy Spa and a stunning nine-hole golf course, this is a secluded sanctuary for the entire family. All packages are valid for two adults and two children (12 and under) or choose the Big Family Upgrade for two adults and three children.\n\nFind your perfect patch of sand to relax on, cool off in the azure Fijian waters, explore the pristine Coal Coast shores by boat or discover the nearby Biausevu Waterfalls, Kula WILD Adventure Park and Sigatoka Sand Dunes - the choice is all yours.\n\n**Your handpicked inclusions:**\n\n- Up to two children (12 and under) stay, play and eat free\n- Fuel up for a fun-filled day with daily buffet breakfast at Nukunuku Restaurant\n- Tuck into one family buffet lunch at Nukunuku Restaurant\n- Go on a culinary adventure with two buffet dinners at Nukunuku Restaurant\n- Enjoy a nightly drink per adult (beer, glass of wine or soft drink)\n- Practise your swing with one round of golf for two adults\n- Have a splash-tastic time with complimentary non-motorised watersports\n\n**Big Family Upgrade**: There's space for larger families in the Family Garden View Room for up to two adults and three children (12 and under).\n\n**All-Inclusive Upgrade:** Ready to indulge? Check out the all-inclusive upgrade with all meals and free-flow drinks (beer, wine, spirits and soft drinks) included. This incredible package also includes unlimited ice cream for kids, unlimited rounds of golf for two adults (including club hire and buggy), a 60-minute massage per adult and more!\n\n**Book with 100% Confidence:** Right up until 14 days before check-in you can enjoy unlimited, free date changes, or cancel and get a 100% credit to use at Luxury Escapes for any other Limited Time Lux Exclusive accommodation, tour or cruise offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "The Naviti Resort Fiji",
    "offer_address": "Queens Highway, Korolevu, Coral Coast, Viti Levu, Fiji",
    "percentage_discount": 63.0,
    "min_duration": 6,
    "max_duration": 12,
    "price": 639.0,
    "value": 1714.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hTfFAAU",
    "hero_image": "https://images.luxuryescapes.com/93zvzrsvjuklv9i97tt",
    "image_two": "https://images.luxuryescapes.com/a1j20pjwltobxrhw9d4l",
    "image_three": "https://images.luxuryescapes.com/it4jr4qwyr73cqbjkm4a",
    "vendor_name": "The Naviti Resort Fiji",
    "title": "Fiji Affordable Coral Coast Family Escape with All-Inclusive Dining, Free-Flow Drinks & Roundtrip International Flights with Fiji Airways for Two Adults",
    "description": "Soak up the sun, escape the crowds and set your watch to island time on Fiji's Coral Coast at Naviti Resort - a beachfront paradise stamped with a Tripadvisor Travellers' Choice 2021 award. Nestled amid tropical gardens, with a private stretch of sugar-fine sand, Naviti Resort’s unbeatable location will instantly make you forget the outside world. Spread across 38 acres of tropical palms and just under two hours from Nadi, this is a secluded sanctuary for the entire family. Facilities include an exceptional swimming pool, swim-up bar, four distinct food and drink outlets, the indulgent Joy Spa and a stunning nine-hole golf course.\n\nFind your perfect patch of sand to relax on, cool off in the azure Fijian waters, explore the pristine Coal Coast shores by boat or discover the nearby Biausevu Waterfall, Kula WILD Adventure Park and Sigatoka Sand Dunes.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "The Naviti Resort Fiji",
    "offer_address": "Queens Highway, Korolevu, Coral Coast, Viti Levu, Fiji",
    "percentage_discount": 0.0,
    "min_duration": 6,
    "max_duration": 16,
    "price": 1286.0,
    "value": 0.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006z49HAAQ",
    "hero_image": "https://images.luxuryescapes.com/1ee7nlmany4urpbgtuh",
    "image_two": "https://images.luxuryescapes.com/2s0vzlfyjrd2u8k21clc",
    "image_three": "https://images.luxuryescapes.com/nhoom7sldqqicm1ft12t",
    "vendor_name": "The Naviti Resort Fiji",
    "title": "Fiji Affordable Coral Coast Family Escape with All-Inclusive Dining, Free-Flow Drinks & Roundtrip International Flights with Fiji Airways for Two Adults",
    "description": "Soak up the sun, escape the crowds and set your watch to island time on Fiji's Coral Coast at Naviti Resort - a beachfront paradise stamped with a Tripadvisor Travellers' Choice 2021 award. Nestled amid tropical gardens, with a private stretch of sugar-fine sand, Naviti Resort’s unbeatable location will instantly make you forget the outside world. Spread across 38 acres of tropical palms and just under two hours from Nadi, this is a secluded sanctuary for the entire family. Facilities include an exceptional swimming pool, swim-up bar, four distinct food and drink outlets, the indulgent Joy Spa and a stunning nine-hole golf course.\n\nFind your perfect patch of sand to relax on, cool off in the azure Fijian waters, explore the pristine Coal Coast shores by boat or discover the nearby Biausevu Waterfall, Kula WILD Adventure Park and Sigatoka Sand Dunes.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "The Naviti Resort Fiji",
    "offer_address": "Queens Highway, Korolevu, Coral Coast, Viti Levu, Fiji",
    "percentage_discount": 0.0,
    "min_duration": 6,
    "max_duration": 16,
    "price": 1197.0,
    "value": 767.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BddjOAAR",
    "hero_image": "https://images.luxuryescapes.com/ds6thptmjl22f57ok5rs",
    "image_two": "https://images.luxuryescapes.com/xf7kk9t1mjxrdu187cce",
    "image_three": "https://images.luxuryescapes.com/ajl3t33x6ty2plk1nsa",
    "vendor_name": "The Naviti Resort Fiji",
    "title": "Fiji Coral Coast Escape with All-Inclusive Dining, Free-Flow Drinks & Cruise Experiences",
    "description": "Soak up the sun, escape the crowds and set your watch to island time on Fiji's Coral Coast at The Naviti Resort Fiji - a beachfront paradise boasting endless fun and fabulous amenities. Nestled amid tropical gardens, with a private stretch of sugar-fine sand, the remarkable resort’s unbeatable location will instantly make you forget the outside world. Spread across 38 acres of paradisiacal palms and just under two hours from Nadi, this is a secluded sanctuary for the entire family. \n\nFacilities include an exceptional swimming pool, swim-up bar, four distinct food and drink outlets, the indulgent Joy Spa and a stunning nine-hole golf course. Find your perfect patch of sand to relax on, cool off in the azure Fijian waters, explore the pristine Coral Coast shores by boat or discover the nearby Biausevu Waterfall, Kula WILD Adventure Park and Sigatoka Sand Dunes.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "The Naviti Resort Fiji",
    "offer_address": "Queens Highway, Korolevu, Coral Coast, Viti Levu, Fiji",
    "percentage_discount": 38.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1448.0,
    "value": 2332.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LeZUAA0",
    "hero_image": "https://images.luxuryescapes.com/z8cym4uqkcw03k2tb8",
    "image_two": "https://images.luxuryescapes.com/w1hiu26b8nun971aebg1",
    "image_three": "https://images.luxuryescapes.com/g0xmv1uevlzzwsjl485",
    "vendor_name": "The Naviti Resort Fiji",
    "title": "Beachfront Fiji Escape with Dining Experiences & Nightly Drinks",
    "description": "Set your watch to island time and experience the ultimate Fiji escape at The Naviti Resort, a beachfront paradise nestled amid tropical gardens on Fiji's Coral Coast.\n\nEnjoy daily buffet breakfast, two delicious buffet dinners, one lunch for two, one nightly drink per adult (your choice of beer, wine or cocktail of the day), a complimentary round of golf and complimentary non-motorised watersports.\n\n**All-Inclusive Family Upgrade:** Check out the all-inclusive upgrade with all meals and free-flow drinks (beer, wine, spirits and soft drinks) included. Plus, two kids (aged 12 years and under) stay, play and eat for free with unlimited ice cream at lunch and dinner when you purchase the All-Inclusive Family Upgrade.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "The Naviti Resort - May 20",
    "offer_address": "Queens Rd, Fiji",
    "percentage_discount": 48.0,
    "min_duration": 6,
    "max_duration": 8,
    "price": 743.0,
    "value": 1421.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gGOZAA2",
    "hero_image": "https://images.luxuryescapes.com/gp1ky4xy0fra5wdih5fs",
    "image_two": "https://images.luxuryescapes.com/nv2s8mgb1lgfhx7uu5c7",
    "image_three": "https://images.luxuryescapes.com/vvmuabzyomcgofre618p",
    "vendor_name": "The Naviti Resort Fiji",
    "title": "Fiji Coral Coast Family-Friendly Escape with Private Beach & Kids Club",
    "description": "Soak up the sun, escape the crowds and set your watch to island time on Fiji's Coral Coast at The Naviti Resort - a beachfront paradise perfect for rest and relaxation. Nestled amid tropical gardens, with a private stretch of sugar-fine sand, The Naviti Resort’s unbeatable location will instantly make you forget the outside world. Spread across 38 acres of tropical palms and just under two hours from Nadi, this is a secluded sanctuary for the entire family. Facilities include an exceptional swimming pool, swim-up bar, four distinct food and drink outlets, the indulgent Joy Spa and a stunning nine-hole golf course.\n\nFind a sun-kissed patch of sand to relax on, cool off in the azure Fijian waters or explore the pristine Coral Coast shores by boat. Venture out of the fabulous resort to discover the secrets of the nearby Biausevu Waterfall and Sigatoka Sand Dunes National Park, or take the whole family on an educational daytrip to the Kula WILD Adventure Park.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "The Naviti Resort",
    "offer_address": "Queens Road, Coral Coast, Korolevu, Viti Levu, Fiji",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 195.0,
    "value": 195.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DWIQAA4",
    "hero_image": "https://images.luxuryescapes.com/a71iu4d9zemf6sdfs3uh",
    "image_two": "https://images.luxuryescapes.com/g1d6x5j2w9te7wcqa5",
    "image_three": "https://images.luxuryescapes.com/ujzyj8qx1gc9w6m2bbdw",
    "vendor_name": "Likuri Island Resort",
    "title": "Fiji Coral Coast Private Island Oasis with Immersive Cultural Experiences",
    "description": "Experience authentic Fijian culture and entertainment at the boutique Likuri Island Resort, situated on a private island close to Natadola Beach on the Coral Coast. Marvel at a spectacular fire walking demonstration, learn how to climb a coconut tree or ride the turquoise waves with complimentary access to sea kayaks and stand-up paddle boards. Plus, relax at Likuri Spa and indulge in locally-sourced cuisine with buffet lovo-style meals by the beachside.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Robinson Crusoe Island",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "Likuri Island Resort Fiji",
    "offer_address": "Likuri Island, Coral Coast, Western Division, Fiji",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 100.0,
    "value": 100.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nMHTAA2",
    "hero_image": "https://images.luxuryescapes.com/6vaom3hbevceaddf5v",
    "image_two": "https://images.luxuryescapes.com/qt89hwc5iywkolda4zck",
    "image_three": "https://images.luxuryescapes.com/m6basbllwmmx8me9ro",
    "vendor_name": "Tambua Sands Beach Resort",
    "title": "Tranquil Fiji Coral Coast Villa Hideaway with Private Beach",
    "description": "Serenity is on the menu at the oceanfront Tambua Sands Beach Resort, a pocket of paradise along the Coral Coast. Between moments spent sprawled on the private beach or splashing in the ocean, you can take advantage of the resort's exceptional facilities. Lunch and dinner are a casual affair at Tambua Sands Restaurant, where fresh seafood, traditional Fijian dishes and an extensive drinks list are perfectly accompanied by the ocean backdrop. Cool off in the vast freshwater pool, sip tropical cocktails on a sun lounger or try your hand at beach volleyball.\n\nWhen it's time to shake things up, nearby you can discover walking trails, sand dunes, adventure parks and a nine-hole golf course. If it's ocean magic you're after, there's snorkelling, canoeing and kayaking available. Access to the fitness centre and spa services at neighbouring resorts can be arranged, so you can enjoy the perfect balance of barefoot bliss and luxury amenities.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Korolevu",
    "location_heading": "Coral Coast",
    "location_subheading": "Fiji",
    "location_description": "Tambua Sands Beach Resort",
    "offer_address": "Sigatoka, Western Division, Fiji",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 107.0,
    "value": 107.0
  }
]