[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007nUllAAE",
    "hero_image": "https://images.luxuryescapes.com/i5geeu3l4aoeurbf592pv",
    "image_two": "https://images.luxuryescapes.com/vu0n9as45qrviuotbgfh",
    "image_three": "https://images.luxuryescapes.com/uch7chhua4ab4lb933m9",
    "vendor_name": "Tree of Life Darbargadh Dared Gujarat",
    "title": "Heritage Gujarat Escape with Daily Breakfast, One Poolside Dinner & 2 Kids Stay Free",
    "description": "Time stands still at the picturesque Tree of Life Darbargadh Dared, a 300-year-old ancient fortress-turned-hotel in the Bhavnagar district of Gujarat, a 3.5-hour-drive from Ahmedabad. Proudly rebuilt in the Saurashtra style of architecture, this gorgeous Tree of Life property is the perfect destination for those seeking a unique and tranquil escape. Conveniently located close to Bhavanagar Airport and easily accessible from all the major cities of Gujarat, Tree of Life Darbargadh Dared promises to pamper you with brave historical tales, rich heritage, lavish open spaces, multi-culinary dining and contemporary amenities. This is Gujarat like you've never experienced before.\n\nAdventure seekers and culture lovers can easily fill up their days at this lavish resort with exciting experiences such as visits to the famed Velavadar Blackbuck National Park, Palitana temple tours and more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Gujarat",
    "offer_geo_area_level_2": "Valabhipur",
    "location_heading": "Gujarat",
    "location_subheading": "India",
    "location_description": "Tree of Life Darbargadh Dared",
    "offer_address": "00 , Dared Taluka Vallabhipur , Village dared Bhavnagar, Gujrat 364760 India",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 171.0,
    "value": 301.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UIsULQA1",
    "hero_image": "https://images.luxuryescapes.com/wqtezmyf2ogeanjstjui",
    "image_two": "https://images.luxuryescapes.com/y9fnjazapclqs2jwlga5",
    "image_three": "https://images.luxuryescapes.com/pdcdmrblsrr0hkaoetil",
    "vendor_name": "The Fern - Gir Forest",
    "title": "Award-winning Luxury Nature Retreat",
    "description": "See the incredible wildlife of Devalia Safari Park, from the endangered Asiatic lion to leopards and more, while staying at the award-winning The Fern Gir Forest Resort in Sasan Gir. Spend three days/two nights in a well-appointed luxury Fern Tent with all daily meals (breakfast, lunch and dinner), daily afternoon tea and one complimentary bird watching trip for two people.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Gujarat",
    "offer_geo_area_level_2": "Talala",
    "location_heading": "Gujarat",
    "location_subheading": "India",
    "location_description": "The Fern - Gir Forest",
    "offer_address": "SH-26, Sasan Road, Opposite Lords Resorts, District J, Junagadh, Sasan Gir, Gujarat, 362135",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 185.0,
    "value": 324.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DPnZAAW",
    "hero_image": "https://images.luxuryescapes.com/gompcz7m8w3y9iahdoi",
    "image_two": "https://images.luxuryescapes.com/eqgb77oqxhwz2fxjqzf",
    "image_three": "https://images.luxuryescapes.com/g2un58gl2j4g9syvax1",
    "vendor_name": "The Leela Gandhinagar",
    "title": "Stylish Gujarat Stay Above Gandhinagar Railway Station with Four Restaurants",
    "description": "Indulge in timeless hospitality and vibrant old-world traditions at the opulent The Leela Gandhinagar, ideally located amid India's vibrant state of Gujarat. Situated atop the concourse of the Gandhinagar Railway Station, this magnificent oasis offers legendary hospitality, signature services and a palatial escape within a sky-high paradise. Part of the globally recognised Leela brand, the hotel features a long list of glamorous facilities, including a swimming pool, state-of-the-art fitness centre and four unforgettable dining sites offering a diverse range of local and international cuisine - including the all-day Citrus Junction and open-kitchen culinary experience at Diya restaurant. For further relaxation, visit The Spa, where you can take advantage of tailored treatments to balance the chakras of your body, mind and soul.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Gujarat",
    "offer_geo_area_level_2": "Gandhinagar",
    "location_heading": "Gujarat",
    "location_subheading": "India",
    "location_description": "The Leela Gandhinagar",
    "offer_address": "Railway Station, The Leela Gandhinagar Sector 14 Airspace, Above Gandhinagar, Near K Road, Gandhinagar, Gujarat 382014, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 104.0,
    "value": 104.0
  }
]