[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HhqoIAC",
    "hero_image": "https://images.luxuryescapes.com/wyi0pckiy5sop250drn",
    "image_two": "https://images.luxuryescapes.com/39pg934sqkfneyron4",
    "image_three": "https://images.luxuryescapes.com/9otvsy0ogoqi1i9o12k",
    "vendor_name": "Freycinet Lodge",
    "title": "Freycinet National Park Luxury Waterside Lodge overlooking Great Oyster Bay with Daily Breakfast & A$100 Dining Credit",
    "description": "From the home of some of Australia's best oysters comes a coastal-meets-bush retreat, a pearl amid the rugged and mountainous Tasmanian landscape. Experience the untouched beauty of Tasmania's east coast at this superb haven, the only accommodation within Freycinet National Park and offering direct access to Richardson's Beach and views of the Hazards mountains and Great Oyster Bay.\n\nWith daily breakfast taken care of and additional dining credit, you'll be spoiled for choice of culinary delights. Savour local seafood at Richardson's Bistro, indulge in fine-dining as you watch the crashing waves from The Bay Restaurant, or enjoy a pint of local Tasmanian beer or a cocktail at Hazards Bar & Lounge.\n\nFor the adventurous, the lodge's own company, Freycinet Adventures, offers thrilling experiences from sea kayaking to e-biking through the wilderness. A short stroll will lead you to the famed Wineglass Bay, or wander to the Lodge's picturesque deck to enjoy a glass of bubbles and fresh Tasmanian oysters as you watch the sunset.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Coles Bay",
    "location_heading": "Coles Bay",
    "location_subheading": "Tasmania",
    "location_description": "Freycinet Lodge",
    "offer_address": "Freycinet National Park, Coles Bay Road, Coles Bay, Tasmania 7215, Australia",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 379.0,
    "value": 767.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IXaWIAW",
    "hero_image": "https://images.luxuryescapes.com/in9d0bkj4islf8pixtic",
    "image_two": "https://images.luxuryescapes.com/v59hiua84huwl6k817",
    "image_three": "https://images.luxuryescapes.com/svm26eep7hcg36d14ng",
    "vendor_name": "Freycinet Lodge",
    "title": "Tasmania Waterside Luxury: Freycinet National Park Lodge with Daily Breakfast & A$100 Dining Credit",
    "description": "Discover Tasmania's wild east coast with a stay within Freycinet National Park, where rugged bushland meets the sweeping sands of Richardson's Beach. Wake to panoramic views of the Hazards mountains and Great Oyster Bay, with direct access to untouched shoreline and coastal walking trails steps from your door.\n\nWith daily breakfast taken care of and additional dining credit to use across any onsite restaurant, you'll be spoiled for choice of culinary delights. Savour local seafood at Richardson's Bistro, indulge in fine-dining as you watch the crashing waves from The Bay Restaurant, or enjoy a pint of local Tasmanian beer or a cocktail at Hazards Bar & Lounge.\n\nFor the adventurous, the lodge's own company, Freycinet Adventures, offers thrilling experiences from sea kayaking to e-biking through the wilderness. A short stroll leads to the renowned Wineglass Bay, or should you wish to stay closer to home, wander to the Lodge's picturesque deck to enjoy a glass of bubbles and fresh Tasmanian oysters as you watch the sunset over the bay's pristine waters.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Coles Bay",
    "location_heading": "Coles Bay",
    "location_subheading": "Tasmania",
    "location_description": "Freycinet Lodge",
    "offer_address": "Freycinet National Park, Coles Bay Road, Coles Bay, Tasmania 7215, Australia",
    "percentage_discount": 78.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 329.0,
    "value": 1512.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UwVbhQAF",
    "hero_image": "https://images.luxuryescapes.com/yhalhpnugqd87hzk1g8o",
    "image_two": "https://images.luxuryescapes.com/awcnrhokcbrkqgl4mt4a",
    "image_three": "https://images.luxuryescapes.com/aybrkw65usowt0kdtb7g",
    "vendor_name": "Saffire Freycinet",
    "title": "Lavish All-Inclusive Getaway at Australia’s Most Acclaimed Luxury Hotel",
    "description": "Treat yourself to an all-inclusive four-night getaway at Saffire Freycinet - Australia's top luxury lodge. Wake up in a Luxury Suite overlooking the scenic Great Oyster Bay, just 2.5 hours from Hobart or Launceston and be spoiled with daily gourmet breakfasts and lunches, unique degustation dinners paired with deluxe alcoholic beverages, complimentary in-room personal minibar, a range of complimentary bespoke activities including oyster shucking and a AU$100 Spa credit to be used at the heavenly day spa.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Coles Bay",
    "location_heading": "Coles Bay",
    "location_subheading": "Tasmania",
    "location_description": "Saffire Freycinet",
    "offer_address": "2352 Coles Bay Rd, Coles Bay TAS 7215",
    "percentage_discount": 31.0,
    "min_duration": 4,
    "max_duration": 4,
    "price": 3747.0,
    "value": 5428.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fle0xAAB",
    "hero_image": "https://images.luxuryescapes.com/f5dyyc2n2n8jbyeah6",
    "image_two": "https://images.luxuryescapes.com/0g6470nfb87ktz8lopb",
    "image_three": "https://images.luxuryescapes.com/kitw00eks6zz2emxlzr",
    "vendor_name": "Freycinet Resort",
    "title": "Tasmania Wilderness Retreat in Coles Bay near Freycinet National Park",
    "description": "Secluded in the rugged wilderness of Tasmania's East Coast, Freycinet Resort offers unparalleled access to the stunning Freycinet National Park, home to the iconic Wineglass Bay. Indulge in the region's freshest seafood at the acclaimed Marine Farm, or sample award-winning wines at the nearby Devil's Corner Cellar Door. After a day of exploration, retreat to your private cabin, where floor-to-ceiling windows offer breathtaking views of the surrounding landscape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Coles Bay",
    "location_heading": "Coles Bay",
    "location_subheading": "Tasmania",
    "location_description": "Freycinet Resort",
    "offer_address": "1819 Coles Bay Road, Coles Bay 7215, Tasmania, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 167.0,
    "value": 167.0
  }
]