[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GgPPAA0",
    "hero_image": "https://images.luxuryescapes.com/6hx59bnjjnz7bg7a8yya",
    "image_two": "https://images.luxuryescapes.com/gqc4etf8s6qucgov5lbc",
    "image_three": "https://images.luxuryescapes.com/uen0eppdbpmbm2ec6kih7",
    "vendor_name": "Mercury Ridge",
    "title": "Private North Island Mediterranean-Style Group Villa for up to 10 Guests Less than Three Hours from Auckland",
    "description": "Private villa living at Mercury Ridge truly offers the best of all worlds - a chance to gather your friends and family in your own private space while discovering the beauty of New Zealand's stunning Coromandel Peninsula. Built high up in the hills, this secluded estate is reminiscent of an Italian seaside villa, with grand suites, leafy terraces, an outdoor pizza oven and stunning views of Cooks Beach and Mercury Bay. After extensive renovations in December 2020, it's time to celebrate the property's grand reopening - feel worlds away from everything with the entire estate to enjoy at your leisure. Look out onto the neighbouring orchard, lush vineyard and native reserve that make for a picturesque backdrop. Perfect for a family reunion or group retreat, this luxury villa invites you to spend time together sitting outside on your terrace with a glass of Mercury Bay wine, cooking gourmet meals in the fully equipped kitchen and cosying up in the media room with popcorn and a movie.\n\nYou’ll find it hard to tear yourself away from your home-away-from-home, but when you can venture away from your charming villa, the jewels of the Coromandel Peninsula are just around the corner. Drive to the famous Hot Water Beach and Cathedral Cove, both a mere 15-minute drive away. Made up of secluded beaches, mountainous forests and secret lagoons - and only a two-hour drive from Auckland - there’s much to discover in this eastern corner of the North Island.\n\n**Your handpicked inclusions:**\n\n- Celebrate your escape with a glass of bubbly each and a gourmet cheese platter to share on arrival\n- Wake each day to a delicious cooked or continental breakfast served in your villa\n- Stay connected with highspeed Wi-Fi available throughout the villa",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Waikato",
    "offer_geo_area_level_2": "Cooks Beach",
    "location_heading": "Cooks Beach",
    "location_subheading": "North Island New Zealand",
    "location_description": "Mercury Ridge",
    "offer_address": "745 Purangi Road, Cooks Beach, Coromandel 3591, New Zealand",
    "percentage_discount": 24.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 3775.0,
    "value": 4978.0
  }
]