[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008fbwRAAQ",
    "hero_image": "https://images.luxuryescapes.com/hm5ym4dmk3hs1bfrs7sb",
    "image_two": "https://images.luxuryescapes.com/2c2bnbz84hiyvypkmxm",
    "image_three": "https://images.luxuryescapes.com/ya05o4i4wgkghba5x1q",
    "vendor_name": "Carriage of Occasion",
    "title": "Langhorne Creek: 3.5-Hour Horse-Drawn Carriage Wine Tour with Cheeseboard & Tastings",
    "description": "Hidden away on South Australia's breathtaking Fleurieu Peninsula sits Langhorne Creek, a boutique wine region that offers a world-class collection of well-awarded cellar doors together with a rich history. Langhorne Creek's idyllic climate and floodplain landscape is a haven for red varietals - and Bleasdale Vineyard’s red wine, with its fine tannin and fruit structure, are highly regarded for their complexity and longevity. You can discover what the region has to offer from the best seat in the house, onboard a traditional horse and carriage.\n\nTravel in absolute comfort and style for 3.5 hours as you trot along the history-filled streets of Langhorne Creek and stop for exceptional tastings at three top wineries in the area. You'll be sampling top tipples at the 171-year-old Bleasdale Vineyard and to keep you going, indulge in a flavourful cheeseboard that has been handpicked with a mixed tasting at the ultra-cool Kimbolton Wines, then sample a selection of wines at Bremerton Wines with small-batch gin on offer to purchase. With ample storage onboard your carriage, there's plenty of space to store your gourmet goodies and exceptional wines to reignite your escape whenever you feel like it. This unique experience can be enjoyed with a small group of up to four or seven guests per carriage for a personalised, unforgettable experience.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Langhorne Creek",
    "location_heading": "Langhorne Creek",
    "location_subheading": "South Australia",
    "location_description": "Carriage of Occasion",
    "offer_address": "70 Bridge Road Langhorne Creek SA 5255 Australia",
    "percentage_discount": 20.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 259.0,
    "value": 325.0
  }
]