[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib17iYAB",
    "hero_image": "https://images.luxuryescapes.com/k8ceih0777hirvirq9",
    "image_two": "https://images.luxuryescapes.com/sti5z70799kv1ng42sp9",
    "image_three": "https://images.luxuryescapes.com/rtgjopiy4n3xzphj33qc",
    "vendor_name": "Mercure Vung Tau",
    "title": "Beachfront Vietnam Oasis in Central Vung Tau with Private Beach & Infinity Pool",
    "description": "Experience the vibrant energy of Vung Tau, a coastal city in southern Vietnam, from a stylish beachfront retreat. Take a leisurely stroll along the beach, or explore the city's historic sites, including the towering Jesus Christ Statue and Thich Ca Phat Dai Pagoda.\n\nDelight in the hotel's elegant facilities, including a shimmering infinity pool and fitness centre. Indulge in international and local Vietnamese cuisine at the Breezes Restaurant, or sip on a refreshing cocktail at the chic Sunset Lounge. Venture beyond the hotel to discover the city's vibrant nightlife, or take a short drive to the picturesque Vung Tau Lighthouse for sparkling city and sea views.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Ba Ria-Vung Tau Province",
    "offer_geo_area_level_2": "Vung Tau",
    "location_heading": "Vung Tau",
    "location_subheading": "Vietnam",
    "location_description": "Mercure Vung Tau",
    "offer_address": "03 06 Ha Long Street, Ward 2, Vung Tau 790000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 52.0,
    "value": 52.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DPpSQAA1",
    "hero_image": "https://images.luxuryescapes.com/53qv6zvzgyfl4q2ptiqh",
    "image_two": "https://images.luxuryescapes.com/6kw3ddtwvijrqe64oiss",
    "image_three": "https://images.luxuryescapes.com/yg16ciz4l6m50eugqec",
    "vendor_name": "Holiday Inn Resort Ho Tram Beach",
    "title": "Vietnam Seaside Escape with Swim-Up Bar",
    "description": "Experience seaside living in the small Vietnamese beach town of Ho Tram when you stay at the fun-loving Holiday Inn Resort Ho Tram Beach, an IHG Hotel. Spend days splashing in the hotel's immense outdoor swimming pool, enjoying a round of table tennis or billiards, or even playing a friendly round of bowling. As for wining and dining, there are four fabulous restaurants to choose that serve everything from poolside snacks to Vietnamese favourites, dim sum and crafted cocktails.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Ba Ria-Vung Tau Province",
    "offer_geo_area_level_2": "Xuyen Moc",
    "location_heading": "Vung Tau",
    "location_subheading": "Vietnam",
    "location_description": "Holiday Inn Resort Ho Tram Beach, an IHG Hotel",
    "offer_address": "The Grand Ho Tram Strip, Phuoc Thuan, Xuyen Moc, Ba Ria, Vung Tau 790000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 85.0,
    "value": 85.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2yBIAS",
    "hero_image": "https://images.luxuryescapes.com/3cmtj8uogww8mza5dje",
    "image_two": "https://images.luxuryescapes.com/o97td57rncfpuxlap30k4",
    "image_three": "https://images.luxuryescapes.com/v1ze9j4xqmjj4c6uk3dg",
    "vendor_name": "Pullman Vung Tau",
    "title": "Five-Star Vung Tau City Hotel Near Back Beach with Outdoor Pool",
    "description": "Experience the allure of Vietnam's coastal city, Vung Tau, with a stay at the elegantly positioned hotel, a mere 90-minute drive from the vibrant Ho Chi Minh City. Dine at the Riviera Restaurant, where international cuisine meets local flavours, enjoy a refreshing drink at the Corniche Ultra Lounge or take tipples by the outdoor pool.\n\nWhen it's time to explore, the hotel is just a short stroll from Back Beach and the Christ of Vung Tau, a towering statue offering panoramic city and sea views. For golf enthusiasts, the Paradise Golf Resort is within easy reach, providing an excellent opportunity to tee off in a picturesque setting. Additionally, don’t miss the chance to wander through the local markets, where you can sample delicious street food and shop for unique handicrafts that reflect the vibrant culture of Vung Tau.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Ba Ria-Vung Tau Province",
    "offer_geo_area_level_2": "Vung Tau",
    "location_heading": "Vung Tau",
    "location_subheading": "Vietnam",
    "location_description": "Pullman Vung Tau",
    "offer_address": "15 Thi Sach Street Thang Tam Ward, Vung Tau, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 52.0,
    "value": 52.0
  }
]