[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ImhZnYAJ",
    "hero_image": "https://images.luxuryescapes.com/3w33ddoz04219ksmdzh",
    "image_two": "https://images.luxuryescapes.com/41gnckkq3kjkhsz8uvc14",
    "image_three": "https://images.luxuryescapes.com/xiiepacefnserkqypyc",
    "vendor_name": "Rye Hotel By Nightcap Plus",
    "title": "Mornington Peninsula Coastal Retreat Steps From Rye Pier with Daily Breakfast",
    "description": "Just 50 metres from Rye’s glittering shoreline at the southern end of the Mornington Peninsula, but only 90 minutes drive from Melbourne's CBD, this slice of coastal cool is the ideal weekend getaway for couples. Renovated in 2024, each light and bright room features its own balcony or patio with views of the hotel's pool or, better still, the beach.\n\nSpend your days at the beach, unwinding at the nearby Peninsula Hot Springs, riding the Arthurs Seat Eagle gondola or exploring the region’s wineries. Or, if you prefer to stay closer, Rye Hotel by Nightcap Plus is set in the heart of town, just steps from Rye’s shops, cafes and walking tracks. When you're not out discovering some of Victoria’s best, make the most of the onsite pool and enjoy pub favourites at Terrace Bistro.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Rye",
    "location_subheading": "Victoria",
    "location_description": "Rye Hotel By Nightcap Plus",
    "offer_address": "2415 Point Nepean Road, Rye, Victoria 3941, Australia",
    "percentage_discount": 65.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 167.0,
    "value": 472.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZmlfsQAB",
    "hero_image": "https://images.luxuryescapes.com/ddwgi0aljk13pd2yxff1",
    "image_two": "https://images.luxuryescapes.com/mvo3ciu9l4erqnbslea3",
    "image_three": "https://images.luxuryescapes.com/mlfezebhzsuhshefimix",
    "vendor_name": "Aquabelle Apartments",
    "title": "Experience Luxury on the Mornington Peninsula with Top-Rated Apartment Stay",
    "description": "Experience the beauty of Victoria’s Mornington Peninsula with a stay at Aquabelle Apartments. Rated the number-one property in Rye and recognised in TripAdvisor’s 2018 Hall of Fame, Aquabelle offers self-contained apartments and a prime location mere steps from the beach. Enjoy a bottle of local Pinot Noir on arrival and a leisurely late noon check-out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Rye",
    "location_subheading": "VIC",
    "location_description": "Aquabelle Apartments",
    "offer_address": "2333 Point Nepean Rd, Rye VIC 3941",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 288.0,
    "value": 433.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009Eq7hAAC",
    "hero_image": "https://images.luxuryescapes.com/a41zb1mafkoim60zfi9",
    "image_two": "https://images.luxuryescapes.com/ghcju23a8lta99n9yqnc",
    "image_three": "https://images.luxuryescapes.com/xukss8lay93pws83h7",
    "vendor_name": "Little Bird Retreat @ Rye",
    "title": "Coastal Mornington Peninsula Private Group Retreat for Six Guests",
    "description": "Hidden between spectacular coastlines, fetching seaside villages and vine-clad hills, Little Bird Retreat on the Mornington Peninsula offers a spacious home only a short stroll from the gentle waves of the Tyrone foreshore. The custom-designed, private retreat boasts three bedrooms - each with an ensuite bathroom - and a generous living area equipped with an open fireplace, perfect to savour cosy winter evenings. It’s a rural beachy retreat that’s ideal for families and couples, perfectly placed in reach of everything that makes the Mornington Peninsula so magnificent.\n\nWhen you’re ready to get among it, Little Bird Retreat is located only a short drive from Blairgowrie’s sandy shores, Sorrento’s shops and dining and the breathtakingly stunning panoramic views of the Point Nepean National Park. Amateur sommeliers will adore exploring the region’s wealth of wineries, and the home is also less than a ten-minute drive from the award-winning Peninsula Hot Springs’ spa treatments and rejuvenating waters. Little Bird Retreat's robust concierge service only makes things sweeter, with in-house catering, yoga sessions, babysitting services, driver services and winery tours all available on request.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Rye",
    "location_subheading": "Victoria",
    "location_description": "Little Bird Retreat",
    "offer_address": "76 Becket Street, Rye VIC 3941",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 1138.0,
    "value": 1801.0
  }
]