[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ieg1iAAB",
    "hero_image": "https://images.luxuryescapes.com/eluv20mpgnmkukxqcvs",
    "image_two": "https://images.luxuryescapes.com/xnso1a980g52ta0z5fne",
    "image_three": "https://images.luxuryescapes.com/igmwsp5avn4d41n47hk",
    "vendor_name": "Montigo Resort Nongsa, Batam",
    "title": "Indonesia: Batam Island's Only Five-Star Oceanfront Pool Villas with Daily Breakfast, Nightly Cocktails & Return Port Transfers",
    "description": "Located on a tranquil stretch of hillside overlooking the shimmering South China Sea, this idyllic retreat offers unparalleled laidback luxury. Just a 30-minute ferry ride from Singapore and home to the only five-star pool villas on Batam, this island paradise enjoys a prime location on golden sands surrounded by tropical palms. Fresh seafood, sugar-white sands and yoga classes await those seeking complete relaxation, while adventure-seekers can enjoy jetskiing, banana boating and kayaking - there's something for everyone.\n\nKick back with a refreshing cocktail and watch the sun set from TIIGO Beach Club, head to Pantai Restaurant for delicious seafood, or savour Indonesian cuisine at Warung Montigo. Take a captivating mangrove tour for a bit of exploration, or head to Montigo Wellness spa for signature rituals and blissful massages to unwind.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Batam",
    "location_heading": "Batam",
    "location_subheading": "Indonesia",
    "location_description": "Montigo Resorts Nongsa",
    "offer_address": "Jalan Hang Lekiu, Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29465, Indonesia",
    "percentage_discount": 65.0,
    "min_duration": 1,
    "max_duration": 40,
    "price": 349.0,
    "value": 997.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ex8D5AAJ",
    "hero_image": "https://images.luxuryescapes.com/cwy39g1vissay7lrph",
    "image_two": "https://images.luxuryescapes.com/kfodste0fyjfqfx3cxm",
    "image_three": "https://images.luxuryescapes.com/s06bvu9qdy0nmeivuu5",
    "vendor_name": "Montigo Resort Nongsa, Batam",
    "title": "Indonesia: Batam Island's Only Five-Star Oceanfront Pool Villas with Daily Breakfast, Nightly Dinner & Roundtrip Port Transfers",
    "description": "Located on a tranquil stretch of hillside overlooking the shimmering South China Sea, Montigo Resorts Nongsa offers a five-star escape brimming with laidback luxury, just a 30-minute ferry ride from Singapore. Stay in a private pool villa (one, two- and three-bedroom options available) and benefit from fantastic inclusions, including daily dining and nightly cocktails. This oceanfront retreat - home to the only five-star pool villas on Batam - enjoys a prime location on golden sands, where fresh seafood (juicy prawns and just-caught lobster, anyone?), sugar-white sands and exciting water sports activities await such as jetskiing, banana boats, wakeboarding and kayaking.\n\nKick back at TIIGO Beach Club to watch the magical sunset from the comfortable cabana beds, while sipping a refreshing poolside cocktail, head to Pantai Restaurant for delicious seafood or savour Indonesian cuisines at Warung Montigo or International choices at TADD’S Restaurant. Ready for adventure? Hit up the onsite ATV and Bike Dirt Track, take a mangrove tour or head to Montigo Spa for signature rituals and blissful massages, body scrubs and body wraps.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Batam",
    "location_heading": "Batam",
    "location_subheading": "Indonesia",
    "location_description": "Montigo Resorts Nongsa",
    "offer_address": "Jalan Hang Lekiu, Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29465, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 22,
    "price": 471.0,
    "value": 1280.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dcuwXQAQ",
    "hero_image": "https://images.luxuryescapes.com/m1acn68nv9vige7t2gb",
    "image_two": "https://images.luxuryescapes.com/igpsfgunzfza00ch48b",
    "image_three": "https://images.luxuryescapes.com/tdx4mm17kjzenjwyazo",
    "vendor_name": "Montigo Resort Nongsa, Batam",
    "title": "Tropical Island Oasis With One- and Two-Bedroom Private Pool Villas",
    "description": "Experience serenity from the moment you arrive at the five-star Montigo Resort Nongsa, a hidden Indonesian oasis just 40-minutes ferry ride from Singapore and voted the number one resort in Nongsa on TripAdvisor. Nestled on the glistening coast with panoramic views of the South China Sea, watch sunset daily from your private infinity pool when staying in a Premier One-Bedroom Villa. Be treated like a VIP with a welcome cocktail each, daily buffet breakfast and your choice of one lunch or dinner. Upgrades available for up to four people.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Batam",
    "location_heading": "Batam",
    "location_subheading": "Indonesia",
    "location_description": "Montigo Resorts Nongsa",
    "offer_address": "Jalan Hang Lekiu, Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29465, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 433.0,
    "value": 1313.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bi4nKQAQ",
    "hero_image": "https://images.luxuryescapes.com/bodnxq6zzrt2n8uapqi5",
    "image_two": "https://images.luxuryescapes.com/uaxmsacbonjjh3e2yt49",
    "image_three": "https://images.luxuryescapes.com/w2ochuzrzqhjej64xky4",
    "vendor_name": "Montigo Resort Nongsa, Batam",
    "title": "Ocean-View Villa Stay on Tropical Indonesian Island",
    "description": "Experience sunny Batam, an Indonesian island just 40 minutes from Singapore by ferry, with a luxe villa stay at Montigo Resort Nongsa. Breathtaking ocean views meet long seafood lunches, sandy beaches and fun watersports on Batam, a great alternative to Bali. Arrive to a welcome cocktail, dine on a generous daily buffet breakfast and get treated to one lunch at the poolside Tadd’s Restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Kepulauan Riau",
    "offer_geo_area_level_2": "Kota Batam",
    "location_heading": "Batam",
    "location_subheading": "Indonesia",
    "location_description": "Montigo Resort Nongsa May 2019",
    "offer_address": "Jalan Hang Lekir Nongsa, Sambau, Kec. Nongsa, Kota Batam, Kepulauan Riau 29465, Indonesia",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 443.0,
    "value": 1530.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007p7eXAAQ",
    "hero_image": "https://images.luxuryescapes.com/3vuhhde9df5oe0s1rfji",
    "image_two": "https://images.luxuryescapes.com/kq265r263a0d0keo3ubr",
    "image_three": "https://images.luxuryescapes.com/tpo4eespdr49y6eothg",
    "vendor_name": "Montigo Resort Nongsa, Batam",
    "title": "Five-Star Batam Tropical Villas with Daily Breakfast & Welcome Drinks",
    "description": "Located on a tranquil stretch of hillside overlooking the gleaming surface of the South China Sea is the fun-filled, five-star Montigo Resorts, Nongsa. This oceanfront resort enjoys a prime location on Indonesia's buzzing Batam Island, just a 50-minute ferry ride from Singapore. Here, a cluster of 100 modern white villas are draped across a hillside overlooking the South China Sea. Kick back at TIIGO Beach Club to watch the sunset from the comfy cabana beds, head to Pantai Restaurant for delicious Indonesian food or sip a refreshing drink in a laidback setting at TADD’s poolside restaurant. When you're ready to indulge in decadent relaxation treatments, head to Montigo Spa for signature rituals and blissful massages, body scrubs and body wraps.\n\nBeyond your resort, Batam's wonders are at your doorstep. This is the perfect place to relax, indulge in incredibly fresh seafood (juicy prawns and just-caught lobster, anyone?), stretch out on Montigo Beach or go get your PADI diving certificate and swim among the reef sharks, stingrays and sea turtles.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Batam",
    "location_heading": "Batam",
    "location_subheading": "Indonesia",
    "location_description": "Montigo Resorts Nongsa",
    "offer_address": "Jalan Hang Lekiu, Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29465, Indonesia",
    "percentage_discount": 32.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 454.0,
    "value": 664.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4U4TAAV",
    "hero_image": "https://images.luxuryescapes.com/2caajygquy22j0f6u16je",
    "image_two": "https://images.luxuryescapes.com/1evl1q8njgqzi0lsh4u2",
    "image_three": "https://images.luxuryescapes.com/33osnozkvmv2ibv0wj1q",
    "vendor_name": "Montigo Resort Nongsa, Batam",
    "title": "Five-Star Indonesia Oceanfront Luxury Villas with Daily Breakfast & Complimentary Minibar",
    "description": "Located on a tranquil stretch of hillside overlooking the gleaming South China Sea, the fun-filled Montigo Resorts, Nongsa, offers a five-star escape just 30 minutes from Singapore. This oceanfront resort, made up of over 100 modern white villas, enjoys a prime location on Indonesia's  Batam Island, where fresh seafood (juicy prawns and just-caught lobster, anyone?), sugar-white sands and sensational diving opportunities come standard.\n\nSpend each day choosing between the spirited and serene, with a treasure trove of experiences to add to your bow. Take on dirt tracks in an ATV, discover your creative side with Batik painting, or sink into shavasana with yoga classes. Kick back at TIIGO Beach Club to watch the sunset from the comfy cabana beds, head to Pantai Restaurant for delicious Indonesian food or sip a refreshing drink in a laidback setting at TADD’s poolside restaurant. When you're ready to indulge in decadent relaxation treatments, head to Montigo Spa for signature rituals and blissful massages, body scrubs and body wraps.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Batam",
    "location_heading": "Batam",
    "location_subheading": "Indonesia",
    "location_description": "Montigo Resorts Nongsa",
    "offer_address": "Jalan Hang Lekiu, Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29465, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 324.0,
    "value": 754.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000J5zj3YAB",
    "hero_image": "https://images.luxuryescapes.com/8csidbf7pgl12j8fzft",
    "image_two": "https://images.luxuryescapes.com/hcdgu35bsa6x1oul4ztt",
    "image_three": "https://images.luxuryescapes.com/iijk2mu13rxi9yzc3st9",
    "vendor_name": "Montigo Resort Nongsa, Batam",
    "title": "Extended by Popular Demand: Indonesia Batam Island Pool Villas with Daily Breakfast & Port Transfers",
    "description": "Located on a tranquil stretch of hillside overlooking the shimmering South China Sea, this idyllic retreat offers unparalleled, laidback luxury just a short 30-minute ferry ride from Singapore. Home to the only five-star pool villas on Batam, this island paradise is perfect for couples and families alike.\n\nGolden sands and tropical palms set the scene for total relaxation. Think fresh seafood, sugar-white beaches and calming yoga classes, while adventure-seekers can enjoy jetskiing, banana boating and kayaking - there's something for everyone.\n\nWatch the sun dip below the horizon with a cocktail at TIIGO Beach Club, feast on local seafood at Pantai Restaurant or savour authentic Indonesian flavours at Warung Montigo. From captivating mangrove tours to soothing rituals at Montigo Wellness spa, this is a destination where everyone can find their perfect pace.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Batam",
    "location_heading": "Batam",
    "location_subheading": "Indonesia",
    "location_description": "Montigo Resorts Nongsa",
    "offer_address": "Jalan Hang Lekiu, Sambau, Kecamatan Nongsa, Kota Batam, Kepulauan Riau 29465, Indonesia",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 25,
    "price": 339.0,
    "value": 1109.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DPMLyAAP",
    "hero_image": "https://images.luxuryescapes.com/mvozs0yu0ifsqmb2bobh",
    "image_two": "https://images.luxuryescapes.com/ruyy55sewnhz3jcc6lip",
    "image_three": "https://images.luxuryescapes.com/1gzd7wra74p1ra54lzl8",
    "vendor_name": "Holiday Inn Resort Batam",
    "title": "Indonesian Island Escape with Four Pools, In-House Spa & Family Activities",
    "description": "Revel in the waterfront location and calming atmosphere of Holiday Inn Resort Batam, an IHG Hotel - a family-friendly space offering both exciting activities and opportunities for relaxation. Unwind by one of four pools on a comfortable sunbed, or indulge in a relaxing treatment at the resort’s in-house spa. With activities on offer including tennis, cycling, volleyball and paintball, this hotel is a thrill-seekers’ paradise, while a warm and welcoming environment is perfect for families, groups and couples.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Riau Islands",
    "offer_geo_area_level_2": "Batam",
    "location_heading": "Batam",
    "location_subheading": "Indonesia",
    "location_description": "Holiday Inn Resort Batam, an IHG Hotel",
    "offer_address": "Waterfront City, Tanjung Riau, Sekupang, Batam City, Riau Islands 29422, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 52.0,
    "value": 52.0
  }
]