[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y278bQAB",
    "hero_image": "https://images.luxuryescapes.com/hqlhdfuqru7auvmqzkv0",
    "image_two": "https://images.luxuryescapes.com/yagbqdfzngp33hbqj3ny",
    "image_three": "https://images.luxuryescapes.com/ghmzhqtpjzu3qszubyij",
    "vendor_name": "Daun Lebar Villas",
    "title": "Brand New Villa with Massages, Cocktails & More Included",
    "description": "Escape it all in a private pool villa nestled amidst the rice paddies and tropical jungle of Ubud, staying at the new Daun Lebar eco-friendly boutique resort. Your stay includes daily breakfast, one complimentary lunch, one complimentary dinner, a relaxing 60-minute massage each, a daily cocktail per person, a complimentary yoga class, convenient airport pickup on arrival and guaranteed late checkout at 1pm.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Daun Lebar Villas - 2018",
    "offer_address": "Banjar Susut no.777, Desa Buahan, Payangan - Ubud, Buahan, Payangan, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 308.0,
    "value": 847.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqrILAAZ",
    "hero_image": "https://images.luxuryescapes.com/7dpza2inkuv2ohoq1xij",
    "image_two": "https://images.luxuryescapes.com/a81dhi37duu705js8rbo",
    "image_three": "https://images.luxuryescapes.com/hheph7vahvy2b8z5exeg",
    "vendor_name": "K Club Ubud",
    "title": "Bali Grand Opening: Luxury Ubud Glamping with All-Day Dining & Free-Flow Cocktails",
    "description": "Be one of the first to experience Bali’s newest luxury glamping resort deep in the heart of the jungle at Kanva Ubud, by K-Club. This impressive resort boasts unparalleled, sweeping views of Bali's picturesque, lush green valleys where the infinity pool meets the premier Kabana Jungle Club - hosting internationally acclaimed DJs. Found just 25 minutes north of Ubud's centre, you can easily spend your days exploring both Bali's hotspots or more remote expanses like the Tegallalang Rice Terraces.\n\nFind an indulgent home away from home in your private serviced glamping tent, with breathtaking views over the lush forest below, romantic private jacuzzis or pools and expansive living spaces. As the sun rises, surrender to the tranquil embrace of untouched nature and as the sun sets, dance the night away at the vibrant club. Rejuvenate at Mekar Spa, with unique farm-to-spa treatments, or stretch out your worries at the open-air yoga studio, before re-fuelling at Akar Restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tegallalang",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "K-Club Ubud",
    "offer_address": "Jalan Raya Cebok, Kedisan Tegallalang, Kedisan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80561, Indonesia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 24,
    "price": 548.0,
    "value": 1085.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPJk0QAG",
    "hero_image": "https://images.luxuryescapes.com/tlwiagowudaliahdcooo",
    "image_two": "https://images.luxuryescapes.com/tibm6sxd7dvstrfpvscj",
    "image_three": "https://images.luxuryescapes.com/s2fzhfulvytxysg6hkoq",
    "vendor_name": "Sankara Suites and Villas",
    "title": "Exotic Hideaway in the Heart of Ubud",
    "description": "Experience the exotic allure of Ubud with an escape to The Sankara Suites & Villas. Located in the heart of the jungle and just ten minutes from Ubud town, it’s a secluded hideaway with easy access to all this beautiful region in Bali has to offer. Included in your package is daily breakfast, two two-course dinners, daily afternoon tea, one cocktail per person, per day, a 60-minute massage each and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Sankara Suites & Villas",
    "offer_address": "Jl. Sri Wedari No.973, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 375.0,
    "value": 979.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cJxp7QAC",
    "hero_image": "https://images.luxuryescapes.com/wda8rlozca0rvu4oemt",
    "image_two": "https://images.luxuryescapes.com/ygsg9lodygb394ke0tmf",
    "image_three": "https://images.luxuryescapes.com/law9qzn2bkyjwexwa6fa",
    "vendor_name": "Sanctoo Suites & Villas",
    "title": "Luxe Villa Getaway with Private Pool and Unlimited Access to Bali Zoo",
    "description": "Get away from it all and treat yourself to a tranquil villa getaway in one of Ubud’s most luxurious destinations. The Sanctoo Villas & Spa offers a chic villa escape with a difference, thanks to its incredible location next to Bali Zoo. Spend your days swimming in your private pool or take advantage of unlimited access to Bali Zoo and visit bears, tigers, orangutans and more. Experience the holiday of a lifetime and enjoy daily breakfast at Sanctoo Restaurant, two decadent three-course dinners, a luxurious 45-minute massage, an Ubud Village tour, return airport transfers and so much more. And if you're planning a family getaway the Sanctoo Villas & Spa is the perfect choice - up to two kids (aged 11 years and under) stay free and enjoy free meals when dining with an adult!",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupatén Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Indonesia",
    "location_description": "The Sanctoo Villas & Spa 2019",
    "offer_address": "Singapadu 80752, Bali, Indonesia",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 506.0,
    "value": 2019.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EMGCXYA5",
    "hero_image": "https://images.luxuryescapes.com/ldzrcp4qahk9fkbnvo8t",
    "image_two": "https://images.luxuryescapes.com/8ki2t8st4cvvotaz66q",
    "image_three": "https://images.luxuryescapes.com/ahctmu42pow2cvw84e3l",
    "vendor_name": "Amarea Resort Ubud by iNi Vie Hospitality",
    "title": "Tranquil Ubud Rainforest Retreat with Daily Breakfast, Daily Lunch or Dinner & Cocktails",
    "description": "Find yourself surrounded by forest greenery, feeling as tranquil as ever, with a stay at this hidden gem in the heart of Bali's creative hub: Ubud. Whether you're unwinding with a cocktail in hand, exploring the vibrant landscapes on a scenic trek or diving into the sparkling lagoon pool, every moment here is a chance to reconnect with nature.\n\nStart each day with a calming yoga session in the open-air yoga venue, where the gentle morning breeze and soft sunlight come together to set the perfect tone for mindfulness and relaxation. For the ultimate in indulgence, treat yourself to a serene massage at Svaha Spa Teges, surrounded by soothing rainforest sounds.\n\nFrom morning to night, savour Japanese bites, classic breakfast dishes and creative cocktails at Norii, a yakitori-style bar catering to all your cravings. Make the most of the resort's complimentary shuttle service into Ubud city centre and venture out of the resort to explore the island's finest dining, shopping districts and traditional temples. Nearby, you can easily access lush rice terraces, the sacred Monkey Forest, art galleries and vibrant local markets.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Amarea Resort & Spa Ubud by iNi Vie Hospitality",
    "offer_address": "Jl. Sawah Indah Gang Amarea 8, Peliatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 269.0,
    "value": 797.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdSSRAA3",
    "hero_image": "https://images.luxuryescapes.com/3d1b404uvqdpklg7m03",
    "image_two": "https://images.luxuryescapes.com/0ylmmfdgvlufvouv977q",
    "image_three": "https://images.luxuryescapes.com/gq72z689ktbq018woya",
    "vendor_name": "Kaamala Resort Ubud",
    "title": "Romantic Ubud Private Suites & Villas with Daily Breakfast, Daily Choice of Lunch or Dinner, Massages & Nightly Cocktails",
    "description": "Retreat to jungle-fringed paradise at this five-star romantic hideaway, perfect for those seeking a serene Ubud escape. At Kaamala Resort Ubud, where traditional stone and wood carvings are complemented by modern design, and sweeping views over terraced rice paddies and breathtaking valleys leave you spellbound. Absorb the beauty of the landscape from the resort's stunning infinity pool, complete with a large hammock overlooking the edge. Tap into the spiritual with daily yoga sessions or restore, renew and rejuvenate at the tranquil Svaha Spa.\n\nWhile this tranquil oasis may leave you feeling miles away from the everyday, the endless wonders of Ubud are all within close reach, including the Sacred Monkey Forest Sanctuary, Ubud Art Market and Ubud Palace. Return to Wild Air Restaurant, where signature Indonesian plates and panoramic views over treetops await.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kaamala Luxury Resort & Spa Ubud by Ini Vie Hospitality",
    "offer_address": "888A Jalan Bisma, Ubud, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 539.0,
    "value": 981.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GwnFLAAZ",
    "hero_image": "https://images.luxuryescapes.com/57mmrka320t46efmu06",
    "image_two": "https://images.luxuryescapes.com/6z9rgu62bg96x890iz3",
    "image_three": "https://images.luxuryescapes.com/jkxzk6be3arkucdgy3yg",
    "vendor_name": "Kappa Senses Ubud",
    "title": "French-Inspired Five-Star Ubud Jungle Luxury with Daily Breakfast, Choice of Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Reclaim your inner peace and reawaken your senses at a blissfully secluded five-star hideaway amid the verdant jungle of Ubud. Showcasing luxurious, French-inspired style and the dreamy 1,000sqm OmTara Spa by Clarins, this is the lush capital of wellbeing in Bali. Picture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort where dreams and reality blend seamlessly. From the peaceful pavilions to the two remarkable jungle-clad pools and myriad of walkways leading through lush foliage, this resort naturally integrates first-class facilities with pristine nature. Each day brings new adventures with a plethora of complimentary daily wellness, culture, and foodie activities on offer. \n\nSink into a sunbed by the retreat pool and watch the morning rays rise through the emerald vegetation, relax around the jungle river pool, and experience the freedom of gliding high above the trees on a convivial swing. Unwind in total privacy, then embark on an epicurean journey across the resort’s five restaurants and bars, whose farm-to-table menus are lead by organic produce, or enrich yourself with an innovative treatment at the exceptional OmTara Spa by Clarins.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kappa Senses Ubud",
    "offer_address": "Banjar Tanggayuda, Jalan Taman Sari, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 599.0,
    "value": 1458.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z6QNAAY",
    "hero_image": "https://images.luxuryescapes.com/r9s32jfkzpgvr7rvkgka",
    "image_two": "https://images.luxuryescapes.com/a9jzg0rsle6q4qxkk03p",
    "image_three": "https://images.luxuryescapes.com/4kc2557u6f5c2603ci9b",
    "vendor_name": "Viceroy Bali",
    "title": "Multi-Award-Winning Five-Star Ubud Escape with Private Pool & Daily Dining",
    "description": "Experience the exotic allure of Ubud, Bali’s spiritual hinterland, staying at the multi-award-winning Viceroy Bali. Located in the central foothills of the Gianyar regency and just five minutes from the thriving culture and arts scene of Ubud, the five-star Viceroy Bali is a perfectly secluded hideaway with easy access to all this beautiful region has to offer. Each suite and villa features a private pool, ensuring utmost exclusivity and romance.\n\nYour escape includes daily à la carte breakfast, your choice of daily three-course lunch or dinner, one 60-minute couple's massage, a daily cocktail each and complimentary airport pick-up.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Viceroy Bali - Sep 2020",
    "offer_address": "Jl. Lanyahan, Br. Nagi, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 799.0,
    "value": 2411.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IaHgIAK",
    "hero_image": "https://images.luxuryescapes.com/mvq07egf3esbszbs8glk",
    "image_two": "https://images.luxuryescapes.com/r15clt293vxdyj3e9mgm",
    "image_three": "https://images.luxuryescapes.com/rh94i6hx9jmlf6pj9bl",
    "vendor_name": "Kappa Senses Ubud",
    "title": "Five-Star Ubud Luxury with Guaranteed Pool Villa Upgrade, Daily Breakfast, Nightly Dinner & Nightly Free-Flow Cocktail Hour",
    "description": "Elevate Bali opulence to new heights in these blissfully secluded villas in Ubud, located within the luxurious Kappa Senses complex. Reclaim your inner peace and reawaken your senses with a myriad of facilities: dine across six epicurean restaurants, plunge into the winding Jungle River Pool and indulge in French-inspired style at the dreamy 1,000sqm OmTara Spa by Clarins.\n\nPicture-perfect rice fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort where dreams and reality blend seamlessly. From the peaceful pavilions to the multitude of walkways leading through lush foliage, this resort naturally integrates first-class facilities with pristine nature. \n\nEach day brings new adventures with complimentary daily wellness, culture, and foodie activities.\n\nVenture out of your private oasis to explore Ubud, dotted with vibrant cafes, historic temples and natural landscapes. Return to experience the freedom of gliding high above the trees on a jungle swing and savour farm-to-table menus led by organic produce before returning to your heavenly villa for moments of tranquillity.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kappa Senses Ubud",
    "offer_address": "Banjar Tanggayuda, Jalan Taman Sari, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 789.0,
    "value": 2185.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000H0sWTYAZ",
    "hero_image": "https://images.luxuryescapes.com/dys9dzvtgz7qign3mka",
    "image_two": "https://images.luxuryescapes.com/wp4zihla0u16ckc7oefc",
    "image_three": "https://images.luxuryescapes.com/adl2hn35g7miqg3dkyl",
    "vendor_name": "The Samaya Ubud Bali",
    "title": "Ubud All-Inclusive Luxury Pool Villas with Massages, Butler Service & Nightly Cocktails",
    "description": "Hidden among Ubud's lush, jungle-covered hills, scenic rice terraces and the winding Ayung River, this five-star all-villa tropical sanctuary is one of Bali's best-kept secrets. Adorned with Balinese touches, each spacious villa has been designed to offer the perfect escape for honeymooners, dreamers and families alike - soul-stirring vistas, complimentary butler service and a luxurious private pool come standard here.\n\nSoak up the verdant views of the rice terraces from the resort's open-air breakfast restaurant, Scene, and savour local flavours at the romantic Swept Away, nestled along the riverbank. \n\nBalance your body, mind and soul at the world-class The Spa at The Samaya, offering treatments from Balinese couples rituals to shiatsu. Or, if you are culinary-curious, learn how to master regional recipes from the experts in a cooking class.\n\nWhen you're ready to explore, stroll through a monkey-filled forest and admire Ubud's cultural marvels, including ancient temples and art galleries, just a stone's throw from the resort.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Samaya Ubud Bali",
    "offer_address": "Banjar Baung, Desa Sayan, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 809.0,
    "value": 2250.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxlInAAJ",
    "hero_image": "https://images.luxuryescapes.com/j2grewlw1m7sp16idb",
    "image_two": "https://images.luxuryescapes.com/6ajnudsoxava16vgi5a",
    "image_three": "https://images.luxuryescapes.com/87ea1m0q46tik2eplx4",
    "vendor_name": "Nandini Jungle By Hanging Gardens",
    "title": "Ubud Cliffside Villas on Ayung River with Massages, Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "A slice of jungle paradise awaits you at the luxurious five-star Nandini Jungle by Hanging Gardens, a serene sanctuary in the heart of the Payangan Rainforest. Here, Balinese culture and contemporary charm combine to create a deluxe destination like no other: the resort is modelled on a traditional Balinese village, with 34 villas and suites cascading down the hillside.\n\nStart your morning peacefully by soaking in amazing jungle views, relax inside the glistening infinity swimming pool or enjoy a soothing spa experience at Sungai Spa, before finishing the day with cocktails to accompany the spectacular sunset view over the river gorge.\n\nFramed by Bali’s iconic terraced green rice paddies, monkey-filled jungles and swaying coconut palms, Ubud offers some of the island’s most beautiful scenery, which can be discovered on rice field tours. A complimentary shuttle takes you from the resort to Ubud, the cultural heart of Bali, brimming with vibrant restaurants, yoga studios, galleries and markets.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Nandini Jungle by Hanging Gardens",
    "offer_address": "Br, Jl. Susut, Buahan, Payangan, Kabupaten Gianyar, Bali 80572, Indonesia",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 459.0,
    "value": 1597.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UyI2cQAF",
    "hero_image": "https://images.luxuryescapes.com/dnrw2snegebdsbfexcau",
    "image_two": "https://images.luxuryescapes.com/u4zkkuuzk06ghcwfsfhi",
    "image_three": "https://images.luxuryescapes.com/wfqljs3iz46taqdqjq8q",
    "vendor_name": "Best Western Premier Agung Resort Ubud",
    "title": "Balinese Charm in the Tropical Ubud Jungle",
    "description": "Discover the lush green beauty of Ubud with its terraced rice paddies, jungle and palm trees, staying at the Best Western Premier® Agung Resort Ubud. Just a stone’s throw from Ubud’s key attractions, this premium resort offers a beautiful tropical pool, a spa and more. Your stay includes daily breakfast, your choice of lunch or dinner daily, a relaxing 60-minute massage each, a complimentary cocktail or beer per person each day and airport pickup on arrival. Plus, up to two kids aged 11 and under stay free.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Best Western Premier Agung Resort Ubud",
    "offer_address": "Jalan Sri Wedari No.99, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 189.0,
    "value": 502.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CMShuYAH",
    "hero_image": "https://images.luxuryescapes.com/5nrk6l0jtrt1r65l6mi",
    "image_two": "https://images.luxuryescapes.com/rnjszfg6wbtxb9gb1dq3",
    "image_three": "https://images.luxuryescapes.com/33ufpr9dimm7fvbtgdo3",
    "vendor_name": "Padma Resort Ubud",
    "title": "Award-Winning Ubud Rainforest Hideaway with Iconic Pool, Daily Breakfast & Nightly Dinner",
    "description": "Find serenity among the untouched rainforests of Bali at this breathtakingly beautiful five-star resort. Located just 35 minutes from the island's celebrated arts capital, Ubud, Padma Resort Ubud offers new heights of unparalleled luxury in the heart of the Island of the Gods, with a truly iconic heated infinity pool, surrounded by the enchanting sounds and sights of the Payangan forest.\n\nWith Padma Resort Ubud's rotating schedule of complimentary resort activities - including a range of yoga classes, cycling tours, archery experiences and the exceptional Wolly Kids Club - you'll be all set to escape the everyday, learn something new and truly embrace a new level of relaxation.\n\nWhen not trying the on-site activities, explore the city’s lush rice fields, check out the abundance of galleries and museums, get to know the Ubud Monkey Forest’s cheeky inhabitants or slow down and take it all in - Ubud offers boundless opportunities for travellers of all stripes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Padma Resort Ubud",
    "offer_address": "Banjar Carik, Desa Puhu, Payangan, Ubud, Bali 80572, Indonesia",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 689.0,
    "value": 1942.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000InSbtYAF",
    "hero_image": "https://images.luxuryescapes.com/axspyug6wtmrt4wk0iwp",
    "image_two": "https://images.luxuryescapes.com/ix38947tiuqjdsexmuql",
    "image_three": "https://images.luxuryescapes.com/aoi4kw0edp661vvg8dj9",
    "vendor_name": "Kayumanis Ubud Private Villa & Spa",
    "title": "Ubud Riverfront Private Pool Villas with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Escape to Ubud's lush green rice paddies and discover your private slice of island paradise at this five-star boutique retreat, home to just 23 elegantly appointed villas, each offering high-end butler service, a glistening private pool and quintessential Balinese design.\n\nHidden within a tropical forest overlooking the Ayung River, heavenly Kayumanis Ubud Private Villa & Spa radiates tranquillity - yet is just a 15-minute drive from Bali's vibrant cultural capital, Ubud. Indulge in a wealth of wellness treatments at Kayumanis Spa Ubud, or treat yourself to a romantic feast high over the river valley at Dining Corner.\n\nEmbrace the beauty of the Balinese jungle and the vibrancy of Ubud, home to world-class restaurants and shopping. Take a short drive and discover innumerable nearby temples or the popular Aloha Ubud Swing, a perfect spot to take in sweeping vistas of rice paddies, rainforests, lakes and waterfalls.\n\nVisit thousands of Balinese long-tailed macaque monkeys within their home at the Sacred Monkey Forest Sanctuary, or journey an extra five minutes to Goa Gajah Elephant Cave temple.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Ubud Private Villa & Spa",
    "offer_address": "Jalan Kayumanis Sayan, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 679.0,
    "value": 2135.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMvAdAAL",
    "hero_image": "https://images.luxuryescapes.com/zbr7wnhd7lry8dqfsdwm",
    "image_two": "https://images.luxuryescapes.com/x7qv3saygy4a6m6e61b",
    "image_three": "https://images.luxuryescapes.com/mq8aeb76fcs3hwjc9zh8",
    "vendor_name": "Kaamala Resort Ubud",
    "title": "Romantic Ubud Private Suites & Villas with Massages, Daily Breakfast, Choice of Lunch or Dinner & Nightly Cocktails",
    "description": "Retreat to jungle-fringed paradise at Kaamala Resort Ubud, a five-star romantic haven perfect for those seeking a serene escape. Fall in love with this impressive hideaway, where traditional stone and wood carvings are complemented by modern design, and sweeping views over terraced paddies and breathtaking valleys leave you spellbound. Absorb the beauty of the landscape from the resort's stunning infinity pool, complete with a large hammock overlooking the edge. Tap into the spiritual with daily yoga sessions or restore, renew and rejuvenate at the clifftop Svaha Spa.\n\nWhile this tranquil oasis may leave you feeling miles away from the every day, the endless wonders of Ubud are all within close reach, including the Sacred Monkey Forest, Ubud Art Market and Ubud Palace. Return to Wild Air Restaurant, where signature Indonesian plates and panoramic views over Ubud's world-famous rice fields await.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kaamala Luxury Resort & Spa Ubud by Ini Vie Hospitality",
    "offer_address": "888A Jalan Bisma, Ubud, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 539.0,
    "value": 1020.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GecGMAAZ",
    "hero_image": "https://images.luxuryescapes.com/93ygupxhkc7kvxzhvph",
    "image_two": "https://images.luxuryescapes.com/q3wyyod2jrh0qnhigxe",
    "image_three": "https://images.luxuryescapes.com/vvpn5b1whdj7s5mh77l",
    "vendor_name": "Cicada Luxury Resort Ubud",
    "title": "Grand Opening: Secluded Ubud Jungle Hideaway with Daily Breakfast, Daily Lunch or Dinner, Nightly Cocktails & Massages",
    "description": "Renowned for its lush rainforests and serene bamboo-clad surroundings, Ubud is the perfect jungle setting for Cicada Luxury Resort Ubud. A place of verdant allure, the landscape is showcased through transitional indoor-outdoor design, from the open-air yoga shala and spa suites, to alfresco dining spaces. Savour the sounds of the wilderness over 15 courses at Tangelo a Contemporary Cuisine and tantalise your palate with exotic cocktails at Verdant Pool Lounge and Bar, best enjoyed to the soundtrack of nightly live music.\n\nCascading over the dense jungles of Tegalalang, this luxe reprieve is secluded in a world of its own, yet moments from the untouched rice terraces, sacred sights and temples of Sebatu village. Let the dedicated concierge team decide your day in Ubud's mesmerising caves and monkey forests, or stay local to sip sacred spring water said to grant youthful vitality.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Sebatu",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Cicada Luxury Resort Ubud",
    "offer_address": "Jl. Raya Bilukan, Sebatu, Kec. Tegallalang, Gianyar, Bali 80561 Indonesia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 579.0,
    "value": 1080.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HFFBRYA5",
    "hero_image": "https://images.luxuryescapes.com/8wh0gnp2rssz0hgjqmfp",
    "image_two": "https://images.luxuryescapes.com/jf61tonbck5i30qphdup",
    "image_three": "https://images.luxuryescapes.com/swgq755ab3707hbgpiqe",
    "vendor_name": "Asvara Villa Ubud",
    "title": "Romantic Ubud Private Pool Villas with Daily Breakfast & Daily Choice of Lunch or Dinner",
    "description": "Discover the lush jungles, grand temples and authentic markets of Ubud in this romantic villa hideaway. Forget about the rest of the world in your own private villa, boasting a shimmering pool, bubbling hot tub and breezy lounge area, perfectly positioned amid terraced rice fields.\n\nWhen you're not enjoying a poolside cocktail or a tension-melting massage, venture out to Ubud centre - just a 15-minute trip on the complimentary shuttle service - and immerse yourself in the vibrant local culture. With various hidden waterfalls, Balinese swings and the Sacred Monkey Forest Sanctuary all within reach, an escape to this hideaway ensures you can tick off all the Ubud's quintessential experiences.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Asvara Villa Ubud, by Ini Vie Hospitality",
    "offer_address": "Jalan Bangkiang Sidem No. 8 X, Keliki, Tegallalang, Gianyar Regency, Bali 80571, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 412.0,
    "value": 970.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ab9uiAAB",
    "hero_image": "https://images.luxuryescapes.com/gblxbljxvcv5j20wfsq",
    "image_two": "https://images.luxuryescapes.com/x83l7toongq3idw0othg",
    "image_three": "https://images.luxuryescapes.com/3fff2l89gs9ww7asd0bq",
    "vendor_name": "Maya Ubud Resort & Spa",
    "title": "Five-Star Maya Ubud Jungle Retreat with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Indulge in five-star bliss at the breathtaking Maya Ubud Resort & Spa - a stunning Balinese sanctuary ranked within the top 10% of properties on Tripadvisor. Cradled by the dramatic Petanu River valley and the rolling rice paddies of Peliatan, Maya Ubud Resort & Spa is a jewel within a tranquil 10-hectare tropical haven. Designed to capture the spirit of a traditional Balinese village, this ultra-luxe retreat combines local elegance and hospitality with a true five-star experience.\n\nPlunge into the glistening infinity pool overlooking the enchanting forest (with a kids' pool for the little ones), build up a sweat on the tennis court, experience euphoria at the spa with a rejuvenating treatment beside the swirling waters of the Petanu River, or spend each morning aligning your chakras at the tranquil yoga pavilion. For a day out, it's just a leisurely 20-minute stroll to vibrant Ubud town with its artisan markets, colourful boutiques and world-class restaurants.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Maya Ubud Resort & Spa",
    "offer_address": "Jalan Gunung Sari, Peliatan, Gianyar, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 659.0,
    "value": 1559.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3Q3qQAF",
    "hero_image": "https://images.luxuryescapes.com/mhek3bjthb6lcbfqhpjd",
    "image_two": "https://images.luxuryescapes.com/blacpxyhhijojcs22wui",
    "image_three": "https://images.luxuryescapes.com/m9vft7wro2a1mf03iiqb",
    "vendor_name": "Payogan Villa Resort and Spa",
    "title": "Secluded Hillside Luxury with Dining & Spa Inclusions",
    "description": "Nestled in between two majestic rivers, you’ll find seven-hectares of vibrant hinterland in the timeless landscape that Ubud is so famous for. Welcome to the five-star Payogan Villa Resort & Spa: a serene sanctuary from the outside world, yet only 10 minutes’ drive from downtown Ubud. Recharge with a lavish four or six-night stay in a huge private pool villa among the lush rolling hills and indulge in daily buffet breakfast, two x three-course Indonesian dinners, a 60-minute massage for two, convenient private one-way airport pick-up and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Payogan Villa Resort and Spa",
    "offer_address": "Jl. Cocoa II No.77, Kedewatan, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 494.0,
    "value": 1350.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQPswAAH",
    "hero_image": "https://images.luxuryescapes.com/9r7xbg7uom1rbsu324m25",
    "image_two": "https://images.luxuryescapes.com/obzpo17m8ma8rnee6mr6",
    "image_three": "https://images.luxuryescapes.com/2amyi2wpje1y7sy699qh",
    "vendor_name": "Kaamala Resort Ubud",
    "title": "Romantic Ubud Private Suites with Massages, Daily Breakfast, Choice of Lunch or Dinner & Nightly Cocktails",
    "description": "Retreat to the ultimate jungle-fringed paradise at Kaamala Resort Ubud, a romantic haven perfect for those seeking a serene escape. Fall in love with this impressive hideaway where traditional stone and wood carvings are perfectly complemented by modern design elements, and sweeping views over terraced paddies and breathtaking valleys will leave you feeling instantly soothed. Absorb the beauty of the landscape from the resort's stunning infinity pool complete with a large hammock overlooking the edge, tap into your spiritual daily yoga sessions or be pampered at Svaha Spa. Later, be sure to refuel at Wild Air restaurant where signature local and international dishes await.\n\nWhile this tranquil oasis may leave you feeling miles away from the everyday, the endless wonders of Ubud are can be found within close reach, including the Sacred Monkey Forest, Ubud Art Market, Ubud Palace and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kaamala Luxury Resort & Spa Ubud by Ini Vie Hospitality",
    "offer_address": "888A Jalan Bisma, Ubud, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 39.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 575.0,
    "value": 938.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X960fQAB",
    "hero_image": "https://images.luxuryescapes.com/lloxef573s76lujfwimm",
    "image_two": "https://images.luxuryescapes.com/xpwrsan9pqfzdpz1cr7x",
    "image_three": "https://images.luxuryescapes.com/qhe9eyv6nuhpej6eegw8",
    "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
    "title": "Five-Star Ubud Retreat with Private Butler Service & Hot Air Balloon Ride",
    "description": "Discover a heavenly hideaway nestled amongst Ubud’s lush rice paddy fields at The Chedi Club, one of Bali’s leading luxury hotels where you can enjoy private butler service. Includes daily breakfast, a hot air balloon ride or massage, guided rice paddy trek, daily refilled minibar, daily afternoon tea, yoga class, dining experiences, sunset cocktails and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Chedi Club 2018",
    "offer_address": "Tengkulak Kaja, Jl. Raya Goa Gajah, Kemenuh, Ubud, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 698.0,
    "value": 2303.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IM67gYAD",
    "hero_image": "https://images.luxuryescapes.com/g098jb8unozr1n5kzqs",
    "image_two": "https://images.luxuryescapes.com/ni88bu98wkrxxz5lpt6",
    "image_three": "https://images.luxuryescapes.com/m19s0pfixowmgejrirr",
    "vendor_name": "AnandaDara Ubud Resort & Spa",
    "title": "Tranquil Ubud Rainforest Retreat with Daily Breakfast, Nightly Two-Course Dinner & Nightly Cocktails",
    "description": "Located just north of Ubud, the home of Bali’s famous rice terraces, this luxury resort and spa is truly at one with its lush natural surroundings. Lose yourself in tranquil landscaped gardens, soak in the poolside whirlpool or float away in a romantic flower bath followed by an indulgent river stone massage at l’santē AnandaDara SPA.\n\nNestled moments from Ubud's culinary scene, the resort's de Daara eateries offer a tantalising blend of international flavours, from crowd-pleasers like authentic nasi goreng to gourmet pizzas, with its name taken from the Balinese word 'Daar' meaning 'eat'.\n\nWhile staying in Bali's most serene province, make the most of your location. Take a short drive to the nearby Ulu Petanu Waterfall, discover local art at the Ubud Market and relish in your proximity to the Tegallalang Rice Terraces - one of Bali's most photographed destinations.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "AnandaDara Ubud Resort & Spa",
    "offer_address": "Jalan Tirta Tawar, Beru Abangan, Tegallalang, Ubud 80571, Bali",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 349.0,
    "value": 1220.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lo28AAC",
    "hero_image": "https://images.luxuryescapes.com/ckzx8en0c2gf9rzqi3d",
    "image_two": "https://images.luxuryescapes.com/k3jeqldfy7cpnd42s97",
    "image_three": "https://images.luxuryescapes.com/w2ousidkdmhvc8n7mko",
    "vendor_name": "PURI WULANDARI A BOUTIQUE RESORT & SPA",
    "title": "Ubud Private Pool Villa Escape with Daily Dining & Cocktails",
    "description": "Embrace complete seclusion and intimacy among the breathtaking rice paddies and jungles of Ubud, Bali's spiritual hinterland, at Puri Wulandari A Boutique Resort & Spa. Stay in an incredible private pool villa, offering ultimate privacy in this verdant slice of paradise.\n\nYour escape includes daily à la carte breakfast, daily three-course dinner from a set menu at Janger Restaurant, one 60-minute Balinese massage per person at Lila Ulangun Spa, a complimentary daily cocktail each and a one-way airport transfer from Bali's Denpasar Airport.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Puri Wulandari A Boutique Resort & Spa March 2020",
    "offer_address": "Jl. Raya Kedewatan, Banjar Tanggayuda, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 719.0,
    "value": 1548.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LhveAAC",
    "hero_image": "https://images.luxuryescapes.com/4h6msrtwf34q8exzualg",
    "image_two": "https://images.luxuryescapes.com/4xk675xjvw9vv0fbqq2",
    "image_three": "https://images.luxuryescapes.com/r1hskg8wgriukuhqf8j",
    "vendor_name": "Ubud Nyuh Bali Resort and Spa",
    "title": "Pool Villa Wellness Escape with Daily Dining",
    "description": "Escape to a private pool villa oasis at Ubud Nyuh Bali Resort & Spa, a tranquil wellness oasis in Bali's cultural heartland. Prepare to be nurtured, inspired and re-invigorated amid Ubud’s serene jungles and rice paddies.\n\nFind your Zen with daily à la carte breakfast, daily afternoon tea, a choice of daily two-course lunch or dinner, a one-time floating breakfast, a 60-minute Balinese massage each with a relaxing 15-minute foot ritual massage, and daily yoga classes targeting your body and mind.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Ubud Nyuh Bali Resort & Spa - Older",
    "offer_address": "Jl. Raya Silungan, Lodtunduh, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 495.0,
    "value": 1026.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcbRCAAZ",
    "hero_image": "https://images.luxuryescapes.com/xuutnj4epxsdo134r38s",
    "image_two": "https://images.luxuryescapes.com/qrtm2wrxzpebuvsqoeqr",
    "image_three": "https://images.luxuryescapes.com/93x57un2gpv2j9unlf6d",
    "vendor_name": "Bisma Eight Hotel",
    "title": "Boutique Five-Star Ubud Retreat with Japanese-Inspired Hot Tub, Daily Breakfast & Nightly Cocktails",
    "description": "Find harmony between verdant landscapes and modern comforts, the five-star Bisma Eight Ubud showcases a boutique sanctuary tucked within a raw-concrete architecture oasis that harmonises beautifully with the leafy Ubud valley. This serene haven is home to an intimate collection of just 50 luxurious villas and suites, each complete with a Japanese-style soaking tub and modern, minimalist touches sure to leave a lasting impression. Lose track of time at the Library Café, toast to your escape with cocktails at Pavilion or indulge in a delicious feast complete with rooftop views from Copper Restaurant - where much of the ingredients come from the hotel’s organic farm and conservatory. For something more intimate, Embers Restaurant serves Mediterranean classics under the stars and the Mandala Spa promises unparalleled pampering - both away from the main hotel in the private villa wing.\n\nMake the most of your stay and venture to the nearby Ubud Royal Place - just 10 minutes on foot, the popular Ubud Monkey Forest or the iconic Tegalalang Rice Terrace, tap into the history of the region and visit Ubud Palace, or get your culture fix at the Agung Rai Museum of Art or Neka Art Museum.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Bisma Eight Hotel",
    "offer_address": "Jl. Bisma No.68, Ubud, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 669.0,
    "value": 1388.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZnUJPQA3",
    "hero_image": "https://images.luxuryescapes.com/z6oxo45jwhs8cerq87qf",
    "image_two": "https://images.luxuryescapes.com/tulmefqfrbtjc9ecylvj",
    "image_three": "https://images.luxuryescapes.com/uibluv1vqmoy8bgasmdt",
    "vendor_name": "Jungle Retreat by Kupu Kupu Barong",
    "title": "Tranquil Ubud Retreat with Luxe L’Occitane Spa Inclusions",
    "description": "Stay in one of just 40 luxury suites at the boutique Jungle Retreat by Kupu Kupu Barong, Bali. Nestled into the lush greenery of Ubud, this secluded property is home to the award-winning Mango Tree Spa by L’Occitane. Included in your escape is daily breakfast, one romantic dinner for two, a 90-minute massage plus 40% off further treatments at the spa, and a luxuriously late 2pm check-out.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Jungle Retreat by Kupu Kupu Barong",
    "offer_address": "Jl. Raya Kedewatan, Kedewatan, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 312.0,
    "value": 797.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQJL1AAP",
    "hero_image": "https://images.luxuryescapes.com/ngqo7s0e5i7n9fn46p1e",
    "image_two": "https://images.luxuryescapes.com/5pb9ur3j8mxv98rfqc3",
    "image_three": "https://images.luxuryescapes.com/3la69vkev0ki5b2recg",
    "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
    "title": "Award-Winning Ubud Resort Luxury with Butler Service & Club Perks Including Daily Breakfast & Nightly Free-Flow Cocktails",
    "description": "Immerse yourself in the tranquil surroundings of the sprawling Ubud retreat, the five-star Tanah Gajah, a Resort by Hadiprana. This luxurious haven is home to just twenty suites and villas, each offering extensive club benefits, and was recently named one of the Top 25 Boutique Hotels in Asia in the Tripadvisor Travellers’ Choice Awards 2022, as well as one of the best resorts in the world in the Condé Nast Traveler Readers' Choice Awards 2022. Hidden within 12 acres of verdant, emerald-green rice paddies, this heavenly resort radiates peace, quiet and tranquility, just ten minutes from the artists' village of Ubud.\n\nRediscover the meaning of relaxation with a day of pampering at the spa, take to the skies with a hot-ballooning adventure, or learn about Balinese culture with onsite cooking classes and dance performances. Later, retreat to your thoughtfully designed suite or villa to rest, recharge and repeat it all over again.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Tanah Gajah, a Resort by Hadiprana",
    "offer_address": "Jalan Raya Goa Gajah, Tengkulak Kaja, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 767.0,
    "value": 1650.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQHDBAA5",
    "hero_image": "https://images.luxuryescapes.com/4hajrg2b2lahfqz1s86g",
    "image_two": "https://images.luxuryescapes.com/6hpcbjf7wjek0ryaee97",
    "image_three": "https://images.luxuryescapes.com/l8wzuc700qydjmdc9l7",
    "vendor_name": "Kayumanis Ubud Private Villa & Spa",
    "title": "Ubud Five-Star Luxury Pool Villas with Daily Breakfast, Nightly Cocktails & Butler Service",
    "description": "Escape to Ubud's lush, serene hills and discover your private slice of island paradise at the five-star boutique retreat, Kayumanis Ubud Private Villas & Spa. This luxury retreat is home to just 23 elegantly appointed villas, each offering butler service and private pools. Hidden within a tropical forest overlooking the Ayung River, this heavenly resort radiates tranquillity - yet it's just five minutes from Bali's vibrant cultural capital, Ubud.\n\nIndulge in a wealth of wellness treatments at Kayumanis Spa Ubud, or treat yourself to a romantic feast high over the river valley at Dining Corner. Take in Ubud's beauty with a guided tour, enrich your home recipes with onsite cooking classes or learn to relax, meditate and harmonise your body through the resort's extensive yoga program.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Ubud Private Villa & Spa",
    "offer_address": "Jalan Kayumanis Sayan, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 692.0,
    "value": 1571.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070M5hAAE",
    "hero_image": "https://images.luxuryescapes.com/xf1b4nps9f0ispml85m",
    "image_two": "https://images.luxuryescapes.com/xpap4u73nodu5afvv3mu",
    "image_three": "https://images.luxuryescapes.com/hwtskmdiawq21m3qtd4",
    "vendor_name": "Viceroy Bali",
    "title": "Award-Winning Five-Star Ubud Retreat with Daily Breakfast & Cocktails",
    "description": "Experience the pinnacle of paradise at Viceroy Bali, a five-star sanctuary rated among the top 10% of properties worldwide on Tripadvisor, and Best Luxury Resort in Asia at the World Luxury Hotel Awards 2021. Sitting on a steep ravine, overlooking the Petanu Valley, this luxury hotel is surrounded by rich Balinese jungle and is just five minutes from the centre of bustling Ubud. Here, you’ll find some of the island’s best restaurants and magnificent markets full of unique artisan gifts.\n\nIntimate and family-run (a rarity for a five-star hotel in Bali), Viceroy Bali is home to 40 suites and villas with sweeping views of perfectly placed palm trees and luxurious amenities. Part of the prestigious Small Luxury Hotels of the World Collection, the resort was once named the Best Resort in the World in the Condé Nast Traveler Readers' Choice Awards. Discover true tranquility at Lembah Spa, where treatments combine traditional Balinese techniques with modern wellness knowledge. Sample Ubud’s finest dining at Apéritif, the 1920s-inspired restaurant and bar that celebrates high-quality ingredients and global influences through a distinguished degustation menu, or opt for something a little more relaxed at Cascades Restaurant Ubud, where traditional Indonesian dishes sit beside western classics.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Viceroy Bali",
    "offer_address": "Jl. Lanyahan, Br. Nagi, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 639.0,
    "value": 2237.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IhyLIAS",
    "hero_image": "https://images.luxuryescapes.com/xdy48a6136k0wdfgsaar",
    "image_two": "https://images.luxuryescapes.com/nqcm304sk772fnmjx5qe",
    "image_three": "https://images.luxuryescapes.com/dltid2fo3sngpw3itgvp",
    "vendor_name": "PURI WULANDARI A BOUTIQUE RESORT & SPA",
    "title": "Ubud Boutique Hillside Pool Villas with Daily Breakfast, Nightly 3-Course Dinner & Nightly Cocktails",
    "description": "Discover the lush jungles, cascading rice paddies and soaring mountains of Bali’s spiritual heartland in this Ubud retreat. Crafted in traditional Balinese style, each secluded villa features thatched roofs and traditional flourishes, without compromising on luxury touches.\n\nIn addition to your villa's own private pool, an incredible infinity pool looks out from the top of the resort over rainforests and dramatic volcanic gulfs. Two restaurants and one bar serve exquisite local fusion meals and tropical cocktails - best enjoyed while watching the sunset ignite the sky in vivid red and gold.\n\nWhen you’re ready to pamper yourself, head to the open-air Lila Ulangun Spa for a massage, soak in the jacuzzi or unwind in the sauna. A peaceful retreat away from the hustle and bustle of the city, Ubud calls for slowing your pace to reconnect with nature.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Puri Wulandari A Boutique Resort & Spa",
    "offer_address": "Jalan Raya Kedewatan, Banjar Tanggayuda, Kedewatan, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 879.0,
    "value": 2930.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcChoAAF",
    "hero_image": "https://images.luxuryescapes.com/j8k8if8ara6k1ck4k58",
    "image_two": "https://images.luxuryescapes.com/8023j4zbkpw9jzj3pgn",
    "image_three": "https://images.luxuryescapes.com/wbpcdbdph9qcwztweak",
    "vendor_name": "Dedary Resort Ubud",
    "title": "Tranquil Ubud Villa Retreat with Daily Breakfast, Daily Lunch or Dinner & Dine-Around Credit",
    "description": "Experience the tranquillity of Bali with a stay at this picture-perfect resort, a serene cluster of villas surrounded by lush tropical gardens and rice fields. This boutique resort is just a short drive from the vibrant Ubud Art Market and the Sacred Monkey Forest Sanctuary. Onsite, indulge in traditional Balinese treatments at the spa, savour fresh cuisine from Sans Thai Restaurant or take a dip in your villa's own private pool when you're ready to cool down. Explore local culture with a visit to the Tegallalang Rice Terrace or a traditional Balinese dance or music class, or take a day trip to Bali's south for fun in the sun when you take advantage of your complimentary access to Tropical Temptation Beach Club.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tegallalang",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Dedary Resort",
    "offer_address": "Banjar Pinjul No.8, Kenderan, Kec. Tegallalang, Kabupaten Gianyar, Bali 80571",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 419.0,
    "value": 1055.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000J2CrlYAF",
    "hero_image": "https://images.luxuryescapes.com/fiql6kbr0be9e41p66vd",
    "image_two": "https://images.luxuryescapes.com/8qgrw4n8xk24z9ojhbt",
    "image_three": "https://images.luxuryescapes.com/8vireg61g4i98xp7ypa",
    "vendor_name": "Kaamala Resort Ubud",
    "title": "Kaamala Resort Ubud July 25",
    "description": "x",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kaamala Luxury Resort & Spa Ubud by Ini Vie Hospitality",
    "offer_address": "888A Jalan Bisma, Ubud, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 439.0,
    "value": 1002.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GwnE5AAJ",
    "hero_image": "https://images.luxuryescapes.com/lju2og1rmbxe9f8dc0u",
    "image_two": "https://images.luxuryescapes.com/yqkkmrk4ckxt6cqcoju",
    "image_three": "https://images.luxuryescapes.com/uhhtz7dne0b2j10eei",
    "vendor_name": "Kayumanis Ubud Private Villa & Spa",
    "title": "Spacious Ubud Private Pool Villa Oasis with All-Day Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Escape to Ubud's lush green rice paddies and discover your private slice of island paradise at this five-star boutique retreat, home to just 23 elegantly appointed villas, each offering high-end butler service, glistening private pools and quintessential Balinese design. Hidden within a tropical forest overlooking the Ayung River, the heavenly Kayumanis Ubud Private Villa & Spa radiates tranquillity - yet is just a 15-minute drive from Bali's vibrant cultural capital, Ubud. Indulge in a wealth of wellness treatments at Kayumanis Spa Ubud, or treat yourself to a romantic feast high over the river valley at Dining Corner. Take in Ubud's beauty with a guided tour, enrich your home recipes with onsite cooking classes or learn to relax, meditate and harmonise your body through the resort's extensive yoga program.\n\nEmbrace the beauty of the Balinese jungle and vibrancy of Ubud, home to world-class restaurants and shops. Take a short drive and discover a plethora of nearby temples and the popular Aloha Ubud Swing, the perfect spot to take in sweeping vistas of rice paddies, lush rainforests, lakes and waterfalls. Visit thousands of Balinese long-tailed macaque monkeys at the Sacred Monkey Forest Sanctuary, or journey an extra five minutes to Goa Gajah Elephant Cave temple.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Ubud Private Villa & Spa",
    "offer_address": "Jalan Kayumanis Sayan, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 719.0,
    "value": 2499.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eNAHkQAO",
    "hero_image": "https://images.luxuryescapes.com/9c4ckcp8kq1ckg0fpr8i",
    "image_two": "https://images.luxuryescapes.com/9b625xmqksoqrb9f939",
    "image_three": "https://images.luxuryescapes.com/2ijagapzqnqme72ancom",
    "vendor_name": "Daun Lebar Villas",
    "title": "Ubud Villa Luxury with Daily Cocktails and Dining Inclusions",
    "description": "Escape it all in a romantic private pool villa amidst the rice paddies and tropical jungle of Ubud, staying at the Daun Lebar eco-friendly boutique resort. Be seduced by the captivating lush green terraces as you’re treated to daily à la carte breakfast, plus a set-menu lunch and a set-menu dinner at Kema Mai, surrounded by beautiful Ubud jungle. You'll also enjoy a reinvigorating 60-minute Balinese Nirmasa massage each, a daily cocktail per person, a complimentary yoga class, convenient airport pickup on arrival and guaranteed 1pm late checkout. Come for the relaxation and rejuvenation, stay for what may be the most romantic holiday of your life. Plus, there are upgrades available for up to six people.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Daun Lebar Villas",
    "offer_address": "Banjar Susut no.777, Desa Buahan, Payangan - Ubud, Buahan, Payangan, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 371.0,
    "value": 843.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPtWoAAL",
    "hero_image": "https://images.luxuryescapes.com/skudw6jtt9g2d3coeumk",
    "image_two": "https://images.luxuryescapes.com/mpzbut2fnp2dot51duzb",
    "image_three": "https://images.luxuryescapes.com/pfu2cobcq4l7pgcjnlb",
    "vendor_name": "Hanging Gardens of Bali",
    "title": "Award-Winning Ubud Hanging Gardens Pool Villas with Daily Breakfast & Cocktails",
    "description": "Suspended over the lush Ubud jungle of orchids, bamboo and coffee trees, Hanging Gardens of Bali is an exotic Eden. This incredible property was heralded 'The World's First Seven Stars Boutique Hotel' in the Seven Stars Hospitality Awards 2021. Watch the world melt away from the famed two-tiered pool, which appears to float above the mist-covered forest below. Marvel at awe-inspiring views that stretch down to the Ayung River, across the valley to the sacred Dalem Segara Temple. Discover the vibrance of Ubud Town - less than a 30-minute shuttle away - and find serenity at the riverside spa.\n\nRomantic pathways lead to Hanging Gardens of Bali’s 44 secluded pool villas, and getting around this vertiginous property is simple: you’ll be whisked up and down the hill via the onsite funicular. Dining at the Feng Shui-inspired Three Elements Restaurant is an award-winning feast for the senses. Enjoy not only a tantalising culinary journey, but also views of the pool, valley and, after dusk, the glow of hundreds of romantic candles.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Hanging Gardens of Bali",
    "offer_address": "Buahan, Payangan, Gianyar Regency, Bali 80571, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 30,
    "price": 1115.0,
    "value": 2328.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Cu32jYAB",
    "hero_image": "https://images.luxuryescapes.com/9jbcsg4xqqhzoorfs36r",
    "image_two": "https://images.luxuryescapes.com/1ovourab2f0hqy7b56j",
    "image_three": "https://images.luxuryescapes.com/eyqwcs9htcv2b2al8u4",
    "vendor_name": "Kaamala Resort Ubud",
    "title": "Romantic Ubud Suites & Villas with Daily Breakfast, Daily Lunch or Dinner & Massages",
    "description": "Retreat to jungle-fringed paradise at this five-star romantic hideaway, perfect for those seeking a serene Ubud escape. At Kaamala Resort Ubud, traditional stone and wood carvings are complemented by modern design, and sweeping views over terraced rice paddies and breathtaking valleys leave you spellbound.\n\nAbsorb the beauty of the landscape from the resort's infinity pool, complete with a large hammock overlooking the edge. Tap into the spiritual with daily yoga sessions or restore, renew and rejuvenate at the tranquil Svaha Spa.\n\nWhile this tranquil oasis may leave you feeling miles away from the every day, the endless wonders of Ubud are all within close reach, including the Sacred Monkey Forest Sanctuary, Ubud Art Market and Ubud Palace. Return to Habitat Bistro, where signature Indonesian plates and panoramic views over treetops await.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kaamala Luxury Resort & Spa Ubud by Ini Vie Hospitality",
    "offer_address": "888A Jalan Bisma, Ubud, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 559.0,
    "value": 1200.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvJhKAAV",
    "hero_image": "https://images.luxuryescapes.com/navcox9lydlazgft7gyc",
    "image_two": "https://images.luxuryescapes.com/xum6u32zk57c1ouzqx1d",
    "image_three": "https://images.luxuryescapes.com/kxuztzs1hv62hiopp9j",
    "vendor_name": "Padma Resort Ubud",
    "title": "Award-Winning Ubud Rainforest Hideaway with World-Famous Pool, Daily Breakfast & Daily Lunch or Dinner",
    "description": "Find serenity among the untouched rainforests of Bali at the breathtakingly beautiful, five-star Padma Resort Ubud. Located just 35 minutes from the island's celebrated arts capital, Ubud, the resort offers new heights of unparalleled luxury in the heart of the Island of the Gods, with a truly iconic infinity pool, surrounded by the enchanting sounds and sights of the Payangan forest. With Padma Resort Ubud's rotating schedule of complimentary resort activities - including a range of yoga classes, cycling tours, archery experiences and the exceptional Wolly Kids Club - you'll be all set to soak up the region's legendary serenity.\n\nPadma Resort Ubud, stamped with a Tripadvisor Travellers’ Choice, Best of the Best 2023 award - and crowned Asia's #4 best hotel - is the perfect launchpad to explore Ubud, Bali’s trendy and effortlessly inventive artistic wonderland. Visit the city’s lush rice fields, check out the abundance of galleries and museums, get to know the Ubud Monkey Forest’s cheeky inhabitants or slow down and take it all in - Ubud offers boundless opportunities for travellers of all stripes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Padma Resort Ubud",
    "offer_address": "Banjar Carik, Desa Puhu, Payangan, Ubud, Bali 80572, Indonesia",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 669.0,
    "value": 1930.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R9e36QAB",
    "hero_image": "https://images.luxuryescapes.com/ihcleeqhdbwcsiktdtni",
    "image_two": "https://images.luxuryescapes.com/fi7ej1c3tqla4xr0ezz2",
    "image_three": "https://images.luxuryescapes.com/l2i9ykz5u1ftdhx02qln",
    "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
    "title": "Five-Star Retreat With Private Butler Service",
    "description": "Discover a heavenly hideaway nestled amongst Ubud’s lush rice paddy fields. Stay three nights at Chedi Club Bali - one of Bali’s leading luxury hotels - and enjoy daily breakfast, a 60-minute massages each, daily afternoon tea, nightly sunset cocktails, daily minibar including alcoholic drinks, a set lunch or dinner at the award-winning restaurant, private butler service, airport pickup and more for two adults.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Chedi Club Tanah Gajah Ubud, Bali - 2018 #2*",
    "offer_address": "Tengkulak Kaja, Jl. Raya Goa Gajah, Kemenuh, Ubud, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 650.0,
    "value": 1555.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000OegrGAAR",
    "hero_image": "https://images.luxuryescapes.com/durj73rucwzjaunojgte",
    "image_two": "https://images.luxuryescapes.com/mpptzrn86winxmxgk2j7",
    "image_three": "https://images.luxuryescapes.com/dq4gnolhjulvv0wos9hy",
    "vendor_name": "Ubud Nyuh Bali Resort and Spa",
    "title": "Brand-New Lavish Retreat in Ubud",
    "description": "Be one of the first to experience high-end indulgence at Bali’s Ubud Nyuh Bali Resort and Spa. Think: A-list luxury meets serene retreat. Rejuvenate your body and refresh your mind with a three or seven-night stay in a villa with your own private pool, daily a la carte breakfast, daily high tea, a romantic poolside dinner, private return airport transfers, private transfers around Ubud, daily yoga classes and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Ubud Nyuh Bali Resort and Spa - OLD*",
    "offer_address": "Jl. Raya Silungan, Lodtunduh, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 631.0,
    "value": 1425.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000E0Gj5YAF",
    "hero_image": "https://images.luxuryescapes.com/jh08crecd7qbbaemymg",
    "image_two": "https://images.luxuryescapes.com/jo5gyaloou4dba3v336",
    "image_three": "https://images.luxuryescapes.com/im91pfimawq23lusd0a6",
    "vendor_name": "Aksari Resort Ubud",
    "title": "Tranquil Ubud Jungle Hideaway with All-Inclusive Dining, Free-Flow Drinks Hour & Massages",
    "description": "Enjoy some well-earned rest and indulge in peaceful tranquillity hidden in the heart of the jungle. This impressive resort boasts sweeping views of Bali's picturesque green valleys accompanied by the finest traditional Balinese touches.\n\nEmbrace the air of romance found across the resort and take a dip in the cascading infinity pool perched over the jungle. Indulge in a soothing massage at Svaha Spa Kenderan, then finish each day on a high note with a delicious cocktail and unparalleled dining experience at Ankhusa or Kojin Teppanyaki Restauarant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tegallalang",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Aksari Luxury Resort & Spa Ubud by Ini Vie Hospitality",
    "offer_address": "88 Jalan Raya Desa Kenderan, Kenderan, Ubud, Bali 80561, Indonesia",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 599.0,
    "value": 1312.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aiUL9QAM",
    "hero_image": "https://images.luxuryescapes.com/zmmqorosodtrciwgjzhp",
    "image_two": "https://images.luxuryescapes.com/ybdu4s5gcpasp3qf9wnu",
    "image_three": "https://images.luxuryescapes.com/kszmwkzkech3idcloi5y",
    "vendor_name": "Ubud Raya Resort",
    "title": "Bali Pool Villa Oasis with Cocktails, Dining Inclusions and Massages",
    "description": "Find your bliss at Ubud Raya Resort, a sanctuary in Ubud's breathtaking natural landscape. You’ll be able to relax and unwind in your beautiful private villa, complete with a private pool and located close the Ubud Market and the Monkey Forest. Indulge in a three-course dinner and two-course lunch, daily afternoon tea, daily cocktail, daily à la carte breakfast, a Balinese massage each, guaranteed 2pm late checkout and one-way airport transfer.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Ubud Raya Resort",
    "offer_address": "Jl. Raya Sayan, Br. Sindu, Sayan Ubud 80571 Bali Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 312.0,
    "value": 934.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQW1DAAX",
    "hero_image": "https://images.luxuryescapes.com/774tb293salrs6om3fx",
    "image_two": "https://images.luxuryescapes.com/kagnn149tokk21u87i3l",
    "image_three": "https://images.luxuryescapes.com/x7qcmhiwth2yvmgwxpl7",
    "vendor_name": "Nandini Jungle By Hanging Gardens",
    "title": "Hidden Ubud Retreat by Hanging Gardens with Daily Breakfast, Choice of Daily Lunch or Dinner & Free-Flow Sunset Cocktail Hour",
    "description": "A slice of jungle paradise awaits you at the luxurious five-star Nandini Jungle by Hanging Gardens, a serene sanctuary set above the spiritual Ayung River. Here, Balinese culture and contemporary charm combine to create a deluxe destination like no other: the resort is modelled on a traditional Balinese village, with 34 villas cascading down the hillside. Start your morning peacefully by soaking in some amazing jungle views, relax inside the glistening infinity swimming pool or enjoy a soothing spa experience at Sungai Spa, before finishing the day with cocktails to accompany the spectacular sunset view over the river gorge.\n\nFramed by Bali’s iconic terraced green rice paddies, monkey-filled jungles and swaying coconut palms, Ubud offers some of the island’s most beautiful scenery, which can be discovered on rice field tours. In just over 20 minutes, a complimentary shuttle takes you from the resort to Ubud, the cultural heart of Bali, brimming with vibrant restaurants, yoga studios, galleries, and markets.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Nandini Jungle by Hanging Gardens",
    "offer_address": "Br, Jl. Susut, Buahan, Payangan, Kabupaten Gianyar, Bali 80572, Indonesia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 539.0,
    "value": 994.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Zmk76QAB",
    "hero_image": "https://images.luxuryescapes.com/itcvekwoezbf78ej1v3u",
    "image_two": "https://images.luxuryescapes.com/re2u0skgwfw1vfdervnj",
    "image_three": "https://images.luxuryescapes.com/lr6zarieedhbb34orbqb",
    "vendor_name": "Padma Resort Ubud",
    "title": "Relax Beside One of Bali’s Most Instagrammable Pools with Nightly Three-Course Dinner, Cocktails & More",
    "description": "Find complete serenity amongst the lush rainforest of Ubud, Bali’s spiritual hinterland, staying at the breathtaking Padma Ubud. Your escape includes daily buffet breakfast, nightly three-course dinner, daily afternoon tea, a complimentary cocktail each, complimentary airport pickup on arrival, guaranteed late checkout at 1pm and savings on food, drinks and spa treatments.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Padma Resort Ubud - Old*",
    "offer_address": "Padma Resort Ubud Banjar Carik, Desa, Puhu, Payangan, Kabupaten Gianyar, Bali 80572, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 578.0,
    "value": 1353.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FmfUVAAZ",
    "hero_image": "https://images.luxuryescapes.com/5tn669om0wd5msz53b6i",
    "image_two": "https://images.luxuryescapes.com/f9wzgrw9victmwe1j81a",
    "image_three": "https://images.luxuryescapes.com/9wqhyciihh23476ft5qn",
    "vendor_name": "The Samaya Ubud Bali",
    "title": "Romantic Five-Star Ubud Villa Sanctuary with Massages, Daily Breakfast & Nightly Cocktails",
    "description": "Hidden among jungled hills, lush rice terraces and the winding Ayung River is one of Bali's best-kept secrets - The Samaya Ubud Bali, a five-star retreat steeped in the region’s vibrant spirit. Each spacious villa has been designed to offer the perfect escape for honeymooners, dreamers and families alike - soul-stirring views, complimentary butler service and a luxurious private pool come standard. Soak up views over Ubud’s vast rice fields from Scene, the resort’s open-air breakfast restaurant, and savour local flavours at the romantic Swept Away, perfectly situated on the property’s riverbank.\n\nWith the world-class The Spa at Samaya Ubud offering treatments from Balinese couple rituals to shiatsu, you’ll be all set to sink into bliss. When you’re ready to explore, Ubud offers an abundance of cultural marvels, from ancient temples to impressive art galleries and sacred monkey-filled groves. For a glimpse of the island's tremendous inner beauty, be sure to enjoy the included, 90-minute nature trek - from riverbanks to rice fields, nature's wonders abound at every turn.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Samaya Ubud Bali",
    "offer_address": "Banjar Baung, Desa Sayan, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 839.0,
    "value": 2095.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdIwqAAF",
    "hero_image": "https://images.luxuryescapes.com/tjbc3i4jlnn4abegqoea",
    "image_two": "https://images.luxuryescapes.com/q8u1aqgt2udl97qglbx",
    "image_three": "https://images.luxuryescapes.com/b8ovicjuadhfbg3sg4",
    "vendor_name": "Amarea Resort Ubud by iNi Vie Hospitality",
    "title": "Tranquil Ubud Retreat with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Find yourself surrounded by forest greenery, feeling as tranquil as ever, with a stay at this hidden gem in the heart of Bali's creative hub: Ubud. Between relaxing sunrise yoga and treks through the nearby lush landscapes, dive into the sparkling lagoon pool or treat yourself to a moment of serenity with a massage at Svaha Spa.\n\nFrom morning to night, savour Japanese bites, classic breakfast dishes and creative cocktails at Norii, a yakitori-style bar catering to all your cravings. Venture out of the resort to explore the island's finest dining, shopping districts and traditional temples. Nearby, you can easily access lush rice terraces, the sacred Monkey Forest, art galleries and vibrant local markets.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Amarea Resort & Spa Ubud by iNi Vie Hospitality",
    "offer_address": "Jl. Sawah Indah Gang Amarea 8, Peliatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 279.0,
    "value": 620.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000J0KF7YAN",
    "hero_image": "https://images.luxuryescapes.com/3ml9hd06hmzr1ab0rfj",
    "image_two": "https://images.luxuryescapes.com/5pi99d9lle9h06f0b7cs",
    "image_three": "https://images.luxuryescapes.com/5u8lfwvz8n9vzq29hq6q",
    "vendor_name": "E Sanctuary Resort Ubud",
    "title": "Ubud Private Pool Villa Stay with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Discover serenity in the heart of Ubud at this hillside retreat, nestled amid palms, rice terraces and tropical gardens. Wake to birdsong and forest vistas in your private pool villa, each featuring a private pool and warm interiors with indoor hot tubs for unwinding. Soothe body and mind with a traditional Balinese massage or a private yoga session at the on-site wellness centre.\n\nSavour mindful Balinese dishes at the picturesque Beiji Rainforest restaurant and sip on sundowners by the pool, while soaking up the greenery all around. Set just minutes from the Sacred Monkey Forest and Ubud Palace, cultural adventures are always close by.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Mambal",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "E Sanctuary Resort Ubud",
    "offer_address": "F65P+V65, Jl. Raya Br. Tunon, Singakerta, Kecamatan Ubud, Kabupaten Gianyar, Bali 80352",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 419.0,
    "value": 782.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DoptqAAB",
    "hero_image": "https://images.luxuryescapes.com/zqr4ug5p6qxesq9gtuqm",
    "image_two": "https://images.luxuryescapes.com/pvb79bzwyk8ht7e6ab1p",
    "image_three": "https://images.luxuryescapes.com/k6yirkpefi0jtyudenyl",
    "vendor_name": "Kappa Senses Ubud",
    "title": "French-Inspired Five-Star Ubud Jungle Luxury with Daily Breakfast, Nightly Cocktails & Massages by Clarins",
    "description": "Reclaim your inner peace and reawaken your senses at Kappa Senses Ubud, a blissfully secluded hideaway amid the verdant jungle of Ubud. Showcasing luxurious, French-inspired style and a dreamy 1,000sqm OmTara Spa by Clarins, this is the lush capital of well-being in Bali. Picture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort where dreams and reality blend seamlessly. Unwind in total privacy, then embark on an epicurean journey across the resort’s five restaurants and bars - whose organic produce leads the farm-to-table menus.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kappa Senses Ubud",
    "offer_address": "Banjar Tanggayuda, Jalan Taman Sari, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 589.0,
    "value": 1292.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mMo5AAE",
    "hero_image": "https://images.luxuryescapes.com/yn1v5faxzbn4qx0zi1r",
    "image_two": "https://images.luxuryescapes.com/rx6qiz88ahmvwdu10afm",
    "image_three": "https://images.luxuryescapes.com/bwi7dhk4fe7rhv1z16n",
    "vendor_name": "Kayumanis Ubud Private Villa & Spa",
    "title": "Five-Star Ubud Pool Villa Luxury with Daily Breakfast, Nightly Cocktails & Butler Service",
    "description": "Escape to the lush, undulating hills of Ubud in search of your own private slice of Bali paradise at the five-star Kayumanis Ubud Private Villas & Spa. This luxury retreat is home to just 23 elegantly appointed villas, each offering butler service and private pools. Hidden within a tropical forest overlooking the Ayung River, this heavenly resort radiates tranquility, while only five minutes from the artists' village of Ubud. Unwind with a day of pampering at Kayumanis Spa Ubud or indulge in a romantic feast high over the river valley at Dining Corner. Take in Ubud's beauty with a guided tour, enrich your home recipes with onsite cooking classes or learn how to relax, meditate and harmonise your body through yoga (surcharges apply to activities).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Ubud Private Villa & Spa",
    "offer_address": "Jalan Kayumanis Sayan, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 659.0,
    "value": 1451.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4NWxAAN",
    "hero_image": "https://images.luxuryescapes.com/ezagcmze3nx54ho7qy",
    "image_two": "https://images.luxuryescapes.com/rucnrgmkk50jp0rweamg",
    "image_three": "https://images.luxuryescapes.com/j575e7kbif1r35j71x",
    "vendor_name": "Kappa Senses Ubud",
    "title": "Grand Opening: French-Inspired Luxury in the Ubud Jungle with Clarins Spa Massages",
    "description": "Reclaim your inner peace and reawaken your senses at the brand-new Kappa Senses Ubud, a blissfully secluded hideaway on the Island of the Gods. Nestled amid the verdant jungle of Ubud, this five-star slice of Eden is perfect for honeymooners, romantics or friends seeking relaxation. Showcasing luxurious, French-inspired style and a dreamy 1,000sqm OmTara Spa by Clarins, this is the new capital of well-being in Bali.\n\nPicture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort where dreams and reality blend seamlessly. A collection of elegant villas and suites are aes­thetically designed to maximise indoor/outdoor living in the jungle. Unwind in total privacy, then embark on an epicurean journey across the resort’s five restaurants and bars - whose organic produce leads the farm-to-table menus - or enrich your wellness with an innovative treatment at the exceptional OmTara Spa by Clarins.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kappa Senses Ubud",
    "offer_address": "Banjar Tanggayuda, Jalan Taman Sari, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 487.0,
    "value": 1076.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GwnE4AAJ",
    "hero_image": "https://images.luxuryescapes.com/knx1377s4lf9z8dk8n4c",
    "image_two": "https://images.luxuryescapes.com/3d4npdzn2lrg880hu8f",
    "image_three": "https://images.luxuryescapes.com/6mbw2tnnxf6yi2294fg8",
    "vendor_name": "Alila Ubud",
    "title": "Alila Ubud Jungle Hideaway with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Bask in unrestricted jungle bliss with a five-star secluded escape to Alila Ubud, ideally positioned in the heart of Bali's spiritual hinterland, high above the Ayung River Valley, yet just 15 minutes from Ubud's centre. This serene hideaway offers the utmost in luxury and seclusion, sprawled across the hillside and hidden among world-famous rice paddies. Savour authentic farm-to-table Balinese plates at Plantation Restaurant or opt for something a little more relaxed by the resort's world-famous infinity pool, previously recognised by Vogue Australia as one of the most beautiful in Bali.\n\nIf you're after the ultimate wellness retreat, it's hard to beat Alila Ubud. A wealth of complimentary resort activities - including morning yoga and tai chi - make aligning your chakras a breeze, and a visit to the world-class Spa Alila, where luxurious wellness treatments combine traditional techniques with modern wellness knowledge, is highly recommended. As the day slowly melts into the evening, Cabana Lounge offers handcrafted cocktails to toast your jungle escape, alongside comforting grazing food and dramatic views overlooking the plunging valley below.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Alila Ubud",
    "offer_address": "Desa Melinggih Kelod, Payangan, Gianyar, Bali 80572, Indonesia",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 599.0,
    "value": 1587.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FnoXnAAJ",
    "hero_image": "https://images.luxuryescapes.com/ee3042abdmh07bx1yixc",
    "image_two": "https://images.luxuryescapes.com/cpd2dk2jlvv17btam2r",
    "image_three": "https://images.luxuryescapes.com/4hfhnk93zj2p2mwt4fwp",
    "vendor_name": "PURI WULANDARI A BOUTIQUE RESORT & SPA",
    "title": "Ubud Five-Star Private Pool Villa Retreat with Daily Breakfast, Nightly Dinner & Nightly Cocktails",
    "description": "Discover absolute serenity among the lush jungles, cascading rice paddies and soaring mountains of Ubud, Bali’s spiritual heartland, at the five-star Puri Wulandari A Boutique Resort & Spa. Lovingly crafted in traditional Balinese style, each secluded villa features thatched roofs, local wood finishes and traditional flourishes that blend seamlessly with the jungle surrounds, without compromising on luxury touches. An incredible infinity pool looks out over lush rainforests and dramatic volcanic gulfs. Two restaurants and one bar serve exquisite local fusion meals and tasty cocktails - best enjoyed while watching the sunset ignite the sky in vivid red and gold.\n\nWhen you’re ready to pamper yourself, head to the open-air Lila Ulangun Spa for a massage, soak in the jacuzzi or steam in the sauna. Known as the spiritual capital of Bali, Ubud is home to some of the island’s most famous natural landscapes, terraced rice paddies, Hindu temples and shrines. A peaceful retreat away from the hustle and bustle of the city, Ubud calls for slowing down the pace, reconnecting with nature and checking out from your daily life.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Puri Wulandari A Boutique Resort & Spa",
    "offer_address": "Jalan Raya Kedewatan, Banjar Tanggayuda, Kedewatan, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 779.0,
    "value": 1450.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2ef1QAB",
    "hero_image": "https://images.luxuryescapes.com/ua2rezr20ldnfbrx3tgq",
    "image_two": "https://images.luxuryescapes.com/brbivuxnzfnhk9luvklu",
    "image_three": "https://images.luxuryescapes.com/kbnz2vyluwb2y2a4zbgq",
    "vendor_name": "Nandini Jungle By Hanging Gardens",
    "title": "Secluded Jungle Luxury with Dining and Spa Inclusions, Daily Breakfast and Daily Yoga",
    "description": "Find your slice of jungle paradise at Nandini Jungle Resort & Spa, a serene sanctuary set amid the timeless landscape of Ubud. Discover why this striking resort was voted the Most Outstanding Luxury Hideaway in 2018 as you enjoy daily breakfast, a multi-course lunch and dinner, a 60-minute massage for two, a daily yoga class, daily afternoon tea and minibar refill, a welcome drink with fresh fruit and a 15-minute relaxing ritual on arrival and so much more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Nandini Jungle Resort & Spa Bali - 2019",
    "offer_address": "Banjar Susut, Desa Buahan, Payangan, Bali, 80572 Payangan, Indonesia",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 516.0,
    "value": 1678.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zNcWAAU",
    "hero_image": "https://images.luxuryescapes.com/osdk35ea5riphdbyxebt",
    "image_two": "https://images.luxuryescapes.com/0vkwb0l5qi74p49lbic",
    "image_three": "https://images.luxuryescapes.com/y76p0575yrbkidgqxlu8",
    "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
    "title": "Five-Star Ubud Suite Hideaway with Daily breakfast, Nightly Free-Flow Cocktails, Three-Course Dinner & Hot Air Balloon Ride",
    "description": "Escape to the undulating hills of Ubud in search of serenity and rejuvenation at the five-star Tanah Gajah, a Resort by Hadiprana, an urban sanctuary ranked among Tripadvisor’s top 10% of properties worldwide. This luxury retreat is home to just twenty suites and villas, each featuring unique artwork, traditional elegance and modern-day comforts in natural Balinese surrounds. \n\nHidden within 12 acres of verdant emerald rice paddies, this heavenly resort radiates peace, quiet, and tranquility, and is just ten minutes from the artists' village of Ubud. Unwind with a day of pampering at the spa, indulge in a romantic feast amidst the rice paddies, or learn about Balinese culture with onsite cooking classes and dance performances. Take in Ubud's beauty with a guided tour of the surrounding landscapes, or witness it from above with Bali’s first hot-ballooning adventure. At the end of the day, retreat to your thoughtfully designed suite or villa to rest, recharge and repeat it all over again.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Tanah Gajah, a Resort by Hadiprana",
    "offer_address": "Jalan Raya Goa Gajah, Tengkulak Kaja, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 649.0,
    "value": 1543.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000C4NlVYAV",
    "hero_image": "https://images.luxuryescapes.com/6mem1mle4h7g81nm5nht",
    "image_two": "https://images.luxuryescapes.com/lscfjzfpk14pj0gg0gm",
    "image_three": "https://images.luxuryescapes.com/rwicvpbv2m1sh72rv29",
    "vendor_name": "AnandaDara Ubud Resort & Spa",
    "title": "Tranquil Ubud Jungle Paradise with Daily Breakfast, Nightly Two-Course Dinner & Nightly Cocktails",
    "description": "Located just north of Ubud to the home of Bali’s famous rice terraces, this luxury resort and spa is truly one with its lush natural surroundings. Lose yourself in tranquil landscaped gardens, soak in the poolside hot tub or float away in a romantic flower bath followed by an indulgent river stone massage at the l’santē AnandaDara SPA.\n\nNestled moments from Ubud's culinary scene, the resort's de Daara eateries offer a tantalising blend of flavours, featuring crowd-pleasers like steamed dumplings and crispy pork belly, with its name taken from the Balinese word 'Daar' meaning 'eat'.\n\nWhile staying in Bali's most serene province, make the most of your location with a short drive to the nearby Ulu Petanu Waterfall, shop local art at the Ubud Market and relish in your proximity to the Tegallalang Rice Terraces - Bali's most photographed destination.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "AnandaDara Ubud Resort & Spa",
    "offer_address": "Jalan Tirta Tawar, Beru Abangan, Tegallalang, Ubud 80571, Bali",
    "percentage_discount": 72.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 369.0,
    "value": 1333.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000C4OKzYAN",
    "hero_image": "https://images.luxuryescapes.com/zibacnjzhibuoaee4d3p",
    "image_two": "https://images.luxuryescapes.com/pzorys3pfv5e007t5qul",
    "image_three": "https://images.luxuryescapes.com/yf5kmzg21hjf48jhbxo",
    "vendor_name": "Kayumanis Ubud Private Villa & Spa",
    "title": "Ubud Riverfront Private Pool Villa Oasis with Massages, All-Day Breakfast &  Nightly Cocktails",
    "description": "Escape to Ubud's lush green rice paddies and discover your private slice of island paradise at this five-star boutique retreat, home to just 23 elegantly appointed villas, each offering high-end butler service, a glistening private pool and quintessential Balinese design.\n\nHidden within a tropical forest overlooking the Ayung River, heavenly Kayumanis Ubud Private Villa & Spa radiates tranquillity - yet is just a 15-minute drive from Bali's vibrant cultural capital, Ubud. Indulge in a wealth of wellness treatments at Kayumanis Spa Ubud, or treat yourself to a romantic feast high over the river valley at the Dining Corner.\n\nTake in Ubud's beauty on a guided tour of the city, enrich your home recipes following onsite cooking classes or learn to relax, meditate and harmonise your body through the resort's extensive yoga program.\n\nEmbrace the beauty of the Balinese jungle and the vibrancy of Ubud, home to world-class restaurants and shopping. Take a short drive and discover innumerable nearby temples or the popular Aloha Ubud Swing, a perfect spot to take in sweeping vistas of rice paddies, rainforests, lakes and waterfalls.\n\nVisit thousands of Balinese long-tailed macaque monkeys within their home at the Sacred Monkey Forest Sanctuary, or journey an extra five minutes to Goa Gajah Elephant Cave temple.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Ubud Private Villa & Spa",
    "offer_address": "Jalan Kayumanis Sayan, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 699.0,
    "value": 2195.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000da2DhQAI",
    "hero_image": "https://images.luxuryescapes.com/xoqdf94xh65aqhr9fdvg",
    "image_two": "https://images.luxuryescapes.com/ctry2fgtrdb3e0h0kwx",
    "image_three": "https://images.luxuryescapes.com/vdy3dg3yot07nvojcrtn",
    "vendor_name": "Alila Ubud",
    "title": "Five-Star Ubud Hideaway with Daily Dining & 60-Minute Massage",
    "description": "Amid Ubud’s rolling rice paddies you’ll find Alila, a five-star sanctuary showcasing one of the country’s most iconic infinity pools. Nestled into the Balinese countryside, it's a peaceful oasis with easy access to Ubud's vibrant dining scene.\n\nDiscover true tranquillity and absolute luxury with daily à la carte breakfast, your choice of daily lunch or dinner, daily poolside afternoon tea, a welcome cocktail each at Cabana Lounge, one 60-minute Balinese massage each, private one-way transfer from Denpasar Airport and more.\n\nPlus, one child (aged 11 years and under) stays free with breakfast.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupatén Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Alila Ubud 2019",
    "offer_address": "Desa, Melinggih Kelod, Payangan, Gianyar, Bali 80572, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 619.0,
    "value": 1419.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id2iRAAR",
    "hero_image": "https://images.luxuryescapes.com/ex402a1j1kf7xrl2wt2v",
    "image_two": "https://images.luxuryescapes.com/1dqft7na0qtrp62eiogh",
    "image_three": "https://images.luxuryescapes.com/2zylnjls19rzcpoojslq",
    "vendor_name": "The Samaya Ubud Bali",
    "title": "Tranquil Five-Star Ubud Jungle Villas with Daily Breakfast, Nightly Dinner, Cocktails & Massages",
    "description": "Hidden among Ubud's lush jungled hills, scenic rice terraces and the winding Ayung River, this five-star all-villa tropical sanctuary is one of Bali's best-kept secrets. Adorned with Balinese touches, each spacious villa has been designed to offer the perfect escape for honeymooners, dreamers and families alike - soul-stirring vistas, complimentary butler service and a luxurious private pool come standard here.\n\nSoak up the verdant views of the rice terraces from the resort's open-air breakfast restaurant, Scene, and savour local flavours at the romantic Swept Away, nestled along the riverbank. Balance your body, mind and soul at the world-class The Spa at The Samaya, offering treatments from Balinese couple rituals to shiatsu. Or, if you are culinary-curious, learn how to master regional recipes from the experts in a cooking class.\n\nWhen you're ready to explore, take a stroll through the sacred monkey-filled groves, and admire Ubud's cultural marvels, including ancient temples and art galleries.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Samaya Ubud Bali",
    "offer_address": "Banjar Baung, Desa Sayan, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 869.0,
    "value": 2208.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DJAAOAA5",
    "hero_image": "https://images.luxuryescapes.com/qw3iavnl6aqna6oealsm",
    "image_two": "https://images.luxuryescapes.com/x6rh6qaox4g53ju6yc958",
    "image_three": "https://images.luxuryescapes.com/2aeuj2t8h3kkh4mhdb",
    "vendor_name": "Kappa Senses Ubud",
    "title": "French-Inspired Five-Star Ubud Jungle Luxury with Daily Breakfast, Choice of Lunch or Dinner, Cocktails & Massages by Clarins",
    "description": "Reclaim your inner peace and reawaken your senses at Kappa Senses Ubud, a blissfully secluded hideaway amid the verdant jungle of Ubud. Showcasing luxurious, French-inspired style and a dreamy 1,000sqm OmTara Spa by Clarins, this is the lush capital of well-being in Bali. Picture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort where dreams and reality blend seamlessly.\n\nUnwind in total privacy, then embark on an epicurean journey across the resort’s five restaurants and bars - whose organic produce leads the farm-to-table menus - or enrich your wellness with an innovative treatment at the exceptional OmTara Spa by Clarins.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kappa Senses Ubud",
    "offer_address": "Banjar Tanggayuda, Jalan Taman Sari, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 589.0,
    "value": 1478.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HZqiIAG",
    "hero_image": "https://images.luxuryescapes.com/1d9a3jo9zsj2po7xg689",
    "image_two": "https://images.luxuryescapes.com/o43p877zeogkc7rhosr",
    "image_three": "https://images.luxuryescapes.com/ww8dwck55uags9l8m2ou",
    "vendor_name": "Maya Ubud Resort & Spa",
    "title": "Five-Star Maya Ubud Jungle Retreat with Daily Breakfast, Nightly Dinner & Sunset Cocktails",
    "description": "Soak up acclaimed luxury in the heart of Bali's spectacular spiritual hinterland with a five-star stay at this breathtaking resort.\n\nCradled by the dramatic Petanu River valley and the rolling rice paddies of Peliatan, this tranquil tropical haven effortlessly blends family-friendly fun with the region's legendary calm - spend sun-soaked days indulging at Spa at Maya, surrounded by lush rainforest and gentle river whispers, while little ones adore the resort's Kids' Club and pool.\n\nDesigned to capture the spirit of a traditional Balinese village, this luxury retreat offers a unique taste of Bali's extraordinary tradition of hospitality. Plunge into the shimmering infinity pool overlooking Ubud's enchanting rainforest, take a swing at the tennis courts or practice your breathwork at the resort's innovative tranquil yoga pavilion and rope wall.\n\nReady to explore? It's just a leisurely 20-minute stroll to Ubud's vibrant town centre, with artisan markets, colourful boutiques and world-class restaurants galore.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Maya Ubud Resort & Spa",
    "offer_address": "Jalan Gunung Sari, Peliatan, Gianyar, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 599.0,
    "value": 1868.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMW8AAAX",
    "hero_image": "https://images.luxuryescapes.com/eht4mw7s7ozezjhouzx8",
    "image_two": "https://images.luxuryescapes.com/grdhipwn2nmldxmwrygn",
    "image_three": "https://images.luxuryescapes.com/zm3q8vin3e3wffa7c5bk",
    "vendor_name": "Kappa Senses Ubud",
    "title": "French-Inspired Ubud Jungle Luxury with Daily Breakfast, Nightly Dinner & Nightly Cocktails",
    "description": "Reclaim your inner peace and reawaken your senses at a blissfully secluded five-star hideaway amid the verdant jungle of Ubud. Showcasing luxurious, French-inspired style and the palatial OmTara Spa by Clarins, this is the lush capital of well-being in Bali.\n\nPicture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort plucked from a dream. With five restaurants and bars, there's a sanctuary to satisfy every craving, including Kokokan's innovative fine dining, featuring fresh produce from the resort's onsite organic garden.\n\nFrom peaceful pavilions to the two remarkable jungle-clad pools and myriad walkways leading through lush foliage, this resort naturally integrates first-class facilities with pristine nature. Each day brings new adventures and a plethora of complimentary daily wellness, culture, and foodie activities.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kappa Senses Ubud",
    "offer_address": "Banjar Tanggayuda, Jalan Taman Sari, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 599.0,
    "value": 1475.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zV9IAAU",
    "hero_image": "https://images.luxuryescapes.com/el1wivprn0rbskuix5",
    "image_two": "https://images.luxuryescapes.com/fnn3kew63x1nxt5f20h",
    "image_three": "https://images.luxuryescapes.com/ejk4rsxm5wgupow9ei4o",
    "vendor_name": "Maya Ubud Resort & Spa",
    "title": "Maya Ubud Five-Star Jungle Retreat with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Indulge in five-star bliss at the breathtaking Maya Ubud Resort & Spa - a stunning Balinese sanctuary ranked within the top 10% of properties on Tripadvisor. Cradled by the dramatic Petanu River valley and the rolling rice paddies of Peliatan, Maya Ubud Resort & Spa is a jewel within a tranquil 10-hectare tropical haven.\n\nDesigned to capture the spirit of a traditional Balinese village, this ultra-luxe retreat combines local elegance and hospitality with a true five-star experience. Plunge into the glistening infinity pool overlooking the enchanting forest (with a kids pool for the little ones), experience euphoria at Maya Spa with a rejuvenating treatment beside the swirling waters of the Petanu River, or spend each morning aligning your chakras at the tranquil yoga pavilion. For a day out, it's just a leisurely 20-minute stroll to vibrant Ubud town with its artisan markets, colourful boutiques, and world-class restaurants.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Maya Ubud Resort & Spa",
    "offer_address": "Jalan Gunung Sari, Peliatan, Gianyar, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 575.0,
    "value": 1568.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JLrcIAG",
    "hero_image": "https://images.luxuryescapes.com/d7355iie6ffd0akgz6",
    "image_two": "https://images.luxuryescapes.com/4kv54wdhxl0567fc7mta",
    "image_three": "https://images.luxuryescapes.com/obik7ttddrja86rxptx",
    "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
    "title": "Award-Winning Ubud Luxury Suites & Villas with US$300 Spa Credit & Daily Breakfast, Dinner & Free-Flow Cocktail Hour",
    "description": "Escape to the undulating hills of Ubud in search of serenity and rejuvenation at this multi-award-winning retreat. Home to just twenty suites and villas, each offering extensive club benefits, this boutique haven has been named one of The Best Upcountry Hotels in Indonesia by Travel + Leisure and past accolades include a spot in the world's top hotels.\n\nHidden within 12 acres of verdant, emerald-green rice paddies, this heavenly resort radiates peace, quiet and tranquillity, just ten minutes from the artists' village of Ubud. Rediscover the meaning of relaxation with a day of pampering at the spa, take to the skies with a hot-ballooning adventure or learn about Balinese culture with onsite cooking classes and dance performances.\n\nIndulge in culinary excellence at The Tempayan, a Balinese open-air restaurant offering uninterrupted views of the rice fields. Enjoy a daily a la carte breakfast and two-course lunch or dinner, plus savour the nightly free-flow cocktail hour while soaking in the serene ambience. Treat yourself to an exquisite afternoon tea experience at the Panen Padi Lounge, where tranquillity meets the finest refreshments.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Tanah Gajah, a Resort by Hadiprana",
    "offer_address": "Jalan Raya Goa Gajah, Tengkulak Kaja, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 929.0,
    "value": 3139.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006Bs7dAAC",
    "hero_image": "https://images.luxuryescapes.com/wk5o6ntjyu92vxlfp509",
    "image_two": "https://images.luxuryescapes.com/4naqyh3twap88ke8a1a",
    "image_three": "https://images.luxuryescapes.com/jsqunwwo40ybo88ynxn",
    "vendor_name": "Alila Ubud",
    "title": "Five-Star Alila Ubud Jungle Hideaway with World-Famous Infinity Pool, Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Discover the epitome of jungle bliss with a five-star, secluded escape to Alila Ubud, nestled high above the Ayung River Valley and around 15 minutes from Ubud's centre. Ranked among Tripadvisor’s top 10% of properties worldwide, this serene jungle hideaway - with many rooms providing panoramic views of the luscious valley below - offers the utmost in luxury and seclusion, sprawled across the hillside and hidden among world-famous rice paddies.\n\nBe led down the path to wellbeing as you align your chakras with daily yoga or tai chi and melt away tension at Spa Alila, where treatments combine traditional techniques with modern wellness knowledge. Savour authentic farm-to-table Balinese cuisine and Western classics at Plantation Restaurant or opt for something a little more relaxed by the world-famous infinity pool - previously recognised by Vogue Australia as one of the most beautiful in Bali. For the romantics, you may even choose to dine hidden among the jungle vegetation or amid the garden’s towering stone pillars with views over the rice terraces. As day turns into serene evening, Cabana Lounge offers handcrafted cocktails to cheers your jungle escape.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Alila Ubud",
    "offer_address": "Desa Melinggih Kelod, Payangan, Gianyar, Bali 80572, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 619.0,
    "value": 1459.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuqUKAAZ",
    "hero_image": "https://images.luxuryescapes.com/prvcw4xvrfc8ndkjrt4",
    "image_two": "https://images.luxuryescapes.com/wt3769klsu1so36p02tf",
    "image_three": "https://images.luxuryescapes.com/y19jftqj2uls5lebw0c",
    "vendor_name": "Aksari Resort Ubud",
    "title": "Tranquil Northern Ubud Hideaway with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Enjoy some well-earned rest and indulge in peaceful tranquillity deep in the heart of the jungle in one of Aksari Resort Ubud’s relaxing suites. The impressive resort boasts unparalleled, sweeping views of Bali's picturesque, lush green valleys accompanied by the finest traditional Balinese touches. Found just 25 minutes from the centre of Ubud, spend your days exploring one of Bali's hotspots or visit the Tegalalang Rice Terraces, a much-loved attraction for tourists from all over the globe. Closer to home, embrace the air of romance found across the resort and take a dip in the cascading infinity pool perched over the jungle, offering seemingly endless views of the verdant forest.\n\nWhere breathtaking beauty and serenity meet, this resort is the perfect destination if relaxation is at the front of your mind. Indulge in a soothing massage or spa treatmeant at Svaha Spa - the perfect place to refresh and recharge both your body and your mind. Then, finish each day on a high note with a delicious cocktail and authentic Indonesian dining experience at Ankhusa - one of the resort's onsite restaurants.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tegallalang",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Aksari Luxury Resort & Spa Ubud by Ini Vie Hospitality",
    "offer_address": "88 Jalan Raya Desa Kenderan, Kenderan, Ubud, Bali 80561, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 499.0,
    "value": 1048.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EQlcjYAD",
    "hero_image": "https://images.luxuryescapes.com/0neve80kc3o7koggacc2",
    "image_two": "https://images.luxuryescapes.com/jfv2ytfh7e8sslvbu25",
    "image_three": "https://images.luxuryescapes.com/ksqp4au0r9872vgau94",
    "vendor_name": "Kamandalu Resort & Spa",
    "title": "Ubud Private Jungle Villas with All-Inclusive Dining, Nightly Cocktails & Massages",
    "description": "Hidden among Ubud’s rice terraces and perched above the flowing Petanu River, this collection of five-star private villas is an enchanting Balinese hideaway. Dive into one of Ubud's most expansive infinity pools, sip on a refreshing tropical cocktail from the swim-up bar and gaze upon the lush jungle scenery.\n\nTraditional thatched-roof villas inspired by local villages offer a slice of seclusion, some featuring their own private pool. With all meals included in your stay, take advantage of the exquisite onsite venues: indulge in authentic Indonesian cuisine with an extensive wine selection at Petulu Restaurant and enjoy fresh international flavours at the poolside Aira Cafe. Drift into pure Balinese bliss with a massage at the Chaya Spa and daily morning shared yoga sessions.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kamandalu Ubud",
    "offer_address": "Jl. Raya Andong, Banjar Nagi, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 659.0,
    "value": 1647.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HiIaAAK",
    "hero_image": "https://images.luxuryescapes.com/vaf7jkci6trp1f9uxo9",
    "image_two": "https://images.luxuryescapes.com/mwmru2breq7g5aqa9dd",
    "image_three": "https://images.luxuryescapes.com/0bleg9zvnp4p3w2zdakn",
    "vendor_name": "Maya Ubud Resort & Spa",
    "title": "Five-Star Maya Ubud Serenity with Daily Breakfast, Daily Lunch or Dinner & Massages",
    "description": "Indulge in the ultimate feeling of five-star bliss at the breathtaking Maya Ubud Resort & Spa - a stunning Balinese sanctuary that offers guests complete serenity. Cradled by the dramatic Petanu River valley and the rolling rice paddies of Peliatan, Maya Ubud is a jewel within a tranquil 10-hectare tropical haven. From here, it's a leisurely 20-minute stroll to vibrant Ubud town with its artisan markets, colourful boutiques and world-class restaurants.\n\nDesigned to capture the spirit of a traditional Balinese village, this ultra-luxe retreat combines local elegance and hospitality with a true five-star experience. Reconnect with nature and plunge into the glistening infinity pool overlooking the enchanting forest, experience euphoria at Maya Spa with a rejuvenating treatment beside the swirling waters of Petanu River, or spend each morning aligning your chakras at the tranquil yoga pavilion. Live the good life in a beautiful suite or villa, bathed in natural light and boasting vistas across the lush surrounds.\n\n**Your handpicked inclusions:**\n\n- Wake up to delicious daily à la carte or buffet breakfast at the relaxing Mayasari restaurant\n- Indulge in your choice of daily lunch or dinner at Mayasari restaurant or Tree Bar\n- Feel the valley breeze with daily afternoon tea at Tree Bar\n- Experience ultimate bliss with a 60-minute spa treatment for two\n- Choose the perfect evening to enjoy your one-time sunset cocktail per adult at Tree Bar\n- Inter-hotel transfers between Maya Ubud and [Maya Sanur](https://luxuryescapes.com/offer/maya-sanur-bali-indeonesia/0062y000005HiIkAAK)\n- Enjoy a convenient one-way private airport arrival or departure transfer\n- Up to two children (up to 17) stay free with daily breakfast only\n\n**Ready to discover more of Indonesia?** Extend your stay with a luxe escape to [Maya Sanur](https://luxuryescapes.com/au/offer/maya-sanur-bali-indeonesia/0062y000005HiIkAAK), the resort's sister property, and enjoy complimentary inter-resort transfers.\n\n**Pool villa upgrade available:** Plunge into your own private pool when you choose a Heavenly Pool Villa, also boasting a private jacuzzi and outdoor shower.\n\n**Travelling with family?** Make memories with the whole family, as up to two children (up to 17 years) stay free with daily breakfast.\n\n**Book with 100% Confidence:** If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Maya Ubud Resort & Spa",
    "offer_address": "Jalan Gunung Sari, Peliatan, Gianyar, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 579.0,
    "value": 1395.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EJDfrYAH",
    "hero_image": "https://images.luxuryescapes.com/8zjid2kjq7hdqpxfdbb",
    "image_two": "https://images.luxuryescapes.com/r8neaatwbj0wk3m8yne9",
    "image_three": "https://images.luxuryescapes.com/r0hzpb6dmsh779jptf7",
    "vendor_name": "Kappa Senses Ubud",
    "title": "French-Inspired Ubud Luxury with Daily Breakfast, Nightly Dinner & Nightly Cocktails",
    "description": "Reclaim your inner peace and reawaken your senses at a blissfully secluded five-star hideaway amid the verdant jungle of Ubud. Showcasing luxurious, French-inspired style and the dreamy 1,000sqm OmTara Spa by Clarins, this is the lush capital of wellbeing in Bali.\n\nPicture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort where dreams and reality blend seamlessly.\n\nFrom the peaceful pavilions to the two remarkable jungle-clad pools and myriad of walkways leading through lush foliage, this resort naturally integrates first-class facilities with pristine nature. Each day brings new adventures with a plethora of complimentary daily wellness, culture, and foodie activities on offer.\n\nSink into a sunbed by the retreat pool,  experience the freedom of gliding high above the trees on a swing, and then embark on an epicurean journey across the resort’s five restaurants and bars before enriching yourself with a treatment at the exceptional OmTara Spa by Clarins.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kappa Senses Ubud",
    "offer_address": "Banjar Tanggayuda, Jalan Taman Sari, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 439.0,
    "value": 870.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Iih5IAC",
    "hero_image": "https://images.luxuryescapes.com/jmkg5sihs2wa9gdvy18",
    "image_two": "https://images.luxuryescapes.com/xv5qexwkhps9bmbfe2ei",
    "image_three": "https://images.luxuryescapes.com/oo9rhlwn9te1k7na3uku",
    "vendor_name": "Suara Alam Ubud by Ini Vie Hospitality",
    "title": "Ubud Adults-Only Retreat with Daily Breakfast, Daily Choice of Lunch or Dinner & Three Onsite Pools",
    "description": "Weave your way through rice paddies to this adults-only stay in the heart of Ubud. Spend your days unwinding by one of three pools, with an ice-cold beer in hand, before setting out to explore the humming streets of the town's centre.\n\nAn ideal getaway for honeymooners, Suara Alam Ubud seamlessly balances natural surroundings with contemporary comforts. Just a short drive from Ubud's vibrant craft stalls, sacred historical sites and streets vibrating with gamelan music, this retreat ensures a traditional Balinese experience.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Suara Alam Ubud",
    "offer_address": "88 Jalan Tirta Tawar, Petulu, Kecamatan, Kabupaten Gianyar, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 304.0,
    "value": 670.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dakG9QAI",
    "hero_image": "https://images.luxuryescapes.com/7hjfmetqwmdottc8h4",
    "image_two": "https://images.luxuryescapes.com/apksi3zstbmegismrhzk",
    "image_three": "https://images.luxuryescapes.com/3wjflkk2h4upizhcjbnk",
    "vendor_name": "Kayangan Villa Ubud",
    "title": "Grand Opening: Private Villa Getaway in Ubud",
    "description": "Escape it all in a private villa nestled amidst the rice paddies and tropical jungle of Ubud, staying at the new Kayangan Villa Ubud. Your stay includes daily a la carte breakfast, daily afternoon tea, two a la carte dinners, private one-way airport transfer and a 60-minute Balinese massage each.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tegallalang",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kayangan Villa Ubud",
    "offer_address": "Kenderan, Tegallalang, Gianyar, Bali 80561, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 309.0,
    "value": 779.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMMwOAAX",
    "hero_image": "https://images.luxuryescapes.com/e31q9k683a7sibgpfkdr",
    "image_two": "https://images.luxuryescapes.com/02keh2gzo3yzif08bfar",
    "image_three": "https://images.luxuryescapes.com/hn5130u8q9p4gquc1md",
    "vendor_name": "AnandaDara Ubud Resort & Spa",
    "title": "Tranquil Ubud Resort Near Iconic Rice Terraces with Daily Breakfast, Daily Lunch or Dinner & Cocktails",
    "description": "Venture into the tropics of Tegallalang, a province just north of Ubud home to Bali’s famous rice terraces and a luxury resort that feels native to its lush surroundings. At AnadaDara Ubud Resort & Spa, lose yourself in the tranquillity of the meticulously landscaped gardens, soak in the heated poolside jacuzzi with views of the lush jungle and rice paddies, or choose to float away in a romantic flower bath at L’Sante Spa, followed by an indulgent river stone massage. \n\nAlthough only moments from Ubud’s culinary offerings, the resort's own restaurant, deDaara Eateries, boasts a diverse menu of Western and Asian favourites that make staying in feel like a treat.\n\nWhile staying in Bali's most tranquil province, make the most of your location with a short drive to the nearby Ulu Petanu Waterfall, shop local art at the Ubud Market and relish in your proximity to the Tegallalang Rice Terraces - Bali's most photographed destination.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "AnandaDara Ubud Resort & Spa",
    "offer_address": "Jalan Tirta Tawar, Beru Abangan, Tegallalang, Ubud 80571, Bali",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 359.0,
    "value": 823.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GBlAAAW",
    "hero_image": "https://images.luxuryescapes.com/g9v21kh9ond42pe74u",
    "image_two": "https://images.luxuryescapes.com/a8l1zf8kcf0skth1imm9",
    "image_three": "https://images.luxuryescapes.com/env64kr9da28zdt9v6nv",
    "vendor_name": "Ubud Nyuh Bali Resort and Spa",
    "title": "Ubud Private Pool Villas with Floating Breakfast, Delicious Dining & Daily Cocktails",
    "description": "Escape to a private pool villa oasis at Ubud Nyuh Bali Resort & Spa, a tranquil wellness oasis in Bali's cultural heartland. Prepare to be nurtured, inspired and reinvigorated amid Ubud’s serene jungles and rice paddies. The resort is a stunning mix of traditional and modern design, made up of spacious villas, each with a private pool. The resort’s Lumbini Restaurant serves up delicious, nourishing food and herbal detox drinks (as well as mouthwatering handcrafted cocktails... you are on holiday, after all). Treat your mind, body and soul to daily yoga classes, leisurely morning walks to the lush green rice fields and complimentary bicycle hire.\n\nUbud is the perfect hideaway for soul searching and cultural experiences. Spend a day exploring the endless rice fields, an abundance of healthy cafés and the lush jungle of Ubud with scheduled shuttle transfers around the Ubud area.\n\n**Your handpicked inclusions:**\n\n- Wake up to daily à la carte breakfast at Lumbini Restaurant\n- Enjoy a one-time upgrade to a decadent floating breakfast in your villa’s private pool\n- Tuck into daily afternoon tea at Lumbini Restaurant\n- Indulge with a one-time two-course set menu lunch or dinner at Lumbini Restaurant\n- Toast your escape with a daily handcrafted cocktail per person\n- Go with the flow with daily morning yoga and rice field walks\n- Enjoy easy exploration with complimentary use of the resort’s bicycles\n- Feel invigorated with a daily herbal detox drink each\n- Be welcomed to the resort with a plate of fresh seasonal fruits\n- Complimentary shuttle service to Ubud centre, as per the resort’s schedule\n- Stay in the moment with 1pm late checkout, subject to availability\n\n**Travelling with friends or family?** Upgrade to the Two Bedroom Pool Villa for up to four guests.\n\n**Book with 100% Confidence:** Right up until 14 days before check-in you can enjoy unlimited, free date changes, or cancel and get a 100% credit to use at Luxury Escapes for any other Limited Time Lux Exclusive accommodation, tour or cruise offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Ubud Nyuh Bali Resort & Spa",
    "offer_address": "Jl. Raya Silungan, Lodtunduh, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 255.0,
    "value": 701.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNRSQAA5",
    "hero_image": "https://images.luxuryescapes.com/g6wit25oteqy6vixcid9",
    "image_two": "https://images.luxuryescapes.com/97v8kwos7j9ev9wve0n7o",
    "image_three": "https://images.luxuryescapes.com/2o204zpv5yyw1lluyuwh",
    "vendor_name": "Maya Ubud Resort & Spa",
    "title": "Five-Star Maya Ubud Jungle Retreat with Daily Breakfast, Nightly Dinner & Sunset Cocktails",
    "description": "Soak up acclaimed luxury in the heart of Bali's spectacular spiritual hinterland with a five-star stay at the breathtaking Maya Ubud Resort & Spa. Cradled by the dramatic Petanu River valley and the rolling rice paddies of Peliatan, this tranquil tropical haven effortlessly blends family-friendly fun with the region's legendary calm - spend sun-soaked days indulging at Spa at Maya, surrounded by lush rainforest and gentle river whispers, while little ones adore the resort's brand-new Kids' Club and pool.\n\nDesigned to capture the spirit of a traditional Balinese village, this luxury retreat offers a unique taste of Bali's extraordinary tradition of hospitality. Plunge into the shimmering infinity pool overlooking Ubud's enchanting rainforest, take a swing at the tennis courts or practice your breathwork at the resort's innovative tranquil yoga pavilion and rope wall. Ready to explore? It's just a leisurely 20-minute stroll to Ubud's vibrant town centre, with artisan markets, colourful boutiques and world-class restaurants galore.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Maya Ubud Resort & Spa",
    "offer_address": "Jalan Gunung Sari, Peliatan, Gianyar, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 72.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 640.0,
    "value": 2313.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EWw0oYAD",
    "hero_image": "https://images.luxuryescapes.com/z6sce0tr3an5ya4m311g",
    "image_two": "https://images.luxuryescapes.com/quyoz2cz9l09cyyx9x2c",
    "image_three": "https://images.luxuryescapes.com/jifjtutyumxx86dbg2wn",
    "vendor_name": "Dedary Resort Ubud",
    "title": "Ubud Private Pool Villas with Daily Breakfast, Daily Lunch or Dinner & Nightly Beer",
    "description": "Experience Bali with a stay at Dedary Resort, boasting villas surrounded by tropical gardens and rice fields. Stay in secluded, modern private pool villas, while also remaining close to Ubud Art Market and the Sacred Monkey Forest Sanctuary.\n\nEnjoy traditional local treatments at the spa, immerse yourself in Balinese rituals with a dance, craft or music class, or while away the day by your private pool. With staff on hand to look after your every need, you can sit back, relax and rejuvenate.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tegallalang",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Dedary Resort",
    "offer_address": "Banjar Pinjul No.8, Kenderan, Kec. Tegallalang, Kabupaten Gianyar, Bali 80571",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 353.0,
    "value": 874.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mMoyAAE",
    "hero_image": "https://images.luxuryescapes.com/w6cpro8gdo6xdbo794yt",
    "image_two": "https://images.luxuryescapes.com/kat93if28rtfcwzwwwa",
    "image_three": "https://images.luxuryescapes.com/rjqe2122nd2vybah6pp",
    "vendor_name": "Sanctoo Suites & Villas",
    "title": "Five-Star Ubud Suite Retreat with Daily Breakfast, Nightly Dinner & Unlimited Bali Zoo Access",
    "description": "Indulge in five-star jungle bliss at Sanctoo Suites & Villas, a serene sanctuary tucked away in the region of Gianyar, adjacent to Bali Zoo and around 20 minutes from Ubud's centre. This peaceful patch is inspired by its locale, with a lagoon pool that mimics the natural water holes of the African savannah and tranquil vistas over Wos River. Revive your senses at Sanctoo Spa with a hot stone massage or organic facial or visit The Sanctoo Restaurant for a wholesome Balinese dishes served alongside international favourites with a focus on fresh organic ingredients. \n\nGet up close and personal with the animals that call Bali Zoo home, many of which are endemic to Indonesia, or take the complimentary shuttle to the nearby village of Singapadu, where you will be immersed in the local culture through the restaurants, boutiques, and galleries.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Sukawati",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Sanctoo Suites & Villas 22",
    "offer_address": "Raya 80582, Indonesia, Jl. Ulun Suwi 2, Singapadu, Kec. Sukawati, Kabupaten Gianyar, Bali 80582, Indonesia",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 299.0,
    "value": 420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gfks2AAB",
    "hero_image": "https://images.luxuryescapes.com/a3hx77ndn7207b6jymi",
    "image_two": "https://images.luxuryescapes.com/fu8p40k5clarah1j2xj",
    "image_three": "https://images.luxuryescapes.com/ezmpy4rs2beuk3szzm9f",
    "vendor_name": "Kappa Senses Ubud",
    "title": "French-Inspired Five-Star Ubud Jungle Luxury with Daily Breakfast & Nightly Cocktails",
    "description": "Reclaim your inner peace and reawaken your senses at Kappa Senses Ubud, a blissfully secluded hideaway amid the verdant jungle of Ubud. Showcasing luxurious, French-inspired style and the dreamy 1,000sqm OmTara Spa by Clarins, this is the lush capital of wellbeing in Bali. Picture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort where dreams and reality blend seamlessly.\n\nUnwind in total privacy, then embark on an epicurean journey across the resort’s five restaurants and bars, whose farm-to-table menus are lead by organic produce, or enrich yourself with an innovative treatment at the exceptional OmTara Spa by Clarins.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kappa Senses Ubud",
    "offer_address": "Banjar Tanggayuda, Jalan Taman Sari, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 22,
    "price": 412.0,
    "value": 953.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002It8DIAS",
    "hero_image": "https://images.luxuryescapes.com/dy39bscevg6kdp4aco99",
    "image_two": "https://images.luxuryescapes.com/3t5fmrs6pvse9ajr34ks",
    "image_three": "https://images.luxuryescapes.com/b7wtq31xbfmd4ybd3wr",
    "vendor_name": "Arkamara Dijiwa Ubud",
    "title": "Romantic Ubud Jungle Escape with Daily Breakfast, Nightly Cocktails & Massages",
    "description": "Experience the Island of Gods with an escape to a tropical sanctuary inspired by a traditional Balinese village. This boutique haven is surrounded by expansive rice terraces and a lush rainforest, offering a serene retreat from the world. \n\nEach suite or villa is a sanctuary of Balinese elegance, with handcrafted furnishings and private outdoor areas overlooking the verdant landscape.\n\nIndonesian flavours await at Kaukau restaurant, while Kamalini Spa offers a space to find your inner balance with traditional Balinese massages. Step out to explore Ubud and the traditional markets, or stay in and enjoy Balinese dance classes or cocktail mixology lessons. \n\nA short drive will take you to the sacred Tirta Empul Temple where you can connect spiritually with the soul of Bali.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Arkamara Dijiwa Ubud",
    "offer_address": "Jalan Katik Lantang, Singakerta, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 369.0,
    "value": 663.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4WCyQAN",
    "hero_image": "https://images.luxuryescapes.com/iqkgb3vpjsqb08rgnisx",
    "image_two": "https://images.luxuryescapes.com/lzwltvsu7u2mkmk3lxsr",
    "image_three": "https://images.luxuryescapes.com/dsetayubtvbyslyhemws",
    "vendor_name": "Ubud Nyuh Bali Resort and Spa",
    "title": "Lavish Retreat with Daily Lunch or Dinner, Massages & Afternoon Tea",
    "description": "Experience high-end indulgence at the Ubud Nyuh Bali Resort and Spa. Think: A-list luxury meets serene retreat. Rejuvenate your body and refresh your mind with a three or five-night stay in a villa with your own private pool, daily a la carte breakfast, daily afternoon tea, daily two-course lunches or dinners, one-way airport transfer, transfers around Ubud, daily yoga classes and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Ubud Nyuh Bali Resort and Spa OLD OLD",
    "offer_address": "Jl. Raya Silungan, Lodtunduh, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 492.0,
    "value": 1052.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dqr9DAAR",
    "hero_image": "https://images.luxuryescapes.com/s9rzqhd1s5pdqwigj6",
    "image_two": "https://images.luxuryescapes.com/mp3f8p0d9jlao5qp3zu",
    "image_three": "https://images.luxuryescapes.com/lwhjpo1luv20fnv6uxp",
    "vendor_name": "Visesa Ubud Resort",
    "title": "Five-Star Ubud Jungle Retreat with Daily Breakfast & Nightly Dinner",
    "description": "Immerse yourself in the lush monkey-dotted rainforests, flavoursome restaurants and verdant rice paddies of Bali’s spiritual heart by staying in absolute tranquillity at Visesa Ubud Resort. This verdant resort dotted across a beautiful green 6.5-hectare site is the ultimate hideaway for couples and families alike. Participate in the daily animal parade, send the kids to the fabulous Kids' Club and enjoy Balinese dance classes before retreating to your private sanctuary. Hidden within a tropical forest overlooking the Sakti River, it radiates seclusion- yet is just 10 minutes from Bali's vibrant cultural capital, Ubud.\n\nWith its lush green jungle, rice paddies as far as the eye can see and emphasis on wellness and relaxation, Ubud offers an authentic Balinese experience. Visesa Ubud Resort is designed to emulate a real Balinese village - indulge in authentic local flavours at Lesung Restaurant, enrich your home recipes with onsite cooking classes or learn to relax, meditate and harmonise your body through the resort's extensive yoga program.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Visesa Ubud Resort",
    "offer_address": "JL. Suweta, Bentuyung Sakti, Ubud, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 29,
    "price": 489.0,
    "value": 1082.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000QueXdQAJ",
    "hero_image": "https://images.luxuryescapes.com/cnfnzftnvv9mt6eucxmz",
    "image_two": "https://images.luxuryescapes.com/msz7st7eavuenxjsxjgd",
    "image_three": "https://images.luxuryescapes.com/lhn6kiqisk9hkq00oego",
    "vendor_name": "Visesa Ubud Resort",
    "title": "Authentic Balinese Escape in Ubud",
    "description": "Enjoy a luxurious Balinese getaway with a difference staying at the breathtaking, five-star Visesa Ubud, a 6.5-hectare resort complete with lush rice paddies and working farmland. Includes 24-hour butler service, daily breakfast, exotic dining experiences, massages, cocktails, return airport transfers and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Visesa Ubud Resort 2018",
    "offer_address": "Bentuyung Sakti, Jl. Suweta, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 74.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 373.0,
    "value": 1420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LrvzAAC",
    "hero_image": "https://images.luxuryescapes.com/xcp274xzogrwo0ordjc",
    "image_two": "https://images.luxuryescapes.com/85va6px8uvoqtg1tuh9",
    "image_three": "https://images.luxuryescapes.com/9o63xrjf2tx4b8azvfqm",
    "vendor_name": "The Garcia Ubud",
    "title": "Grand Opening: Luxe Ubud Sanctuary with Daily Dining & Cocktails",
    "description": "A haven of tranquility, The Garcia Ubud is a brand-new sanctuary where wellness and luxury combine, just a stone’s throw from Ubud's vibrant dining scene. Surrounded by nature and the resort's glittering swimming pools, spa and rooftop yoga pavilion, you’ll feel instantly grounded by the sprawling rice terraces and tropical forestry.\n\nExperience the pinnacle of Balinese romance at this brand-new retreat with daily à la carte breakfast, your choice of daily three-course lunch or dinner, one daily cocktail per adult and a 60-minute massage per person.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Garcia Ubud",
    "offer_address": "Jl. Raya Silungan, Lodtunduh, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 359.0,
    "value": 703.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VdQIAA0",
    "hero_image": "https://images.luxuryescapes.com/rpakm7hw13vyrtbqe4",
    "image_two": "https://images.luxuryescapes.com/0zo29z3oedq3g7nx1em8",
    "image_three": "https://images.luxuryescapes.com/wnx9706sl6nhafpfxtem",
    "vendor_name": "Viceroy Bali",
    "title": "Top-Rated Five-Star Ubud Retreat with Private Pool, Daily Breakfast & Cocktails",
    "description": "Experience the pinnacle of paradise at Viceroy Bali, a five-star sanctuary rated among the top 1% of properties worldwide on Tripadvisor. Sitting on a steep ravine, overlooking the Petanu Valley, this luxury hotel is surrounded by rich Balinese jungle but is just ten minutes from the centre of bustling Ubud. Here, you’ll find some of the island’s best restaurants, magnificent markets and independent boutiques, full of unique artisan gifts.\n\nIntimate and family-run (a true rarity for a five-star hotel in Bali), Viceroy Bali is home to 40 suites and villas, with sweeping views of perfectly placed palm trees, private pools and luxurious amenities. Part of the prestigious Small Luxury Hotels of the World Collection, the resort was once named the Best Resort in the World in the Condé Nast Traveler Readers' Choice Awards. While leaving your sumptuous sanctuary is optional, there’s more to explore. Discover true tranquility at Lembah Spa, where treatments combine traditional Balinese techniques with modern wellness knowledge. Sample Ubud’s finest dining at Apéritif, the 1920s-inspired restaurant and bar that celebrates high-quality ingredients and global influences through a distinguished degustation menu, or opt for something a little more relaxed at Cascades Restaurant Ubud, where traditional Indonesian dishes sit beside western classics.\n\n**Luxury Escapes inclusions:**\n\n- Wake up in rainforest paradise with delicious daily à la carte breakfast at Cascades Restaurant Ubud\n- Enjoy a daily cocktail or mocktail per person at either Apéritif or Cascades Restaurant Ubud - the perfect sundowner\n- Unwind with a 60-minute couple's massage at Lembah Spa, a magnificent retreat overlooking the Petanu River gorge\n- Celebrate with a special one-time three-course gourmet dinner served at Cascades Restaurant Ubud\n- A convenient one-way transfer from Bali Airport to whisk you away to this calm oasis\n\n**Longer-Stay Bonus Inclusions:** Extend your stay to five nights and enjoy an eight-course degustation dining experience at Apéritif once during your stay. Seven-night stays can look forward to two three-course dinners at Cascades Restaurant Ubud and two 60-minute couple's massages at Lembah Spa. See individual packages for details.\n\n**Villa Upgrade:** Looking for added luxury? Upgrade to a beautiful Terrace Villa or Deluxe Terrace Villa to enjoy your own infinity-edge pool and traditional thatched Balinese pavilion. \n\n**Deluxe Terrace Villa Bonus Inclusion:** choose this heavenly villa, boasting contemporary style and a larger infinity pool, to enjoy nightly three-course dinners at Cascades Restaurant Ubud.\n\n**Tripadvisor Travellers' Choice, Best of the Best 2020** Top 25 Hotels for Romance - Asia\n\n**Book with 100% Confidence:** Right up until 14 days before check-in you can enjoy unlimited, free date changes, or cancel and get a 100% credit to use at Luxury Escapes for any other Limited Time Lux Exclusive accommodation, tour or cruise offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Viceroy Bali",
    "offer_address": "Jl. Lanyahan, Br. Nagi, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 939.0,
    "value": 2909.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UNtfAAG",
    "hero_image": "https://images.luxuryescapes.com/27uz48opmf3nmnbwapo",
    "image_two": "https://images.luxuryescapes.com/59mqfun4ua72jksfv2o",
    "image_three": "https://images.luxuryescapes.com/4lannrwcipztqgiuwi92",
    "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
    "title": "Award-Winning Ubud Club Suites with Butler Service, Nightly Free-Flow Cocktails & Hot Air Balloon Ride",
    "description": "Escape to the undulating hills of Ubud to find sumptuous serenity at the exclusive Tanah Gajah, a Resort by Hadiprana (formerly The Chedi Club). Sitting among 12 acres of verdant rice paddies, this exclusive estate guarantees peace and quiet but is just 3km from the artists’ village of Ubud, where remarkable restaurants and galleries await. This unbelievable resort is rated in the top 1% worldwide on Tripadvisor and was named among the Tripadvisor Travellers’ Choice, Best of the Best 2020 Top 25 Boutique Luxury Hotels in the world.\n\n**Your handpicked inclusions:**\n\n- Wake up to à la carte breakfast at The Tempayan every morning\n- Enjoy one three-course lunch or dinner at The Tempayan\n- Arrive or depart in total comfort with a one-way airport transfer\n- Enjoy Club Lounge access with daily afternoon tea between 4pm and 6pm and daily free-flow sunset cocktails between 6pm and 7pm\n- Make the difficult choice between a 90-minute Balinese couples massage or a hot air balloon ride\n- It's an impossible choice: rice field trekking or Campuhan Hill trekking followed by a sunset cocktail\n- Be welcomed with a refreshing drink on arrival\n- From poolside pampering to unpacking, your private butler will look after your every need\n- Get seasonal fresh fruits delivered to your villa or suite daily\n- Never go hungry or thirsty with a complimentary minibar, restocked daily with beer, juices, soft drinks and snacks\n- Daily laundry service for up to six pieces per person (excluding dry cleaning)\n- Travel to and from Ubud centre in style with the resort's private car service\n- Stay connected with Wi-Fi access in the suite/villa and public areas\n- Make memories to last with one 30-minute photo session and one complimentary digital photo\n\n**Travelling with friends or family?** For a little extra space, upgrade to the Two Bedroom Club Family Pool Villa, where a tropical garden, private pool and outdoor bathtub await (packages valid for four guests).\n\n**Tripadvisor Travellers’ Choice, Best of the Best 2020** Top 25 Boutique Luxury Hotels - World",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Tanah Gajah, a Resort by Hadiprana - April 2021",
    "offer_address": "Tengkulak Kaja, Jl. Raya Goa Gajah, Kemenuh, Ubud, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 629.0,
    "value": 1492.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006R8eGAAS",
    "hero_image": "https://images.luxuryescapes.com/9pizdu35wqkbhk5lg4yj",
    "image_two": "https://images.luxuryescapes.com/jrjs7695qs3c1x2gudjq",
    "image_three": "https://images.luxuryescapes.com/gre7gtwmlh3c8fbixxb",
    "vendor_name": "Sanctoo Suites & Villas",
    "title": "Five-Star Ubud Retreat with Daily Breakfast, Daily Lunch or Dinner & Unlimited Bali Zoo Access",
    "description": "Indulge in five-star jungle bliss at Sanctoo Suites & Villas, tucked away in the region of Gianyar, adjacent to Bali Zoo and around 20 minutes from Ubud's centre. This peaceful patch is inspired by its locale, with a lagoon pool that mimics the natural water holes of the African savannah and tranquil vistas over Wos River. Revive your senses at Sanctoo Spa with a hot stone massage or organic facial, and explore the surrounding rice paddies with a local guide.\n\nGet up close and personal with the animals that call Bali Zoo home, many of which are endemic to Indonesia, or take the complimentary shuttle to the nearby village of Singapadu, where you will be immersed in the local culture through the restaurants, boutiques, and galleries. At the end of the day, rely on Sanctoo Restaurant for sensational sustenance, with traditional Balinese dishes served alongside Western classics.\n\n**Your** **handpicked inclusions:**\n\n- Up to two children (11 years and under) stay, play and eat free\n- Enjoy daily breakfast and your choice of daily three-course lunch or dinner\n- Sip on one daily sunset cocktail per adult\n- Travel in style with roundtrip airport transfers\n- Get up close and personal with the animals with unlimited entry to Bali Zoo\n- Unwind with a one-time 60-minute massage for two adults\n- Experience the local culture with a Balinese village tour\n- Extend that holiday feeling with guaranteed 1pm late checkout\n\n**One Bedroom Riverside Pool Villa Upgrade:** Up the romance with a stay in the One Bedroom Riverside Pool Villa, where you can laze by your private pool while gazing over the spectacular Wos River.\n\n**Travelling with** **family?** Up to two children (11 years and under) stay, play and eat free, sharing existing bedding. Children will receive all inclusions except cocktails and massages.\n\n**Book with 100% Confidence:** Right up until 14 days before check-in you can enjoy unlimited, free date changes, or cancel and get a 100% credit to use at Luxury Escapes for any other Limited Time Lux Exclusive accommodation, tour or cruise offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Sukawati",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Sanctoo Suites & Villas 22",
    "offer_address": "Raya 80582, Indonesia, Jl. Ulun Suwi 2, Singapadu, Kec. Sukawati, Kabupaten Gianyar, Bali 80582, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 619.0,
    "value": 1682.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zWqeAAE",
    "hero_image": "https://images.luxuryescapes.com/jma4xbc1e8wmnboscru",
    "image_two": "https://images.luxuryescapes.com/35xgxht5dg38g0n1kink",
    "image_three": "https://images.luxuryescapes.com/jid6opimym3j5tcof9n9",
    "vendor_name": "PURI WULANDARI A BOUTIQUE RESORT & SPA",
    "title": "Ubud Private Pool Villa Retreat with Daily Breakfast, Daily Lunch or Dinner, Massages & Nightly Cocktails",
    "description": "Uncover absolute serenity among the lush jungles and cascading rice paddies of Ubud, Bali’s spiritual hinterland, at the five-star Puri Wulandari A Boutique Resort & Spa. Crafted in traditional Balinese style, villas have thatched roofs, local wood finishes and volcanic rock walls blending seamlessly with the jungle surrounds, without compromising on luxurious modern touches to make your stay ultra-comfortable.\n\nAn incredible infinity pool looks out over the verdant landscape, where you won’t spot another soul for miles. Two restaurants and one bar serve up exquisite local and fusion meals and tasty cocktails (best enjoyed while watching the sunset). When you’re ready to pamper yourself, head to the open-air Lila Ulangun Spa for a Balinese massage, a soak in the jacuzzi or a steam in the sauna. Known as the spiritual capital of Bali, Ubud is home to some of the island’s most famous natural landscapes, lush rainforests, terraced rice paddies, Hindu temples and shrines. A peaceful retreat away from the hustle and bustle of the city, Ubud calls for slowing down the pace, reconnecting with nature and checking out from your daily life.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Puri Wulandari A Boutique Resort & Spa",
    "offer_address": "Jalan Raya Kedewatan, Banjar Tanggayuda, Kedewatan, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 649.0,
    "value": 1947.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqrJ3AAJ",
    "hero_image": "https://images.luxuryescapes.com/znxaypi1uyhv698y1u6",
    "image_two": "https://images.luxuryescapes.com/859q2t8sr72sa5nrimqf",
    "image_three": "https://images.luxuryescapes.com/uiuc3al7teeywh4fd8dl",
    "vendor_name": "Royal Kamuela Villas & Suites - Monkey Forest Ubud",
    "title": "Serene Ubud Adults-Only Suite & Villa Luxury with Daily Breakfast, Nightly Dinner, Massages & Free-Flow Cocktail Hour",
    "description": "Romantic moments await at Royal Kamuela Villas & Suites at Monkey Forest, Ubud, a five-star, adults-only oasis in the heart of Bali’s inimitable spiritual hinterland. Spend your day exploring sloping rice terraces, waterfall-kissed Hindu temples and the region’s legendary Sacred Monkey Forest Sanctuary - just a five-minute walk away - before returning to your villa and the resort’s magnificent central pool. With a daily hour of delicious free-flow cocktails included, you and your special someone can sip away while watching the sunset melt beneath the banyan trees.\n\nWhen it comes to iconic Bali experiences, Royal Kamuela Villas & Suites at Monkey Forest, Ubud more than delivers - enjoy poolside coffees, afternoon tea and dinners of aromatic nasi goreng and richly glazed barbecue chicken at the acclaimed Shrida Taste of Ubud, then head to Aum Spa for massage treatments backed by millennia of Balinese tradition.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Royal Kamuela Villas & Suites at Monkey Forest, Ubud",
    "offer_address": "Jl. Monkey Forest, Ubud, Bali, 80571, Indonesia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 530.0,
    "value": 994.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C3GTBAA3",
    "hero_image": "https://images.luxuryescapes.com/jso8g57the58rvh0p78",
    "image_two": "https://images.luxuryescapes.com/p62qwelyg7hsqnxcabm",
    "image_three": "https://images.luxuryescapes.com/0y26g6vhn1iop4j7ae5",
    "vendor_name": "Gdas Bali Health and Wellness Resort",
    "title": "Grand Opening: Ubud Boutique Wellness Sanctuary with Massages & Daily Dining",
    "description": "You are invited to be one of the very first to experience the swaying rice fields and serene yoga shala of the brand-new Gdas Bali Health and Wellness Resort - a blissful boutique sanctuary in Ubud, Bali’s spiritual and cultural heart. Connected to the new holistic wellness centre The Bali Eden, this peaceful resort has spared no expense in providing guests with the ultimate in rejuvenating luxury. Its meticulous VIP concierge offers bespoke, personalised service designed to elevate every extraordinary experience. Practise hot yoga, dine on locally sourced vegan plates at Tangi, embark on handcrafted wellness journeys at Arana Spa or sip ice-cold Loloh by the resort’s mirage-like pool.\n\nFeel renewed with warm hospitality, flawless service, wholesome food and wellness methods backed by countless years of Balinese wisdom. When you’re ready to explore, Ubud provides countless treasures for soulful seekers and art aficionados alike, across an abundance of ancient temples, fascinating museums and heron-filled forests.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Gdas Bali Health and Wellness Resort",
    "offer_address": "Jalan Cempaka, Mas, Ubud, Bali Gianyar Bali 80571 Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 867.0,
    "value": 2333.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hDRWAA2",
    "hero_image": "https://images.luxuryescapes.com/fmoibb14njcs5milarga",
    "image_two": "https://images.luxuryescapes.com/yyedy9fwsv1h9bjpbjb",
    "image_three": "https://images.luxuryescapes.com/9o1foxoj0qo2ta1suvoh",
    "vendor_name": "Padma Resort Ubud",
    "title": "Five-Star Ubud Rainforest Hideaway with World-Famous Pool, Daily Breakfast & Daily Lunch or Dinner",
    "description": "Find serenity among the untouched rainforests of Bali at the breathtakingly beautiful, five-star Padma Resort Ubud. Located just 35 minutes from Bali’s celebrated arts capital, Ubud, the resort offers unparalleled luxury, including an instantly Instagrammable heated infinity pool, luxurious wellness spa, kids' club, fitness centre, sauna, steam room, three onsite eateries and the prestigious Padma Club Lounge, all surrounded by the enchanting sounds and sights of the Payangan forest.\n\nPadma Resort Ubud, stamped with a Tripadvisor Travellers’ Choice, Best of the Best 2022 award and currently ranked as the #1 hotel in Panyangan, is the perfect launchpad to explore Ubud, Bali’s trendy and effortlessly inventive artistic wonderland. Visit the city’s lush rice fields, check out the abundance of galleries and museums, get to know the Ubud Monkey Forest’s cheeky inhabitants or slow down and take it all in - Ubud offers boundless opportunities for travellers of all stripes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Padma Resort Ubud",
    "offer_address": "Banjar Carik, Desa Puhu, Payangan, Ubud, Bali 80572, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 609.0,
    "value": 1398.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FHYz8YAH",
    "hero_image": "https://images.luxuryescapes.com/4bn5oibkskc2r2fswfjj",
    "image_two": "https://images.luxuryescapes.com/u6wvsmx7z96gn8h7vz2k",
    "image_three": "https://images.luxuryescapes.com/ogupqkia39bci0j0nv2p",
    "vendor_name": "Ubud Mas Glamping",
    "title": "Grand Opening: Ubud Pool Villa Glamping with Daily Breakfast, Nightly Dinner & Nightly Cocktail",
    "description": "Sink into the tranquillity of Bali's lush landscapes with a serene stay at this newly opened, five-star glamping villa. Perfectly positioned amid the rice terraces, each villa takes glamping to a new level of luxury with all the comforts of home - as well as the chance to luxuriate by your sparkling private pool.\n\nDrift into pure Balinese bliss with a massage at the Soleil Spa, or venture out with a private car to Ubud centre and explore the famed Ubud Art Market or Sacred Monkey Forest Sanctuary. As the sun sets, raise a glass and toast to the enchanting life with a nightly cocktail on the Lacoo Restaurant rooftop.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Mas",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Ubud Mas Glamping",
    "offer_address": "Jalan Arjuna, Banjar Abianseka, Mas, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 599.0,
    "value": 1694.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMg4MAAT",
    "hero_image": "https://images.luxuryescapes.com/lh6wzabmen1znnr8sh15",
    "image_two": "https://images.luxuryescapes.com/7rk5i3m0edinpfqedci",
    "image_three": "https://images.luxuryescapes.com/g2c3fjok7ktipdlew8ss9",
    "vendor_name": "Aksari Resort Ubud",
    "title": "Tranquil Northern Ubud Hideaway with Daily Breakfast, Nightly Dinner, Cocktails & Massages",
    "description": "Enjoy some well-earned rest and indulge in peaceful tranquillity deep in the heart of the jungle with a relaxing Ubud stay. This impressive resort boasts unparalleled, sweeping views of Bali's picturesque, lush green valleys accompanied by the finest traditional Balinese touches.\n\nFound just 25 minutes from the centre of Ubud, spend your days exploring one of Bali's hotspots or visit the Tegalalang Rice Terraces. Closer to home, embrace the air of romance found across the resort and take a dip in the cascading infinity pool perched over the jungle.\n\nWhere breathtaking beauty and serenity meet, this resort is the perfect destination if relaxation is at the front of your mind. Indulge in a soothing massage or a spa treatment at Svaha Spa. Then, finish each day on a high note with a delicious cocktail and authentic Indonesian dining experience at Ankhusa.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tegallalang",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Aksari Luxury Resort & Spa Ubud by Ini Vie Hospitality",
    "offer_address": "88 Jalan Raya Desa Kenderan, Kenderan, Ubud, Bali 80561, Indonesia",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 559.0,
    "value": 1068.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMWgcAAH",
    "hero_image": "https://images.luxuryescapes.com/a2rw1fbq2qfjqg7sr9us",
    "image_two": "https://images.luxuryescapes.com/doi2m0rovlim1ikrsf27",
    "image_three": "https://images.luxuryescapes.com/vroifbrs9sl50usglqlb",
    "vendor_name": "Kayumanis Ubud Private Villa & Spa",
    "title": "Ubud Five-Star Private Pool Villas with Daily Breakfast, Nightly Cocktails & Massages",
    "description": "Escape to Ubud's lush green rice paddies and discover your private slice of island paradise at the five-star boutique retreat, Kayumanis Ubud Private Villa & Spa. This luxury retreat is home to just 23 elegantly appointed villas, each offering butler service and private pools. Hidden within a tropical forest overlooking the Ayung River, this heavenly resort radiates tranquillity - yet is just five minutes from Bali's vibrant cultural capital, Ubud. Indulge in a wealth of wellness treatments or treat yourself to a romantic feast high over the river valley at Dining Corner. Take in Ubud's beauty with a guided tour, enrich your home recipes with onsite cooking classes or learn to relax, meditate and harmonise your body through the resort's extensive yoga program.\n\nEmbrace the beauty of the Balinese jungle and vibrancy of Ubud, home to world-class restaurants and shops. Take a short drive and discover a plethora of nearby temples and the popular Aloha Ubud Swing, the perfect spot to take in sweeping vistas of rice paddies, lush rainforests, lakes and waterfalls. Visit thousands of Balinese long-tailed macaque monkeys at the Sacred Monkey Forest Sanctuary, or journey an extra five minutes to Goa Gajah Elephant Cave temple.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Ubud Private Villa & Spa",
    "offer_address": "Jalan Kayumanis Sayan, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 649.0,
    "value": 2698.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000QuinkQAB",
    "hero_image": "https://images.luxuryescapes.com/nx2u04822up4zbq5cb8t",
    "image_two": "https://images.luxuryescapes.com/jatccinmgaorriokd6vd",
    "image_three": "https://images.luxuryescapes.com/kni754pvgkm1zqtpyaxs",
    "vendor_name": "Furama Villas and Spa, Ubud",
    "title": "Multi-Award-Winning Balinese Luxury in Ubud",
    "description": "Be enchanted by beautiful Ubud - Bali’s cultural heartland - when you spend four days/three nights at the award-winning Furama Villas & Spa. Stay in a lavish Deluxe Pool Villa with nightly dinners, daily 30-minute massages each, daily cocktails, late checkout and a complimentary one-way airport transfer for two.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Furama Villas & Spa Ubud - 2018",
    "offer_address": "Jl. Raya Mambal, Banjar Bindu, Mambal, Ubud, Mekar Bhuwana, Abiansemal, Kabupaten Badung, Bali 80571, Indonesia",
    "percentage_discount": 72.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 376.0,
    "value": 1320.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GGfu3YAD",
    "hero_image": "https://images.luxuryescapes.com/h0gybuxtod6pfrplmjb",
    "image_two": "https://images.luxuryescapes.com/5amhw3chajioxy67u0o",
    "image_three": "https://images.luxuryescapes.com/tg4bwwbqhwnep9t3xe4",
    "vendor_name": "Amarea Resort Ubud by iNi Vie Hospitality",
    "title": "Tranquil Ubud Rainforest Retreat with Daily Breakfast, Daily Lunch or Dinner & Cocktails",
    "description": "Find yourself surrounded by forest greenery, feeling as tranquil as ever, with a stay at this hidden gem in the heart of Bali’s creative hub: Ubud. Whether you’re unwinding with a cocktail in hand, exploring the vibrant landscapes on a scenic trek or diving into the sparkling lagoon pool, every moment here is a chance to reconnect with nature.\n\nStart each day with a calming yoga session in the open-air yoga venue, where the gentle morning breeze and soft sunlight come together to set the perfect tone for mindfulness and relaxation. For the ultimate in indulgence, treat yourself to a serene massage at Svaha Spa Teges, surrounded by soothing rainforest sounds.\n\nFrom morning to night, savour Japanese bites, classic breakfast dishes and creative cocktails at Norii, a yakitori-style bar catering to all your cravings. Make the most of the resort’s complimentary shuttle service into Ubud city centre and venture out of the resort to explore the island’s finest dining, shopping districts and traditional temples. Nearby, you can easily access lush rice terraces, the sacred Monkey Forest, art galleries and vibrant local markets.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Amarea Resort & Spa Ubud by iNi Vie Hospitality",
    "offer_address": "Jl. Sawah Indah Gang Amarea 8, Peliatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 247.0,
    "value": 685.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IM8xIAG",
    "hero_image": "https://images.luxuryescapes.com/vuvbku8gweobr5hjcdix",
    "image_two": "https://images.luxuryescapes.com/edq6ehiwltqwno1ssnc",
    "image_three": "https://images.luxuryescapes.com/pkvn4wuv44px1yruc3l",
    "vendor_name": "Asvara Villa Ubud",
    "title": "Romantic Ubud Private Pool Villas with Daily Breakfast, Choice of Lunch or Dinner & Massages",
    "description": "Discover the lush jungles, grand temples and authentic markets of Ubud in this romantic villa hideaway. Forget about the rest of the world in your own private villa, boasting a shimmering pool, bubbling jacuzzi and breezy lounge area, perfectly positioned amid terraced rice fields. \n\nWhen you're not enjoying a poolside cocktail or a tension-melting massage, venture out to Ubud centre - just a 15-minute trip on the complimentary shuttle service - and immerse yourself in the vibrant local culture. With various hidden waterfalls, Balinese swings and the Sacred Monkey Forest Sanctuary all within reach, an escape to Asvara Ubud Villas ensures you can tick off all the town's quintessential experiences.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Asvara Villa Ubud, by Ini Vie Hospitality",
    "offer_address": "Jalan Bangkiang Sidem No. 8 X, Keliki, Tegallalang, Gianyar Regency, Bali 80571, Indonesia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 519.0,
    "value": 973.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csDooQAE",
    "hero_image": "https://images.luxuryescapes.com/prgcb7vlbc2p4rrzwk2b",
    "image_two": "https://images.luxuryescapes.com/o5ob4shgek5mt49gsxm",
    "image_three": "https://images.luxuryescapes.com/uth3i95o9lqk80wfpj",
    "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
    "title": "Five-Star Retreat Amid Secluded Rice Fields with Butler Service",
    "description": "Discover a heavenly hideaway nestled amongst Ubud’s lush rice paddy fields at The Chedi Club Tanah Gajah, one of Bali’s leading luxury hotels, where you can enjoy private butler service and sophisticated seclusion. Includes daily buffet breakfast, daily afternoon tea, a hot air balloon ride or 60-minute couples' massage, guided rice paddy trek, daily refilled minibar, decadent dining experiences, nightly free-flow cocktails, private one-way airport transfer and much more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Chedi Club Tanah Gajah 2019",
    "offer_address": "Tengkulak Kaja, Jl. Raya Goa Gajah, Kemenuh, Ubud, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 799.0,
    "value": 1650.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DODoTAAX",
    "hero_image": "https://images.luxuryescapes.com/b7084be9gmx5vr3qqlde",
    "image_two": "https://images.luxuryescapes.com/kpr1q2yx0mud2flbyw4",
    "image_three": "https://images.luxuryescapes.com/tbefyctiin9doawugkk6",
    "vendor_name": "Padma Resort Ubud",
    "title": "Five-Star Ubud Rainforest Hideaway with World-Famous Pool, Daily Breakfast & Daily Lunch or Dinner",
    "description": "Find serenity among the untouched rainforests of Bali at the breathtakingly beautiful, five-star Padma Resort Ubud. Located just 35 minutes from the island's celebrated arts capital, Ubud, the resort offers unparalleled luxury, including a luxurious wellness spa, kids' club, fitness centre, sauna, steam room, three onsite eateries, the prestigious Club Lounge and a truly iconic outdoor infinity pool, all surrounded by the enchanting sounds and sights of the Payangan forest.\n\nPadma Resort Ubud, stamped with a Tripadvisor Travellers’ Choice, Best of the Best 2022 award, is the perfect launchpad to explore Ubud, Bali’s trendy and effortlessly inventive artistic wonderland. Visit the city’s lush rice fields, check out the abundance of galleries and museums, get to know the Ubud Monkey Forest’s cheeky inhabitants or slow down and take it all in - Ubud offers boundless opportunities for travellers of all stripes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Padma Resort Ubud",
    "offer_address": "Banjar Carik, Desa Puhu, Payangan, Ubud, Bali 80572, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 609.0,
    "value": 1391.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMfGHAA1",
    "hero_image": "https://images.luxuryescapes.com/09cxdnsl08nv4ay9r083",
    "image_two": "https://images.luxuryescapes.com/33bgf63zzfrr18nomqi",
    "image_three": "https://images.luxuryescapes.com/n963fn59sh3uqsteh11k",
    "vendor_name": "Visesa Ubud Resort",
    "title": "Five-Star Private Pool Villas with Daily Breakfast, Nightly Dinner & Free-Flow Cocktail Hour",
    "description": "Surrounded by verdant rice paddies, this luxurious five-star retreat in Ubud seamlessly blends natural beauty with opulence. Set across six hectares of lush tropical rainforest overlooking the Sakti River, it offers a serene escape where you can witness daily animal parades and immerse yourself in Balinese dance classes before retiring to your private sanctuary.\n\nVisesa Ubud Resort offers a serene retreat while remaining just 10 minutes from Bali's vibrant cultural hub. With three complimentary daily shuttles to Ubud's center, guests can easily explore the area's rich offerings.\n\nVisesa Ubud Resort is designed to replicate a traditional Balinese village, inviting guests to savour local flavours at Lesung restaurant, refine culinary skills in cooking classes or rejuvenate mind and body through the resort's comprehensive yoga program.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Visesa Ubud Resort",
    "offer_address": "JL. Suweta, Bentuyung Sakti, Ubud, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 29,
    "price": 689.0,
    "value": 1776.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UyI31QAF",
    "hero_image": "https://images.luxuryescapes.com/ieuqpifqiv2er0alfuzx",
    "image_two": "https://images.luxuryescapes.com/lhe5aehegsmwfq0jomvh",
    "image_three": "https://images.luxuryescapes.com/aaltpp9rqjdaa8tpi7ig",
    "vendor_name": "SenS Hotel and Spa Ubud",
    "title": "Relaxing Break in Ubud, Bali",
    "description": "Treat yourself and a loved one to a blissful experience at the SenS Hotel & Spa, Ubud. This Bali resort offers everything you need for a relaxing stay and is conveniently located within walking distance of many local attractions, including the Sacred Monkey Forest Sanctuary. With daily breakfast, a 60-minute massage and select gourmet meals included, you’ll love this relaxing getaway.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "SenS Hotel & Spa",
    "offer_address": "1, Jl. Sukma Kesuma, Banjar Tebesaya, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 189.0,
    "value": 586.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y1R6LQAV",
    "hero_image": "https://images.luxuryescapes.com/yvgsjezhnzlbso81ojzz",
    "image_two": "https://images.luxuryescapes.com/yungdhtrlxws7iqlkp88",
    "image_three": "https://images.luxuryescapes.com/dcgn9awmtdenhoxmi8cr",
    "vendor_name": "The Alena Resort",
    "title": "Tranquil Boutique Escape with Indulgent Inclusions",
    "description": "Find serenity at the tranquil Alena Resort, located in the village of Silungan, just ten minutes’ drive from the centre of Ubud. Surrounded by tropical jungle and rice fields, time will stand still during this peaceful Balinese getaway. Included in your stay is daily à la carte breakfast, a 60-minute massage for two, daily cocktails, a gourmet set-menu dinner and more. Plus, two children aged 11 and under stay free with breakfast when sharing existing bedding.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Alena Resort",
    "offer_address": "Banjar Silungan, Lodtunduh, Ubud, Lodtunduh, Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 314.0,
    "value": 863.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lf3PAAS",
    "hero_image": "https://images.luxuryescapes.com/9lbp8awyhoq7uyixgytq",
    "image_two": "https://images.luxuryescapes.com/hyll7gem6ja9lxlqtlj",
    "image_three": "https://images.luxuryescapes.com/wvipf6ph0ih76tafq2ob",
    "vendor_name": "Padma Resort Ubud",
    "title": "Hidden Ubud Retreat with Gourmet Dining & one of Bali's Most Instagrammable Pools",
    "description": "Find complete serenity among the lush rainforest of Ubud, Bali’s spiritual hinterland, at the breathtaking Padma Resort Ubud. Your escape includes daily buffet breakfast, daily buffet-style afternoon tea, your choice of two two-course set-menu lunches or dinners designed by Indonesian celebrity MasterChef Degan Septoadji, a complimentary cocktail each beside one of Bali's most Instagrammable pools, guaranteed 1pm late checkout, a 10% discount on food at any onsite restaurant and 10% off any spa treatment.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Padma Resort Ubud",
    "offer_address": "Banjar Carik, Desa Puhu, Payangan, Ubud, Bali 80572, Indonesia",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 619.0,
    "value": 1210.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bhAm7QAE",
    "hero_image": "https://images.luxuryescapes.com/gut1ic0znbz3sxr98fk",
    "image_two": "https://images.luxuryescapes.com/uy03jmgwaryzjbgf1zxo",
    "image_three": "https://images.luxuryescapes.com/lmzemic91txn5ncb2l8",
    "vendor_name": "Furama Villas and Spa, Ubud",
    "title": "Private Pool Villa Luxury with Daily Dinner and Cocktails in Ubud",
    "description": "Be enchanted by beautiful Ubud, Bali’s cultural heartland, at the award-winning Furama Villas & Spa. Stay in a lavish Deluxe Pool Villa with private plunge pool and enjoy daily buffet breakfast, nightly set-menu dinner, one 60-minute massage each, a nightly cocktail per person, one-way airport transfer, scheduled shuttles to Ubud centre and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Furama Xclusive Villas & Spa Ubud - old",
    "offer_address": "Jl. Raya Mambal, Banjar Bindu, Mambal, Ubud, Mekar Bhuwana, Abiansemal, Kabupaten Badung, Bali 80571, Indonesia",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 374.0,
    "value": 1312.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mMoPAAU",
    "hero_image": "https://images.luxuryescapes.com/1ocp1vfyiekiv8y7426d",
    "image_two": "https://images.luxuryescapes.com/p0u8yywlsifyyoji9mhf",
    "image_three": "https://images.luxuryescapes.com/lykegeozgaghsmcvd7c",
    "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
    "title": "Five-Star Award-Winning Ubud Suites with Daily Breakfast & Daily Lunch or Dinner, Club Lounge Access & One-Time Hot Air Balloon Experience",
    "description": "Escape to the undulating hills of Ubud in search of serenity and rejuvenation at the five-star Tanah Gajah, a Resort by Hadiprana, an urban sanctuary ranked among Tripadvisor’s top 1% of properties worldwide. This luxury retreat is home to just twenty suites and villas, each featuring unique artwork, traditional elegance and modern-day comforts in natural Balinese surrounds. Hidden within 12 acres of verdant emerald rice paddies, this heavenly resort radiates peace, quiet, and tranquility, and is just ten minutes from the artists' village of Ubud. \n\nUnwind with a day of pampering at the spa, indulge in a romantic feast amidst the rice paddies, or learn about Balinese culture with onsite cooking classes and dance performances. Take in Ubud's beauty with a guided tour of the surrounding landscapes, or witness it from above with Bali’s first hot-ballooning adventure. At the end of the day, retreat to your thoughtfully designed suite or villa to rest, recharge and repeat it all over again.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Tanah Gajah, a Resort by Hadiprana",
    "offer_address": "Jalan Raya Goa Gajah, Tengkulak Kaja, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 736.0,
    "value": 1735.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004uxkaAAA",
    "hero_image": "https://images.luxuryescapes.com/nrkzusw0cbp31r6mm4",
    "image_two": "https://images.luxuryescapes.com/bhi48ns6yvhtjbsektr",
    "image_three": "https://images.luxuryescapes.com/3v1s1pntq8i32v0mvy3",
    "vendor_name": "Nandini Jungle By Hanging Gardens",
    "title": "Five-Star Ubud Rainforest Retreat on Ayung River with Daily Breakfast & Sunset Cocktails",
    "description": "A slice of jungle paradise awaits you at the luxurious five-star Nandini Jungle Resort & Spa, a serene sanctuary in the heart of the gorgeous Payangan Rainforest. Balinese culture and contemporary charm combine to create a deluxe destination getaway like no other, with 18 opulent villas modelled after a traditional Balinese village. Start your morning peacefully with a spiritual yoga class before exploring the trendy town of Ubud, finishing with a handcrafted cocktail to accompany the spectacular sunset view over the river gorge and beyond. Or spend your days lounging by the hillside infinity swimming pool, with views out over the lush rainforest.\n\nFramed by Bali’s iconic terraced green rice paddies, monkey-filled jungles and swaying coconut palms, Ubud offers some of the island’s most beautiful scenery, which can be discovered on rice field tours. With a complimentary shuttle from the resort to Ubud, it will take just over 20 minutes to reach the cultural heart of Bali, brimming with vibrant restaurants, yoga studios, galleries, and markets. After a long day of exploring, achieve the ultimate relaxation with soothing massages at the Sungai Spa, located right near the Ayung River.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Nandini Jungle by Hanging Gardens",
    "offer_address": "Br, Jl. Susut, Buahan, Payangan, Kabupaten Gianyar, Bali 80572, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 461.0,
    "value": 1152.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cJrr5QAC",
    "hero_image": "https://images.luxuryescapes.com/f8815cng7f018uq689v",
    "image_two": "https://images.luxuryescapes.com/gmygys39um2x3nx0eh",
    "image_three": "https://images.luxuryescapes.com/6vzxjskxxcacdcr56jgi",
    "vendor_name": "Visesa Ubud Resort",
    "title": "Five-Star Ubud Hideaway with 24-Hour Butler Service",
    "description": "Enjoy a luxurious Balinese getaway with a difference staying at the breathtaking, five-star Desa Visesa Ubud-a 6.5-hectare resort complete with lush rice paddies and working farmland. Discover all this beautiful region has to offer as you're treated to 24-hour butler service, daily buffet breakfast, exotic dining experiences, a blissful signature massage each, two cocktails each, return airport transfers and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Visesa Ubud Resort",
    "offer_address": "JL. Suweta, Bentuyung Sakti, Ubud, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 380.0,
    "value": 1515.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GgZWQYA3",
    "hero_image": "https://images.luxuryescapes.com/6ycjahxzqlfchwfjdb4",
    "image_two": "https://images.luxuryescapes.com/8xgq9t0arvvh7lfswff",
    "image_three": "https://images.luxuryescapes.com/ss4ebqooyvax5q5e0bx",
    "vendor_name": "Suara Alam Ubud by Ini Vie Hospitality",
    "title": "Ubud Adults-Only Retreat with Daily Breakfast, Daily Choice of Lunch or Dinner & Beach Club Access",
    "description": "Weave your way through rice paddies to this adults-only stay near the heart of Ubud. Spend your days unwinding by one of three pools, with an ice-cold beer in hand, before setting out to explore the humming streets of the town's centre.\n\nAn ideal getaway for honeymooners, Suara Alam Ubud seamlessly balances natural surroundings with contemporary comforts. Just a short drive from Ubud's vibrant craft stalls, sacred historical sites and streets vibrating with gamelan music, this retreat ensures a traditional Balinese experience.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Suara Alam Ubud",
    "offer_address": "88 Jalan Tirta Tawar, Petulu, Kecamatan, Kabupaten Gianyar, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 279.0,
    "value": 625.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I1R5AAK",
    "hero_image": "https://images.luxuryescapes.com/ky08i8nwik1ksux58da",
    "image_two": "https://images.luxuryescapes.com/s8yl33xofjo72donn6e8",
    "image_three": "https://images.luxuryescapes.com/okvf4z276gp3wsyty2ai",
    "vendor_name": "Furama Villas and Spa, Ubud",
    "title": "Ubud Five-Star Pool Villa Serenity with Massages & Daily Dining",
    "description": "Be enchanted by beautiful Ubud, Bali’s cultural heartland, at the five-star FuramaXclusive Resort & Villas Ubud. A winner in the Tripadvisor Travellers’ Choice Awards 2021, this serene resort sits beneath the majestic Mount Batur, framed by palm-fringed rice paddy fields and lush jungle.\n\nEnjoy barefoot luxury in your private pool villa, indulge in delicious cuisine overlooking the rice fields at Padi Restaurant, sunbathe beside the resort pool or perhaps treat yourself to a spa treatment… this is the Ubud escape you’ve been waiting for.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Mambal",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "FuramaXclusive Resort & Villas Ubud",
    "offer_address": "Jl. Raya Mambal - Ubud, Banjar Bindu, Mambal, Abiansemal, Kabupaten Badung, Bali 80571, Indonesia Kabupaten Badung Bali 80571 Indonesia",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 319.0,
    "value": 810.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000J0I5GYAV",
    "hero_image": "https://images.luxuryescapes.com/yg2am5lm9iwiv2sfuks",
    "image_two": "https://images.luxuryescapes.com/w1ste415iciii093x35q",
    "image_three": "https://images.luxuryescapes.com/6i57am0snm5i7bcmizi7",
    "vendor_name": "Kappa Senses Ubud",
    "title": "Ubud Rainforest Hideaway with Massages by Clarins, Daily Breakfast, Daily Lunch or Dinner & Cocktails",
    "description": "Reclaim your inner peace and reawaken the senses at this blissfully secluded hideaway amid the verdant jungle of Ubud. Showcasing luxurious, French-inspired style and the palatial OmTara Spa by Clarins - complete with vitality pools, steam, sauna and Vichy showers - this is the lush capital of well-being in Bali.\n\nPicture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort plucked from a dream. With five heavenly restaurants and bars, there’s a sanctuary to satisfy every craving, including Kokokan Restaurant’s innovative fine dining, featuring fresh produce from the resort’s onsite organic garden.\n\nFrom peaceful pavilions to the two remarkable jungle-clad pools and myriad walkways leading through lush foliage, this resort naturally integrates first-class facilities with pristine nature. Each day brings new adventures and a plethora of complimentary daily wellness, culture, and foodie activities.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kappa Senses Ubud",
    "offer_address": "Banjar Tanggayuda, Jalan Taman Sari, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 559.0,
    "value": 1489.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hDhtAAE",
    "hero_image": "https://images.luxuryescapes.com/p6fd30t5afv5t2ltobc",
    "image_two": "https://images.luxuryescapes.com/l68ut8t2puoh858fdz",
    "image_three": "https://images.luxuryescapes.com/ub06565arg0wi06j0w",
    "vendor_name": "Hanging Gardens of Bali",
    "title": "Ubud Hanging Gardens Award-Winning Pool Villas with Daily Breakfast & Daily Handcrafted Signature Cocktail",
    "description": "Suspended over the lush jungle, bursting with orchids, bamboo and coffee trees, Hanging Gardens of Bali is an exotic Eden near Ubud. This incredible property was recently named by Seven Stars Luxury Hospitality Awards as the world's best boutique hotel in 2021. Watch the world melt away from the famed two-tier pool, which appears to float above the mist-covered forest below. Marvel at awe-inspiring views that stretch down to the Ayung River, across the valley to the sacred Dalem Segara Temple. Discover the vibrance of Ubud Town - less than a 30-minute shuttle away - and find serenity at the riverside spa.\n\nRomantic pathways lead to Hanging Gardens of Bali’s 44 secluded pool villas, and getting around this vertiginous property is simple: you’ll be whisked up and down the hill via the onsite funicular. Dining at the Feng Shui-inspired Three Elements Restaurant is an award-winning feast for the senses. Enjoy not only a tantalising culinary journey, but also views of the pool, valley and, after dusk, the glow of hundreds of romantic candles.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Hanging Gardens of Bali",
    "offer_address": "Buahan, Payangan, Gianyar Regency, Bali 80571, Indonesia",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 1004.0,
    "value": 2066.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IxCIvYAN",
    "hero_image": "https://images.luxuryescapes.com/hyf6v5ymmt6sspiisfts",
    "image_two": "https://images.luxuryescapes.com/z4oxfpyqmqk90t4tfdci",
    "image_three": "https://images.luxuryescapes.com/9nfb9yshqq4nvs233as",
    "vendor_name": "Khastana Hadi Resort Ubud",
    "title": "Ubud Pool Villa Oasis near Heritage-Listed Rice Terraces with Jungle Views",
    "description": "Run away to the misty hills of Ubud and relax like never before in your private villa among the verdant jungle. Spend your days exploring the UNESCO World Heritage-listed Tegallalang Rice Terraces, savour bold Balinese flavours at the bustling Ubud Market or find inner peace at the sacred Tirta Empul Temple.\n\nWith two- and three-bedroom villa variations to choose from, the whole family can enjoy quality time at Khastana Hadi Resort Ubud. Luxuriate in your private pool amid stunning jungle surroudnings, or rejuvenate your senses with indulgent in-villa massages. For the food enthusiasts, cooking classes and seafood dinners can be arranged in your villa.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Sebatu",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Khastana Hadi Resort Ubud",
    "offer_address": "Jl. Br Jasan No.161, Sebatu, Kec. Tegallalang, Kabupaten Gianyar, Bali 80561, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 665.0,
    "value": 665.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQRAIAA5",
    "hero_image": "https://images.luxuryescapes.com/i3sj66suocxbp1f7w6d",
    "image_two": "https://images.luxuryescapes.com/68ah6ku7itrhdka04v",
    "image_three": "https://images.luxuryescapes.com/tnci1srayic12kd2t1xn",
    "vendor_name": "Asvara Villa Ubud",
    "title": "Romantic Ubud Private Pool Villas with Daily Breakfast & Beach Club Entry",
    "description": "Discover the lush jungles, temples and art markets of Ubud when you stay at Asvara Villa Ubud, a romantic all-villa hideaway surrounded by evergreen rice fields. It's all too easy to forget about the rest of the world in your own private villa, complete with a private swimming pool, bubbling jacuzzi, kitchenette and breezy lounge. \n\nWhen you're not enjoying candle-lit dinners and floating breakfasts, venture out to Ubud centre - just 15 minutes away by car - and immerse yourself in the local culture.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Asvara Villa Ubud, by Ini Vie Hospitality",
    "offer_address": "Jalan Bangkiang Sidem No. 8 X, Keliki, Tegallalang, Gianyar Regency, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 193.0,
    "value": 193.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuwiFAAR",
    "hero_image": "https://images.luxuryescapes.com/0xhj871s5dophn5p76wc",
    "image_two": "https://images.luxuryescapes.com/cyrcjojc34ccuk2peqv",
    "image_three": "https://images.luxuryescapes.com/ww1mxo3m7fhm0o071rb8",
    "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
    "title": "Five-Star Award-Winning Ubud Suites near Bali's Rice Paddies",
    "description": "Escape to the undulating hills of Ubud in search of serenity and rejuvenation at the five-star Tanah Gajah, a Resort by Hadiprana. This luxury retreat is home to just twenty suites and villas, each featuring unique artwork, traditional elegance and modern-day comforts in natural Balinese surrounds. Hidden within 12 acres of verdant emerald rice paddies, this heavenly resort radiates peace, quiet and tranquility, but is just ten minutes from the artists' village of Ubud. Unwind with a day of pampering at the spa, indulge in a romantic feast amidst the rice paddies, or witness the beauty of the region from above with Bali’s first hot-ballooning adventure.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Tanah Gajah, a Resort by Hadiprana",
    "offer_address": "Jl. Goa Gajah, Tengkulak Kaja, Ubud, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 554.0,
    "value": 554.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009FbPiAAK",
    "hero_image": "https://images.luxuryescapes.com/imcued181gbh3fd3g5o",
    "image_two": "https://images.luxuryescapes.com/o4i8mfnp97q8aa338g3",
    "image_three": "https://images.luxuryescapes.com/934noxnegfjpfxsg42q7",
    "vendor_name": "Nandini Jungle By Hanging Gardens",
    "title": "Five-Star Ubud Boutique Retreat within Payangan Rainforest",
    "description": "Escape to a five-star oasis perched above the Ayung River at Nandini Jungle by Hanging Gardens, a serene destination located in the heart of the Payangan Rainforest. After busy days exploring the bustling vibrance of Ubud or traversing through the concealed jungle paths, retreat to this intimate haven to enjoy a luxurious massage, practice yoga or simply relax around the outdoor swimming pool. As the sun sets, head to Wild Ginger Restaurant to enjoy the traditional culinary delights on offer.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Nandini Jungle By Hanging Gardens",
    "offer_address": "Br. Jalan Susut, Buahan, Kec. Payangan, Kab. Gianyar, Bali 80572, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 189.0,
    "value": 189.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CNxJjAAL",
    "hero_image": "https://images.luxuryescapes.com/iic9dv32jyv6azgowm5",
    "image_two": "https://images.luxuryescapes.com/yy6kjczvdigunoswrgfv",
    "image_three": "https://images.luxuryescapes.com/9hsuss399jb5i2oxjqgd",
    "vendor_name": "COMO Shambhala Estate",
    "title": "Five-Star Award-Winning Ubud Jungle Wellness Sanctuary on the Ayung River",
    "description": "Let the rest of the world melt away when you succumb to bliss at COMO Shambhala Estate, an award-winning wellness sanctuary resting on the banks of the Ayung River, just outside of Ubud. At its heart, the resort is dedicated to achieving balance through holistic means. World-class facilities include nine treatment rooms and three treatment pavilions, each with verdant jungle panoramas, plus an outdoor vitality pool for hydrotherapy and a top-of-the-range yoga pavilion. To complement your well-being journey, indulge in nutritious and seasonal dishes at Glow, where you can watch your food being prepared in the open kitchen. Meanwhile, Indonesia's complex flavours and spices await at Kudus House, housed within a 150-year-old former Javanese residence.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "COMO Shambhala Estate",
    "offer_address": "Banjar Begawan, Desa, Melinggih Kelod, Kec. Payangan, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 703.0,
    "value": 703.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037J5xAAE",
    "hero_image": "https://images.luxuryescapes.com/tobti09yp57al4lk0i",
    "image_two": "https://images.luxuryescapes.com/mvmxwqwdf92x1383b7am",
    "image_three": "https://images.luxuryescapes.com/re7gs9cid38ezr39job8",
    "vendor_name": "Viceroy Bali",
    "title": "Multi-Award-Winning Five-Star Ubud Sanctuary Perched Above Petanu River Gorge",
    "description": "Discover a New Type of Tropical Paradise at Viceroy Bali. Viceroy Bali is a five-star sanctuary nestled in a steep ravine overlooking the tranquil Petanu Valley, part of the exclusive Small Luxury Hotels of the World (SLH) Finest Collections. Sitting on a steep ravine, overlooking the Petanu Valley, this luxury hotel is surrounded by rich Balinese jungle but is just five minutes from the centre of bustling Ubud. Here, you’ll find some of the island’s best restaurants, magnificent markets and independent boutiques, full of unique artisan gifts.\n\nIntimate and family-run (a true rarity for a five-star hotel in Bali), Viceroy Bali is home to 40 suites and villas, each with thatched roofs, sweeping views of perfectly placed palm trees, private pools and luxurious amenities. The list of awards is lengthy and includes accolades from the Small Luxury Hotels of the World Awards and Galatian Signature Hotels Awards for 2020 alone. While leaving your sumptuous sanctuary is optional, there’s more to explore. Discover true tranquility at Akoya Spa, where treatments combine traditional Balinese techniques with modern wellness knowledge. \n\nDelight in the finest dining at Apéritif Restaurant, an elegant 1920s-inspired venue serving a distinguished degustation menu that celebrates high-quality ingredients and offering a borderless food experience that transcends traditional culinary boundaries. For a more laid-back experience, CasCades Restaurant presents a delicious selection of traditional Indonesian dishes alongside Western classics, all set in a stunning environment. For those seeking a sophisticated yet relaxed atmosphere, Pinstripe Bar offers expertly crafted cocktails, fine spirits, and an ambiance that perfectly complements the vibrant energy of Ubud.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Viceroy Bali",
    "offer_address": "Jl. Lanyahan, Br. Nagi, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 577.0,
    "value": 577.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GPqtAAG",
    "hero_image": "https://images.luxuryescapes.com/kceezyxnqqsgat6kuc5h",
    "image_two": "https://images.luxuryescapes.com/6ujv333oqoodbknkj0d",
    "image_three": "https://images.luxuryescapes.com/4wpl1vcpqr7nc52as0qz",
    "vendor_name": "Maya Ubud Resort & Spa",
    "title": "Serene Five-Star Ubud Retreat",
    "description": "Indulge in the ultimate feeling of five-star bliss at the breathtaking Maya Ubud Resort & Spa - a stunning Balinese sanctuary that offers guests complete serenity. Cradled by the dramatic Petanu River valley and the rolling rice paddies of Peliatan, Maya Ubud is a jewel within a tranquil 10-hectare tropical haven. From here, it's a leisurely 25-minute stroll to vibrant Ubud town, bursting with artisan markets, colourful boutiques and world-class restaurants.\n\nDesigned to capture the spirit of a traditional Balinese village, this ultra-luxe retreat combines local elegance and hospitality with a true five-star experience. Reconnect with nature and plunge into the glistening infinity pool overlooking the enchanting forest, experience euphoria at Maya Spa with a rejuvenating treatment beside the swirling waters of Petanu River, or spend each morning aligning your chakras at the tranquil Bale Raga Yoga Studio. Live the good life in a carefully designed suite or villa, beautiful spaces bathed in natural light and boasting verdant vistas across the lush surrounds.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Maya Ubud Resort & Spa",
    "offer_address": "Jalan Gunung Sari, Banjar Ambengan, Desa Peliatan, Ubud, Kec. Gianyar, Bali 80571, Indonesia Gianyar 80571 Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 134.0,
    "value": 134.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GQ6o0AAD",
    "hero_image": "https://images.luxuryescapes.com/4xxzwa9fmor0zqkxzkbe",
    "image_two": "https://images.luxuryescapes.com/slsoalr027qlkam6x3",
    "image_three": "https://images.luxuryescapes.com/6xajpdid0eyfyb2lp5lk",
    "vendor_name": "Capella Ubud",
    "title": "Unique Capella Ubud Luxury Tents in the Lush Rainforest with Private Pools",
    "description": "Where natural wonder meets boutique luxury completely surrounded by the beauty of Ubud's rainforest, Capella Ubud, Bali is the serene sanctuary crowned 'Best Upcountry Hotel' in Travel + Leisure's Luxury Awards Asia Pacific 2023. This exclusive retreat spans a collection of heritage-inspired tents and one lodge, all with private pools, that weave together to form an opulent camp rich with decor inspired by Bali's past. Savor culinary delights at Mads Lange, as you join in paying homage to the famed Danish spice trader, and Api Jiwa, where bold flavours inspired by Asian omakase dance on your palate. Toast with craft cocktails at The Mortar and Pestle Bar while munching on light snacks and listening to the sweet sounds of the forest.\n\nRelax in the Officer's Tent, exclusively for camp residents, or gather around the campfire for storytelling evenings under the twinkling sky. Stay active throughout your stay at The Armory, the camp's tented gymnasium, offering state-of-the-art equipment and guided wellness activities from yoga to village biking. The site’s 120sqm outdoor rainforest pool invites you to swim amidst nature's beauty and Capella’s day spa, Auriga Wellness, takes you on a journey of pampering and spiritual healing.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tegallalang",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Capella Ubud, Bali",
    "offer_address": "Jl. Raya Dalem, Banjar Triwangsa Desa Keliki, Kecamatan Tegallalang, 80561 Ubud, Bali, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 968.0,
    "value": 968.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQR66AAH",
    "hero_image": "https://images.luxuryescapes.com/ngqe6loqpymp8m31yxl",
    "image_two": "https://images.luxuryescapes.com/lsrsm4qq7pqv25losb8",
    "image_three": "https://images.luxuryescapes.com/jluc2gzucomxu75815",
    "vendor_name": "Aksari Resort Ubud",
    "title": "Romantic Ubud Jungle Paradise with Infinity Pool",
    "description": "Discover a new level of romantic luxury at Aksari Resort Ubud, a contemporary collection of suites and villas nestled in the lush valleys of Bali's Ubud. Take a dip in the cascading infinity pool perched over the jungle, recharge your body and mind with a decadent massage or spa treatment at Svaha Spa and dive into authentic Indonesian cuisine at Ankhusa or Japanese delicacies at Kojin Teppanyaki Restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tegallalang",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Aksari Luxury Resort & Spa Ubud by Ini Vie Hospitality",
    "offer_address": "88 Jalan Raya Desa Kenderan, Kenderan, Ubud, Bali 80561, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 159.0,
    "value": 159.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CNx4tAAD",
    "hero_image": "https://images.luxuryescapes.com/xjltgtcerhad561yb50b",
    "image_two": "https://images.luxuryescapes.com/xqxgr087rrbi5twpchsq",
    "image_three": "https://images.luxuryescapes.com/o0ydo2ua2khkzgb0i5dj",
    "vendor_name": "COMO Uma Ubud",
    "title": "Ubud Five-Star Jungle Haven with Italian-Inspired Dining",
    "description": "Allow the artful spirit of Ubud to take hold when you stay at the five-star COMO Uma Ubud, a jungle sanctuary enveloped by coconut palms and banyan trees on the cusp of the Tjampuhan Valley. The outdoor terrace is the perfect place to catch balmy breezes and at the celebrated Uma Cucina, an Italian-inspired restaurant and lounge bar serving antipasto platters or ribbons of silky pasta alongside innovative cocktails from a menu curated by Lewis Wilkinson, a leading London mixologist. Slip into total bliss at the top-rated wellness centre, a tranquil haven with decadent spa treatments including a soothing Indonesian massage, plus a yoga pavilion and a 25-metre swimming pool.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "COMO Uma Ubud",
    "offer_address": "Jalan Raya Sanggingan, Banjar Lungsiakan, Kedawatan, Ubud, Gianyar 80571, Bali, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 244.0,
    "value": 244.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DpUP3AAN",
    "hero_image": "https://images.luxuryescapes.com/xgo0odmthfv8t20qnra",
    "image_two": "https://images.luxuryescapes.com/cy6o07vdfflkyiuaa4r",
    "image_three": "https://images.luxuryescapes.com/43mimh3csj6j0te0xz54",
    "vendor_name": "The Samaya Ubud Bali",
    "title": "Idyllic Five-Star Villa Sanctuary in the Heart of Ubud with Private Pools & Onsite Spa",
    "description": "A collection of impeccably designed villas set deep in the heart of Ubud’s lush rainforest and verdant rice paddies, five-star Bali relaxation awaits at The Samanya Ubud Bali. Feel at peace as you arrive on the tranquil grounds and make your way to your private, incredibly spacious villa. Relieve any lingering tension with a rejuvenating trip to the resort’s spa, and leave the gastronomy and mixology to the professionals with a feast at either Swept Away or Scene restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Samaya Ubud Bali",
    "offer_address": "Jalan Banjar Baung, Desa Sayan, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 256.0,
    "value": 256.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VVfqAAG",
    "hero_image": "https://images.luxuryescapes.com/mnw86awq6at9kflfn7do",
    "image_two": "https://images.luxuryescapes.com/3lk0np2imecvrfq0du06",
    "image_three": "https://images.luxuryescapes.com/e666ywf9p7nxg0llpnd",
    "vendor_name": "Sanctoo Suites & Villas",
    "title": "Serene Five-Star Ubud Sanctuary near Bali Zoo",
    "description": "Indulge in five-star jungle bliss at Sanctoo Suites & Villas, a secluded and serene sanctuary nestled in the heart of Ubud. Sitting in the town of Singapadu, just 30 minutes from the centre of Ubud, this peaceful patch is inspired by its proximity to the award-winning and internationally accredited Bali Zoo, with a prime position overlooking the Savannah exhibit, home to exotic African wildlife. A complimentary shuttle to the town centre puts you in the middle of the cultural action, with world-class restaurants, beautiful boutiques and great galleries all within easy reach.\n\nRevive your senses at Sanctoo Spa, where trained therapists offer body scrubs and signature massages, or spend hours soaking up the sunshine by the savannah-inspired pool. Explore the surrounding rice paddies with a local guide or take on a two-wheel journey, mountain-biking through local villages for a taste of traditional life. Say hello to the orangutans at Kampung Sumatra, or get up close and personal with a raft of local and international animals that call Bali Zoo home. At the end of the day, rely on Sanctoo Restaurant for sensational sustenance - the menu celebrates local and international flavours, with traditional Balinese dishes enjoyed alongside Western classics.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Sukawati",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Sanctoo Suites & Villas 22",
    "offer_address": "Raya 80582, Indonesia, Jl. Ulun Suwi 2, Singapadu, Kec. Sukawati, Kabupaten Gianyar, Bali 80582, Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CO9ZiAAL",
    "hero_image": "https://images.luxuryescapes.com/pssmdy9o4l2woap41omk",
    "image_two": "https://images.luxuryescapes.com/xlp2ld70xgfvu2hnmg",
    "image_three": "https://images.luxuryescapes.com/mym1wgu0ma4rv6q0n5",
    "vendor_name": "Sanctoo Suites & Villas",
    "title": "Tranquil Five-Star Ubud Retreat near Bali Zoo",
    "description": "Indulge in five-star jungle bliss at Sanctoo Suites & Villas, a serene sanctuary tucked away in the region of Gianyar, adjacent to Bali Zoo and around 20 minutes from Ubud's centre. This peaceful patch is inspired by its locale, with a lagoon pool that mimics the natural water holes of the African savannah and tranquil vistas over Wos River. Revive your senses at Sanctoo Spa with a hot stone massage or organic facial, or visit Sanctoo Restaurant for wholesome Balinese dishes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Sukawati",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Sanctoo Suites & Villas",
    "offer_address": "Jalan Ulun Suwi II, Singapadu, Kec. Sukawati, Kabupaten Gianyar, Bali 80582, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 148.0,
    "value": 148.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009Bi5IAAS",
    "hero_image": "https://images.luxuryescapes.com/ukc8rlrq63gprlrppduk",
    "image_two": "https://images.luxuryescapes.com/7e7u7k8ox32j489gyidr",
    "image_three": "https://images.luxuryescapes.com/3k74jfodbrne4n2zzwn",
    "vendor_name": "Alila Ubud",
    "title": "Five-Star Alila Ubud Jungle Hideaway with World-Famous Infinity Pool",
    "description": "Discover the epitome of jungle bliss with a five-star escape to Alila Ubud, nestled high above the Ayung River Valley, sprawled across the hillside among world-famous rice paddies. This serene jungle hideaway offers the utmost in luxury and seclusion, only around 15 minutes from Ubud's centre. Savour authentic farm-to-table Balinese cuisine and Western classics at Plantation Restaurant, enjoy age-old beauty treatments at Spa Alila or opt to simply relax by the world-famous infinity pool - recognised by Vogue Australia as one of the most beautiful in Bali.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Alila Ubud",
    "offer_address": "Desa Melinggih Kelod, Payangan, Gianyar, Bali 80572, Indonesia",
    "percentage_discount": null,
    "min_duration": null,
    "max_duration": null,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IeZmiAAF",
    "hero_image": "https://images.luxuryescapes.com/yh1biff7dihsfvwo67b",
    "image_two": "https://images.luxuryescapes.com/9y4ncoab4rrumihcq9ix",
    "image_three": "https://images.luxuryescapes.com/q2s8m7yolf5jlzp4ynvr",
    "vendor_name": "Bambu Indah Resort",
    "title": "Boutique Ubud Eco-Luxury Jungle Retreat with Natural Pools & Rejuvenating Spa",
    "description": "Immerse yourself in the tranquillity of a Balinese jungle and be in harmony with nature at this luxurious sustainable stay, cradled in the heart of Ubud and perched by a babbling river. Rejuvenate amid the rich forest foliage, breathe in the crisp air, take a refreshing dip in the spring-fed natural pools and pamper yourself with authentic Balinese treatments in the stunning massage pods.\n\nBoasting uniquely curated organic bamboo houses, choose to stay high up in the treetops or by the river and indulge in unparalleled luxury. Tuck into farm-to-table delights and Balinese delicacies at the picturesque The Riverside Warung, and sip on fruity cocktails at The Elevator Sunset Bar. If you wish to explore, there are plenty of hiking trails and walking tours to embark on nearby, while Ubud's cultural icons are only moments away.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Bambu Indah Resort",
    "offer_address": "Jl. Baung, Sayan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 212.0,
    "value": 212.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQR87AAH",
    "hero_image": "https://images.luxuryescapes.com/uc4cmq6oazsfqnnqvdr",
    "image_two": "https://images.luxuryescapes.com/73kti6pxb330o4gqjb",
    "image_three": "https://images.luxuryescapes.com/jzy605nmvcbtogc79dph",
    "vendor_name": "Kaamala Resort Ubud",
    "title": "Romantic Ubud Suite Escape with Infinity Pool",
    "description": "Retreat to the ultimate jungle-fringed paradise at Kaamala Resort Ubud, a romantic haven perfect for those seeking a serene escape. Absorb the beauty of the terraced rice paddies and breathtaking valleys from the resort's stunning infinity pool, complete with an oversized hammock swaying at its edge. Tap into your spiritual side with daily yoga sessions or be pampered at Svaha Spa. Later, be sure to refuel at Habitat Bistro, where signature local and international dishes await.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kaamala Luxury Resort & Spa Ubud by Ini Vie Hospitality",
    "offer_address": "888A Jalan Bisma, Ubud, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 149.0,
    "value": 149.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BeYBqAAN",
    "hero_image": "https://images.luxuryescapes.com/xf1n9i03u4exut9ixb1m",
    "image_two": "https://images.luxuryescapes.com/y87ts39yrnn2mhs7q83d",
    "image_three": "https://images.luxuryescapes.com/00bklxilzo1t5pnq2ncj",
    "vendor_name": "Tanadewa Resort and Spa - Ubud",
    "title": "Five-Star Bali Retreat just 10 Minutes from Ubud with Rooftop Bar",
    "description": "Discover romance among rivers and rice fields with a five-star stay at Tanadewa Resort and Spa - Ubud by Cross Collection, just 10 minutes from Bali’s soulful centre. Wake each morning to spectacular panoramic views of the lush jungle and savour days enriched by the resort’s effortless serenity. Sip cocktails high above Ubud at the stylish Sky Terrace, head to Tanaspa for traditional treatments surrounded by verdant green or watch the river drift lazily by from the resort’s infinity pool.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Tanadewa Resort and Spa - Ubud by Cross Collection",
    "offer_address": "Jl. Padang Getas, Banjar Kengetan, Desa Singakerta, Ubud, Gianyar 80571 Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 108.0,
    "value": 108.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DthMbYAJ",
    "hero_image": "https://images.luxuryescapes.com/ob13tjeo8it2iiggrvnh",
    "image_two": "https://images.luxuryescapes.com/gnl7fii31goyb4uwlh1g",
    "image_three": "https://images.luxuryescapes.com/ab8jugdxm8us9xmknr5b",
    "vendor_name": "Beehouse Dijiwa Ubud",
    "title": "Ubud Adults-Only Serene Escape with Rice Field Views & Spa",
    "description": "This adults-only sanctuary, tucked away amongst Ubud's lush rice fields, offers a serene escape surrounded by idyllic greenery and breathtaking views of the majestic Mount Agung. Whether it's waking to a gentle sunrise over the rice fields from your bamboo villa, relaxing by the tranquil lagoon-style pool, or rejuvenating your body at Lasati Spa, Beehouse Dijiwa Ubud invites guests to unwind in a setting that celebrates Bali’s rich culture and natural beauty.\n\nDesigned like bee houses with structures made of wood and bamboo, this haven of tranquillity pays homage to traditional Balinese craftsmanship. When you're not soaking up pure bliss in your villa, embark on a cycling tour through Peliatan Village or enjoy a guided tour through the rice paddies. This is a place to rediscover simplicity, find inner peace and connect with the soul of Bali.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Beehouse Dijiwa Ubud",
    "offer_address": "Jl. Sawah Indah, Peliatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 491.0,
    "value": 491.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004i1VPAAY",
    "hero_image": "https://images.luxuryescapes.com/yj8o3nd18e2wl4gr3o6",
    "image_two": "https://images.luxuryescapes.com/9e8algj2tfd8xhyer8c",
    "image_three": "https://images.luxuryescapes.com/uvb9vlzltmuw6ynfdqss",
    "vendor_name": "Rumah Luwih Bali",
    "title": "Five-Star Elegant Beachfront Resort near Ubud with Daily Breakfast",
    "description": "Transport yourself to a state of pure bliss with a stay at the beachfront Rumah Luwih, Bali - a five-star waterfront hideaway just a short distance from Sanur and Ubud. Styled after a classic colonial Indonesian mansion, Rumah Luwih offers pure elegance in the tranquil province of Gianyar, renowned for its outstanding food and popular night market.\n\nSweeping views across verdant rice paddies, lush gardens and waves crashing on the shore offer a visual delight from the moment you reach the resort. The stylish rooms promise exceptional comfort and charm, and help make this stunning spot feel like a luxurious home-away-from-home. Fill your days with adventures, eco-tourism attractions and trips to world-renowned surfing and diving spots nearby - or simply lounge by the pool overlooking the ocean, soothe your senses with an indulgent treatment at the spa and sample artisan Indonesian specialities at the onsite restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Gianyar",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Rumah Luwih",
    "offer_address": "Jl. Prof Ida Bagus Mantra Km. 19,9, Lebih, Kec. Gianyar, Kabupaten Gianyar, Bali, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 291.0,
    "value": 291.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Cj3hGYAR",
    "hero_image": "https://images.luxuryescapes.com/65wipqqc5j2n6q4rtoe",
    "image_two": "https://images.luxuryescapes.com/ls5t8k9m3xqihqvxvf",
    "image_three": "https://images.luxuryescapes.com/ewx30ysegohsjr3gfb5l",
    "vendor_name": "Alila Ubud",
    "title": "Ubud Hillside Hideaway Overlooking Ayung River Valley with Wellness Program, Spa & Pool",
    "description": "High above the Ayung River, stay at a secluded hillside sanctuary that blends Balinese charm with natural beauty. Hidden within Bali’s central foothills, a lush path of coconut and banana trees welcomes you to this tranquil retreat. From its elevated vantage, the resort offers views of the emerald jungle canopy and alang-alang plantations that stretch endlessly into the horizon.\n\nWithin this architectural masterpiece, designed to resemble a Balinese village, savour authentic Balinese cuisine at onsite Plantation Restaurant, or rejuvenate your senses at Spa Alila. Just five kilometres from Ubud’s artistic heart, you're invited relax, rejuvenate, and connect with the enchanting spirit of Bali’s verdant landscapes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Alila Ubud",
    "offer_address": "Melinggih Kelod, Ubud, Gianyar, Bali 80572, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 144.0,
    "value": 144.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FNKQUAA5",
    "hero_image": "https://images.luxuryescapes.com/n7pa4dvvm27kozos1w4",
    "image_two": "https://images.luxuryescapes.com/qxbr5uxo3j9pn0rtnbc",
    "image_three": "https://images.luxuryescapes.com/db65rtgneeijt7cce0s9",
    "vendor_name": "Kappa Senses Ubud",
    "title": "French-Inspired Five-Star Ubud Jungle Luxury with Private Pool Villas & Rice Paddy Views",
    "description": "Reclaim your inner peace and reawaken your senses at Kappa Senses Ubud, a blissfully secluded hideaway amid the verdant jungle of Ubud. Showcasing luxurious, French-inspired style, five relaxing restaurants and bars and a dreamy 1,000sqm OmTara Spa by Clarins, this is the lush capital of wellbeing in Bali. Picture-perfect rice paddy fields, beautiful Sanskrit carvings and serene chants from nearby temples set the scene for a resort where dreams and reality blend seamlessly.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kappa Senses Ubud",
    "offer_address": "Banjar Tanggayuda, Jalan Taman Sari, Kedewatan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 262.0,
    "value": 262.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003HcyFAAS",
    "hero_image": "https://images.luxuryescapes.com/0dqb71jf1err21eovkfs",
    "image_two": "https://images.luxuryescapes.com/tte143t3tcxmvc0h0iyc",
    "image_three": "https://images.luxuryescapes.com/wrwrfyio33xn56m56w",
    "vendor_name": "Tanah Gajah, a Resort by Hadiprana",
    "title": "Award-Winning Ubud Club Suites with Butler Service & Nightly Free-Flow Cocktails",
    "description": "Escape to the undulating hills of Ubud to find sumptuous serenity at the exclusive Tanah Gajah, a Resort by Hadiprana (formerly The Chedi Club). Sitting among 12 acres of verdant rice paddies, this exclusive estate guarantees peace and quiet but is just 3km from the artists’ village of Ubud, where remarkable restaurants and galleries await. This unbelievable resort is rated in the top 1% worldwide on Tripadvisor and was named among the Tripadvisor Travellers’ Choice, Best of the Best 2020 Top 25 Boutique Luxury Hotels in the world.\n\nAs the former estate of Hendra Hadiprana, one of Indonesia’s most respected art collectors, the resort places tranquility at its forefront, with lotus ponds and reflection pools scattered amid the 20 villas and suites. Rediscover the true meaning of relaxation with a day of pampering at the spa, or take to the skies with Bali’s first hot-ballooning adventure. Dine among the rice paddies or learn about Balinese culture with onsite cooking classes, dramatic Kecak dance performances and tours of the surrounding landscapes. Unwind in a sumptuous suite or pool villa with club access and let your private butler look after your every need, from babysitting to poolside pampering.\n\n**Luxury Escapes inclusions (select nights)**\n\n- Wake up to à la carte **breakfast every morning**\n- From poolside pampering to unpacking, your **private butler** will look after your every need\n- Get into the holiday spirit with **free-flow sunset cocktails served daily** between 6pm and 7pm\n- Experience relaxation with **a 60-minute massage per person**\n- Never go thirsty with a **fresh minibar every day**, updated with beer, juices and soft drinks\n- Sample an afternoon pick-me-up with **daily afternoon tea** in your room, or in the resort’s bar or lounge\n- Catch up on the news with a **daily newspaper** delivered to your door, alongside **seasonal fresh fruits**\n- Sample a **delicious three-course lunch or dinner** **for two** at The Tempayan (for stays of 2+ nights)\n- Travel to Tanah Gajah, a Resort by Hadiprana in style with a **one-way airport transfer** (for stay of 3+ nights)\n- It’s the impossible choice: **an additional 60-minute massage each or three-course dinner for two** at the resort’s thatched-roof restaurant (for stays of 5+ nights)\n- Arrive and depart relaxed with **return airport transfers** (for stays of 7+ nights)\n\n**Travelling with friends or family?** For a little extra space, upgrade to the Two Bedroom Club Family Pool Villa, where a tropical garden, private pool and outdoor bathtub await. Packages valid for two adults and two children (aged 11 years and under). For four adults, check out the incredible Hadiprana Estate, once the master accommodation for the resort’s founder. Soak your day away in the outdoor jacuzzi or find a special spot around the 10m private pool.\n\n**Tripadvisor Travellers’ Choice, Best of the Best 2020** Top 25 Boutique Luxury Hotels - World",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Tanah Gajah, a Resort by Hadiprana.",
    "offer_address": "Tengkulak Kaja, Jl. Raya Goa Gajah, Kemenuh, Ubud, Gianyar, Bali 80571, Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ClNgbYAF",
    "hero_image": "https://images.luxuryescapes.com/pvdy9rbl85lfo6xdlp9d",
    "image_two": "",
    "image_three": "",
    "vendor_name": "K Club Ubud",
    "title": "K Club- LPC & LE+- OCT24",
    "description": "x",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Tegallalang",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "K-Club Ubud",
    "offer_address": "Jalan Raya Cebok, Kedisan Tegallalang, Kedisan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80561, Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 31,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GlA8AAK",
    "hero_image": "https://images.luxuryescapes.com/3c44dr28id36mj5ojpqe",
    "image_two": "https://images.luxuryescapes.com/461v0mz97ep2aa1fn8wo",
    "image_three": "https://images.luxuryescapes.com/4xr6vh575c29cx940ql37",
    "vendor_name": "Hanging Gardens of Bali",
    "title": "Secluded Jungle Pool Villas near Ubud",
    "description": "Suspended over the lush jungle, bursting with orchids, bamboo, and coffee trees, Hanging Gardens of Bali is an exotic Eden near Ubud. Watch the world melt away from the famed two-tier pool, which appears to float above the mist-covered forest below. Marvel at awe-inspiring views that stretch down to the Ayung River, across the valley to the sacred Dalem Segara Temple, discover the vibrance of Ubud Town - less than a 30-minute shuttle away - and find serenity in the riverside spa by The Spa Collection.\n\nRomantic pathways lead to Hanging Gardens of Bali’s 44 secluded pool villas, and getting around this vertiginous property is simple: you’ll be whisked up and down the hill via the onsite monorail. Dining at the Feng Shui-inspired Three Elements Restaurant is an award-winning feast for the senses. Here, enjoy not only a tantalising culinary journey, but also views of the pool, valley, and, after dusk, the glow of hundreds of romantic candles.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Payangan",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Hanging Gardens of Bali.",
    "offer_address": "Br. Susut Desa Buahan, Payangan, Gianyar Bali 80362 Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 833.0,
    "value": 833.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQpeqAAD",
    "hero_image": "https://images.luxuryescapes.com/4wrjdc6dum47wq43erlb",
    "image_two": "https://images.luxuryescapes.com/6anly7dxnhe063aa97xk",
    "image_three": "https://images.luxuryescapes.com/w3fq2ndlc5ofqc4rpuo4",
    "vendor_name": "Blue Karma Dijiwa Ubud",
    "title": "Ubud Jungle Sanctuary with Yoga & Wellness Spa",
    "description": "Shut the world out from your private sanctuary at Blue Karma Dijiwa Ubud. Tucked away in the tranquil Ubud jungle, this magnetic hideaway beckons guests to indulge in the theraputic sounds of sprawling Balinese wildlife while blurring the lines between the outdoors and in. Rejuvinate your mind and body with a superfood meal at the Botanist Restaurant, where local produce are championed in nutrient-rich dishes, or immerse yourself in a full-body wellness treatment at Flying Bamboo Spa.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Indonesia",
    "location_description": "Blue Karma Dijiwa Ubud",
    "offer_address": "Jalan Kelabang Moding, Banjar Bentuyung, Ubud, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 128.0,
    "value": 128.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070HUzAAM",
    "hero_image": "https://images.luxuryescapes.com/5u3fcae93a8alxirjx4c",
    "image_two": "https://images.luxuryescapes.com/f82xbntc1ccaejq2a2ly",
    "image_three": "https://images.luxuryescapes.com/v84pamwa1fjqhjky7e8n",
    "vendor_name": "Kayumanis Ubud Private Villa & Spa",
    "title": "Ubud Five-Star Pool Villa Luxury with Butler Service",
    "description": "Escape to the lush, undulating hills of Ubud in search of your own private slice of Bali paradise at the five-star Kayumanis Ubud Private Villa & Spa, an urban sanctuary ranked among Tripadvisor’s top 10% of properties worldwide. This luxury retreat is home to just 23 elegantly appointed villas, each offering butler service and private pools.\n\nHidden within a tropical forest overlooking the Ayung River, and home to an intimate collection of one, two and three-bedroom villas, this heavenly retreat radiates tranquility, while only five minutes from the artists' village of Ubud. Unwind with a day of pampering at Kayumanis Spa Ubud or indulge in a romantic feast high over the river valley at Dining Corner. Take in Ubud's beauty with a guided tour, enrich your home recipes with onsite cooking classes or learn how to relax, meditate and harmonise your body through yoga (surcharges apply to activities).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Ubud Private Villa & Spa",
    "offer_address": "Jl. Raya Sayan Jl. Baung, Sayan, Kecamatan Ubud, Kabupaten Gianyar, Bali 80571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 226.0,
    "value": 226.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQpgrAAD",
    "hero_image": "https://images.luxuryescapes.com/2a8mgg0ut6fhr9jmcp5n",
    "image_two": "https://images.luxuryescapes.com/wip9fjbal88r571lcqos",
    "image_three": "https://images.luxuryescapes.com/5mmv6rphrs7nbqogt8",
    "vendor_name": "Arkamara Dijiwa Ubud",
    "title": "Elegant Five-Star Ubud Jungle Oasis near Sacred Monkey Forest",
    "description": "Escape to a five-star, evergreen wonderland close to Bali’s iconic Sacred Monkey Forest Sanctuary at the gorgeous Arkamara Dijiwa Ubud. Enjoy genuine hospitality, the harmony of a traditional Balinese village and pure tranquillity within the scenic surroundings and glistening outdoor pools of this retreat. Your days will be spent luxuriating at the onsite Kamalini Spa, treating your tastebuds to elegant Indonesian cuisine at Kaukau Restaurant or sipping a sundowner at Akasa Rooftop Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "Arkamara Dijiwa Ubud",
    "offer_address": "Jalan Katik Lantang, Singakerta, Ubud, Gianyar 80571, Bali, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 116.0,
    "value": 116.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004iCXlAAM",
    "hero_image": "https://images.luxuryescapes.com/dx9g8q9yzq41245ib55",
    "image_two": "https://images.luxuryescapes.com/kowve5gqfe6es31aomoq",
    "image_three": "https://images.luxuryescapes.com/oyppkmtsqbsm5g0gczzb",
    "vendor_name": "The Purist Villas and Spa",
    "title": "Boutique Ubud Jungle Retreat",
    "description": "Find your jungle-fringed paradise at The Purist Villas and Spa, a boutique resort set among the rolling green hills of Ubud, Bali’s spiritual heart. Nestled amid lush gardens, the resort offers 18 unique, contemporary suites and villas to choose from, each one more stunning than the last. Enjoy peaceful seclusion tucked away behind rural roads, terraced rice fields and layers of jungle, while Ubud’s central hub is only a five-minute drive away, so you’re never too far from small-town convenience.\n\nSpend blissful days by the pool (there are two to choose from), book in an indulgent spa treatment at the onsite Purist Spa, join a yoga class or dine alfresco on classic Indonesian cuisine at Café Balisimo. This is the perfect place to relax and recharge. Meanwhile, the serenity of Ubud, along with its cultural curiosities - galleries, local street markets and temples - is a breath of fresh air from the everyday.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ubud",
    "location_heading": "Ubud",
    "location_subheading": "Bali",
    "location_description": "The Purist Villas and Spa",
    "offer_address": "JL. Tirta Tawar, Banjar Kutuh Kaja 80571 Ubud, Bali, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 150.0,
    "value": 150.0
  }
]