[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbHmhAAF",
    "hero_image": "https://images.luxuryescapes.com/vd7pna7xql9ar3atidth",
    "image_two": "https://images.luxuryescapes.com/r5ael849ougbdnktmcv",
    "image_three": "https://images.luxuryescapes.com/suywltncwaqp9idphh7",
    "vendor_name": "Château de Fonscolombe",
    "title": "Provence 18th Century Relais & Châteaux Luxury with Onsite Winery & Daily Breakfast",
    "description": "Experience a fusion of modern comforts and historic elegance at this prestigious five-star getaway, where a centuries-old stone pond has been transformed into a serene swimming pool, accompanied by a stunning arboretum. Nestled among the renowned Relais & Châteaux collection and surrounded by lush landscapes, this revered chateau beckons you to partake in a lavish retreat reminiscent of aristocratic indulgence. Inside, period chinoiserie designs and Italian leather tapestries line beautiful walls, while canopied beds, sculpted fireplaces and soft colours reflect the chic, rustic Provencal charm of the estate's past.\n\nIn summer, guests may opt to dine under the huge 300-year-old bald cypress, as the property's stylish L'Orangerie restaurant goes alfresco. Go beyond the estate gardens to uncover charming towns lined with cafes, museums, and historic monuments. As the warm breeze rolls in, expect to find markets and events hosted along the town’s cobblestoned streets, and join in the lively atmosphere.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Provence - Alpes - Cote d'Azur",
    "offer_geo_area_level_2": "Le Puy-Sainte-Reparade",
    "location_heading": "Le Puy-Sainte-Réparade",
    "location_subheading": "France",
    "location_description": "Château de Fonscolombe",
    "offer_address": "3301 Route de Saint-Canadet, Le Puy-Sainte-Réparade, France",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 11,
    "price": 589.0,
    "value": 1600.0
  }
]