[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007or2OAAQ",
    "hero_image": "https://images.luxuryescapes.com/t5krgduszo0ehqkr7hzb",
    "image_two": "https://images.luxuryescapes.com/t84ds0sbmdn7dhcq2ir",
    "image_three": "https://images.luxuryescapes.com/a86xz9mdojcppdekb43w",
    "vendor_name": "Quinta Real Acapulco",
    "title": "Mexico Seaside Retreat with Prime Acapulco Beachfront Location",
    "description": "A seaside stay awaits in Mexico at the grand Quinta Real Acapulco. An impressive five-storey property located in the Zona Diamante area, the hotel has been wowing its guests since its opening in 1998 thanks to incredible views over Punta Diamante beach and unbeatable facilities. Along with the spacious, tastefully decorated suites, there are three exceptional onsite restaurants where you can enjoy a tasty meal; Buenavista serves up authentic Mexican and international cuisine with seaside views, Club de Playa La Bocana is your go-to eatery for fresh seafood and the Lobby Bar is all about lavish cocktails and live music. When you need a break from the heat, take a dip in the expansive swimming pool, located steps from the beach, or opt to hide out at the day spa and indulge in a rejuvenating treatment.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Guerrero",
    "offer_geo_area_level_2": "Acapulco",
    "location_heading": "Acapulco",
    "location_subheading": "Mexico",
    "location_description": "Quinta Real Acapulco",
    "offer_address": "Paseo de la Quinta No. 6, Fracc. Real Diamante, Acapulco de Juárez, Guerrero, C.P. 39907, México",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004URHeAAO",
    "hero_image": "https://images.luxuryescapes.com/pz7hbcm01uhtqmj9w9bh",
    "image_two": "https://images.luxuryescapes.com/gtt4tffimbqd3fiuf4",
    "image_three": "https://images.luxuryescapes.com/b789xc315bshwps30b0n",
    "vendor_name": "Banyan Tree Cabo Marqués",
    "title": "Mexico Five-Star Private Pool Villas on Diamond Zone Cliffs",
    "description": "Perched on the dazzling cliffs of the Diamond Zone, the luxury and comfort of the five-star Banyan Tree Cabo Marqués is only matched by its breathtaking views. Concealed within a private gated community, this spectacular resort is the pinnacle of seclusion and relaxation. Indulge in uninterrupted views of the Pacific Ocean while unwinding in your own private heated pool  - the perfect setting for a moment of peace. Make the most out of the revitalising experience with specially crafted relaxing bath rituals or welcome the sun with graceful yoga sessions. Explore the intricacies of the dishes of each different Mexican region and try the finest Mexican tequila and mezcal at the hotel's four dining venues. \n\nKids will be excited with their own tepee in-villa, while parents can soak away their stress at the award-winning Banyan Tree Cabo Marqués Spa. Head down the magnificent cliffs to explore Acapulco and Cabo Marqués, filled with natural wonders and vibrant events for an immersive experience of the Mexican Pacific coast.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Guerrero",
    "offer_geo_area_level_2": "Puerto Marques",
    "location_heading": "Acapulco",
    "location_subheading": "Mexico",
    "location_description": "Banyan Tree Cabo Marqués",
    "offer_address": "Blvd. Cabo Marqués Lote 1 Col. Punta Diamante Acapulco, Guerrero Mexico 39907",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 18,
    "price": 264.0,
    "value": 264.0
  }
]