[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lgw7AAC",
    "hero_image": "https://images.luxuryescapes.com/dkhug86shmb7fnryq0c",
    "image_two": "https://images.luxuryescapes.com/pw7hxp0aw482pzxq6jh",
    "image_three": "https://images.luxuryescapes.com/fh7rgrwvctswoyklbqth",
    "vendor_name": "Cugo Gran Macina Grand Harbour",
    "title": "Luxurious Maltese Escape Inside Historic Fortress Walls",
    "description": "Experience a luxurious escape at the Cugó Gran Macina Grand Harbour - a sophisticated hotel with a glittering rooftop pool, set within Malta's historic fortress walls. Located on the Senglea harbour, less than 10 minutes by ferry and taxi from Valletta, it's an ideal place to discover why the area is often regarded as the cradle of Maltese history. Your stay includes daily breakfast, a welcome drink on arrival, a complimentary two-course dinner and a glass of wine.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Malta",
    "offer_country_code_alpha_2": "MT",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "",
    "location_heading": "Senglea",
    "location_subheading": "Malta",
    "location_description": "Cugó Gran Macina Grand Harbour - Feb 2020",
    "offer_address": "Sheer Bastion, Triq Il-31 Ta'Marzu, L-Isla ISL 1040, Malta",
    "percentage_discount": 69.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 588.0,
    "value": 1909.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GjPIAA0",
    "hero_image": "https://images.luxuryescapes.com/wx9lpdhswrym2umj6anv",
    "image_two": "https://images.luxuryescapes.com/92lkchp07nt5plunxy1d",
    "image_three": "https://images.luxuryescapes.com/c30tblv2t5xmu5lm5u",
    "vendor_name": "Cugo Gran Macina Grand Harbour",
    "title": "Malta Harbourside Suite Escape in Luxe Historic Fortress",
    "description": "Experience a luxurious escape at Cugó Gran Macina Grand Harbour - a sophisticated hotel set within a restored historic fortress in dreamy Malta. Located on the Senglea harbour - a fortified city with a historic waterfront buzzing with cafés and restaurants - this charming hotel sets the stage for a magical stay in this sun-kissed destination.\n\nBoasting 300 days of sunshine a year, unimaginable history and traditional sandstone buildings and bastions, Malta packs a whole lot of incredible culture into its small archipelago. Explore its hilltop towns, historic seaports, elegant fishing villages and pristine beaches with a stay in one of Malta’s most impressive hotels, an iconic landmark transformed into an international retreat by acclaimed architect Edwin Mintoff.\n\nArt and luxe facilities effortlessly blend in this exquisite harbourside retreat, originally built in 1554 and boasting ancient chalk-white walls, high-vaulted ceilings, Carrara marble and Maltese hard stone, an impressive rooftop pool with sweeping views and an elegant restaurant offering traditional Maltese cuisine.",
    "offer_country_name": "Malta",
    "offer_country_code_alpha_2": "MT",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Senglea",
    "location_heading": "Senglea",
    "location_subheading": "Malta",
    "location_description": "Cugó Gran Macina Grand Harbour",
    "offer_address": "Sheer Bastion, Triq Il-31 Ta'Marzu, L-Isla ISL 1040, Malta",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 7,
    "price": 161.0,
    "value": 161.0
  }
]