[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FPN8PAAX",
    "hero_image": "https://images.luxuryescapes.com/j64rukhlsb1i5cgxo3u",
    "image_two": "https://images.luxuryescapes.com/49uxbj8uzdkrh8ozala7",
    "image_three": "https://images.luxuryescapes.com/ja8kxcy41fqfwajcbwbk",
    "vendor_name": "Conrad Hong Kong",
    "title": "Hong Kong Conrad Luxury on Victoria Harbour with Executive Lounge Access, Daily Breakfast & Evening Drinks",
    "description": "Reach new heights of travel delight with a relaxing and reinvigorating five-star escape to Conrad Hong Kong. Experience an elegant oasis of classic luxury set high above the lively central streets of Hong Kong, overlooking both Victoria Harbour and Victoria Peak. Part of the Conrad Hilton family, this spectacular stay upholds the classic opulence, keen eye for design and warm hospitality the brand is renowned for. Just outside the hotel’s sparkling glass facade, you can spend days designer-shopping, museum-hopping and trendy restaurant-romping to your travelling heart's content.\n\nWhen you’re not galivanting around the sparkling city, discover the hotel’s world-class facilities, including a heated outdoor pool and health club with a sauna and steam room. With an extensive collection of six vibrant bars and restaurants throughout the property, your appetite is sure to be satisfied. Spend time feeling like royalty in the exclusive Executive Lounge with delicious refreshments and breathtaking views. Experience a feast of Northern Italian delicacies and premium wine from the extensive cellar at Nicholini’s. Sample the finest Cantonese cuisine at award-winning Golden Leaf, recognised as one of Hong Kong’s best Chinese restaurants, and sip away on artisan cocktails while listening to live music at Lobby Lounge.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Conrad Hong Kong",
    "offer_address": "No. 88 Queensway Pacific Place, Hong Kong 518000, Hong Kong",
    "percentage_discount": 46.0,
    "min_duration": 4,
    "max_duration": 16,
    "price": 1489.0,
    "value": 2742.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdKJFAA3",
    "hero_image": "https://images.luxuryescapes.com/oji685wc3nk9qsss7h",
    "image_two": "https://images.luxuryescapes.com/69o0a32p2njfc1c2xav",
    "image_three": "https://images.luxuryescapes.com/fppezpqr69hfmxucwdki",
    "vendor_name": "Ovolo Southside",
    "title": "Hong Kong Ovolo Southside Glamour with Daily Breakfast, Free-Flow Drinks & Complimentary Minibar",
    "description": "Bringing a whole new meaning to the term ‘city break’, expect the unexpected in the cooler-than-cool Ovolo Southside, set in a converted warehouse and referencing the area’s industrial past with its ultra-stylish design, exposed concrete, art installations and artistic graffiti. Elevating what once was a simple warehouse to a 1980's inspired wonderland with exclusive facilities, Ovolo Southside dares to be different. Here, surprises await at every turn - find a top-quality restaurant, a rooftop bar offering sweeping views over the city, a premium gym and thoughtful design touches everywhere the eye can see.\n\nHong Kong is a city that never sleeps, where the world's top restaurants, extravagant hotels and the most expensive shopping boutiques sit next to hole-in-the-wall dumpling vendors, street food stalls and busy markets selling everything you could ever imagine - discover it all with ease from your elegant launchpad. Fall in love with one of Hong Kong's most exciting locales, Wong Chuk Hang, just 10 minutes away by MTR to the city's bustling Causeway Bay and 20 minutes from the Central District and SOHO.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Ovolo Southside",
    "offer_address": "64 Wong Chuk Hang Road, Wong Chuk Hang, Southern District, Wong Chuk Hang San Wai AIL 89, China",
    "percentage_discount": 74.0,
    "min_duration": 4,
    "max_duration": 16,
    "price": 479.0,
    "value": 1814.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HpNcIAK",
    "hero_image": "https://images.luxuryescapes.com/9dz0501twbdwximcysrg",
    "image_two": "https://images.luxuryescapes.com/n9txmz92v8b8zy8gwi0k",
    "image_three": "https://images.luxuryescapes.com/zfi84ikw1uiqxyddt5x",
    "vendor_name": "Lanson Place Causeway Bay, Hong Kong",
    "title": "Glamorous Hong Kong Causeway Bay Escape with Return Cathay Pacific Flights for Two, Daily Breakfast & Nightly Free-Flow Drinks",
    "description": "Uncover a world of sparkling European sophistication just steps from Hong Kong's iconic Causeway Bay at one of the city's latest additions to its already glamorous offerings. This luxurious five-star haven finds its home in the vibrant heart of Hong Kong Island, providing a tranquil, pastel-hued sanctuary metres from the city's action.\n\nStep through the recently opened colonial-eqsue façade to discover richly styled spaces, including the hotel's French-inspired all-day restaurant, Salon Lanson. Flooded with natural daylight by day and transforming into a sophisticated nightspot by evening, here you can enjoy delectable breakfast, enjoy incredible club privileges from all-day refreshments to free-flow canape hour and signature cocktails curated by an in-house mixologist.\n\nJust a stone's throw from the renowned Times Square shopping district, the lush Victoria Park and the buzzing bars of Wan Chai, a stay at Lanson Place Causeway Place allows you to rub shoulders with the city's trendsetters, gourmands and fashionistas. After days spent adventuring through this buzzing city, relish the comfort of a chic retreat, seamlessly blending European sophistication with Asian hospitality.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Lanson Place Causeway Bay",
    "offer_address": "133 Leighton Road, Causeway Bay, Hong Kong",
    "percentage_discount": 39.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 914.0,
    "value": 1492.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000IDyLUAA1",
    "hero_image": "https://images.luxuryescapes.com/b1v77yyj36fd67f3jodh",
    "image_two": "https://images.luxuryescapes.com/bkkwtkq6gporupgxybqc",
    "image_three": "https://images.luxuryescapes.com/buiqvqmpsmxqysk30u8w",
    "vendor_name": "JW Marriott Hotel Hong Kong",
    "title": "JW Marriott Luxury in the Heart of Hong Kong",
    "description": "Experience an unforgettable five-star city escape at the JW Marriott Hotel Hong Kong, located near the city’s famous harbour, SoHo entertainment district and Pacific Place shopping complex. Enjoy a four-night stay in the heart of Hong Kong including daily buffet breakfasts, a six-course Chinese dining experience at Man Ho Chinese restaurant, a welcome cocktail each, late checkout and more for only $1,799 for two adults, valued up to $3,236.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "",
    "location_heading": "Hong Kong",
    "location_subheading": "",
    "location_description": "JW Marriott Hotel Hong Kong [192606] JW Marriott Luxury in the Heart of Hong Kong",
    "offer_address": "Pacific Place, 88 Queensway, Hong Kong",
    "percentage_discount": 48.0,
    "min_duration": 4,
    "max_duration": 8,
    "price": 1039.0,
    "value": 2008.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HjVInYAN",
    "hero_image": "https://images.luxuryescapes.com/bs2wnia0jljog5v2inag",
    "image_two": "https://images.luxuryescapes.com/u8cwquzgvcqqj23fsrka",
    "image_three": "https://images.luxuryescapes.com/8dorsavw43lo40a408s",
    "vendor_name": "EAST Hong Kong",
    "title": "Hong Kong Five-Star Victoria Harbour Retreat with Daily Breakfast, Nightly Drinks & Dining Credit",
    "description": "Experience the romance of disappearing into a glittering cityscape from your sky-high stay at this five-star lifestyle hotel. In the heart of Taikoo Shing, the eastern business district, EAST Hong Kong fosters complete cosmopolitan immersion with the charm of local neighbourhood surroundings.\n\nExplore the city's iconic waterfront by bike, or shop up a drop at the CityPlaza Shopping Center, connected to the design-driven hotel. Should further adventures be calling, the Tai Koo MTR is just steps away, connecting you to the rest of the vibrant city.\n\nCome sunset, venture up to the Sugar rooftop bar for signature cocktails and tasty tapas with views over the harbour, or take a culinary adventure at FEAST (Food by EAST), the bustling eatery featuring international cuisine with fresh flavours. Best of all, you can rest your head knowing that your stay isn't harming the planet: the majority of products being recyclable or reusable and plant-based fare commonplace on restaurant menus, while in-room water filters leave little need for single-use plastics.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "EAST Hong Kong",
    "offer_address": "29 Taikoo Shing Road, Taikoo Shing, Hong Kong",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 449.0,
    "value": 1047.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ey5evAAB",
    "hero_image": "https://images.luxuryescapes.com/2pd9gr9js10ju452w9b",
    "image_two": "https://images.luxuryescapes.com/29bsxluhhbzxv7mgin4q",
    "image_three": "https://images.luxuryescapes.com/cidxts143s2drbq3dnp",
    "vendor_name": "EAST Hong Kong",
    "title": "Hong Kong Victoria Harbour Retreat with Daily Breakfast, Nightly Drinks & Cathay Pacific Return Flights for Two",
    "description": "Experience the romance of disappearing into a glittering cityscape from your sky-high stay at EAST Hong Kong. In the heart of Taikoo Shing, the eastern business district, this lifestyle hotel fosters complete cosmopolitan immersion with the charm of local neighbourhood surroundings and is attached to one of the largest shopping malls in Hong Kong. Bikes are also on hand for adventures further afield, with plenty of pathways along the city’s iconic waterfront. The unique birdnest staircase invites guests to EAST Hong Kong’s contemporary lobby, setting the scene for design-driven interiors. Sustainability is the hotel's foremost initiative, with the majority of products being recyclable or reusable and plant-based fare commonplace on restaurant menus, while in-room water filters leave little need for single-use plastics.\n\nYou won’t have to go far to find awe-inspiring skyline vistas - venture up to the rooftop bar, Sugar, for signature cocktails and tasty tapas with views over the harbour, or take a culinary adventure at FEAST (Food by EAST), the bustling eatery featuring international cuisine with fresh flavours. The next morning, work off last night’s indulgences with a session at BEAST (Body by EAST), the 24-hour, naturally lit gym, complete with a heated outdoor pool.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "EAST Hong Kong",
    "offer_address": "29 Taikoo Shing Road, Taikoo Shing, Hong Kong",
    "percentage_discount": 74.0,
    "min_duration": 2,
    "max_duration": 13,
    "price": 884.0,
    "value": 3379.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxlLXAAZ",
    "hero_image": "https://images.luxuryescapes.com/nwfas1nj85dftaeamd9",
    "image_two": "https://images.luxuryescapes.com/i1ul3wyoepwdirwdb3f",
    "image_three": "https://images.luxuryescapes.com/jcfrqnnarnu8k3h2utdh",
    "vendor_name": "Lanson Place Causeway Bay, Hong Kong",
    "title": "Grand Opening: Glamorous Hong Kong Causeway Bay Escape with Daily Breakfast, Club Access & Nightly Free-Flow Cocktail Hour",
    "description": "Uncover a world of sparkling European sophistication just steps from Hong Kong's iconic Causeway Bay at one of the city's latest additions to its already glamorous offerings. Swiftly earning its stripes as one of the most sought-after hotels in the bustling city, this luxurious five-star haven finds its home in the vibrant heart of Hong Kong Island, providing a tranquil, pastel-hued sanctuary metres from the city's action. Step through the recently opened colonial-eqsue façade to discover richly styled spaces, including the hotel's French-inspired all-day restaurant, Salon Lanson. Flooded with natural daylight by day and transforming into a sophisticated nightspot by evening, here you can enjoy delectable breakfasts, enjoy incredible club privileges from all-day refreshments to free-flow canape hour and signature cocktails curated by an in-house mixologist.\n\nJust a stone's throw from the renowned Times Square shopping district, the lush Victoria Park, and the buzzing bars of Wan Chai, a stay at Lanson Place Causeway Place allows you to rub shoulders with the city's trendsetters, gourmands and fashionistas. Immerse yourself in local traditions at the historic Tin Hau Temple, or experience the vibrant energy of Causeway Bay with a wander through its high-end offerings. After days spent adventuring through this buzzing city, relish the comfort of a chic retreat, seamlessly blending European sophistication with Asian hospitality.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Lanson Place Causeway Bay",
    "offer_address": "133 Leighton Road, Causeway Bay, Hong Kong",
    "percentage_discount": 36.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 899.0,
    "value": 1407.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DfuiKAAR",
    "hero_image": "https://images.luxuryescapes.com/nrmfg6kk534cex830sn",
    "image_two": "https://images.luxuryescapes.com/79cw9q8lr9avkwlbvvzn",
    "image_three": "https://images.luxuryescapes.com/duy0hj2gh3gfauplg7pj",
    "vendor_name": "EAST Hong Kong",
    "title": "Hong Kong Lifestyle Retreat overlooking Victoria Harbour with Rooftop Bar, Daily Breakfast & Nightly Drinks",
    "description": "Experience the romance of disappearing into a glittering cityscape from your sky-high stay at EAST Hong Kong. In the heart of Taikoo Shing, the eastern business district, this lifestyle hotel fosters complete cosmopolitan immersion with the charm of local neighbourhood surroundings. Bikes are also on hand for adventures further afield, with plenty of pathways along the city’s iconic waterfront. The unique birdnest staircase invites guests to EAST Hong Kong’s contemporary lobby, setting the scene for design-driven interiors. Sustainability is the hotel's foremost initiative, with the majority of products being recyclable or reusable and plant-based fare commonplace on restaurant menus, while in-room water filters leave little need for single-use plastics. \n\nYou won’t have to go far to find awe-inspiring skyline vistas - venture up to the rooftop bar, Sugar, for signature cocktails and tasty tapas, or take a culinary adventure at FEAST (Food by EAST), the bustling eatery featuring international cuisine with fresh flavours. The next morning, work off last night’s indulgences with a session at BEAST (Body by EAST), the 24-hour, naturally lit gym, complete with a heated outdoor pool.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "EAST Hong Kong",
    "offer_address": "29 Taikoo Shing Road, Taikoo Shing, Hong Kong",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 13,
    "price": 629.0,
    "value": 1480.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EyVjRAAV",
    "hero_image": "https://images.luxuryescapes.com/3m8zutsvtepnc4in1dk",
    "image_two": "https://images.luxuryescapes.com/rxaijuajxiptu2ndvrpk",
    "image_three": "https://images.luxuryescapes.com/8cnvnzhise3z7feo7dnl",
    "vendor_name": "Ovolo Southside",
    "title": "Hong Kong Ovolo Southside Glamour with Daily Breakfast, Free-Flow Drinks & Cathay Pacific Return Flights for Two",
    "description": "Bringing a whole new meaning to the term ‘city break’, expect the unexpected in the cooler-than-cool Ovolo Southside, set in a converted warehouse and referencing the area’s industrial past with its ultra-stylish design, exposed concrete, art installations and artistic graffiti. Elevating what once was a simple warehouse to a 1980's inspired wonderland with exclusive facilities, Ovolo Southside dares to be different. Here, surprises await at every turn - find a top-quality restaurant, a rooftop bar offering sweeping views over the city, a premium gym and thoughtful design touches everywhere the eye can see.\n\nHong Kong is a city that never sleeps, where the world's top restaurants, extravagant hotels and the most expensive shopping boutiques sit next to hole-in-the-wall dumpling vendors, street food stalls and busy markets selling everything you could ever imagine - discover it all with ease from your elegant launchpad. Fall in love with one of Hong Kong's most exciting locales, Wong Chuk Hang, just 10 minutes away by MTR to the city's bustling Causeway Bay and 20 minutes from the Central District and SOHO.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Ovolo Southside",
    "offer_address": "64 Wong Chuk Hang Road, Wong Chuk Hang, Southern District, Wong Chuk Hang San Wai AIL 89, China",
    "percentage_discount": 85.0,
    "min_duration": 4,
    "max_duration": 16,
    "price": 574.0,
    "value": 3711.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HnXDzYAN",
    "hero_image": "https://images.luxuryescapes.com/onjagved2kh8xuygyor",
    "image_two": "https://images.luxuryescapes.com/j69zmbowkhqeoxa15vl4",
    "image_three": "https://images.luxuryescapes.com/zpgq60io2ng5c8g6w53",
    "vendor_name": "Lanson Place Causeway Bay, Hong Kong",
    "title": "Hong Kong Causeway Bay Glamour with Club Lounge Benefits, Daily Breakfast & Nightly Free-Flow Drinks",
    "description": "Discover a realm of European elegance just steps from Hong Kong's iconic Causeway Bay. This luxurious five-star haven finds its home in the vibrant heart of Hong Kong Island, providing a tranquil, pastel-hued sanctuary metres from the city's action.\n\nStep through Lanson Place Causeway Bay's colonial-esque facade to discover richly styled spaces, including Salon Lanson, the hotel's French-inspired all-day restaurant. Bathed in natural daylight by day, it transforms into a sophisticated nightspot, offering a delectable breakfast, exclusive club privileges, all-day refreshments, free-flow canapé hour and signature cocktails.\n\nAround the corner from Times Square shopping district, Victoria Park and the buzzing bars of Wan Chai, a stay at this relaxing retreat allows you to rub shoulders with the city's trendsetters, gourmands and fashionistas.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Lanson Place Causeway Bay",
    "offer_address": "133 Leighton Road, Causeway Bay, Hong Kong",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 749.0,
    "value": 1527.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X9I6vQAF",
    "hero_image": "https://images.luxuryescapes.com/xxn3sk6bq8cxz2c0tibj",
    "image_two": "https://images.luxuryescapes.com/o2ierbxnhifcm7gh7xsx",
    "image_three": "https://images.luxuryescapes.com/pvikbn3wtesrhuvoshpl",
    "vendor_name": "Regal Kowloon Hotel",
    "title": "Upscale Stay with the Best of Hong Kong on Your Doorstep",
    "description": "Immerse yourself in the vibrant culture and exciting culinary scene of Hong Kong, staying in one of the most popular districts: Kowloon. Discover everything Hong Kong has to offer staying at the stylish Regal Kowloon Hotel, and enjoy daily buffet breakfast, a HKD200 food and drinks credit and a guaranteed leisurely late 1pm checkout.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Kowloon",
    "offer_geo_area_level_2": "Kowloon",
    "location_heading": "Hong Kong",
    "location_subheading": "China",
    "location_description": "Regal Kowloon Hotel",
    "offer_address": "71 Mody Rd, Tsim Sha Tsui East, Hong Kong",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 439.0,
    "value": 1250.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UuhHoQAJ",
    "hero_image": "https://images.luxuryescapes.com/haxzy77m3xkevlc9pzyt",
    "image_two": "https://images.luxuryescapes.com/piiikzg8in72omq2ccbj",
    "image_three": "https://images.luxuryescapes.com/hy5qzb5fsuxnshhnajkn",
    "vendor_name": "Hotel Vic On The Harbour Hong Kong",
    "title": "Grand Opening: Hong Kong’s Hottest Harbourfront Hotel",
    "description": "Experience the grand opening of an urban designer getaway at the brand-new, tech-savvy Hotel VIC on the Harbour and lounge by the spectacular rooftop infinity pool overlooking Victoria Harbour. Stay waterfront in trendy North Point and immerse yourself in the vibrant culture and exciting culinary scene of Hong Kong with daily buffet breakfast, resort credit to share, complimentary minibar on arrival and a guaranteed late 1pm checkout. Plus, two kids 11 and under stay free (see 'Fine Print' for details).",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "China",
    "location_description": "Hotel VIC On The Harbour",
    "offer_address": "1 North Point Estate Lane, North Point, Hong Kong",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 510.0,
    "value": 1355.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CMOpaYAH",
    "hero_image": "https://images.luxuryescapes.com/bide664j5ajiv5oo0j4up",
    "image_two": "https://images.luxuryescapes.com/a1a1s3zizyru3euxe6",
    "image_three": "https://images.luxuryescapes.com/ddgarlndli788lmbh17",
    "vendor_name": "EAST Hong Kong",
    "title": "Hong Kong Victoria Harbour Retreat with Daily Breakfast, Nightly Drinks & Rooftop Bar",
    "description": "Experience the romance of disappearing into a glittering cityscape from your sky-high stay at EAST Hong Kong. In the heart of Taikoo Shing, the eastern business district, this lifestyle hotel fosters complete cosmopolitan immersion with the charm of local neighbourhood surroundings.\n\nBikes are also on hand for adventures further afield, with plenty of pathways along the city’s iconic waterfront. The unique birdnest staircase invites guests to EAST Hong Kong’s contemporary lobby, setting the scene for design-driven interiors.\n\nSustainability is the hotel's foremost initiative, with the majority of products being recyclable or reusable and plant-based fare commonplace on restaurant menus, while in-room water filters leave little need for single-use plastics.\n\nYou won’t have to go far to find awe-inspiring skyline vistas - venture up to Sugar rooftop bar for signature cocktails and tasty tapas with views over the harbour, or take a culinary adventure at FEAST (Food by EAST), the bustling eatery featuring international cuisine with fresh flavours.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "EAST Hong Kong",
    "offer_address": "29 Taikoo Shing Road, Taikoo Shing, Hong Kong",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 559.0,
    "value": 1241.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000JHsrqAAD",
    "hero_image": "https://images.luxuryescapes.com/glg8cnvgurgozi7lbzzs",
    "image_two": "https://images.luxuryescapes.com/keuk9lelfr0f5mqdjuy2",
    "image_three": "https://images.luxuryescapes.com/l9ff3yszbuaisjy9nknn",
    "vendor_name": "The Upper House",
    "title": "The Pinnacle of Luxury at the #1 Hotel in Hong Kong",
    "description": "Discover unparalleled five-star indulgence staying at the #1 hotel in Hong Kong, The Upper House. Spend four nights in the heart of one of the world's most exciting cities and enjoy daily a la carte breakfasts, private return airport transfers, a world-class dining experience at Café Gray Deluxe featuring dishes created by Michelin-starred chef Gray Kunz, nightly mixologist-created cocktails at the 49th-floor bar and more for only $1,499 per person (twin share), valued up to $5,233. Watch the video below.",
    "offer_country_name": "",
    "offer_country_code_alpha_2": "",
    "offer_geo_area_level_1": "Adrar Province",
    "offer_geo_area_level_2": "",
    "location_heading": "Hong Kong",
    "location_subheading": "",
    "location_description": "The Upper House [201990] The Upper House 26/03/2017 Escapes",
    "offer_address": "Pacific Place, 88, Queensway, Admiralty Hong Kong",
    "percentage_discount": 43.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 1999.0,
    "value": 3494.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CwHnCAAV",
    "hero_image": "https://images.luxuryescapes.com/x6vy4c4n2q6dakyj6vs",
    "image_two": "https://images.luxuryescapes.com/5nr822pt6yn9zhugqkrh",
    "image_three": "https://images.luxuryescapes.com/6qa52zd49prw1w1yivlb",
    "vendor_name": "The Peninsula, Hong Kong",
    "title": "Hong Kong's Most Iconic Five-Star Harbourside Heritage Escape with Michelin Restaurants, Daily Breakfast & Nightly Cocktails",
    "description": "Discover Hong Kong’s triumph at renowned heritage icon The Peninsula Hong Kong, eminently positioned in glamorous Tsim Sha Tsui and boasting spectacular views over Victoria Harbour and one of the finest skylines in the world. Hong Kong’s oldest and most prestigious hotel effortlessly blends timeless elegance, unrivalled service and an unbeatable central Kowloon location for a sublime five-star stay beyond compare. Embark on a culinary journey across eight world-class restaurants - including sumptuous Cantonese seafood and dim sum at the Michelin-starred Spring Moon - or experience Hong Kong’s most celebrated high tea beneath The Lobby’s grand, gold-corniced ceiling.\n\nAfter days spent discovering Hong Kong’s countless charms - including lofty Victoria Peak and Lantau’s sprawling wilderness - return to quiet moments of repose by The Peninsula Hong Kong’s Roman-inspired indoor pool or acclaimed wellness retreat The Peninsula Spa for gentle treatments backed by ancient Chinese tradition. Those preferring retail therapy won't be disappointed - even in a city legendary for its shopping, onsite The Peninsula Arcade offers a truly extraordinary upscale luxury experience, hosting brands such as Chanel, Rolex and Louis Vuitton.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Kowloon",
    "offer_geo_area_level_2": "Kowloon",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "The Peninsula Hong Kong",
    "offer_address": "Salisbury Rd, Tsim Sha Tsui, Hong Kong",
    "percentage_discount": 56.0,
    "min_duration": 4,
    "max_duration": 8,
    "price": 2107.0,
    "value": 4763.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Flo77AAB",
    "hero_image": "https://images.luxuryescapes.com/8ljgrk948e643z2g262y",
    "image_two": "https://images.luxuryescapes.com/ftf11xw6xm3hgvbs4fgf",
    "image_three": "https://images.luxuryescapes.com/kzwpnoqbsanpbwmwexg7",
    "vendor_name": "The Sheung Wan by Ovolo",
    "title": "Hong Kong Ovolo Boutique Central Escape with Daily Breakfast Credit, Studio Upgrade & Nightly Cocktails",
    "description": "There’s central and then there’s Central: flanked by incense-filled temples, cutting-edge galleries and quirky cafes, The Sheung Wan by Ovolo offers a designer stay in the heart of one of the city’s most exciting districts. You’ll be close to all of the city’s greatest hits - catch the near-vertical tram to The Peak to soak up spectacular views over the city, antique the day away on Hollywood Road or cross Victoria Harbour’s gentle waters on the world-famous Star Ferry.\n\nReturn to authentic Mexican plates and Hong Kong’s best margaritas at Te Quiero Mucho, the hotel’s fabulous onsite taqueria - the perfect place to toast your escape - or head out to explore the island’s best. There’s next-level shopping - SOHO, The Landmark and IFC are all within walking distance - and some of Hong Kong’s best dining, including renowned offsite coffee roastery, The Cupping Room.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "The Sheung Wan by Ovolo",
    "offer_address": "286 Queen's Road Central, Central 852, Hong Kong",
    "percentage_discount": 51.0,
    "min_duration": 4,
    "max_duration": 16,
    "price": 899.0,
    "value": 1841.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000crZlXQAU",
    "hero_image": "https://images.luxuryescapes.com/2qxog7e8jskgb9lgkhdl",
    "image_two": "https://images.luxuryescapes.com/lrcwgzy9mgjm575r8uft",
    "image_three": "https://images.luxuryescapes.com/a25a3c0593jfv2b4wqo",
    "vendor_name": "Ovolo Southside",
    "title": "Ovolo Southside: Discover Hong Kong’s Coolest Hotel",
    "description": "You are invited to explore the vibrant culture and exciting culinary scene of Hong Kong from the award-winning and conveniently located Ovolo Southside. Where edgy design and love of art meet, Ovolo Southside provides a space brimming with sleek, meticulous design and awe-inspiring art throughout. Located in Wong Chuk Hang, the city’s first warehouse-turned-hotel is a trendy alternative taking you to one of the most authentic districts of the city. The hotel also features an innovative restaurant, a stunning rooftop cocktail bar and brand new Mexican Taqueria. Includes daily breakfast, one hour of free-flow drinks with a selection of wines and beers, complimentary mini bar restocked daily and a semi-buffet style lunch during your stay.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Ovolo Southside",
    "offer_address": "64 Wong Chuk Hang Road, Wong Chuk Hang, Southern District, Wong Chuk Hang San Wai AIL 89, China",
    "percentage_discount": 32.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 491.0,
    "value": 724.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R7aNTQAZ",
    "hero_image": "https://images.luxuryescapes.com/efpc6hm0xrryoyyasu8a",
    "image_two": "https://images.luxuryescapes.com/qopgqoz2su0en7hj5gmo",
    "image_three": "https://images.luxuryescapes.com/qgkkaw80mfkya7vojpn3",
    "vendor_name": "Hotel Icon Hong Kong",
    "title": "Experience One of Hong Kong’s Top 3 Hotels",
    "description": "Embrace the bright lights and oriental delights of Hong Kong. Spend three nights at the super-stylish Hotel ICON - home to award-winning restaurants, a rooftop pool overlooking Hong Kong’s iconic harbour and skyline and a fabulous day spa. Enjoy daily buffet breakfasts, HK$200 credit to spend on spa treatments or food and beverages,  minibar replenished daily and a guaranteed late checkout until 1pm for two.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Kowloon",
    "offer_geo_area_level_2": "Kowloon",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Hotel Icon Hong Kong",
    "offer_address": "17 Science Museum Rd, Tsim Sha Tsui, Hong Kong",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 568.0,
    "value": 2072.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdKKDAA3",
    "hero_image": "https://images.luxuryescapes.com/9fxj978fh2t43gjbvab",
    "image_two": "https://images.luxuryescapes.com/dyujxi8ubxzftndzl95",
    "image_three": "https://images.luxuryescapes.com/f1sq966s4jfbczldksrh",
    "vendor_name": "EAST Hong Kong",
    "title": "Hong Kong Victoria Harbour Retreat with Rooftop Bar, Daily Breakfast & Nightly Drinks",
    "description": "Experience the romance of disappearing into a glittering cityscape from your sky-high stay at EAST Hong Kong. In the heart of Taikoo Shing, the eastern business district, this lifestyle hotel fosters complete cosmopolitan immersion with the charm of local neighbourhood surroundings and is attached to one of the largest shopping malls in Hong Kong. Bikes are also on hand for adventures further afield, with plenty of pathways along the city’s iconic waterfront. The unique birdnest staircase invites guests to EAST Hong Kong’s contemporary lobby, setting the scene for design-driven interiors. Sustainability is the hotel's foremost initiative, with the majority of products being recyclable or reusable and plant-based fare commonplace on restaurant menus, while in-room water filters leave little need for single-use plastics.\n\nYou won’t have to go far to find awe-inspiring skyline vistas - venture up to the rooftop bar, Sugar, for signature cocktails and tasty tapas with views over the harbour, or take a culinary adventure at FEAST (Food by EAST), the bustling eatery featuring international cuisine with fresh flavours. The next morning, work off last night’s indulgences with a session at BEAST (Body by EAST), the 24-hour, naturally lit gym, complete with a heated outdoor pool.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "EAST Hong Kong",
    "offer_address": "29 Taikoo Shing Road, Taikoo Shing, Hong Kong",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 13,
    "price": 421.0,
    "value": 753.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GwFIJAA3",
    "hero_image": "https://images.luxuryescapes.com/x4g4w6clhx3b02gmejon",
    "image_two": "https://images.luxuryescapes.com/1bw01hj5ki91rcn177g",
    "image_three": "https://images.luxuryescapes.com/vda3qn7ihp67x8c4w9ko",
    "vendor_name": "WM Hotel Hong Kong, Vignette Collection",
    "title": "Serene Hong Kong Seaside Escape with Rooftop Infinity Pool, Three Restaurants & International Minimart",
    "description": "Experience a hidden gem removed from the stunning vibrance of Hong Kong at contemporary-cool WM Hotel Hong Kong, Vignette Collection, an IHG Hotel. Nestled among rolling hills on the tranquil Sai Kung seaside, here you can unwind with a dip in the rooftop infinity pool, maintain your fitness routine at the state-of-the-art gym and delight in a delectable dinner at one of three onsite restaurants. When it's time to explore, you're still within easy reach of the bustling city.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "New Territories",
    "offer_geo_area_level_2": "Sai Kung",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "WM Hotel Hong Kong, Vignette Collection, an IHG Hotel",
    "offer_address": "28 Wai Man Road, Sai Kung, New Territories, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 141.0,
    "value": 141.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009E2xTAAS",
    "hero_image": "https://images.luxuryescapes.com/6lv0zoukbyfgrp45e8f",
    "image_two": "https://images.luxuryescapes.com/ycp70vg5sdpmujz64wta",
    "image_three": "https://images.luxuryescapes.com/w2knb1d8jalch9jse3t3",
    "vendor_name": "Mandarin Oriental Hong Kong",
    "title": "Five-Star Hong Kong City Break with Nine Restaurants & Multi-Award-Winning Spa",
    "description": "A sophisticated stay awaits at the legendary Mandarin Oriental, Hong Kong, an icon of the city's luxury hotel landscape since the 1960s. Magnificent views, unrivalled service and cutting-edge facilities put this urban sanctuary on the map, which sits in the heart of the bustling metropolis. Both the hotel and its dreamy, world-class spa were awarded prestigious five-star status by Forbes Travel Guide in 2022. The property's incredible nine bars and restaurants, two of which possess Michelin stars, are renowned for their quality and draw in locals and visitors alike. Head to Man Wah for traditional Cantonese, The Aubrey for Japanese Izakaya and Captain's Bar for classic cocktails - and that's just the beginning.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Mandarin Oriental, Hong Kong",
    "offer_address": "5 Connaught Road Central, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 455.0,
    "value": 455.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt6IAAR",
    "hero_image": "https://images.luxuryescapes.com/ub5e2uy47jx8xp9omoi",
    "image_two": "https://images.luxuryescapes.com/3zr1l8yh1osuwo3s0m5e",
    "image_three": "https://images.luxuryescapes.com/aiyp46oellorpl735gkv",
    "vendor_name": "Hotel Indigo Hong Kong Island",
    "title": "Stylish Hong Kong Escape in the Heart of Wan Chai with Rooftop Infinity Pool",
    "description": "Discover the many wonders of Wan Chai with a stay at Hotel Indigo Hong Kong Island, an IHG Hotel, located among the iconic neighbourhood’s famed collection of storied temples, soaring skyscrapers and rainbow mansions. Head to Indicolite for casual tea, street noodles and majestic views of the city’s historic Old Post Office, Skybar for cockails in the clouds, or the hotel’s glass-bottomed rooftop infinity pool for fun-filled days high in the Wan Chai sky.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Hotel Indigo Hong Kong Island",
    "offer_address": "No. 246 Queen's Road East, Wanchai, Hong Kong, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 153.0,
    "value": 153.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Elhz9YAB",
    "hero_image": "https://images.luxuryescapes.com/gnn4fg57hoekdgkjx9s",
    "image_two": "https://images.luxuryescapes.com/n252kz8d759x8dvn6xy",
    "image_three": "https://images.luxuryescapes.com/5bzmc98s2nk8liibzdl",
    "vendor_name": "IBIS Hong Kong Central and Sheung Wan",
    "title": "Modern Hong Kong Island Escape near Ferry Terminal with Onsite Restaurant & Bar",
    "description": "Step into a haven where modern comfort meets cultural charm, with breathtaking views of Victoria Harbour as your backdrop. Perfectly located in the heart of Sheung Wan, the hotel offers unparalleled convenience, with a tram stop right at your door, the HK-Macau Ferry Terminal just a five-minute walk away and the nearest Mass Transit Railway station within easy reach.\n\nThe hotel's chic rooms offer stunning city or harbour views, while the Taste Restaurant serves a delightful array of international dishes. Start your day with coffee at the Starbucks located onsite before wandering Hollywood Road’s historical gems, including Man Mo Temple, Tai Kwun and Hollywood Road.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "China",
    "location_description": "ibis Hong Kong Central & Sheung Wan",
    "offer_address": "No 28 Des Voeux Road West, Sheung Wan, 0 HONG KONG, Hong Kong SAR, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 75.0,
    "value": 75.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ibqz3AAB",
    "hero_image": "https://images.luxuryescapes.com/hb2per9qh04fbsx8g0r",
    "image_two": "https://images.luxuryescapes.com/fgxavt8gqs90rorcer",
    "image_three": "https://images.luxuryescapes.com/g5hepbnvv82in8tw2y5q",
    "vendor_name": "Mondrian Hong Kong",
    "title": "Sleek Hong Kong Retreat in Tsim Sha Tsui District with Onsite Cocktail Bar & Italian Steakhouse",
    "description": "Discover Hong Kong's infectious energy with this five-star contemporary stay as your base. Gaze out at spectacular views of the city as it wakes up below you, then explore the neon-lit Nathan Road or luxury shopping of Canton Road, easily accessible from the nearby metro station. Ascend to the 38th floor of this sleek hotel and you’ll find Avoca, offering handcrafted cocktails and curated bites. Or, feast on Tuscan steakhouse cuisine at Carna by Dario Cecchini.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Kowloon",
    "offer_geo_area_level_2": "Kowloon",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong SAR",
    "location_description": "Mondrian Hong Kong",
    "offer_address": "8A Hart Avenue, Tsim Sha Tsui, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 160.0,
    "value": 160.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HicEJYAZ",
    "hero_image": "https://images.luxuryescapes.com/r5zxer2344am9c5mkmr",
    "image_two": "https://images.luxuryescapes.com/pjodh0s4pst202srqv08",
    "image_three": "https://images.luxuryescapes.com/gkkdr46u8km1lkzwo0h5v",
    "vendor_name": "Hyatt Regency Hong Kong, Sha Tin",
    "title": "Hong Kong Hyatt Opulence with Onsite Dining, Spa & Kids Club",
    "description": "Hyatt Regency Hong Kong, Sha Tin offers a tranquil yet convenient retreat combining resort-style luxury with urban accessibility. Situated adjacent to University MTR Station, the hotel provides seamless connections to Hong Kong's bustling city centre. Boasting elegantly appointed rooms and suites, many offering stunning views of Tolo Harbour and the surrounding mountains, it is the perfect Hong Kong escape.\n\nEnjoy dining at Sha Tin 18, serving authentic northern Chinese cuisine with creative desserts and signature dishes such as peking duck. When it is time to relax, look no further than Melo Spa for soothing treatments, or unwind at the outdoor swimming pool with a beautiful backdrop and calming views of Kau To Shan mountain.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "New Territories",
    "offer_geo_area_level_2": "Sha Tin",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Hyatt Regency Hong Kong, Sha Tin",
    "offer_address": "18 Chak Cheung Street, New Territories, Sha Tin, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 108.0,
    "value": 108.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP1aYAF",
    "hero_image": "https://images.luxuryescapes.com/7lk2ltoke37y024jhsb8",
    "image_two": "https://images.luxuryescapes.com/95qqsnmegcg9hyi79oth",
    "image_three": "https://images.luxuryescapes.com/glwknn6ldryigndfcenj",
    "vendor_name": "Novotel Hong Kong Century",
    "title": "Elegant Hong Kong Urban Escape near Exhibition Centre with Tranquil Pool & Two Restaurants",
    "description": "Experience the dazzle of Hong Kong with a stay at this Novotel sanctuary, perfectly positioned in the bustling Wan Chai district and within easy reach of the Convention and Exhibition Centre. Savour international flavours and seafood delicacies at Le Cafe, feast on Italian fare at Pepino and indulge at AK's Bar + Lounge while soaking up city views from floor-to-ceiling windows.\n\nSpend your days lounging by the outdoor pool and take advantage of the hotel's prime location to explore the city's premier shopping, dining and entertainment venues at the iconic Causeway Bay. With the famous Star Ferry and tram - locally known as ding-ding - on your doorstep, you can explore the island with complete ease.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Novotel Hong Kong Century",
    "offer_address": "238 Jaffe Road, Wanchai, Hong Kong, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 105.0,
    "value": 105.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FLJroAAH",
    "hero_image": "https://images.luxuryescapes.com/8995mvyl8b55axlg1lrq",
    "image_two": "https://images.luxuryescapes.com/mpf08xcy7v8m5gv10pb",
    "image_three": "https://images.luxuryescapes.com/hsfsyezewuvze2ovcg4t",
    "vendor_name": "The Upper House",
    "title": "Five-Star Designer Hong Kong Sanctuary with Wellness Spa & Rooftop Lawn",
    "description": "In the heart of Hong Kong, where the streets are buzzing with energy, there is The Upper House - a sanctuary of peace that feels worlds away. Embracing modern minimalist design, this inner-city haven exudes a sense of Zen. From the serene blonde-wood yoga room to the wellness suites that afford captivating vistas of the skyline, every element is thoughtfully curated. At the crown of the hotel, the Salisterra restaurant emanates a warm Mediterranean ambience, meanwhile, The Lawn invites you to indulge in delightful moments on the rooftop, a glass of wine in hand. The architectural brilliance of Andre Fu, the renowned designer, reaches its zenith in the guest suites and studios, each one of them offering unparalleled views of the iconic cityscape, reminding you that the electric pull of Hong Kong is never far away.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "The Upper House",
    "offer_address": "88 Queensway, Admiralty, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 448.0,
    "value": 448.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI6BCAA1",
    "hero_image": "https://images.luxuryescapes.com/taosg45w5of7ayrqbntr",
    "image_two": "https://images.luxuryescapes.com/0xjal7q8koys42dk7h",
    "image_three": "https://images.luxuryescapes.com/mh1h35ptox4fytlprzb",
    "vendor_name": "Holiday Inn Express Hong Kong Kowloon East",
    "title": "Holiday Inn Express Hong Kong Kowloon East - IHG LPP",
    "description": "x",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "New Territories",
    "offer_geo_area_level_2": "Sai Kung",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Holiday Inn Express Hong Kong Kowloon East, an IHG Hotel",
    "offer_address": "Tower 4, 3 Tong Tak St, Tseung Kwan O, Hong Kong",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP1bYAF",
    "hero_image": "https://images.luxuryescapes.com/6ndi3nu6r4xb4zz6u8k",
    "image_two": "https://images.luxuryescapes.com/lka2gh1vv78qmbwf34a",
    "image_three": "https://images.luxuryescapes.com/4c0ov4bxflk09taq50qv3",
    "vendor_name": "Novotel Hong Kong Citygate",
    "title": "Contemporary Hong Kong Escape Just Five Minutes from Airport with Outdoor Pool & Complimentary Shuttle",
    "description": "Experience the best of Hong Kong with a stay in the heart of Tung Chung. Perfectly located on Lantau Island - just five minutes from Hong Kong International Airport (and with a complimentary shuttle) -  this stylish haven is your gateway to adventure, with Hong Kong Disneyland within easy reach and the Ngong Ping 360 Cable Car both offering seamless access to the Big Buddha and Po Lin Monastery.\n\nIndulge in culinary delights at Olea, Essence or Moccato and jump into a beautiful outdoor pool. Direct access to Tung Chung MTR puts the city’s vibrant heart within easy reach, while the adjacent Citygate Outlets offer irresistible shopping treasures.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Islands District",
    "offer_geo_area_level_2": "Tung Chung",
    "location_heading": "Hong Kong",
    "location_subheading": "China",
    "location_description": "Novotel Hong Kong Citygate",
    "offer_address": "51 Man Tung Road Tung Chung, Hong Kong, SAR, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 127.0,
    "value": 127.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Cj3hOYAR",
    "hero_image": "https://images.luxuryescapes.com/c59z2ocxd6ys5ascy33",
    "image_two": "https://images.luxuryescapes.com/tuuc54l59y9kckeu909",
    "image_three": "https://images.luxuryescapes.com/pxfe1jn28qurjondubg",
    "vendor_name": "Hyatt Centric Victoria Harbour, Hong Kong",
    "title": "Five-Star Hong Kong Hyatt Waterfront Stay Overlooking Victoria Harbour",
    "description": "Experience the allure of Hong Kong's vibrant harbourfront with a stay at this contemporary lifestyle hotel, the ultimate launchpad for exploring the dynamic city. Hyatt Centric Victoria Harbour Hong Kong offers an elevated stay in the city's bustling North Point district, with the Star Ferry Pier and the fashion-forward Causeway Bay just a short stroll away.\n\nSavour innovative Cantonese cuisine at The Farmhouse, or enjoy panoramic views and creative cocktails at Cruise, the hotel's rooftop restaurant and bar. For a dose of tranquillity, head to the 24-hour fitness centre or take a dip in the dazzling rooftop pool, offering sweeping views of Victoria Harbour.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Hyatt Centric Victoria Harbour Hong Kong",
    "offer_address": "1 North Point Estate Ln, North Point, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 121.0,
    "value": 121.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI6BAAA1",
    "hero_image": "https://images.luxuryescapes.com/k4tbi83vzo2nphz7ri9",
    "image_two": "https://images.luxuryescapes.com/od5mpglymi74xm6jyu",
    "image_three": "https://images.luxuryescapes.com/qjivsfdwesvgnpx2iobl",
    "vendor_name": "Holiday Inn Express Hong Kong Kowloon Cbd2",
    "title": "Modern Hong Kong Stay in the Heart of Kowloon East",
    "description": "Stay and play in the heart of a vibrant Central Business District at Holiday Inn Express Hong Kong Kowloon CBD2, an IHG Hotel. Fuel up with an Express Start Breakfast before heading out for a soothing stroll at Aldrich Bay Park or a shopping spree at the nearby apm shopping mall, the largest in the area. Just 500m from Kwun Tong MTR station,  this urban haven is ideally located to experience everything the scintillating streets of Hong Kong have to offer.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Kowloon",
    "offer_geo_area_level_2": "Kowloon",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Holiday Inn Express Hong Kong Kowloon CBD2, an IHG Hotel",
    "offer_address": "97 How Ming Street, Kwun Tong, Kowloon, Hong Kong, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 84.0,
    "value": 84.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004NMmjAAG",
    "hero_image": "https://images.luxuryescapes.com/xjziqfbffnsjpdioqgr9",
    "image_two": "https://images.luxuryescapes.com/hvr8zwyk7i7eb6yp8bs",
    "image_three": "https://images.luxuryescapes.com/a82hr4m3zikvddol0n9g",
    "vendor_name": "Marco Polo Hongkong Hotel",
    "title": "Five-Star Hong Kong Waterfront Stay Overlooking Victoria Harbour",
    "description": "Perched on the waterfront, with front-row seats to Hong Kong’s spectacular Victoria Harbour, is Marco Polo Hongkong Hotel, arguably one of the region's best-located properties. On your doorstep, you’ll find the high-end boutiques of Canton Road and the premier retail destination Harbour City shopping complex. Feeling peckish? Luckily for you, you’re in the ‘Culinary Capital of Asia’, with endless dining choices within easy walking distance. After time spent exploring the city in-depth, return to the comfort and convenience of your stylish five-star hotel. Feast on delicious Italian meals served with breathtaking harbour views at Cucina restaurant or visit Café Marco for a more casual affair, where fish and chips are served alongside all-day breakfast, mouthwatering curries and more. If you fancy a cocktail, make a beeline for the Lobby Lounge, an elegant space for drinks or afternoon tea. When you’ve had your fill, the hotel’s outdoor swimming pool is the perfect place for a dip, while the 24-hour gym is a fitness lovers' dream.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Kowloon",
    "offer_geo_area_level_2": "Kowloon",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "Marco Polo Hongkong Hotel",
    "offer_address": "No. 3 Canton Road, Harbour City, Tsim Sha Tsui, Kowloon, Hong Kong SAR, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 116.0,
    "value": 116.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003IBGuAAO",
    "hero_image": "https://images.luxuryescapes.com/kezz8f350g5p7lj3ui7t",
    "image_two": "https://images.luxuryescapes.com/6h7qhg42nftrqvtwt5n",
    "image_three": "https://images.luxuryescapes.com/9dkuhmo17kecwnqiwj6",
    "vendor_name": "The Upper House",
    "title": "Award-Winning Sky-High Hong Kong Luxury",
    "description": "Find a luxurious ‘home away from home’ in the skies of Hong Kong at The Upper House, a boutique bolthole recognised among the top 1% on Tripadvisor. Perched above the glossy Pacific Place shopping complex in Admiralty, this collection of studios and suites is perfectly placed to explore Hong Kong island. Both Central and Tsim Sha Tsui are just one stop away on the MTR - in opposite directions - while Hong Kong Park and its 20 acres of walking and jogging tracks is five minutes away. Explore the laneways of Starstreet precinct, discovering the swathe of independent boutiques, cafés, bars and galleries.\n\nAndré Fu, one of Asia’s most-lauded designers, is in charge of The Upper House’s aesthetic, with each lodging pairing his clean minimalist design with jaw-dropping views. Commissioned artworks dot the public areas of the luxury hotel, starting with the fourth-floor lobby, all the way to 49th floor, where the event space Sky Lounge sits. On level six is The Lawn, a verdant outdoor space serving picnic-style cocktails and small bites. A fresh dining concept marks a new chapter in the innovative dining approach for which The Upper House is known. A variety of spa experiences, including exclusive organic Bamford treatments, can be arranged in your expansive room.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Hong Kong Island",
    "offer_geo_area_level_2": "Hong Kong",
    "location_heading": "Hong Kong",
    "location_subheading": "Hong Kong",
    "location_description": "The Upper House",
    "offer_address": "88 Queensway, Admiralty, Hong Kong",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  }
]