[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QbFXAA0",
    "hero_image": "https://images.luxuryescapes.com/x4v664uf3tgucorg7yd8",
    "image_two": "https://images.luxuryescapes.com/2bc3gw5kdejti8chn87wm",
    "image_three": "https://images.luxuryescapes.com/8agk329dxonw6m0rz5v",
    "vendor_name": "Fraser Explorer Tours",
    "title": "Fraser Island: 4 or 5-Day Small-Group K'Gari Tour with Lake McKenzie, SS Maheno Shipwreck & Eco-Resort Stay",
    "description": "A haven of beautiful beaches, soaring sand dunes, verdant rainforest and incredible wildlife, there's something magical about Queensland's UNESCO World Heritage-listed Fraser Island - known to the traditional Butchulla owners as K’gari. Discover this majestic stretch of land with a once-in-a-lifetime opportunity to reconnect with nature over four or five unforgettable days on a selection of unique guided experiences.\n\nWith three nights of handpicked accommodation (four for five-night packages) and two full days of guided 4WD touring, go wild on the world’s largest sand island. Stroll barefoot along the white silica shore of Lake McKenzie, glide through the shallow waters of Eli Creek, look on in amazement at the technicoloured sand cliffs of The Pinnacles, unearth the iconic SS Maheno Shipwreck and so much more.\n\nWith daily breakfast, select dining experiences and scheduled roundtrip passenger ferry transfers included, this compact wilderness adventure highlights the best of Fraser Island.\n\n**Your handpicked inclusions:**\n\n- Three (or four) nights of handpicked accommodation, including two nights at Kingfisher Bay Resort (with a complimentary upgrade) and one night at Eurong Beach Resort\n- Enjoy two full days of guided 4WD touring with a local expert driver-guide\n- Roundtrip transfers between Hervey Bay airport/your accommodation and River Heads Ferry Terminal, plus roundtrip passenger ferry transfers between Hervey Bay and Fraser Island\n- Daily breakfast, one resort lunch and one picnic lunch\n- Make the most of A$50 experiences credit per person to use at Kingfisher Bay Resort\n- Celebrate your escape with a one-time sunset drink per adult (beer, glass of wine or soft drink each)\n- All National Park fees\n\n**Extend your stay**: Enjoy an extra day to explore Fraser Island at leisure with one additional night at Kingfisher Bay Resort.\n\n**This deal has NO peak surcharges:** Travel any time, for the same great price.\n\n**Want the freedom to plan your own journey?** See our family-friendly escape to [Kingfisher Bay Resort](https://luxuryescapes.com/offer/kingfisher-bay-resort-fraser-island-qld-australia/0062y000005JPLgAAO). Valid for up to four guests, this package invites you to travel in a group and enjoy roundtrip ferry transfers, put A$100 resort credit towards local experiences and feast on a shared sunset platter with a drink each at Sunset Bar.\n\n**Please Note:** The four-day K'Gari Experience and five-day K'Gari Ultimate arrivals are only available on Monday, Wednesday and Friday.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "Fraser Island",
    "location_subheading": "Queensland",
    "location_description": "Fraser Explorer Tours",
    "offer_address": "Kingfisher Bay, Fraser Island QLD 4581",
    "percentage_discount": 33.0,
    "min_duration": 3,
    "max_duration": 4,
    "price": 853.0,
    "value": 1268.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000Nxx7yAAB",
    "hero_image": "https://images.luxuryescapes.com/zfes5xxvs0181qi9da5b",
    "image_two": "https://images.luxuryescapes.com/uqtgqtxupjgkruflymts",
    "image_three": "https://images.luxuryescapes.com/z8dfjpcsjsougvq1bgn0",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "Fraser Island: Breakfasts, Guided Walks & More",
    "description": "Uncover the natural beauty of World Heritage-Listed Fraser Island with an award-winning eco resort stay by the beach. Spend three nights at Kingfisher Bay Resort with daily buffet breakfasts, AU$100 resort credit, complimentary bottle of wine, return passenger ferry transfers, and guided nature walks for two adults.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Coast Regional",
    "location_heading": "Fraser Island",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort - January 2018",
    "offer_address": "Kingfisher Bay, Fraser Island QLD 4581",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 260.0,
    "value": 976.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000WJjbzQAD",
    "hero_image": "https://images.luxuryescapes.com/kcgwlbhofrpiax5gip2y",
    "image_two": "https://images.luxuryescapes.com/adxnsqikp37krmm0rdbz",
    "image_three": "https://images.luxuryescapes.com/uzlhbj6l55ui0yjfgdab",
    "vendor_name": "Eurong Beach Resort",
    "title": "4WD Getaway on World Heritage-Listed Fraser Island",
    "description": "Embark on an adventure-loving getaway in paradise with a two, three or five-night stay at Eurong Beach Resort, surrounded by rainforests, endless beaches, clear blue lakes and freshwater creeks. This escape is the perfect base for four wheel-driving adventures and exploring Fraser Island and includes daily breakfast, welcome bottle of local wine and return 4WD vehicle ferry transfers from River Heads to Wanggoolba Creek or Inskip Point to the southern tip of Fraser. You must BYO your off-road 4WD to purchase this package.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Eurong",
    "location_heading": "Fraser Island",
    "location_subheading": "Australia",
    "location_description": "Eurong Beach Resort",
    "offer_address": "Eurong Beach Resort, Eurong QLD 4581",
    "percentage_discount": 65.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 191.0,
    "value": 546.0
  }
]