[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DOgCcAAL",
    "hero_image": "https://images.luxuryescapes.com/4425gpfl0kjm96eeu5y8",
    "image_two": "https://images.luxuryescapes.com/jlqfwxu5j9ntg7jrpwb",
    "image_three": "https://images.luxuryescapes.com/hpirlg00edf6qppk9xm2",
    "vendor_name": "The Frames",
    "title": "South Australia Five-Star Murray River Pool Villa with Daily Gourmet Breakfast, Distillery & Woolshed Brewery Tastings",
    "description": "In search of an intimate escape? Look no further than The Frames, an award-winning collection of three ultra-luxurious adults-only retreats, perched on a cliff overlooking the meandering Murray River. Each unique space comes with its own private pool, a revitalising infrared sauna, a soothing spa and epic sunset views from your spacious balcony. Beyond your retreat, explore historic Renmark and the breathtaking natural surroundings within easy reach of your stylish abode. Visit the 19th-century township and hop between vineyards and distilleries, including the iconic 23rd Street Distillery - a 100-year-old cellar door producing one of South Australia’s most beloved gins. In between gourmet adventures, trace the banks of the Murray River on a nature stroll.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Paringa",
    "location_heading": "Riverland",
    "location_subheading": "South Australia",
    "location_description": "The Frames",
    "offer_address": "Lot 7 Panorama Court, Paringa, South Australia 5340, Australia",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 1239.0,
    "value": 1.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JrkTAAS",
    "hero_image": "https://images.luxuryescapes.com/e387rjzw50vdjn7aaqbzx",
    "image_two": "https://images.luxuryescapes.com/r9j7s1a2drc2h4dz7i2",
    "image_three": "https://images.luxuryescapes.com/r3ttaia3ru4cag994lv",
    "vendor_name": "The Frames",
    "title": "South Australia Five-Star Murray River Private Pool Villas with Daily Gourmet Breakfast",
    "description": "Peaceful and romantic, the tranquil beauty of the Riverland region provides the breathtaking backdrop to one of South Australia's most luxurious stays - The Frames - an intimate five-star collection of ultra-modern, adults-only villas, perched on the ochre clifftops by the Murray River.\n\nSpoil your loved one with an indulgent stay in the Collage Retreat - an architectural showstopper featuring a private heated lap pool and a state-of-the-art BBQ terrace overlooking sweeping river vistas. Bubbling away in the comfort of your retreat is an impressive six-seater hydrotherapy spa complete with Smart TV. Pop a bottle of champagne and enjoy a jacuzzi movie night, or order a range of ultra-luxe in-villa services, from a relaxing massage to one of the Frames' exceptional private chef dinners.\n\nBeyond your retreat, explore the majesty of historic Renmark and its breathtaking natural surrounds. Explore the 19th-century township and hop between vineyards and distilleries, including the iconic Twenty Third Street - a revitalised, 100-year-old cellar door producing one of South Australia’s most loved gins. Then, fuelled by gourmet food and wine, trace the banks of the Murray River creeks and wetlands on a nature stroll or canoe ride.\n\n**Your handpicked inclusions:**\n\n- Wake up to daily gourmet breakfast provisions to enjoy in the comfort of your luxurious retreat\n- Go behind the scenes of award-winning tipples with a Twenty Third Street distillery tour\n- Sample a handpicked selection of beers with a complimentary tasting paddle at Woolshed Brewery\n- Explore the stunning Riverland region with daily e-bike hire\n- Stay connected with complimentary high-speed Wi-Fi\n\n**Romantic Sunset Cruise Upgrade:** Elevate the romance on a two-hour sunset Murray River cruise in a restored, 100-year-old gondola with a delicious cheese platter and your choice of wine or beer for two.\n\n**Luxe All-Inclusive Upgrade:** Enjoy the ultimate indulgence with an all-inclusive dining upgrade. Savour daily breakfast, lunch and dinner provisions, including one three-course private chef-prepared dinner and a supreme BBQ pack to cook up in your state-of-the-art private kitchen. Luxe All-Inclusive Upgrades also include an open minibar replenished daily with Twenty Third Street spirits, wine, beer, champagne and more, plus the sunset cruise and a private six-hour guided wetland and wildlife safari cruise with morning tea, gourmet 'bushtucker' lunch and refreshments.\n\n**Luxe All-Inclusive Upgrade longer stay bonus:** Extend your all-inclusive upgrade to 3+ nights to enjoy your choice of the following: an exclusive five-hour Calperum Station eco-cultural tour, guided by ecologists and Indigenous rangers as you visit Lake Woolpolool and the surrounding area. OR the exclusive six-hour Riverland flavour safari, where you'll meet the growers, brewers, winemakers and producers at local establishments. Stays of 4+ nights will also receive a gourmet lunch hamper for two, once per stay, and a three-course, private chef-prepared dinner.\n\n**Travelling with friends?** The Collage Retreat can accommodate up to four guests. See individual packages for extra guest surcharges.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Paringa",
    "location_heading": "Riverland",
    "location_subheading": "South Australia",
    "location_description": "The Frames",
    "offer_address": "Lot 7 Panorama Court, Paringa, South Australia 5340, Australia",
    "percentage_discount": 16.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 1089.0,
    "value": 1302.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008ghxmAAA",
    "hero_image": "https://images.luxuryescapes.com/mx45vp6dk3jojkprljjc",
    "image_two": "https://images.luxuryescapes.com/1ugqy2yome3wzf6zow",
    "image_three": "https://images.luxuryescapes.com/2r8fdyajbyprw779xt66",
    "vendor_name": "The Frames",
    "title": "South Australia Five-Star Murray River Private Pool Villa with Daily Gourmet Breakfast",
    "description": "Peaceful and romantic, the tranquil beauty of the Riverland region provides the breathtaking backdrop to one of South Australia's most luxurious stays - The Frames - an intimate five-star collection of ultra-modern, adults-only villas, perched on the clifftops by the Murray River.\n\nSpoil your loved one with an indulgent stay in the Pastiche Retreat - an architectural showstopper featuring an outdoor heated pool with a rain-shower waterfall feature, a state-of-the-art BBQ terrace and a soothing in-villa infrared sauna. Beyond your retreat, explore historic Renmark and the breathtaking natural surroundings within easy reach of your stylish abode. Visit the 19th-century township and hop between vineyards and distilleries, including the iconic 23rd Street Distillery - a revitalised, 100-year-old cellar door producing one of South Australia’s most loved gins. Then, fuelled by gourmet food and wine, trace the banks of the Murray River creeks and wetlands on a nature stroll.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Paringa",
    "location_heading": "Riverland",
    "location_subheading": "South Australia",
    "location_description": "The Frames",
    "offer_address": "Lot 7 Panorama Court, Paringa, South Australia 5340, Australia",
    "percentage_discount": 17.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 1291.0,
    "value": 1564.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xVhGAAU",
    "hero_image": "https://images.luxuryescapes.com/llvx3udcugwisfz574p",
    "image_two": "https://images.luxuryescapes.com/axmoe5ysdknsh7qsw26",
    "image_three": "https://images.luxuryescapes.com/cl2sdiqsz07hplqz4yn",
    "vendor_name": "The Frames",
    "title": "South Australia Five-Star Murray River Luxury with Just Three Villas",
    "description": "Peaceful and romantic, the tranquil beauty of the Riverland region provides the breathtaking backdrop to one of South Australia's most luxurious stays - The Frames. This intimate collection of five-star, adults-only villas is perched on the ochre cliffside of the Murray River. Spoil your loved one with an indulgent stay in one of three exceptional retreats, each one beaming with modern architectural splendour. Soak in a private spa or pool, whip up a feast in the fully equipped kitchen or sizzle a gourmet lunch on the state-of-the-art BBQ. Pop a bottle of wine and lounge in the spacious living area or dine on your private balcony while taking in sweeping sunset vistas across the Murray River.\n\nBeyond your retreat, explore the majesty of historic Renmark and its breathtaking natural surroundings. Explore the township and hop between vineyards and distilleries, including the iconic 23rd Street Distillery - a 100-year-old cellar door producing one of South Australia’s best-loved gins. Then, fuelled by gourmet food and wine, trace the banks of the Murray River creeks and wetlands on a nature stroll or canoe ride.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Paringa",
    "location_heading": "Riverland",
    "location_subheading": "South Australia",
    "location_description": "The Frames",
    "offer_address": "Lot 7 Panorama Court, Paringa, South Australia 5340, Australia",
    "percentage_discount": null,
    "min_duration": 2,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xVhVAAU",
    "hero_image": "https://images.luxuryescapes.com/5kh96xnieh70g8c517k6",
    "image_two": "https://images.luxuryescapes.com/2gpg8mozip0fetajteih",
    "image_three": "https://images.luxuryescapes.com/zgza3f3ldej9wqmigwmd",
    "vendor_name": "The Frames",
    "title": "SA: Murray River Five-Star Adults-Only Villas",
    "description": "Peaceful and romantic, the tranquil beauty of the Riverland region provides the breathtaking backdrop to one of South Australia's most luxurious stays - The Frames. An intimate five-star collection of just three ultra-modern, adults-only villas, perched on the ochre clifftops by the Murray River, a stay here is an exceptional way to spoil a loved one or spend time with special friends. Daydream in a private hydrotherapy spa or pool, whip up a feast in the fully equipped kitchen or sizzle a gourmet lunch on the state-of-the-art BBQ. Pop open a bottle of wine and lounge in the spacious living area, dine on your private balcony while taking in sweeping sunset vistas across the Murray River or order a range of ultra-luxe in-villa services, from a relaxing massage to one of the Frames' renowned private-chef dinners.\n\nBeyond your retreat, explore the majesty of historic Renmark and its breathtaking natural surrounds. Explore the 19th-century township and hop between vineyards and distilleries, including the iconic Twenty Third Street Distillery - a revitalised 100-year-old cellar door producing one of South Australia’s most loved gins. In between gourmet food and wine, trace the banks of the Murray River creeks and wetlands on a nature stroll or canoe ride.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Paringa",
    "location_heading": "Riverland",
    "location_subheading": "South Australia",
    "location_description": "The Frames",
    "offer_address": "Lot 7 Panorama Court, Paringa, South Australia 5340, Australia",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 1465.0,
    "value": 1465.0
  }
]