[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xw9dAAA",
    "hero_image": "https://images.luxuryescapes.com/7wxnyiqbguq8ftel3vs",
    "image_two": "https://images.luxuryescapes.com/yjoqdoo59saloprvlm7",
    "image_three": "https://images.luxuryescapes.com/k9xs93ivwplaprgia6q",
    "vendor_name": "An Lam Retreats Saigon River",
    "title": "Vietnam Tranquil Five-Star Riverfront Retreat near Ho Chi Minh City",
    "description": "Escape the urban jungle and delve into a riverside sanctuary with a five-star stay at the recently renovated An Lam Retreats Saigon River. Set in the tranquil surrounds of Southern Vietnam, this picturesque resort is ranked within the top 10% of properties worldwide on Tripadvisor. Located just a 25-minute drive or boat ride from Ho Chi Minh City, this nature-inspired oasis blends beautifully into the tropical landscape and puts exquisite luxury at your fingertips.\n\nSpend relaxing days by the palm-fringed pool, transcend into a state of bliss at Jungle Spa and savour farm-to-table cuisine with sweeping river views at Sen Restaurant. Afterwards, head to the Wine Cellar and explore an extensive selection of tipples or wind up to Treehouse Bar for sunset cocktails and canapés. Engage with nature through a range of activities: hop on a speedboat and explore authentic river life along the Mekong Delta, step back in time on an eye-opening tour to the Cu Chi Tunnels or dive into the rich history and culture of Binh Duong Province with a local guide.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Duong Province",
    "offer_geo_area_level_2": "Thuan An",
    "location_heading": "Thuan An",
    "location_subheading": "Vietnam",
    "location_description": "An Lam Retreats Saigon River",
    "offer_address": "21/4 Trung Street Vinh Phu Ward Thuan An City, Bình Dương, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 167.0,
    "value": 167.0
  }
]