[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQJYwAAP",
    "hero_image": "https://images.luxuryescapes.com/wfajxnhsc943dx5ezwc19",
    "image_two": "https://images.luxuryescapes.com/d92c1chofx2vx21226o",
    "image_three": "https://images.luxuryescapes.com/9zqpzetvpit8eiowz1kr",
    "vendor_name": "Crowne Plaza Changbaishan Hot Spring",
    "title": "Elegant Changbaishan Alpine Escape with Hot Springs",
    "description": "Soak in glorious alpine elegance in Changbaishan, located at the cusp of the mountainous Jilin Province, with a stay at Crowne Plaza Resort Changbaishan Hot Spring, an IHG Hotel. From your haven of tranquility, discover a region dotted with peaceful retreats including Heavenly Lake, Julong Hot Springs or Changbai Waterfall. After days of hitting the slopes, escape to one of the hotel’s three bars to savour a warming tipple or take your tastebuds on a journey at Cai Feng Lou.",
    "offer_country_name": "China",
    "offer_country_code_alpha_2": "CN",
    "offer_geo_area_level_1": "Jilin",
    "offer_geo_area_level_2": "Yanbian",
    "location_heading": "Changbaishan",
    "location_subheading": "China",
    "location_description": "Crowne Plaza Resort Changbaishan Hot Spring, an IHG Hotel",
    "offer_address": "North Gate of Changbaishan, Antu County Erdaobaihe Town, Changbaishan 133613, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 190.0,
    "value": 190.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HicERYAZ",
    "hero_image": "https://images.luxuryescapes.com/vp8pzwodupb3cw7cn7",
    "image_two": "https://images.luxuryescapes.com/h0ba5te5zhjyxcumjnkh",
    "image_three": "https://images.luxuryescapes.com/gm9w0gdg15xn9d9m3jq",
    "vendor_name": "Park Hyatt Changbaishan",
    "title": "Secluded China Mountain Luxury with Indoor Pool, Spa and Onsite Dining",
    "description": "Embrace the natural beauty of China's Jilin Province with a decadent stay at this five-star hideaway, nestled in the mountain slopes of Changbaishan Wanda International Resort. Enjoy seamless access to snow trails in winter and awe-inspiring forest landscapes during the warmer months. Delight in all-day dining at The Living Room, where a selection of international dishes await. Stay active at the fitness centre or unwind with a refreshing swim in the indoor heated pool.\n\nRelax in your elegantly designed room, featuring plush bedding and modern amenities, or indulge in rejuvenating ancient Chinese therapies at the tranquil onsite spa. Venture beyond the resort to explore the area's rich cultural heritage and breathtaking natural splendour, ensuring a memorable and enriching escape.",
    "offer_country_name": "China",
    "offer_country_code_alpha_2": "CN",
    "offer_geo_area_level_1": "Jilin",
    "offer_geo_area_level_2": "Baishan",
    "location_heading": "Changbaishan",
    "location_subheading": "China",
    "location_description": "Park Hyatt Changbaishan",
    "offer_address": "No.236 Guanmian Street, South Area of Changbaishan International Tourism Holiday Zone, Fusong County 134504, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 146.0,
    "value": 146.0
  }
]