[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZopJuQAJ",
    "hero_image": "https://images.luxuryescapes.com/e52bmb3k1raingzbdsjg",
    "image_two": "https://images.luxuryescapes.com/uyiwspiosre26apglx6t",
    "image_three": "https://images.luxuryescapes.com/kuoj8zyi84eltahaqniz",
    "vendor_name": "Sea Cliff Resort and Spa",
    "title": "Paradise Island Escape to Zanzibar with Bucket-List Tours Upgrade Option",
    "description": "Off the coast of Tanzania, East Africa lies historic Zanzibar, an archipelago of beautiful islands fringed by white sands and lapped by aquamarine waters, home to the cliffside Sea Cliff Resort & Spa, a tranquil resort overlooking the Indian Ocean. The resort offers the only golf course on the island, horse riding on the beach, restaurants, bars, infinity pools and a spa. Your escape includes an upgraded sea-view room, daily buffet breakfast, indulgent nightly dinner, a bottle of sparkling wine on arrival, a complimentary round of golf, a 10% spa discount, a complimentary shuttle service to historic Stone Town and more. Want to experience the bucket-list adventure of a lifetime? Choose our upgraded tour package with a Zanzibar sailing tour, an excursion to fascinating Prison Island and a trip to Jozania Forest.",
    "offer_country_name": "Tanzania, United Republic of",
    "offer_country_code_alpha_2": "TZ",
    "offer_geo_area_level_1": "Zanzibar North Region",
    "offer_geo_area_level_2": "Kaskazini B",
    "location_heading": "Zanzibar",
    "location_subheading": "Tanzania",
    "location_description": "Sea Cliff Resort & Spa Feb 2019",
    "offer_address": "Kama Village, Mangapwani, Zanzibar Tanzania 1763, Tanzania",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1064.0,
    "value": 2281.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxWWYQA3",
    "hero_image": "https://images.luxuryescapes.com/jqtmq4rsmk6fdai4r1yq",
    "image_two": "https://images.luxuryescapes.com/z4oaiodxp6gyphe5t4z9",
    "image_three": "https://images.luxuryescapes.com/ti28uli7xapv994kmrch",
    "vendor_name": "Sea Cliff Resort and Spa",
    "title": "Paradise Island Escape to Zanzibar",
    "description": "Off the coast of Tanzania, East Africa lies historic Zanzibar, an archipelago of beautiful islands fringed by white sands and lapped by aquamarine waters. Discover the beauty of its main island at the cliffside Sea Cliff Resort and Spa, a tranquil resort overlooking the Indian Ocean offering the only golf course on the island, horse riding on the beach, restaurants, bars, infinity pools and a spa. Your escape includes a sea-view room, daily buffet breakfast, indulgent nightly dinners, a complimentary round of golf, a bottle of sparkling, welcome gifts and more.",
    "offer_country_name": "Tanzania, United Republic of",
    "offer_country_code_alpha_2": "TZ",
    "offer_geo_area_level_1": "Zanzibar North Region",
    "offer_geo_area_level_2": "Kaskazini B",
    "location_heading": "Zanzibar",
    "location_subheading": "East Africa",
    "location_description": "Sea Cliff Resort & Spa OLD*",
    "offer_address": "Kama Village, Mangapwani, Zanzibar Tanzania 1763, Tanzania",
    "percentage_discount": 36.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1018.0,
    "value": 1589.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005Jmb8AAC",
    "hero_image": "https://images.luxuryescapes.com/tkpq8q3mihrp3snigwnj",
    "image_two": "https://images.luxuryescapes.com/zedt41ec1ggiemgmtba",
    "image_three": "https://images.luxuryescapes.com/3tzf85bk55animp11a8",
    "vendor_name": "Zanzibar White Sand Luxury Villas & Spa",
    "title": "Luxury Zanzibar Beachfront Resort with Rooftop Sunset Bar",
    "description": "The Zanzibar Archipelago is a jewel in the Indian Ocean, and there’s no better way to experience its magic than with a dreamy stay at Zanzibar White Sand Luxury Villas & Spa, part of the exclusive Relais & Châteaux collection and ranked in the top 1% of properties worldwide on Tripadvisor. Perched on the east coast of the island on Paje Beach, this secluded sanctuary is perfect for a post-safari jaunt or some much-needed rest and relaxation. With an onsite spa, two restaurants, a rooftop sunset bar, beach bar and lounge, as well as a kitesurfing and watersports centre, there’s something for everyone.\n\nWith rich history waiting to be unearthed, coconut trees swaying in the breeze on flawless beaches and traditional Arabian dhows bobbing in the warm turquoise waters, Zanzibar is what island dreams are made of. To further your understanding of the island’s history, venture to Stone Town - the heart and soul of the island - and marvel at the way African, Arabic, Indian, and Persian influences intertwine to form a fascinating cultural backdrop. Or, you could join a spice tour to the plantations that dot the island to learn about its trading past as ‘Spice Island’.\n\n**Luxury Escapes inclusions:**\n\n- Indulge with **daily breakfast and dinner**\n- One **30-minute spa treatment** per adult, per stay\n- Welcome **bottle of sparkling wine** on arrival\n- Arrive to a special **welcome gift**\n- Stay hydrated with a **complimentary bottle of water** per person, per day\n\n**TripAdvisor Travellers’ Choice, Best of the Best 2021 -**Top 25 Small Hotels - Africa",
    "offer_country_name": "Tanzania, United Republic of",
    "offer_country_code_alpha_2": "TZ",
    "offer_geo_area_level_1": "Unguja South Region",
    "offer_geo_area_level_2": "Paje",
    "location_heading": "Zanzibar",
    "location_subheading": "Tanzania",
    "location_description": "Zanzibar White Sand Luxury Villas & Spa",
    "offer_address": "Paje Beach, Paje, Tanzania",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 1432.0,
    "value": 1432.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GoJpAAK",
    "hero_image": "https://images.luxuryescapes.com/3gfeb2l27whm4t1n1epm",
    "image_two": "https://images.luxuryescapes.com/ki0gysr6vosdfiomch6",
    "image_three": "https://images.luxuryescapes.com/3pn2phkcc0v2gs3x5ch",
    "vendor_name": "Sea Cliff Resort and Spa",
    "title": "Serene Zanzibar Clifftop Oasis with Ocean-View Golf Course",
    "description": "Escape to the island of Zanzibar staying at the Sea Cliff Resort & Spa, a serene hideaway ranked within the top 10% of properties on Tripadvisor, where you can ride horses on the beach, dine overlooking the deep blue Indian Ocean and soak up the history of this fascinating historic trade destination. Fringed by lush tropical terrain on one side and sweeping views of the sparkling waters below, the resort feels perfectly secluded, yet the island’s history-filled capital of Stone Town is just 30-minutes away so you can easily unearth details of the island’s fascinating past.\n\nWander through tropical gardens and admire the traditional-style architecture with makuti palm tree roofing and opulent Arabic-style towers before stepping inside one of the elegant rooms, complete with luxurious gold accents and handpicked antique furniture. Then, plunge into one of the gleaming infinity pools, pamper yourself at the spa, tee off at the resort's nine-hole, championship-standard golf course, or take a seat at the onsite restaurant and dine under the stars. A spice tour to the plantations across the island is a must-do, along with time spent roaming the magical, cobblestone streets of Stone Town or enjoying a sundowner as you watch Arabian dhows sail along the coastline.",
    "offer_country_name": "Tanzania, United Republic of",
    "offer_country_code_alpha_2": "TZ",
    "offer_geo_area_level_1": "Unguja North Region",
    "offer_geo_area_level_2": "Mangapwani",
    "location_heading": "Zanzibar",
    "location_subheading": "Tanzania",
    "location_description": "Sea Cliff Resort & Spa",
    "offer_address": "Kama Village, Mangapwani, Zanzibar Tanzania 1763, Tanzania",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 7,
    "price": 247.0,
    "value": 247.0
  }
]