[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007owHtAAI",
    "hero_image": "https://images.luxuryescapes.com/gppa19i6mhiq1fcx5gr",
    "image_two": "https://images.luxuryescapes.com/t11t7ddx03o76b25gms9",
    "image_three": "https://images.luxuryescapes.com/cav7j6yqajomr9ghhdvq",
    "vendor_name": "QUINTA REAL HUATULCO",
    "title": "Boutique Mexico Five-Star Beachside Suites Overlooking Tangolunda Bay within Huatulco Region",
    "description": "Nestled in the resort region of Huatulco, Mexico is the five-star Quinta Real Huatulco, a boutique beachfront oasis with just 27 exclusive suites. Perched on a hill overlooking the shimmering waters of Tangolunda Bay, the hotel boasts an elegant fusion of Mexican and Moroccan architecture and is beautifully decorated with hand-painting furnishings and topped off with luxurious facilities. Four exceptional onsite restaurants and bars await to toast to your stay: Las Cúpulas serves up stunning ocean views from both the restaurant and the adjacent bar, La Cuija Beach Club offers a variety of light dishes served poolside and Sky Lounge, built around a magnificent fig tree at the highest point of the hotel, is all about lavish cocktails and tranquillity. When you need a break from the heat, take a dip in the expansive swimming pool or take a few short steps to float in the dazzling Pacific Ocean. With nine bays, 36 beaches and a nature reserve nearby, a Huatulco escapes promises both relaxation and adventure.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Oaxaca",
    "offer_geo_area_level_2": "Santa María Huatulco",
    "location_heading": "Huatulco",
    "location_subheading": "Mexico",
    "location_description": "Quinta Real Huatulco",
    "offer_address": "Paseo Benito Juárez Lote 2, Bahía de Tangolunda, 70989 Bahías de Huatulco, Oaxaca, Mexico",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]