[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ECAbRYAX",
    "hero_image": "https://images.luxuryescapes.com/b75u0tzyh2ejv0pmfas",
    "image_two": "https://images.luxuryescapes.com/hrkfm357ch8obiut240u",
    "image_three": "https://images.luxuryescapes.com/96xn1gfvcl3lsphq3iav",
    "vendor_name": "Kobi Onsen Resort Hue, Affiliated by Meliá",
    "title": "Vietnam Japanese-Style Hue Wellness Retreat with Daily Breakfast, Nightly Dinner & Onsen Access",
    "description": "Escape to a wellness paradise nestled in the serene My An mineral springs on the outskirts of Hue and inspired by the serenity of Japan's thermal bath mountain villages. Spend you days rejuvenating at the resort’s expansive onsen facilities, soaking in the healing waters of local hot springs. Unwind with Ganban-Yoku and mud bath therapy or take a refreshing dip in the glittering outdoor pool.\n\nWithin this secluded setting, you'll find everything you need for your retreat, meaning you never need leave during your stay. Enjoy two meals a day and nightly drinks as part of your stay, along with unlimited onsen access and a 30-minute treatment at Kourai Spa. If and when you do decide to take a day trip, find yourself conveniently close to the historic Imperial city of Hue.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Thua Thien-Hue Province",
    "offer_geo_area_level_2": "Phu Vang",
    "location_heading": "Hue",
    "location_subheading": "Vietnam",
    "location_description": "Kobi Onsen Resort Hue, Affiliated by Meliá",
    "offer_address": "Mỹ An, Phú Vang District, Thua Thien Hue 53000, Vietnam",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 319.0,
    "value": 676.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2JYFQA3",
    "hero_image": "https://images.luxuryescapes.com/lvlwipent7chro6b8mvc",
    "image_two": "https://images.luxuryescapes.com/fqmq9wqu5f9pktdfxkzy",
    "image_three": "https://images.luxuryescapes.com/clf1wrpj6fcsx2c1reed",
    "vendor_name": "ALBA WELLNESS VALLEY BY FUSION",
    "title": "Newly Opened Wellness Retreat with Luxurious Hot Springs",
    "description": "Seeking a restorative wellness retreat? Nestled in the jungle, on top of a natural hot spring, lies Alba Wellness Valley by Fusion, a stunning escape outside the UNESCO World Heritage-listed town of Hue. Go on a journey to this beautiful retreat and experience pure bliss. Includes daily dining experiences featuring fresh produce grown at Alba Farm, a Vietnamese cooking class, daily reflexology and Onsen treatments, daily breakfast, daily access to the hotel’s hot springs, zip line and highwire activities, return airport shuttle transfers and much more.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Thừa Thiên Huế",
    "offer_geo_area_level_2": "Phong Điền",
    "location_heading": "Hue",
    "location_subheading": "Vietnam",
    "location_description": "Alba Wellness Valley by Fusion - April 2019",
    "offer_address": "Thanh Tân, Phong Điền District, Thua Thien Hue 535147, Vietnam",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 501.0,
    "value": 1125.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbxN4AAJ",
    "hero_image": "https://images.luxuryescapes.com/0cgwxrb6aj4cp2t5vi",
    "image_two": "https://images.luxuryescapes.com/lcb2glwmrlio3njdh75n",
    "image_three": "https://images.luxuryescapes.com/j4vxhgw3kbibe06990mk",
    "vendor_name": "ALBA WELLNESS VALLEY BY FUSION",
    "title": "Serene Vietnamese Hot Springs Sanctuary near Hue with Daily Dining, Complimentary Spa Services & Zipline Rides",
    "description": "Alba Wellness Valley by Fusion, a sprawling oasis built on the Alba natural hot spring, blurs the lines between resort and sanctuary. Allow serene scenery, tropical forests and sloping foothills to cocoon you as you relish the property's onsite Thanh Tan Hot Springs, minimalist style and Japanese-inspired rooms and bungalows. When hunger strikes, satisfy your cravings at the resort's Madame Chau restaurant. This gorgeous eatery is your gateway to some of the best Hue cuisine, with breathtaking 360-degree views over Lotus Lake and the surrounding forest.\n\nLocated 50 minutes from the UNESCO World Heritage-listed imperial monuments of Hue, you can stroll along the banks of the Perfume River or explore the stunning citadel for an insight into royal life of old. Return to the resort and feel stress melt away through reflexology treatments and find inner serenity with onsite movement therapies, including yoga, tai-chi and meditation.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Thua Thien-Hue Province",
    "offer_geo_area_level_2": "Phong Dien",
    "location_heading": "Hue",
    "location_subheading": "Vietnam",
    "location_description": "Alba Wellness Valley by Fusion",
    "offer_address": "Phong Son, Phong Dien, Thua Thien Hue Province, Hue 49000, Vietnam",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 640.0,
    "value": 1574.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LiPiAAK",
    "hero_image": "https://images.luxuryescapes.com/99lyg8cq3fz067q8uo",
    "image_two": "https://images.luxuryescapes.com/x9kfs3jbujscyj99rtv",
    "image_three": "https://images.luxuryescapes.com/j54rl4ypfnrfpvt3hj7",
    "vendor_name": "ALBA WELLNESS VALLEY BY FUSION",
    "title": "Serene Hot Springs Wellness Sanctuary with Daily Dining",
    "description": "Once you get a feel for the revitalising daily reflexology, extended soaks in the bubbling natural hot springs of the majestic Truong Son mountains and one of Vietnam’s only Japanese-style onsens with a plethora of nutritionally balanced meals at your fingertips at Alba Wellness Valley by Fusion, your regular run-of-the-mill wellness retreat just won’t cut it. Be enveloped by the serene scenery, tropical forests and sloping foothills of this wellness retreat less than 50-minutes from the UNESCO World Heritage-listed Hue.\n\nYour stay includes calm-inducing daily activities such as yoga, a welcome detox drink and fresh fruit, a complimentary Vietnamese cooking class, daily à la carte breakfast anywhere, anytime, with your choice of daily lunch or dinner, daily zipline and high wire activities, a shuttle bus to Hue, return airport transfers and so much more.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Thua Thien-Hue Province",
    "offer_geo_area_level_2": "Phong Dien",
    "location_heading": "Hue",
    "location_subheading": "Vietnam",
    "location_description": "Alba Wellness Valley by Fusion",
    "offer_address": "Phong Son, Phong Dien, Thua Thien Hue Province, Hue 49000, Vietnam",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 495.0,
    "value": 1395.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004iN6gAAE",
    "hero_image": "https://images.luxuryescapes.com/wutziis7zn13bljygx5",
    "image_two": "https://images.luxuryescapes.com/jxus9kdlggwrdzt55otl",
    "image_three": "https://images.luxuryescapes.com/06v6w39k3d2m727oyjd",
    "vendor_name": "Azerai La Residence, Hue",
    "title": "Award-Winning Five-Star Vietnam Luxury on the Perfume River with Room Upgrade & Daily Breakfast",
    "description": "Discover the beauty of Vietnam’s former imperial capital with a stay at the boutique Azerai La Residence, Hue. Fit for royalty, this award-winning five-star hotel boasts elegant, luxuriously spacious public areas and a palatial exterior. Feast on creative Asian fusion at La Residence Café, practise your backstroke in the saltwater swimming pool and indulge in a pampering spa treatment at the wellness centre. Spectacular facilities and exceptional service have earned the hotel a place in Tripadvisor's Travellers' Choice, Best of the Best 2021 ranking, placing it in the top 1% worldwide on the review site.\n\nNestled on the banks of the fabled Perfume River, Azerai La Residence, Hue is the perfect launchpad to the sites and wonders of this World Heritage-listed city, including Thien Mu Pagoda and To Mieu Temple Complex. Hue is the tranquil, culture-rich alternative to some of Vietnam’s more bustling cities, its serenity owing largely to the picturesque Perfume River which weaves throughout the city.\n\n**Luxury Escapes inclusions (select nights):**\n\n- Wake up to delicious **daily breakfast** at La Residence Café\n- Enjoy absolute comfort with a guaranteed **room upgrade**\n- Celebrate your escape with a **welcome cocktail** on arrival (for stays of 2+ nights)\n- Get a taste for the region with one **two-course set dinner** (for stays of 3+ nights)\n- Relax with one **60-minute full-body massage** each (for stays of 5+ nights)\n\n**Tripadvisor Travellers’ Choice, Best of the Best 2021** Top Hotels for Romance - Vietnam\n\n**Colonial Suite Upgrade:** Discover your home-away-from-home in this gloriously expansive suite, boasting a large bathroom with bathtub, plush king bed and generous panoramic veranda with Perfume River views.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Thua Thien-Hue Province",
    "offer_geo_area_level_2": "Hue",
    "location_heading": "Hue",
    "location_subheading": "Vietnam",
    "location_description": "Azerai La Residence, Hue",
    "offer_address": "5 Lê Lợi, Vĩnh Ninh, Thành phố Huế, Thừa Thiên Huế 530000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 181.0,
    "value": 181.0
  }
]