[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J0U8IAK",
    "hero_image": "https://images.luxuryescapes.com/s6bigk5ebddv4hg6qluq",
    "image_two": "https://images.luxuryescapes.com/bpcqum0fllj6y7daogkr",
    "image_three": "https://images.luxuryescapes.com/8n46fim21q3dvvppk6k",
    "vendor_name": "Kerry Hotel Hong Kong",
    "title": "Extended by Popular Demand: Hong Kong Harbourside Glamour with Daily Breakfast & Club Lounge Access",
    "description": "Stay only steps away from Kowloon’s Tsim Sha Tsui East shopping district at this glamorous city escape, from the world-renowned Shangri-La collection, on the fringes of Hung Hom Bay.\n\nWhen you’re not admiring harbour views from almost every vantage point in the hotel, tantalise your tastebuds at one of three onsite restaurants. Load up your plates at Big Bay Café's lunch buffet, feast on dim sum at Hung Tong or be spoilt for choice in Dockyard's gourmet food hall. For a romantic date night in a sultry setting, Red Sugar boasts an impressive collection of craft beers, world wines and creative cocktails.\n\nBetween time exploring Kowloon and Hong Kong’s sights, retreat to the spa at Base Camp Kerry Sports, a tranquil haven where signature massages, brightening facials and shea butter infusions will leave you feeling brand new.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Kowloon",
    "offer_geo_area_level_2": "Kowloon",
    "location_heading": "Hung Hom Bay",
    "location_subheading": "Hong Kong",
    "location_description": "Kerry Hotel, Hong Kong",
    "offer_address": "38 Hung Luen Road, Hung Hom Bay, Hong Kong",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 669.0,
    "value": 2768.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zXGcAAM",
    "hero_image": "https://images.luxuryescapes.com/z8gma4zv6cgyq9h0gmt",
    "image_two": "https://images.luxuryescapes.com/mhgy58gpp96q3u96k7",
    "image_three": "https://images.luxuryescapes.com/asd1q7a28faned4efepo",
    "vendor_name": "Kerry Hotel Hong Kong",
    "title": "Hong Kong Harbourside Luxury with Skyline Views",
    "description": "Stay only steps away from Kowloon's Tsim Sha Tsui East shopping district at the luxe Kerry Hotel, Hong Kong, a glamorous city escape from the world-renowned Shangri-La collection on the fringes of Kowloon Bay. When you're not admiring the harbour views from almost every vantage point in the hotel, tantalise your tastebuds at one of the three onsite restaurants. Load up your plates at Big Bay Café for a buffet lunch, feast on dim sum at Hung Tong, or be spoilt for choice at Dockyard, a gourmet food hall. For a romantic date night in a sultry setting, Red Sugar boasts an impressive collection of craft beers, world wines and creative cocktails. Between time exploring Kowloon and Hong Kong's sights, retreat to the spa, a tranquil haven where signature massages, brightening facials and shea butter infusions will leave you feeling brand new.",
    "offer_country_name": "Hong Kong",
    "offer_country_code_alpha_2": "HK",
    "offer_geo_area_level_1": "Kowloon",
    "offer_geo_area_level_2": "Kowloon",
    "location_heading": "Hung Hom Bay",
    "location_subheading": "Hong Kong",
    "location_description": "Kerry Hotel, Hong Kong",
    "offer_address": "38 Hung Luen Road, Hong Kong",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 167.0,
    "value": 167.0
  }
]