[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GfI66AAF",
    "hero_image": "https://images.luxuryescapes.com/qkqcm0n77o2clm5cumx",
    "image_two": "https://images.luxuryescapes.com/ldoe4s9tdgsy9ktw64r2",
    "image_three": "https://images.luxuryescapes.com/bh2lhqvvaqht9mavty6h",
    "vendor_name": "Lily Beach Resort and Spa",
    "title": "Award-Winning Maldives All-Inclusive Villa Luxury with Roundtrip International Flights, Malé Transfers & Free-Flow Drinks",
    "description": "With flights included, it's now easier than ever to breeze into an extraordinary island paradise at Lily Beach Resort & Spa - a top-rated Maldives resort promising unrivalled all-inclusive indulgence. This dreamy oasis - superbly poised just a 25-minute flight from Malé, on a private island in the South Ari Atoll - promises an offering beyond compare: expect free-flow imported Tattinger French champagne, 80 premium wines from around the world and spectacular gourmet dining. Its position as one of the top all-inclusive resorts in the Maldives - a region legendary for all-inclusive luxury - has been confirmed by a swathe of accolades, including a win at the World Travel Awards 2023.\n\nMake the resort your luxe playground in paradise and be spoiled by endless ways to fill your day. Stretch out alongside one of three shimmering pools, dip your toes in the translucent lagoon or drop into the watersports and scuba diving centre to explore an underwater world teeming with marine life, including gentle whale sharks. Feed your curiosity for new dining experiences at the restaurants and bars onsite - including the sand-lined main dining room and trendy beach bars. Unwind with a peaceful yoga class or revitalise with a well-deserved treatment at Tamara Spa.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Huvahendhoo",
    "location_heading": "Huvahendhoo",
    "location_subheading": "Maldives",
    "location_description": "Lily Beach Resort & Spa",
    "offer_address": "Huvahendhoo Island 00160, Maldives",
    "percentage_discount": null,
    "min_duration": null,
    "max_duration": null,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zW0bAAE",
    "hero_image": "https://images.luxuryescapes.com/whsr4tqqw6y3cmc5duhf",
    "image_two": "https://images.luxuryescapes.com/47d63u94lufuct8nr2exp",
    "image_three": "https://images.luxuryescapes.com/ecln1bq9ad9uxrsmexts",
    "vendor_name": "Lily Beach Resort and Spa",
    "title": "Award-Winning Maldives All-Inclusive Villa Luxury with Champagne, Gourmet Dining & Roundtrip Transfers from Malé",
    "description": "Breeze into an extraordinary island paradise and escape it all with a stay at Lily Beach Resort & Spa - a Maldives top-rated all-inclusive resort promising incredible indulgence. This dreamy oasis is superbly poised just a 25-minute seaplane ride from Malé (surcharges apply), on a private island in the South Ari Atoll. Its all-inclusive offering (which includes Tattinger champagne, 80 premium wines from around the world and spectacular gourmet dining) has led to it being named among the Top 10 All-Inclusive Resorts - Asia at the Tripadvisor Travellers' Choice Awards 2021.\n\nMake the resort your luxe playground in paradise and be spoiled by endless ways to fill your day. Stretch out alongside one of three shimmering pools, dip your toes in the translucent lagoon or drop into the watersports and scuba diving centre to explore an underwater world teeming with wildlife, including gentle whale sharks. Feed your curiosity for new dining experiences at the restaurants and bars onsite - including the sand-lined main dining room and trendy beach bars - unwind with a peaceful yoga class, feel revitalised with a well-deserved treatment at Tamara Spa, try your hand at fishing or perhaps dabble in a game of tennis or beach volleyball. At Lily Beach Resort & Spa, paradise is whatever you make it.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Huvahendhoo",
    "location_heading": "Huvahendhoo",
    "location_subheading": "Maldives",
    "location_description": "Lily Beach Resort & Spa",
    "offer_address": "Huvahendhoo Island 00160, Maldives",
    "percentage_discount": 28.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 4139.0,
    "value": 5783.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I8cFIAS",
    "hero_image": "https://images.luxuryescapes.com/6fxbgi75djss4nkh6r",
    "image_two": "https://images.luxuryescapes.com/6oasa7pitvxapzzzzm4",
    "image_three": "https://images.luxuryescapes.com/ku8zvzqbte2l61qtwyk",
    "vendor_name": "Lily Beach Resort and Spa",
    "title": "Maldives #1 All-Inclusive Resort: Private Island Luxury with All-Inclusive Dining, Unlimited Drinks & Roundtrip Malé Transfers",
    "description": "Escape to an exceptional island paradise at this highly acclaimed Maldives resort, where you'll experience unmatched all-inclusive luxury. This exceptional resort offers a uniquely unparalleled experience and has been honoured as the Maldives' Leading All-Inclusive Resort 2024 by the World Travel Awards.\n\nFeed your curiosity for new dining experiences at the restaurants and bars onsite - including the sand-lined main dining room and trendy beach bars. Expect free-flow imported Taittinger French champagne, 80 premium wines from around the world and spectacular gourmet dining.\n\nMake the resort your luxe playground in paradise and be spoiled by endless ways to fill your day. Stretch out alongside one of three shimmering pools, dip your toes in the translucent lagoon or drop into the water sports and scuba diving centre to explore an underwater world teeming with marine life, including gentle whale sharks. Unwind with a peaceful yoga class or revitalise with a well-deserved treatment at Tamara Spa.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Huvahendhoo",
    "location_heading": "Huvahendhoo",
    "location_subheading": "Maldives",
    "location_description": "Lily Beach Resort & Spa",
    "offer_address": "Huvahendhoo Island 00160, Maldives",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 3869.0,
    "value": 7889.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Flc0MAAR",
    "hero_image": "https://images.luxuryescapes.com/bkdjmk3fgg44syummr0k",
    "image_two": "https://images.luxuryescapes.com/5sul3clhda2u0njfg889",
    "image_three": "https://images.luxuryescapes.com/dov9jsba8q8wsmuj7h9",
    "vendor_name": "Lily Beach Resort and Spa",
    "title": "Award-Winning Maldives Villa Luxury with All-Inclusive Dining, Unlimited Free-Flow Drinks & Roundtrip Malé Transfers",
    "description": "Breeze into an extraordinary island paradise at this top-rated Maldives resort promising unrivalled all-inclusive indulgence. The dreamy oasis that is Lily Beach Resort & Spa - superbly poised just a 25-minute flight from  Malé, on a private island in the South Ari Atoll - promises an offering beyond compare: expect free-flow imported Tattinger French champagne, 80 premium wines from around the world and spectacular gourmet dining. Its position as one of the top all-inclusive resorts in the Maldives - a region legendary for all-inclusive luxury - has been confirmed by a swathe of accolades, including a win at the World Travel Awards 2022.\n\nMake the resort your luxe playground in paradise and be spoiled by endless ways to fill your day. Stretch out alongside one of three shimmering pools, dip your toes in the translucent lagoon or drop into the watersports and scuba diving centre to explore an underwater world teeming with marine life, including gentle whale sharks. Feed your curiosity for new dining experiences at the restaurants and bars onsite - including the sand-lined main dining room and trendy beach bars. Unwind with a peaceful yoga class or revitalise with a well-deserved treatment at Tamara Spa.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Huvahendhoo",
    "location_heading": "Huvahendhoo",
    "location_subheading": "Maldives",
    "location_description": "Lily Beach Resort & Spa",
    "offer_address": "Huvahendhoo Island 00160, Maldives",
    "percentage_discount": 32.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 3899.0,
    "value": 5771.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HALMNYA5",
    "hero_image": "https://images.luxuryescapes.com/2h4palzrqdz5l8eh7qso",
    "image_two": "https://images.luxuryescapes.com/ezip3dmi3alr301rg18o",
    "image_three": "https://images.luxuryescapes.com/ep5f2vwtwclnmdmeh4c9",
    "vendor_name": "Lily Beach Resort and Spa",
    "title": "Maldives #1 Resort: All-Inclusive Luxury with Unlimited Free-Flow Drinks & Roundtrip Malé Transfers",
    "description": "Escape to an exceptional island paradise at this highly acclaimed Maldives resort, where you'll experience unmatched all-inclusive luxury. This exceptional escape offers a uniquely unparalleled experience and has been honoured as the Maldives' Leading All-Inclusive Resort 2024 by the World Travel Awards.\n\nIndulge at the onsite restaurants, including the sand-lined main dining room Lily Maa and trendy beach bars. Enjoy free-flow drinks and sip on a selection of imported Taittinger champagne or 80 premium wines from around the world, all while savouring spectacular gourmet cuisine. Plus, one child stays for free, making it a perfect choice for families.\n\nTransform your stay into a luxe playground in paradise and be spoiled by endless ways to fill your day. Stretch out alongside one of the shimmering pools, dip your toes in the translucent lagoon or explore an underwater world teeming with marine life. Find tranquillity with a peaceful yoga class or revitalise with a lavish treatment at the Tamara Spa.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Huvahendhoo",
    "location_heading": "Huvahendhoo",
    "location_subheading": "Maldives",
    "location_description": "Lily Beach Resort & Spa",
    "offer_address": "Huvahendhoo Island 00160, Maldives",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 3699.0,
    "value": 8587.0
  }
]