[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbO9bAAF",
    "hero_image": "https://images.luxuryescapes.com/z2juoeue8uiibx6vxdm",
    "image_two": "https://images.luxuryescapes.com/5jwrztvdaggsxdp0jre",
    "image_three": "https://images.luxuryescapes.com/akwbjwb7b5wrf8b0wuw",
    "vendor_name": "Aguas de Ibiza",
    "title": "Stylish Ibiza Retreat Steps from Santa Eulalia Marina with Daily Breakfast & Unlimited Spa Access",
    "description": "Embark on a serene island getaway on Ibiza's north-east coast, where eco-luxury meets tranquility. Nestled in a prime location overlooking the marina in the popular resort town of Santa Eulalia, Aguas de Ibiza serves as the perfect launchpad for exploring the Mediterranean island's treasures, from captivating turquoise beaches to lush green landscapes. This boutique escape sets to enhance its natural surroundings, instead of taking from it - smart systems save water and energy, while suppliers are chosen for their sustainable credentials. Ingredients are sourced as locally as possible for the three onsite restaurants - indulge in Peruvian flavours while sipping on pisco sours at Maymanta rooftop restaurant, discover healthy Mediterreanean combinations at Alabastro and feast on pastries, local cheeses and eggs any way at Oligo.\n\nLittle islanders will love the crafts and costumes of The Kids Fun Corner, while parents can escape to the adults-only rooftop for cocktails with a side of sea breeze. For a more tranquil vibe, take time to unwind at Revival Spa by Clarins, where you can balance the body and mind with a range of luxurious treatments that celebrate the very best in nature-based ingredients.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Santa Eulalia del Rio",
    "location_heading": "Ibiza Island",
    "location_subheading": "Spain",
    "location_description": "Aguas de Ibiza",
    "offer_address": "Salvador Camacho 14, 07840, Santa Eulalia del Rio, Islas Baleares, Spain",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 739.0,
    "value": 2316.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id0e6AAB",
    "hero_image": "https://images.luxuryescapes.com/62w47wtg3pmaghixr7r",
    "image_two": "https://images.luxuryescapes.com/36wkn1txzwrqxfoogba",
    "image_three": "https://images.luxuryescapes.com/xefk9n1bjqcf5f52987w",
    "vendor_name": "Hotel La Torre del Canónigo",
    "title": "Hilltop Heritage Luxury in Heart of Ibiza Town with Ocean-View Pool & Daily Breakfast",
    "description": "Experience the allure of Ibiza's old town with a serene stay at this historic yet luxurious boutique hotel overlooking the city and marina. Wind your way through a labyrinth of 14th-century walls and medieval marvels to reach the charming Hotel La Torre del Canónigo,  a restored heritage building full of traditional Spanish character. The hotel's exterior - comprised of three 16th-century buildings - may be reflective of the city’s past, but the interior showcases a modern flair and energetic spirit perfectly suited to Ibiza’s lively atmosphere. Inside the stylish rooms, exposed stone walls act as the perfect backdrop for plush velvet touches and lavish furnishings.\n\nWhen you’re ready to step outside your tranquil room, the hotel’s pool and terrace is the place to enjoy a refreshing swim with unparalleled views that stretch across the Mediterranean below. Visit Corsario Restaurant to dine in style as you watch the sun go down and the city come to life after dark.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Ibiza Town",
    "location_heading": "Ibiza Island",
    "location_subheading": "Spain",
    "location_description": "Hotel La Torre del Canónigo",
    "offer_address": "Carrer de Joan Roman, 1, 07800, Ibiza, Spain",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 959.0,
    "value": 2080.0
  }
]