[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Vo2eAAC",
    "hero_image": "https://images.luxuryescapes.com/l4r64ayhecmxqwfsfo4",
    "image_two": "https://images.luxuryescapes.com/90mri182cr7x2p9lzwn",
    "image_three": "https://images.luxuryescapes.com/ckk67qo0dz6lglmjy0d",
    "vendor_name": "Tropical Retreat Luxury Resort & Spa Igatpuri",
    "title": "Top-Rated Igatpuri Western Ghats Escape with Daily Dining, Cocktails & Adventure Experiences",
    "description": "Transport yourself to the tranquil environs of Igatpuri, a hill station in the Western Ghats, with a stay at Tropical Retreat Luxury Resort & Spa, just a 2.5-hour drive from Mumbai and a 4.5-hour drive from Pune. A haven of grace and tranquility for discerning travellers, this top-rated retreat is currently ranked the #1 property in Igatpuri on Tripadvisor. Sprawled over 8.5 acres of lush green landscape, Tropical Retreat Luxury Resort & Spa offers comfortable accommodation, delicious dining and exciting adventurous experiences, from exhilarating bridge climbs to archery.\n\nWhether you're seeking family fun or a romantic stay, Tropical Retreat Luxury Resort & Spa is the place to be.\n\n**Your handpicked inclusions:**\n\n- Begin your Igatpuri adventure with daily buffet breakfast at Ambrosia\n- Every night, sit down for a three-course/buffet dinner at Ambrosia\n- Enjoy one cocktail every evening at Shimmers Bar/Pool Bar (one drink per person)\n- Go crazy with access to adventure activities (Burma Bridge, rope cycling and archery) \n- Make the most of your stay with a 20% discount on drinks, dining and spa\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** Two kids aged six years and under stay free in existing bedding with all inclusions (excludes alcohol).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Igatpuri",
    "location_heading": "Igatpuri",
    "location_subheading": "India",
    "location_description": "Tropical Retreat Luxury Resort & Spa",
    "offer_address": "Survey No. 237/1, Pimpri Road, Mumbai - Agra National Hwy, Near PWD Guest House, Ram Nagar, Igatpuri, Maharashtra 422403",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 164.0,
    "value": 383.0
  }
]