[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cLiJkQAK",
    "hero_image": "https://images.luxuryescapes.com/g9hwliextj5mzbu8euye",
    "image_two": "https://images.luxuryescapes.com/dexuj8suz6ni6bypqmlo",
    "image_three": "https://images.luxuryescapes.com/iwy6uh1wyeb2av8nkb5",
    "vendor_name": "Kupu Kupu Jimbaran Beach Club and Spa",
    "title": "Blissful Balinese Escape with Luxurious Spa Treatment",
    "description": "Relax and recharge with a stay at Kupu Kupu Jimbaran Beach Club and Spa. This stylish resort offers a beautiful location where you can immerse yourself in the tranquillity of Jimbaran, while still having easy access to all Bali has to offer. The jewel in the resort’s crown is the stunning Bamboo Spa by L’OCCITANE, where you can feel your troubles melt away with blissful massage treatments and more. Enjoy daily buffet breakfast, a 90-minute Balinese massage, two three-course set menu lunches at Chocolate Café, access to the popular Jimbaran Beach Club with priority seating, one-way airport transfers and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Kupu Kupu Jimbaran Beach Club and Spa",
    "offer_address": "Jimbaran, South Kuta, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 77.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 372.0,
    "value": 1645.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cs6T1QAI",
    "hero_image": "https://images.luxuryescapes.com/cltdypllqvwnvto02k2",
    "image_two": "https://images.luxuryescapes.com/5ab1pd98hlykesfel4wk",
    "image_three": "https://images.luxuryescapes.com/a0q5w0hn7ce76l7jng",
    "vendor_name": "The Sintesa Jimbaran",
    "title": "Relaxing Bali Escape",
    "description": "Enjoy a laidback break in Bali at The Sintesa Jimbaran, located in a tranquil spot just a short shuttle ride from the beach, shops and restaurants. With daily breakfast, a daily cocktail per adult, one three-course dinner for two, a relaxing Balinese massage, a one-way airport transfer and a daily shuttle service to nearby Jimbaran Beach all included in your package, there’s something to keep everyone happy.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Sintesa Jimbaran",
    "offer_address": "Jl. Kencana No.1, Jimbaran, Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 245.0,
    "value": 640.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GgVHVYA3",
    "hero_image": "https://images.luxuryescapes.com/18x3wnjay9229f1zv5",
    "image_two": "https://images.luxuryescapes.com/4gehvc9m5v2ecnomzph",
    "image_three": "https://images.luxuryescapes.com/67stxl7imwo5lqp463l",
    "vendor_name": "The Jimbaran Villa by Ini Vie Hospitality",
    "title": "Secluded Jimbaran Private Pool Villas with Rooftop Terrace, Daily Breakfast & Nightly Beer",
    "description": "Answer the call of Bali’s pristine beaches, palm-fringed landscapes and turquoise waters with a stay at The Jimbaran Villa. Perfect for a romantic getaway, this hidden oasis offers boutique accommodation in a quieter region of Bali, all within easy walking distance of beachfront restaurants and bars.\n\nRelax with ease in spacious villas and catch the picturesque sunset from your furnished rooftop terrace, or sink even further into wellness enrichment with a laze in the comfortable hammock hanging next to your private pool.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Jimbaran Villa",
    "offer_address": "Jalan Bukit Permai, Mimpi Resort No. 88, Jimbaran 80361, Bali, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 341.0,
    "value": 771.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Flof3YAB",
    "hero_image": "https://images.luxuryescapes.com/xw8cox0bnklpkm4v51me",
    "image_two": "https://images.luxuryescapes.com/6pveo1tsbbk0ifn9977f",
    "image_three": "https://images.luxuryescapes.com/xmr6h26n5bmgux9h1z6",
    "vendor_name": "The Leaf Jimbaran",
    "title": "Jimbaran Private Pool Villa Stay with Daily Breakfast, Daily Lunch or Dinner & Daily Beer",
    "description": "Relax from your upgraded private pool villa nestled between the beach and the hills of Jimbaran, home to golden beaches, sunsets and a laid-back atmosphere. Enjoy traditional and international favourites at Sattvic Restaurant, or sit back with a cocktail and some light tapas while taking in the tropical views from Cilantro Rooftop Bar & Lounge.\n\nFor complete relaxation, choose from a menu of treatments available at Thyme Spa, or take advantage of regular cooking and sunset yoga classes hosted by the resort. Shuttles to local beaches run regularly, allowing you to explore the surrounding area whenever you're not taking in all that the resort has to offer.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Leaf Jimbaran",
    "offer_address": "Jalan Jepun, Karang Mas Sejahtera No 81, Jimbaran, Bali 80361, Indonesia",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 307.0,
    "value": 985.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxEBRAA3",
    "hero_image": "https://images.luxuryescapes.com/vbta05q94a4fxvxl6py",
    "image_two": "https://images.luxuryescapes.com/65kubysppnp0uck0qw8l",
    "image_three": "https://images.luxuryescapes.com/w4ql42mnlpmapxfiel",
    "vendor_name": "RIMBA by AYANA Bali",
    "title": "Unmissable Five-Star RIMBA by AYANA Bali Escape with Daily Dining Across 11 Restaurants & Rock Bar Priority Access",
    "description": "Experience a not-to-be-missed stay at an award-winning, world-class haven that stretches across 90 hectares of clifftop land above Jimbaran Bay. Book an exquisite escape to Bali’s only resort integrated with AYANA Bali and bear witness to majestic sunsets and lush verdant gardens that are complemented by five-star shared facilities. Dotted along the coast-hugging grounds are 14 dreamy swimming pools - including three with waterslides and another with a swim-up bar. Gourmands will revel in the chance to explore an array of restaurants and bars across the shared resort complex, serving everything from traditional Balinese to Mediterranean fare, cocktails and tapas.\n\nFor those who enjoy an active escape, take advantage of the complimentary resort shuttle and visit the recreation facilities at both RIMBA and the AYANA Estate, which include a golf-putting course and fitness centres. A world-class spa is close at hand for pampering and relaxation, and the world-famous Rock Bar provides the perfect setting to watch the sunset with a cocktail in hand. Or, simply step straight out onto the white-sand Kubu Beach and soak up the Balinese bliss or cool off in the azure waters.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "RIMBA by AYANA Bali",
    "offer_address": "Jalan Karang Mas Sejahtera, Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 48.0,
    "min_duration": 6,
    "max_duration": 21,
    "price": 1199.0,
    "value": 2318.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dbiPIQAY",
    "hero_image": "https://images.luxuryescapes.com/3ub8381sabi0opp0283u",
    "image_two": "https://images.luxuryescapes.com/gpcnhb2iprou3oy3ef",
    "image_three": "https://images.luxuryescapes.com/mqj3gtx6gxbw1tda82r",
    "vendor_name": "Belmond Jimbaran Puri",
    "title": "Five-Star Beachfront Luxury with Daily Dining Inclusions",
    "description": "Discover the beauty of Jimbaran, Bali staying at the five-star beachfront paradise of Belmond Jimbaran Puri, one of the renowned Belmond group's ultra-luxurious hotels. Truly unwind with a daily buffet breakfast, choice of daily three-course lunch or dinner, two 30-minute massages each, convenient airport pick-up, guaranteed late 1pm checkout and a complimentary cocktail each.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Belmond Jimbaran Puri",
    "offer_address": "Jalan Uluwatu Yoga Perkanthi Lane, Jimbaran, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 975.0,
    "value": 3353.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMQJcAAP",
    "hero_image": "https://images.luxuryescapes.com/nxi9hfojnmo54jyq5ro",
    "image_two": "https://images.luxuryescapes.com/n6gztdgzbgwljn05ehep",
    "image_three": "https://images.luxuryescapes.com/fthon6k0mcblsmkvish",
    "vendor_name": "InterContinental Bali Resort",
    "title": "InterContinental Jimbaran Beachfront Luxury with Daily Breakfast, Nightly Dinner & Nightly Cocktails",
    "description": "Enjoy the luxurious seclusion of traditional Balinese living at this five-star resort from the notable InterContinental brand, the first of its kind to be built on the shores of the serene Jimbaran Bay. A mirage of lush tropical foliage opposite the secluded, powder-white beachfront, this village-style retreat invites you to unwind away from the crowds.\n\nStart your days with a delicious breakfast at Taman Gita overlooking the gardens, feel the sand between your toes at Sunset Beach Bar & Grill, swing by Jimbaran Gardens to soak up the seaside ambience, and indulge in the jetted tub, steam room and sauna at the Spa Uluwatu. Bring the whole family along, with one child staying and eating free, and treat the little ones to a variety of exciting resort activities from tennis to paddleboarding and access to the Planet Trekkers Kids’ Club.\n\nRelax as you please in the resort’s collection of newly refreshed rooms and suites complete with handmade furnishings, classic Balinese touches, breezy private balconies and marble bathtubs. Venture out to explore the glorious semi-secluded stretch of beach, float in the sparkling resort pool, or stretch out waterside with a refreshing cocktail at the Pool Bar.\n\nEnhance the opulence with an upgraded stay in a Club room or Suite for access to the Club InterContinental lounge to enjoy daily breakfast, light refreshments, afternoon tea and two-hour nightly free-flow drinks in the luxurious lounge space. Experience the best of Bali from this next-level beachfront location, within 15 minutes of the airport and easy reach of the Kuta shopping district and the Nusa Dua resort enclave.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "InterContinental Bali Resort",
    "offer_address": "45 Jalan Raya Uluwatu, Jimbaran, Kuta Selatan, Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 40.0,
    "min_duration": 6,
    "max_duration": 22,
    "price": 1239.0,
    "value": 2060.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2b7rQAB",
    "hero_image": "https://images.luxuryescapes.com/e7hiok9fnpvbtf7o1b1a",
    "image_two": "https://images.luxuryescapes.com/ydajgyq47lnbnrqae03",
    "image_three": "https://images.luxuryescapes.com/d4i1be8bi9o53us8xso",
    "vendor_name": "Cross Bali Breakers Resort",
    "title": "Five-Star Grand Opening: Private Pool Villa",
    "description": "Discover secluded romance at the brand-new X2 Bali Breakers Resort in Jimbaran, staying in a lavish private pool villa. This hideaway is set within lush tropical gardens and sits just 10 minutes’ drive from some of Bali’s best beaches, offering the ultimate escape for couples. Enjoy daily breakfast, your choice of daily lunches or dinners, nightly cocktail each, relaxing 60-minute massage each, private one-way transfer from Denpasar Airport and a guaranteed late 1pm checkout.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "X2 Bali Breakers Resort 2019",
    "offer_address": "Jl. Pantai Balangan no. 10, Balangan, Jimbaran, Bali, Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 9,
    "price": 799.0,
    "value": 1876.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4EGBQA3",
    "hero_image": "https://images.luxuryescapes.com/gjhzezxfs8naynodck5o",
    "image_two": "https://images.luxuryescapes.com/hdisj6jbyxkggwxpiic4",
    "image_three": "https://images.luxuryescapes.com/gyke7pelo1pj6buhseci",
    "vendor_name": "Royal Tulip Springhill Resort",
    "title": "Bali Escape with Daily Breakfast and Gourmet Inclusions",
    "description": "Kick back, relax and enjoy the serenity of Jimbaran - the ultra-chilled side of Bali - staying at the newest resort in the area: The Royal Tulip Springhill Resort Jimbaran. Your escape includes daily breakfast, two multi-course dinners during your stay, a 60-minute Balinese massage per person, a daily cocktail each, two afternoon tea experiences and a one-way airport transfer. Plus, enjoy complimentary scheduled shuttle transport to Jimbaran Beach Club during your stay and a leisurely late 1pm checkout.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Royal Tulip Springhill Resort Jimbaran 2018",
    "offer_address": "Jalan Jimbaran Hijau Kelod Jimbaran Bali 80361",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 245.0,
    "value": 670.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DeEkAAK",
    "hero_image": "https://images.luxuryescapes.com/5tcgd6f7qfpe7n4bebdg",
    "image_two": "https://images.luxuryescapes.com/6ysdh5ryh77fk6lpcacm",
    "image_three": "https://images.luxuryescapes.com/f3duyy41w6502v0j3x",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Family-Friendly Bali Mövenpick Indulgence with Daily Breakfast, Daily Lunch or Dinner & Chocolate Hour",
    "description": "Life doesn’t get much sweeter than a stay at the award-winning, five-star Mövenpick Resort & Spa Jimbaran Bali, offering true resort luxury and nonstop family fun just minutes from the shimmering beachfront of Jimbaran. This gourmet sanctuary - brought to you by the brand behind the Swiss-style artisan ice cream - is home to stunning swimming pools, high-end restaurants and, of course, plenty of Mövenpick's signature sweet creations. While young ones have the time of their lives at the pirate ship-themed kids' club, adults can indulge in afternoon cocktails with sweeping views or a rejuvenating Indonesian treatment at the tranquil onsite spa. The impressive multi-level, water-slide-adorned swimming pool and the dazzling array of activities available to book through Mövenpick - from watersport adventures to cultural tours - will provide endless excitement for the whole family.\n\nThen there's the Samasta Lifestyle Village next door - an open-air shopping, dining and entertainment complex just a few steps from the hotel lobby. You'll also be just a short stroll from the relaxed, cafe-lined sands of Pantai Muaya, famous for its scenic sunsets and relaxed Jimbaran vibes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jalan Wanagiri No.1, Jimbaran, South Kuta, Bali 80362, Indonesia",
    "percentage_discount": 38.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 494.0,
    "value": 800.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CiwNzYAJ",
    "hero_image": "https://images.luxuryescapes.com/hlyem396jfj2mt0h2v2l",
    "image_two": "https://images.luxuryescapes.com/656a606ek5vadthmnlms",
    "image_three": "https://images.luxuryescapes.com/pruknukdz69sbghp9l9",
    "vendor_name": "InterContinental Bali Resort",
    "title": "Bali Iconic Jimbaran Beachfront Luxury with Daily Breakfast, Daily Lunch or Dinner & Free-Flow Drinks Hour",
    "description": "Enjoy the luxurious seclusion of traditional Balinese living at this five-star resort, the first of its kind to be built on the shores of the serene Jimbaran Bay. A mirage of lush tropical foliage opposite a secluded, powder-white beachfront, this village-style retreat invites you to unwind away from the crowds.\n\nStart your day with breakfast at Taman Gita overlooking the gardens, feel the sand between your toes at Sunset Beach Bar & Grill, swing by Jimbaran Gardens to soak up the seaside ambience, and indulge in the jetted tub, steam room and sauna at the Spa Uluwatu. Bring the whole family along, and treat the little ones to exciting resort activities like tennis and paddleboarding.\n\nRelax as you please in the resort’s collection of newly refreshed rooms and suites complete with handmade furnishings, classic Balinese touches, breezy private balconies and marble bathtubs. Venture out to explore the glorious semi-secluded stretch of beach, float in the sparkling resort pool, or stretch out waterside with a refreshing cocktail at the Pool Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "InterContinental Bali Resort",
    "offer_address": "45 Jalan Raya Uluwatu, Jimbaran, Kuta Selatan, Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 22,
    "price": 1199.0,
    "value": 3214.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cqT3NQAU",
    "hero_image": "https://images.luxuryescapes.com/yko3dpih8swlpi7l4aw",
    "image_two": "https://images.luxuryescapes.com/iuent2h17fc1r1fyfop",
    "image_three": "https://images.luxuryescapes.com/55qtbl09urzsk8qn5vo",
    "vendor_name": "The Leaf Jimbaran",
    "title": "Private Pool Villa Luxury with Gourmet Dining & Daily Cocktails",
    "description": "Relax and rejuvenate at the blissfully secluded The Leaf Jimbaran. Find your private slice of Balinese paradise while staying in a huge 180sqm one-bedroom private pool villa with daily buffet breakfast, exquisite dining inclusions at Cilantro Rooftop Bar & Lounge for dinner and at Sattvic Restaurant for lunch, a relaxing 60-minute massage each, a daily cocktail per person, convenient one-way airport transfer and a guaranteed leisurely late 1pm checkout.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Leaf Jimbaran - 2019",
    "offer_address": "Karang Mas Sejahtera No. 81, Jl. Jepun, Jimbaran, Badung, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 614.0,
    "value": 1854.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DP9fAAAT",
    "hero_image": "https://images.luxuryescapes.com/2tmrqteat1goo1h48d",
    "image_two": "https://images.luxuryescapes.com/et30q8fcg7av9fsp55e",
    "image_three": "https://images.luxuryescapes.com/2pnd2g4ol1r9rbpa9mb",
    "vendor_name": "Kayumanis Jimbaran Private Estate & Spa",
    "title": "Bali Pool Villa Luxe near Jimbaran Beach with Daily Dining, Sunset Cocktails, Two 90-Minute Massages & Roundtrip Transfers",
    "description": "Set moments from the pristine sands of Jimbaran Beach, you’ll find the five-star Kayumanis Jimbaran Private Estate & Spa - an exclusive tropical haven of expansive villas with private pools, fringed with tropical greenery. Fusing traditional Balinese elements with opulent dark wood accents and thatched roofs while blissfully integrating modern luxuries, each villa has spacious day beds to catch up on some well-deserved relaxation, an expansive courtyard, and wide glass doors that allow the balmy sea breeze in.\n\nWith traditional and international delicacies on offer at Kayumanis Resto Jimbaran, and a menu of relaxing treatments available at the spa, it's easy to spend your entire stay at the resort. But venture beyond the walls of your private villa and you'll find idyllic Jimbaran Beach, famed for its white sands, sapphire waters, casual seafood cafés lining the shore, and hypnotic evening sunsets. For adventures a little further afield, the thundering waves of Uluwatu or the idyllic enclave of Nusa Dua can be reached within a 20-minute drive.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Jimbaran Private Estate & Spa",
    "offer_address": "Jalan Yoga Perkanthi Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 755.0,
    "value": 1846.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JCFy1YAH",
    "hero_image": "https://images.luxuryescapes.com/u3v3236hh704jobpn1",
    "image_two": "https://images.luxuryescapes.com/n9qmwah6b7cxz3bd5r1o",
    "image_three": "https://images.luxuryescapes.com/4jd6lspcigl0x8og3aw",
    "vendor_name": "AYANA Segara Bali",
    "title": "Ultimate Jimbaran Bay Clifftop Luxury with Daily Breakfast & Daily Lunch or Dinner at 11 Restaurants",
    "description": "Experience sparkling pools and unbeatable sunset views from the rooftop of this stunning AYANA escape: a clifftop resort designed to take luxury to new heights.\n\nNestled amid 90 hectares of tropical forest above Jimbaran Bay, AYANA Segara Bali is the newest luxurious addition to the award-winning AYANA Bali complex. Indulge at the state-of-the-art rooftop terrace, featuring sensational infinity pools, plush daybeds and Luna Rooftop Bar, where you can sip a cocktail as the sun sets and transforms the sky into a striking array of colours over the ocean.\n\nGuests of AYANA Segara Bali are also invited to make use of the renowned wellness and dining facilities of the wider AYANA complex, including one of Bali's most legendary venues for a cocktail with a view - Rock Bar, carved into the rockface by the crashing ocean - in addition to 14 pools, a miniature 18-hole golf course, Kubu Beach, and a spa and fitness centre. At the end of the day, relax in style with deep-soaking bathtubs and private balconies in every room.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Segara Bali",
    "offer_address": "Jalan Karang Mas Sejahtera, Jimbaran, South Kuta, Badung Regency, Bali 80364, Indonesia",
    "percentage_discount": 70.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1399.0,
    "value": 4603.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AbA60AAF",
    "hero_image": "https://images.luxuryescapes.com/4bwt5fwxjaa3outwt3l",
    "image_two": "https://images.luxuryescapes.com/mn8380bdkg0pr5hdg5ce",
    "image_three": "https://images.luxuryescapes.com/t526z0rdj937e9hk9vgm",
    "vendor_name": "Cross Bali Breakers Resort",
    "title": "Bali Five-Star Private Pool Villa Hideaway with Daily Breakfast, Daily Lunch or Dinner & Nightly Free-Flow Cocktail Hour",
    "description": "Experience the pinnacle of secluded romance at the award-winning Cross Bali Breakers in Jimbaran, a five-star sanctuary ideally located on Bali’s pristine southern peninsula. This luxury hotel is surrounded by Balinese jungle, yet is just 10 minutes from the waves of famed Balangan Beach and the cool, calm waters of Dreamland Beach. When you're not relaxing beachside, enjoy the seclusion of your very own villa, complete with a private pool.\n\nMake the most of the resort’s luxurious amenities, which include a glorious sunken swim-up bar, rooftop pool, adults-only serenity pool, outdoor gym and a full-service spa. Savour an all-day culinary experience at Point Break by CROSS restaurant or swim up and enjoy quality snacks and drinks at Sunken Pool Bar. In the evening, watch the sun sink below the horizon as you sample creative cocktails overlooking the resort at the unbeatable Hang Loose Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Cross Bali Breakers",
    "offer_address": "Jl. Pantai Balangan No. 10, Jimbaran, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 895.0,
    "value": 2429.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zRTGAA2",
    "hero_image": "https://images.luxuryescapes.com/l7sfinc6ebyqpbd1h4k3i",
    "image_two": "https://images.luxuryescapes.com/028k0ss8qlfgazc4h6yi",
    "image_three": "https://images.luxuryescapes.com/dbsln8n1dk2ej5see7lj",
    "vendor_name": "Kayumanis Jimbaran Private Estate & Spa",
    "title": "Five-Star Jimbaran Villa Haven with Daily Breakfast, Sunset Cocktails & Massages",
    "description": "Set moments from a pristine sweep of sand and hugged by a dense canopy of swaying coconut palms you’ll find the five-star Kayumanis Jimbaran Private Estate & Spa - a tropical haven ranked within the top 10% of properties on Tripadvisor. Couples and families alike can seek solace in this tranquil oasis that was once a former coconut grove. Today the stunning resort has been expertly designed with no detail overlooked. \n\nEach of the 20 expansive villas perfectly fuses traditional Balinese elements with opulent dark-wooden accents and thatched roofs while blissfully integrating modern luxuries sure to win you over. Each has its own private plunge pool, spacious day beds to catch up on some well-deserved relaxation, an expansive courtyard fringed with lush tropical greenery, and wide glass doors that allow the balmy sea breeze in. Venture beyond the walls of your private villa to Jimbaran Beach, an idyllic spot just a short stroll away, and famed for its white sands, sapphire waters, casual seafood cafés lining the shore, and hypnotic evening sunsets. For adventures a little further along, the thundering waves of Uluwatu or the idyllic enclave of Nusa Dua can be reached within a 20-minute drive.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Jimbaran Private Estate & Spa",
    "offer_address": "Jalan Yoga Perkanthi Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1299.0,
    "value": 2724.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPjV5QAK",
    "hero_image": "https://images.luxuryescapes.com/aocidwn6tpfzbkfjfm9v",
    "image_two": "https://images.luxuryescapes.com/qguiprohkfstgtchc7hi",
    "image_three": "https://images.luxuryescapes.com/qk7tvvymrylxreihx0ii",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Coastal Mövenpick Luxury with Incredible Family Inclusions",
    "description": "With access to a Jimbaran Beach, this paradise is home to a world-class rooftop bar, a range of high-end restaurants and Mövenpick’s famous Swiss chocolate specialties. Treat yourself to five-star family indulgence at Mövenpick Resort & Spa Jimbaran Bali, boasting high-end amenities amidst an amazing kids' club in a pirate ship for little ones. Jam-packed with VIP inclusions, your escape features daily buffet breakfast with unlimited ice cream, indulgent dining experiences including two three-course lunches, two three-course dinners and a daily decadent Mövenpick chocolate hour. You'll also enjoy a 60-minute Sasak massage for two, daily rooftop cocktail at the ultra-chic Above Eleven rooftop bar, private one-way airport transfers and much more - plus one child 11 years and under stays free with most inclusions.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali - March 2019",
    "offer_address": "Jl. Wanagiri No.1, Jimbaran, Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 66.0,
    "min_duration": 7,
    "max_duration": 10,
    "price": 1124.0,
    "value": 3339.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Znk4oQAB",
    "hero_image": "https://images.luxuryescapes.com/cwqjr1gpo1pqbe2n7hcv",
    "image_two": "https://images.luxuryescapes.com/qz3bv793ehd0ljo3eoo5",
    "image_three": "https://images.luxuryescapes.com/dyvpgi2kndygayfjz5lg",
    "vendor_name": "Belmond Jimbaran Puri",
    "title": "Five-Star Beachfront Belmond Luxury with Daily Dining Inclusions",
    "description": "Discover the beauty of Jimbaran, staying at a five-star Bali beachfront paradise at Belmond Jimbaran Puri, one of the renowned Belmond group's ultra-luxurious hotels. Truly unwind with a daily buffet breakfast, choice of daily three-course lunch or dinner, a 30-minute massage each, convenient airport pick-up, guaranteed late 1pm checkout and a complimentary cocktail each.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Belmond Jimbaran Puri - Jan 19",
    "offer_address": "Jalan Raya Uluwatu, Yoga Perkanthi Lane, Jimbaran, Kuta Selatan, Jimbaran, Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 71.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 935.0,
    "value": 3240.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UySILQA3",
    "hero_image": "https://images.luxuryescapes.com/ixcfhthfb8jxud6hy3m8",
    "image_two": "https://images.luxuryescapes.com/cu0kpbbbnxgcldigpeiq",
    "image_three": "https://images.luxuryescapes.com/qysj17jojauhom9tgwmc",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Mövenpick Indulgence in Bali's Beautiful Jimbaran",
    "description": "Treat yourself to five-star indulgence at Mövenpick Resort & Spa Jimbaran Bali, an incredible resort offering everything from an artisan beach lagoon pool with swim-up bar and a spa for adults, to a waterslide and amazing kids' club in a pirate ship for little ones - all a short distance from the famed Jimbaran Beach. Jam-packed with VIP inclusions, your escape features daily buffet breakfasts with unlimited ice cream, two indulgent dining experiences including a three-course lunch, a three-course dinner, an afternoon tea featuring signature Mövenpick creations, a 60-minute Balinese massage each, rooftop cocktails at Jimbaran's tallest rooftop bar, private airport pickup on arrival or drop off on departure and more - plus one child 11 and under stays free including breakfast.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali - 2018",
    "offer_address": "Jl. Wanagiri No.1, Jimbaran, Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 62.0,
    "min_duration": 7,
    "max_duration": 10,
    "price": 948.0,
    "value": 2468.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FiIGhAAN",
    "hero_image": "https://images.luxuryescapes.com/u030x2no95w5q0ellmiq",
    "image_two": "https://images.luxuryescapes.com/xjj6qdqtog7dm5aykma",
    "image_three": "https://images.luxuryescapes.com/mn8lf1fkhh9czapm7i",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Award-Winning Mövenpick Bali Indulgence Is Back with Daily Breakfast, Daily Lunch or Dinner, Chocolate Hour & Children Eat Free",
    "description": "Life doesn’t get much sweeter than a stay at Bali's foremost family resort, the five-star, award-winning Mövenpick Resort & Spa Jimbaran Bali, offering true resort luxury and non-stop family fun just minutes from the shimmering beachfront of Jimbaran. This resort is home to stunning swimming pools and high-end eateries like Anarasa restaurant and Mövenpick Cafe. While young ones have the time of their lives at the pirate ship-themed kids' club, adults can indulge in afternoon cocktails with sweeping views or a rejuvenating treatment at the spa.\n\nThe impressive multi-level, water-slide-adorned swimming pool and the dazzling array of activities available to book through Mövenpick - from watersport adventures to cultural tours - will provide endless excitement for the whole family. Then there's the Samasta Lifestyle Village next door - an open-air shopping, dining and entertainment complex just a few steps from the hotel lobby. You'll also be just a short stroll to the relaxed, cafe-lined sands of Pantai Muaya, famous for its scenic sunsets and relaxed Jimbaran vibes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jalan Wanagiri No.1, Jimbaran, South Kuta, Bali 80362, Indonesia",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 501.0,
    "value": 865.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcfeHAAR",
    "hero_image": "https://images.luxuryescapes.com/inn5iz45msxhy7mw96j8",
    "image_two": "https://images.luxuryescapes.com/931889zug9gyis5wbr9s",
    "image_three": "https://images.luxuryescapes.com/5t1fd2g388m4o7h1e7i",
    "vendor_name": "The Leaf Jimbaran",
    "title": "Bali Private Pool Villa Stay with Massages, Daily Breakfast & Nightly Cocktails",
    "description": "Indulge in blissful relaxation from your private villa nestled between the beach and the hills of Jimbaran, home to golden beaches, dramatic sunsets and a laid-back atmosphere. Enjoy traditional and international delicacies at Sattvic restaurant, or sit back with a cocktail and some light tapas while taking in the tropical views from Cilantro Rooftop Bar & Lounge. For complete relaxation, choose from a menu of treatments available at Thyme Spa, or take advantage of regular cooking and sunset yoga classes hosted by the resort. Shuttles to local beaches run regularly, allowing you to explore the surrounding area whenever you're not luxuriating in all that the resort has to offer.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Leaf Jimbaran",
    "offer_address": "Jalan Jepun, Karang Mas Sejahtera No 81, Jimbaran, Bali 80361, Indonesia",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 899.0,
    "value": 2814.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ex9hQAAR",
    "hero_image": "https://images.luxuryescapes.com/4kb8kmjvegow2598xklb",
    "image_two": "https://images.luxuryescapes.com/7npuzemk1n6w8n2nn6xa",
    "image_three": "https://images.luxuryescapes.com/27lb8wm5qr303oawifld",
    "vendor_name": "The Jimbaran Villa by Ini Vie Hospitality",
    "title": "Secluded Bali Villa Paradise with Private Pool, Daily Breakfast & Daily Bucket of Beers",
    "description": "Answer the call of Bali’s pristine beaches, palm-fringed landscapes and turquoise waters with a stay at The Jimbaran Villa. Perfect for a romantic getaway, this hidden oasis offers boutique accommodation in a quieter region of Bali and is within easy walking distance of beachfront restaurants and bars. Relax with ease in spacious villas, enjoy a private floating breakfast and catch the picturesque sunset from your furnished rooftop terrace, or sink even further into wellness enrichment with a laze in the comfortable hammock hanging next to your private pool.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Jimbaran Villa",
    "offer_address": "Jalan Bukit Permai, Mimpi Resort No. 88, Jimbaran 80361, Bali, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 464.0,
    "value": 961.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Hn4dNYAR",
    "hero_image": "https://images.luxuryescapes.com/g9tqce27bk1o1209uegd",
    "image_two": "https://images.luxuryescapes.com/fvkctfi7n19fi80jtt35",
    "image_three": "https://images.luxuryescapes.com/g1y84d47czm7tv2kqb",
    "vendor_name": "AYANA Resort Bali",
    "title": "Bali Ultimate Oceanfront Luxury: Cliffside Oasis with Massages, Daily Breakfast & Nightly Dinner",
    "description": "Experience the grandeur of five-star AYANA Resort Bali, situated on the cliff-tops of Jimbaran's renowned 'sunset coast'. Recently renovated, the resort now boasts enhanced facilities and accommodations, surrounded by lush tropical gardens and sweeping Indian Ocean views.\n\nAYANA Resort Bali is a destination in its own right, boasting 30 world-class restaurants, bars and cafes, 14 shimmering pools, including a kids' one equipped with slides, and 13 boutique shops. The standout? Rock Bar - carved into the cliffside, known for its sunset views, expertly crafted cocktails and DJ sets that draw a global crowd.\n\nThere's a slice of paradise for every age and the Kids’ Playground is just the start - at AYANA, little explorers can learn about sustainability at the farm, roll dough in pizza-making classes and connect with Balinese culture. Meanwhile, adults can retreat to AYANA Spa for wellness rituals or oceanfront treatments at Spa on the Rocks.\n\nWhen it’s time to explore, Jimbaran Village is a short drive away - think art galleries, markets, fine dining, ancient temples and outdoor adventures just beyond the resort.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Resort Bali",
    "offer_address": "Jalan Karang Mas Sejahtera Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1459.0,
    "value": 2987.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C53cZAAR",
    "hero_image": "https://images.luxuryescapes.com/xoth7faj4kn9e6tfngsm",
    "image_two": "https://images.luxuryescapes.com/ggmc6lia6vcf5rflfdx",
    "image_three": "https://images.luxuryescapes.com/di1exq0btmbtv9ykynp",
    "vendor_name": "AYANA Segara Bali",
    "title": "Grand Opening: AYANA Segara Bali Resort Luxury with Cocktails, Massages & Daily Dining",
    "description": "Be one of the first to experience the sparkling pools and unbeatable sunset views from the rooftop bar of AYANA Segara: a clifftop resort designed to take luxury to new heights. Nestled amid 90 hectares of tropical forest above Jimbaran Bay, this brand-new wing is the latest and most luxurious addition to the award-winning AYANA Bali complex. \n\nIndulge at the state-of-the-art rooftop terrace, featuring sensational infinity pools, plush day beds and Luna Bar, where you can sip a cocktail as the sun sets and transforms the sky into a striking array of colours over the ocean. Guests to AYANA Segara are also invited to make use of the renowned wellness and dining facilities of the wider AYANA complex, including one of Bali's most legendary venues for a cocktail with a view - Rock Bar, carved into the rockface by the crashing ocean - in addition to 12 pools, a miniature 18-hole golf course, Kubu Beach, a spa and fitness centre. At the end of the day, relax in style, with deep-soaking bathtubs and private balconies in every room.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Segara Bali",
    "offer_address": "Jalan Karang Mas Sejahtera, Jimbaran, South Kuta, Badung Regency, Bali 80364, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 5,
    "max_duration": 25,
    "price": 1574.0,
    "value": 4413.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbpazAAB",
    "hero_image": "https://images.luxuryescapes.com/ziz36znl67iazwtmd2w",
    "image_two": "https://images.luxuryescapes.com/hw614x5ulzj5wwa82g",
    "image_three": "https://images.luxuryescapes.com/73owy095m53afphcchr",
    "vendor_name": "Cross Bali Breakers Resort",
    "title": "Five-Star Bali Pool Villas with Daily Breakfast, Daily Lunch or Dinner & Nightly Free-Flow Cocktail Hour",
    "description": "Discover new heights of secluded luxury at this five-star Jimbaran sanctuary ideally located on Bali’s pristine southern peninsula. Though surrounded by lush Balinese jungle, this luxury hotel is a beach-lovers dream: just 10 minutes from Balangan Beach's legendary waves and Dreamland Beach's calm, limestone-hugged waters. When not relaxing on the sand, you'll love the careful touches shown in your very own villa, complete with a magnificent private pool and relaxing tropical gardens.\n\nMake the most of the resort’s top-notch facilities, which include the swim-up Sunken Pool Bar, rooftop pool, adults-only serenity pool, outdoor fitness centre and traditional Balinese wellness centre Alo'e Wellness. Savour classic cocktails and local delicacies at the resort's all-day dining venue, Point Break by CROSS, or let the good times roll as you soak up the unforgettable Balinese sunset from the panoramic Hang Loose Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Cross Bali Breakers",
    "offer_address": "Jl. Pantai Balangan No. 10, Jimbaran, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 969.0,
    "value": 1923.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000COiAoAAL",
    "hero_image": "https://images.luxuryescapes.com/paiz6xhhuaoriqdx3n5",
    "image_two": "https://images.luxuryescapes.com/i3ym7uaj8mb5bpwu7j",
    "image_three": "https://images.luxuryescapes.com/4lx0b6xqs58dh3jre5i",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Award-Winning Mövenpick Bali Indulgence is Back with Daily Breakfast, Daily Lunch or Dinner & Chocolate Hour",
    "description": "Life doesn’t get much sweeter than a stay at the award-winning, five-star Mövenpick Resort & Spa Jimbaran Bali, offering true resort luxury and nonstop family fun just minutes from the shimmering beachfront of Jimbaran. This resort is home to stunning swimming pools, high-end restaurant Anarasa Restaurants, Katha Lobby Lounge & Library & Mövenpick Cafe. While young ones have the time of their lives at the pirate ship-themed kids' club, adults can indulge in afternoon cocktails with sweeping views or a rejuvenating treatment at the spa.\n\nThe impressive multi-level, water-slide-adorned swimming pool and the dazzling array of activities available to book through Mövenpick - from watersport adventures to cultural tours - will provide endless excitement for the whole family. Then there's the Samasta Lifestyle Village next door - an open-air shopping, dining and entertainment complex just a few steps from the hotel lobby. You'll also be just a short stroll from the relaxed, cafe-lined sands of Pantai Muaya, famous for its scenic sunsets and relaxed Jimbaran vibes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jalan Wanagiri No.1, Jimbaran, South Kuta, Bali 80362, Indonesia",
    "percentage_discount": 35.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 511.0,
    "value": 787.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AbAGoAAN",
    "hero_image": "https://images.luxuryescapes.com/zhbrosf9jowixn64a7dv",
    "image_two": "https://images.luxuryescapes.com/tgw31ksc3pruj4ij8vn",
    "image_three": "https://images.luxuryescapes.com/1yvswq6xytmxqzhjn3ay",
    "vendor_name": "Vivara Bali Private Pool Villas & Spa Retreat",
    "title": "Grand Opening: Jimbaran Pool Villa Luxury with Massages, Daily Breakfast & Drinks",
    "description": "Be the first to experience Jimbaran’s new shining jewel of pool villa luxury, with a stay at Vivara Bali Private Pool Villas & Spa Retreat - located just five minutes from one of the island’s most beloved golden beaches. Step within your private villa and discover a secluded world of light-filled spaces and shimmering waterfall pools, surrounded by lush greenery and Bali's inimitable magic. Enjoy exquisite Indonesian plates overlooking the hotel’s shimmering lagoon pool at Royal Vivara Pool Club, Bar & Restaurant, head to Royal Spa for top-notch wellness treatments, or savour afternoons spent in your opulent villa soaking up the sun.\n\nThis is the ultimate family-friendly Bali escape - children will adore the resort’s fun-filled kids’ club, games room and mini golf course. When you’re ready to explore, the region’s most extraordinary shorelines await - hit up Jimbaran for mellow, balmy waters, nearby Kuta for sensational surfing and legendary sunsets, or travel a little further out to bustling Seminyak for ultra-cool cafes, dining venues and nightlife.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Vivara Bali Private Pool Villas & Spa Retreat",
    "offer_address": "Jl. Karang Mas, Jimbaran, Kec. Kuta Sel., Kabupaten Badung Bali 80361 Indonesia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 649.0,
    "value": 1218.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000COiDOAA1",
    "hero_image": "https://images.luxuryescapes.com/p8w168nnc42kmnm69y0p",
    "image_two": "https://images.luxuryescapes.com/05dpnz9gytiybqpe0k9r",
    "image_three": "https://images.luxuryescapes.com/psy0bq7jktol7mjjxt5",
    "vendor_name": "RIMBA by AYANA Bali",
    "title": "Unmissable Five-Star RIMBA by AYANA Bali Escape with Daily Dining Across 11 Restaurants & Rock Bar Priority Access",
    "description": "Experience a not-to-be-missed stay at the award-winning RIMBA by AYANA Bali - a world-class haven that stretches across 90 hectares of clifftop land perched above Jimbaran Bay. Exclusively on Luxury Escapes, you can book an exquisite escape to Bali’s only resort integrated with AYANA Bali and bear witness to majestic sunsets and lush verdant gardens that are complemented by five-star shared facilities. Dotted along the coast-hugging grounds are 14 dreamy swimming pools - including three with waterslides and another with a swim-up bar. Gourmands will revel in the chance to explore an array of restaurants and bars across the shared resort complex, serving everything from traditional Balinese to Mediterranean fare, cocktails and tapas.\n\nFor those who enjoy an active escape, take advantage of the complimentary resort shuttle and visit the recreation facilities at both RIMBA and the AYANA Estate, which include a golf-putting course and fitness centres. A world-class spa is close at hand for pampering and relaxation, and the world-famous Rock Bar provides the perfect setting to watch the sunset with a cocktail in hand. Or, simply step straight out onto the white-sand Kubu Beach and soak up the Balinese bliss or cool off in the azure waters.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "RIMBA by AYANA Bali",
    "offer_address": "Jalan Karang Mas Sejahtera, Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 1199.0,
    "value": 2652.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RAD7LQAX",
    "hero_image": "https://images.luxuryescapes.com/xdomxfkqufgvvsz7gpqm",
    "image_two": "https://images.luxuryescapes.com/tb3j6upuhgmqbjd06etk",
    "image_three": "https://images.luxuryescapes.com/jkwela1mn4uxdgolh1rq",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Mövenpick Jimbaran: The Ultimate Bali Holiday",
    "description": "Experience one of Bali’s top resorts with seven nights at the Mövenpick Resort & Spa Jimbaran Bali. Includes a private airport pickup, daily buffet breakfasts, a three-course à la carte dinner, an à la carte lunch, an afternoon tea experience, rooftop sunset cocktails, mini refreshments, a daily chocolate hour and more. Plus, one child stays free with daily kids’ club access.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali - January 2018",
    "offer_address": "Jl. Wanagiri No.1, Jimbaran, Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 7,
    "max_duration": 10,
    "price": 909.0,
    "value": 1902.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DODo3AAH",
    "hero_image": "https://images.luxuryescapes.com/54npwlyxpyjup5iqek",
    "image_two": "https://images.luxuryescapes.com/u0ygtpxlv3okhczdg68",
    "image_three": "https://images.luxuryescapes.com/fx31ai4o0a6l6afensqn",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Award-Winning Mövenpick Bali Indulgence Is Back with Daily Breakfast, Daily Lunch or Dinner, Chocolate Hour & Children Eat Free",
    "description": "Life doesn’t get much sweeter than a stay at Bali's foremost family resort, the five-star award-winning Mövenpick Resort & Spa Jimbaran Bali, offering true resort luxury and non-stop family fun just minutes from the shimmering beachfront of Jimbaran. This resort is home to stunning swimming pools and high-end eateries Anarasa restaurant and Mövenpick Cafe. While young ones have the time of their lives at the pirate ship-themed kids' club, adults can indulge in afternoon cocktails with sweeping views or a rejuvenating treatment at the spa.\n\nThe impressive multi-level, water-slide-adorned swimming pool and the dazzling array of activities available to book through Mövenpick - from watersport adventures to cultural tours - will provide endless excitement for the whole family. Then there's the Samasta Lifestyle Village next door - an open-air shopping, dining and entertainment complex just a few steps from the hotel lobby. You'll also be just a short stroll from the relaxed, cafe-lined sands of Pantai Muaya, famous for its scenic sunsets and relaxed Jimbaran vibes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jalan Wanagiri No.1, Jimbaran, South Kuta, Bali 80362, Indonesia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 509.0,
    "value": 953.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DV35AAG",
    "hero_image": "https://images.luxuryescapes.com/z511atyilmtx2kw3t6a",
    "image_two": "https://images.luxuryescapes.com/yr4m35gz6ippzll53qsg",
    "image_three": "https://images.luxuryescapes.com/hjqvlvobphij0abzrp2h",
    "vendor_name": "RIMBA by AYANA Bali",
    "title": "Unmissable RIMBA Bali by Ayana Stay with Daily Breakfast, Daily Lunch or Dinner, VIP Kubu Beach Club & Rock Bar Priority Access",
    "description": "Experience a not-to-be-missed stay at the award-winning RIMBA Jimbaran Bali by AYANA - a world-class haven that stretches across 90 hectares of clifftop land perched above Jimbaran Bay. For the very first time on Luxury Escapes, you can book an exquisite escape to Bali’s only resort integrated with AYANA Bali and bear witness to majestic sunsets and lush verdant gardens that are complemented by five-star shared facilities. Dotted along the coast-hugging grounds are 12 dreamy swimming pools - including three with waterslides and another with a swim-up bar. Gourmands will revel in the chance to explore an array of restaurants and bars across the shared resort complex, serving everything from traditional Balinese to Mediterranean fare, cocktails and tapas. \n\nFor those who enjoy an active escape, make use of the recreation facilities at both RIMBA and AYANA, which include a golf-putting course and fitness centres. A world-class spa is close at hand for pampering and relaxation, with treatments, healing therapies and wellness rituals. For those strong enough to tear themselves away from the resort, be sure to make use of the complimentary resort shuttle to visit nearby attractions, or simply step straight out onto the white-sand Kubu Beach and soak up the Balinese bliss or cool off in the azure waters.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "RIMBA by AYANA Bali",
    "offer_address": "Jalan Karang Mas Sejahtera, Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 7,
    "max_duration": 19,
    "price": 1339.0,
    "value": 2764.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LmTVAA0",
    "hero_image": "https://images.luxuryescapes.com/lj25afv0ms18ro0vhe2",
    "image_two": "https://images.luxuryescapes.com/t6vts70wfzcfbuhhad",
    "image_three": "https://images.luxuryescapes.com/x7j7b3yfaxl473xwrpl",
    "vendor_name": "Cross Bali Breakers Resort",
    "title": "Tranquil Pool Villa Escape with Daily Dining & Free-Flow Cocktail Hour",
    "description": "Discover secluded romance at the X2 Bali Breakers Resort in Jimbaran, staying in a lavish private pool villa. This hideaway is set within lush tropical gardens and sits just 10 minutes’ drive from some of Bali’s best beaches, offering the ultimate escape for couples or small families. Enjoy daily breakfast, your choice of daily lunch or dinner, nightly free-flow beer and cocktail hour (5pm-6pm), one relaxing 60-minute massage each and a private one-way transfer from Denpasar Airport.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "X2 Bali Breakers Resort Feb 2020",
    "offer_address": "Jl. Pantai Balangan no. 10, Balangan, Jimbaran, Bali, Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 9,
    "price": 839.0,
    "value": 1780.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005ITX1AAO",
    "hero_image": "https://images.luxuryescapes.com/pw5hyzet0co58d9b202",
    "image_two": "https://images.luxuryescapes.com/3ym1vfpqd0uucb8h0l",
    "image_three": "https://images.luxuryescapes.com/4ikj2g23pey3y8f40839",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Award-Winning Mövenpick Indulgence at Bali's No.1 Family Resort with Daily Breakfast, Daily Three-Course Lunch or Dinner & Chocolate Hour",
    "description": "Life doesn’t get much sweeter than a stay at the award-winning Mövenpick Resort & Spa Jimbaran Bali - and this is our best Mövenpick Bali package yet. Enjoy fabulous inclusions, true five-star resort luxury and nonstop family fun, all just minutes from the shimmering beachfront of Jimbaran.\n\nVoted Bali's Leading Family Resort at the World Travel Awards 2020, this gourmet sanctuary - brought to you by the brand behind the Swiss-style artisan ice cream - is home to a world-class rooftop bar, high-end restaurants and, of course, plenty of Mövenpick's signature sweet creations.\n\nWhile young ones have the time of their lives at the pirate ship-themed kids' club, adults can indulge in afternoon cocktails with sweeping views or a rejuvenating Indonesian treatment at the tranquil spa. The whole family will love the impressive multi-level swimming pool with swim-up hammocks and waterslides, and the myriad activities available to book, from watersport adventures to cultural tours. Then there's the Samasta Lifestyle Village next door - an open-air shopping, dining and entertainment complex just a few steps from the hotel lobby.\n\n**Your handpicked inclusions:**\n\n- One child (11 and under) stays free with meals per package inclusions\n- Wake up to daily breakfast at Anarasa restaurant\n- Choose between daily three-course lunch or dinner at Anarasa restaurant\n- Unwind with one 60-minute Balinese couples' massage per package at the Pool Gazebo\n- Celebrate your escape with a daily bucket of beer at JeJaLa bar\n- Indulge with a daily Mövenpick chocolate hour featuring artisanal desserts and chocolates\n- Adults can relax with four hours of daily kids' club access for any little ones (4-11 only; see Fine Print for details)\n\n**Travelling as a family of four?** Select the Family Upgrade with two interconnecting Classic Rooms. Up to two additional guests of any age stay free of charge with meals per package\nand select inclusions (see individual packages for details).\n\n**Travelling with young children?** Kids six and under always eat free when dining with two paying adults, even outside of package inclusions\n\n**Longer stay bonus**: Extend your stay to receive bonus inclusions, including roundtrip transfers from Bali Airport, two daily sunset cocktails per package and much more.\n\n**World Travel Awards 2020** - Bali's Leading Family Resort\n\n**Book with 100% Confidence**: If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other Limited Time Lux Exclusive offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jalan Wanagiri No.1, Jimbaran, South Kuta, Bali 80362, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 409.0,
    "value": 910.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csBUOQA2",
    "hero_image": "https://images.luxuryescapes.com/0yu7tx0axk7w8n7cdfd",
    "image_two": "https://images.luxuryescapes.com/q6bjekilafl1px6zdwuk",
    "image_three": "https://images.luxuryescapes.com/ivlpe8k0ymkvjp7lgo1j",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Mövenpick Luxury: Stay at Bali's Leading Family Resort with Daily Dining",
    "description": "Treat yourself to five-star family indulgence at Mövenpick Resort & Spa Jimbaran Bali. With access to Jimbaran Beach, this paradise is home to a world-class rooftop bar, a range of high-end restaurants and high-end amenities including an amazing kids' club in a pirate ship for little ones. Jam-packed with VIP inclusions, your escape features daily buffet breakfast with unlimited ice cream, daily choice of lunch or dinner and a daily decadent Mövenpick chocolate hour with Swiss-style desserts. You'll also enjoy a 60-minute Balinese massage for two, a private one-way airport transfer and much more - plus one child aged 11 years and under stays free with dining inclusions, four hours of Kids' Club access daily and two hours of babysitting per stay.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali 2019",
    "offer_address": "Jl. Wanagiri No.1, Jimbaran, Kec. Kuta Sel., Kabupaten Badung, Bali 80362, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 7,
    "max_duration": 10,
    "price": 1097.0,
    "value": 3289.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbpakAAB",
    "hero_image": "https://images.luxuryescapes.com/icn0hfchifjgd9gy7nm",
    "image_two": "https://images.luxuryescapes.com/4slh03sj75gml4z8sgyo",
    "image_three": "https://images.luxuryescapes.com/fsglk5ia720u448sbor",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Mövenpick Bali Indulgence Is Back with Daily Breakfast, Daily Lunch or Dinner, Chocolate Hour & Children Eat Free",
    "description": "Life doesn’t get much sweeter than a stay at this five-star family resort, offering true resort luxury and non-stop family fun just minutes from the shimmering beachfront of Jimbaran. Mövenpick Resort & Spa Jimbaran Bali is home to stunning swimming pools and high-end eateries like Anarasa restaurant and Mövenpick Cafe. While young ones have the time of their lives at the pirate ship-themed kids' club, adults can indulge in afternoon cocktails with sweeping views or a rejuvenating treatment at the spa.\n\nThe impressive multi-level, water-slide-adorned swimming pool and the dazzling array of activities available to book through Mövenpick - from watersport adventures to cultural tours - will provide endless excitement for the whole family. Then there's the Samasta Lifestyle Village next door - an open-air shopping, dining and entertainment complex just a few steps from the hotel lobby. You'll also be just a short stroll to the relaxed, cafe-lined sands of Pantai Muaya, famous for its scenic sunsets and relaxed Jimbaran vibes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jalan Wanagiri No.1, Jimbaran, South Kuta, Bali 80362, Indonesia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 899.0,
    "value": 1671.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3knYQAR",
    "hero_image": "https://images.luxuryescapes.com/ovkq28zfoktxjwiqla01",
    "image_two": "https://images.luxuryescapes.com/svtjckvupf9uaywubeoi",
    "image_three": "https://images.luxuryescapes.com/w3ijtnslruwh93e23ste",
    "vendor_name": "The Leaf Jimbaran",
    "title": "Private Pool Villa Luxury with Gourmet Inclusions & Daily Cocktails",
    "description": "Relax and rejuvenate at The Leaf Jimbaran. Enjoy five nights in a huge 180sqm one-bedroom private pool villa with daily buffet breakfasts, two three-course dinners at Cilantro Rooftop Bar & Lounge, two two-course lunches, a relaxing 60-minute massage each, daily cocktail per person, convenient one-way airport transfer and a guaranteed late 1pm checkout.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Leaf Jimbaran Bali Dec 2018",
    "offer_address": "Karang Mas Sejahtera No. 81, Jl. Jepun, Jimbaran, Badung, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 54.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 615.0,
    "value": 1323.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GfUspAAF",
    "hero_image": "https://images.luxuryescapes.com/lvufx11d8iomaza0s",
    "image_two": "https://images.luxuryescapes.com/los5i3531buv49q8p4lk",
    "image_three": "https://images.luxuryescapes.com/bsablghj0i6pygtl48hn",
    "vendor_name": "AYANA Resort Bali",
    "title": "Five-Star AYANA Resort Bali with Daily Breakfast, Nightly Dinner & Rock Bar Priority Access",
    "description": "Experience the grandeur of five-star AYANA Resort Bali, situated on the cliff-tops of Jimbaran's renowned 'sunset coast'. Immerse yourself in the lush tropical gardens of the resort and take in the expansive views of the Indian Ocean as you savour a sprawling wealth of top-notch luxury facilities. AYANA Resort Bali is a destination in its own right, boasting 28 world-class restaurants and bars, 14 shimmering pools and 11 boutique shops. Those looking for relaxation and rejuvenation can treat themselves to one of many spa treatments and wellness rituals at the Spa on The Rocks or AYANA Spa.\n\nIf you're searching for a change of scenery, the heart of Jimbaran Village is only a five minute drive away. There, you can explore art galleries, traditional markets, fine dining restaurants, ancient temples and an array of exciting adventure-based activities.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Resort Bali",
    "offer_address": "Jalan Karang Mas Sejahtera Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 2064.0,
    "value": 4694.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2A9qQAF",
    "hero_image": "https://images.luxuryescapes.com/yeni7zwu7zdswwjneteb",
    "image_two": "https://images.luxuryescapes.com/yyg9ocsugtdaylfvmplv",
    "image_three": "https://images.luxuryescapes.com/tgszahwd7sadiyfqlkw5",
    "vendor_name": "Sun Island Suite Goa Gong",
    "title": "Stylish Private Pool Villa Escape in Bali",
    "description": "Discover your own private haven in the heart of Bali at Sun Island Suites & Spa Goa Gong. Perfectly located between Kuta and Jimbaran, your 314sqm One-Bedroom Suite features a private pool and stunning views over the ocean, plus daily breakfast, one multi-course dinner and a BBQ dinner during your stay, daily cocktail, airport pick up, a 60-minute massage and a leisurely late 1pm checkout - to make your Bali holiday the most spectacular one yet.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kutuh",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Sun Island Suites & Spa Goa Gong",
    "offer_address": "Jalan Raya Goa Gong, 80361 Jimbaran, Indonesia",
    "percentage_discount": 54.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 618.0,
    "value": 1337.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FlaTAAAZ",
    "hero_image": "https://images.luxuryescapes.com/g3dnuza1fq6l36b2io76",
    "image_two": "https://images.luxuryescapes.com/2jdlmr7l4bzqfmqdajnb",
    "image_three": "https://images.luxuryescapes.com/lwzwikltpamr2i2h2xan",
    "vendor_name": "Kayumanis Jimbaran Private Estate & Spa",
    "title": "Bali Five-Star Tropical Jimbaran Villas with Daily Breakfast, Nightly Dinner, Roundtrip Airport Transfers & Butler Service",
    "description": "Set moments from the pristine sands of Jimbaran Beach, you’ll find the five-star Kayumanis Jimbaran Private Estate & Spa - an exclusive tropical haven of expansive villas with private pools, fringed with tropical greenery. Fusing traditional Balinese elements with opulent dark wood accents and thatched roofs while blissfully integrating modern luxuries, each villa has spacious day beds to catch up on some well-deserved relaxation, an expansive courtyard, and wide glass doors that allow the balmy sea breeze in.\n\nWith traditional and international delicacies on offer at Kayumanis Resto Jimbaran, and a menu of relaxing treatments available at the spa, it's easy to spend your entire stay at the resort. But venture beyond the walls of your private villa and you'll find idyllic Jimbaran Beach, famed for its white sands, sapphire waters, casual seafood cafes and hypnotic evening sunsets. For adventures a little further afield, the thundering waves of Uluwatu or the idyllic enclave of Nusa Dua can be reached with a 20-minute drive.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Jimbaran Private Estate & Spa",
    "offer_address": "Jalan Yoga Perkanthi Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 74.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 899.0,
    "value": 3498.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gg6fJAAR",
    "hero_image": "https://images.luxuryescapes.com/nbh40iiex00oavddqnk",
    "image_two": "https://images.luxuryescapes.com/hm1oz7kocaj8x30d84",
    "image_three": "https://images.luxuryescapes.com/l79j09re8wev7mmzmgr",
    "vendor_name": "AYANA Segara Bali",
    "title": "AYANA Segara Bali Luxury with Daily Breakfast & Daily Lunch or Dinner Across 9 Restaurants",
    "description": "Be one of the first to experience the sparkling pools and unbeatable sunset views from the rooftop bar of AYANA Segara Bali: a clifftop resort designed to take luxury to new heights. Nestled amid 90 hectares of tropical forest above Jimbaran Bay, this is the latest and most luxurious addition to the award-winning AYANA Bali complex. Indulge at the state-of-the-art rooftop terrace, featuring sensational infinity pools, plush daybeds and Luna Bar, where you can sip a cocktail as the sun sets and transforms the sky into a striking array of colours over the ocean.\n\nGuests of AYANA Segara Bali are also invited to make use of the renowned wellness and dining facilities of the wider AYANA complex, including one of Bali's most legendary venues for a cocktail with a view - Rock Bar, carved into the rockface by the crashing ocean - in addition to 12 pools, a miniature 18-hole golf course, Kubu Beach, a spa and fitness centre. At the end of the day, relax in style, with deep-soaking bathtubs and private balconies in every room.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Segara Bali",
    "offer_address": "Jalan Karang Mas Sejahtera, Jimbaran, South Kuta, Badung Regency, Bali 80364, Indonesia",
    "percentage_discount": 48.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1499.0,
    "value": 2895.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cKmZjQAK",
    "hero_image": "https://images.luxuryescapes.com/yeh74cvb2h2w2nene5p",
    "image_two": "https://images.luxuryescapes.com/0tmarvij2onhnhzzp0ld",
    "image_three": "https://images.luxuryescapes.com/33hhh7f3uldsistckej3",
    "vendor_name": "Royal Tulip Springhill Resort",
    "title": "Balinese Escape with Exquisite Dining Inclusions",
    "description": "Kick back, relax and enjoy the serenity of Jimbaran - the ultra-chilled side of Bali - staying at the newest resort in the area: The Royal Tulip Springhill Resort Jimbaran. Your escape includes daily breakfast, two multi-course dinners during your stay, a massage per person, a cocktail each and a convenient airport drop off. Plus, enjoy complimentary scheduled shuttle transport and free access to Jimbaran Beach Club during your stay and a leisurely late 1pm checkout.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Royal Tulip Springhill Resort Jimbaran - 2019",
    "offer_address": "Jalan Jimbaran, Hijau Kelod, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 253.0,
    "value": 482.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GgkXVAAZ",
    "hero_image": "https://images.luxuryescapes.com/xc5cg5m29o73oe3wyr8f",
    "image_two": "https://images.luxuryescapes.com/b79chng5h84i1nex4w3g",
    "image_three": "https://images.luxuryescapes.com/kk9lhaxhhqdi3lsrgci",
    "vendor_name": "Cross Bali Breakers Resort",
    "title": "Five-Star Bali Pool Villas with Daily Breakfast, Daily Lunch or Dinner & Nightly Free-Flow Cocktail Hour",
    "description": "Discover new heights of secluded luxury at Cross Bali Breakers in Jimbaran, a five-star sanctuary ideally located on Bali’s pristine southern peninsula. Though surrounded by lush Balinese jungle, this luxury hotel is a beach-lovers dream: it's just 10 minutes from Balangan Beach's legendary waves and Dreamland Beach's calm, limestone-hugged waters. When not relaxing on the sand, you'll love the careful touches shown in your very own villa, complete with a magnificent private pool and relaxing tropical gardens.\n\nMake the most of the resort’s top-notch facilities, which include the swim-up Sunken Pool Bar, rooftop pool, adults-only serenity pool, outdoor fitness centre and traditional Balinese wellness centre Alo'e Spa. Savour classic cocktails and local delicacies at the resort's all-day dining venue, Point Break by CROSS, or let the good times roll as you soak up the unforgettable Balinese sunset from the panoramic The Tube Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Cross Bali Breakers",
    "offer_address": "Jl. Pantai Balangan No. 10, Jimbaran, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 943.0,
    "value": 2598.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oa0hAAA",
    "hero_image": "https://images.luxuryescapes.com/el97tg4wqvpa9dhoubhq",
    "image_two": "https://images.luxuryescapes.com/a211j4xforv8niltmus",
    "image_three": "https://images.luxuryescapes.com/r2pydxlh8csh9a9h85ck",
    "vendor_name": "Cross Bali Breakers Resort",
    "title": "Bali Five-Star Private Pool Villa Hideaway with Daily Breakfast, Daily Lunch or Dinner & Nightly Free-Flow Cocktail Hour",
    "description": "Experience the pinnacle of secluded romance at the award-winning Cross Bali Breakers in Jimbaran, a five-star sanctuary ideally located on Bali’s pristine southern peninsula. This luxury hotel is surrounded by rich Balinese jungle but just 10 minutes from the waves of famed Balangan Beach and the cool, calm waters of Dreamland Beach. When you're not relaxing beachside, enjoy the seclusion of your very own villa, complete with a private pool. It won't take you long to realise why this stunning resort is stamped with a Tripadvisor Travellers' Choice award 2021.\n\nMake the most of the resort’s luxurious amenities, which include a glorious sunken swim-up bar, rooftop pool, adults-only serenity pool, state-of-the-art fitness centre and a full-service spa. Savour an all-day culinary experience at Point Break by CROSS restaurant or swim up and enjoy quality snacks and drinks at Sunken Pool Bar. In the evening, watch the sun sink as you sample creative cocktails overlooking the resort at the unbeatable Hang Loose Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Cross Bali Breakers",
    "offer_address": "Jl. Pantai Balangan No. 10, Jimbaran, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 819.0,
    "value": 1750.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CZB9lYAH",
    "hero_image": "https://images.luxuryescapes.com/a3twccaguqgfl7fe6n6",
    "image_two": "https://images.luxuryescapes.com/uo8hxjqj59aagtc2muoc",
    "image_three": "https://images.luxuryescapes.com/1ldnf51h2arnb6pdvzd",
    "vendor_name": "AYANA Segara Bali",
    "title": "Bali Ultimate Cliffside Oasis: Jimbaran Bay Luxury with Daily Breakfast, Daily Lunch & Dinner across 11 Restaurants & Massages",
    "description": "Experience sparkling pools and unbeatable sunset views from the rooftop of this stunning AYANA escape: a clifftop resort designed to take luxury to new heights.\n\nNestled amid 90 hectares of tropical forest above Jimbaran Bay, this is the most luxurious addition to the award-winning AYANA Bali complex. Indulge at the state-of-the-art rooftop terrace, featuring sensational infinity pools, plush daybeds and Luna Bar, where you can sip a cocktail as the sun sets and transforms the sky into a striking array of colours over the ocean.\n\nGuests of AYANA Segara Bali are also invited to make use of the renowned wellness and dining facilities of the wider AYANA complex, including one of Bali's most legendary venues for a cocktail with a view - Rock Bar, carved into the rockface by the crashing ocean - in addition to 14 pools, a miniature 18-hole golf course, Kubu Beach, and a spa and fitness centre. At the end of the day, relax in style with deep-soaking bathtubs and private balconies in every room.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Segara Bali",
    "offer_address": "Jalan Karang Mas Sejahtera, Jimbaran, South Kuta, Badung Regency, Bali 80364, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1859.0,
    "value": 5166.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AbA7DAAV",
    "hero_image": "https://images.luxuryescapes.com/38teyp940hqwno5vmawd",
    "image_two": "https://images.luxuryescapes.com/7whnq9bhn2jthksmb8",
    "image_three": "https://images.luxuryescapes.com/8vojhif1zot3tyl4s78w",
    "vendor_name": "AYANA Villas Bali",
    "title": "Exclusive AYANA Bali Pool Villas with Daily Breakfast, Nightly Dinner at Your Choice of 11 Restaurants & Rock Bar Access",
    "description": "A private pool villa experience awaits with an extravagant escape to AYANA Villas Bali, the pinnacle of private luxury within the award-winning destination resort, AYANA Resort Bali. Perched on the clifftops overlooking the glistening Indian Ocean, this impeccable sanctuary is made for days spent by your private pool with a butler replenishing your drink, romantic candlelit dinners, soul-balancing massages or just lazy days with no disturbances.\n\nYou may feel a world away from reality, but five-star facilities are just metres away - sip on cocktails at the world-famous Rock Bar, complete with jaw-dropping views of the Indian Ocean, or dine your way through 11 restaurants, sampling Balinese, Mexican, Italian, Chinese and Mediterranean flavours. Hop between the ultra-hip Kubu Beach Club, located on the resort's very own private, white-sand beach, and the 14 shimmering pools, or relax and recharge in the aquatonic heated salt-water hydrotherapy pool or AYANA Spa.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Villas Bali",
    "offer_address": "Karang Mas Estate, Jalan Karang Mas Sejahtera Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 1951.0,
    "value": 4738.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JXW9SYAX",
    "hero_image": "https://images.luxuryescapes.com/i1icudtgtge0g5wilww",
    "image_two": "https://images.luxuryescapes.com/i1lcpm9o6qfej160p5pd",
    "image_three": "https://images.luxuryescapes.com/jqts3rbkbxcn012wvp5f",
    "vendor_name": "InterContinental Bali Resort",
    "title": "Iconic Jimbaran Beachfront Luxury with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktail",
    "description": "Enjoy the luxurious seclusion of traditional Balinese living at this five-star resort, the first of its kind to be built on the shores of the serene Jimbaran Bay. Surrounded by lush tropical foliage opposite a secluded, powder-white beachfront, this village-style retreat offers a peaceful escape from the crowds.\n\nStart your day with breakfast overlooking the gardens at Taman Gita, feel the sand between your toes at Sunset Beach Bar & Grill, swing by Jimbaran Gardens to soak up the seaside ambience and indulge in the jetted tub, steam room and sauna at Spa Uluwatu. Bring the whole family along and treat the little ones to exciting resort activities or the dedicated Planet Trekkers Kids' Club.\n\nRelax as you please in the resort’s collection of rooms and suites complete with handmade furnishings, classic Balinese touches, breezy private balconies and marble bathtubs. Venture out to explore the glorious semi-secluded stretch of beach, float in the sparkling resort pool, or stretch out waterside with a refreshing cocktail at Jimbaran Gardens Pool Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "InterContinental Bali Resort",
    "offer_address": "45 Jalan Raya Uluwatu, Jimbaran, Kuta Selatan, Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 6,
    "max_duration": 22,
    "price": 1099.0,
    "value": 2334.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X8p0MQAR",
    "hero_image": "https://images.luxuryescapes.com/byvfnviwd4gkbboc72kr",
    "image_two": "https://images.luxuryescapes.com/kr5qfeewenhmtddpl6ng",
    "image_three": "https://images.luxuryescapes.com/jmhsfmx9tp954oexqim3",
    "vendor_name": "The Sintesa Jimbaran",
    "title": "Bali: Family Friendly Jimbaran Escape",
    "description": "Enjoy a relaxing family break in Bali with guaranteed interconnecting rooms at The Sintesa Jimbaran. With daily breakfasts, a bucket of beer on arrival, select meals, a relaxing Balinese massage and a daily shuttle service to nearby Jimbaran Beach all included in your package, there’s something to keep everyone happy on this family-friendly escape.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Sintesa Jimbaran OLD",
    "offer_address": "Jl. Kencana No.1, Jimbaran, Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 44.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 635.0,
    "value": 1130.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hDRqAAM",
    "hero_image": "https://images.luxuryescapes.com/id4jskwe73som0d0nrk8",
    "image_two": "https://images.luxuryescapes.com/d7ftfzzazqvfoq5nxmco",
    "image_three": "https://images.luxuryescapes.com/5r5ajjfk1q7t0rxypocl",
    "vendor_name": "AYANA Resort Bali",
    "title": "Luxury Escapes Exclusive: AYANA Five-Star Jimbaran Beachside Luxury with Daily Breakfast, Daily Three-Course Lunch or Dinner & Massages",
    "description": "Experience a Luxury Escapes' first with an exclusive, not-to-be-missed stay at the award-winning AYANA Resort and Spa, BALI - a world-class haven that stretches across 90 hectares of clifftop land perched above Jimbaran Bay. For the very first time on Luxury Escapes, you can book an exquisite escape to Bali’s only integrated resort with RIMBA Jimbaran BALI and bear witness to the resort's majestic sunsets and ocean-front views are complemented by a white-sand beach and five-star shared facilities.\n\nDotted along the coast-hugging grounds are 12 dreamy swimming pools - including three with waterslides and another with a swim-up bar. Gourmands will revel in the chance to explore 19 restaurants and bars across the shared resort complex, serving everything from traditional Balinese to Mediterranean fare, cocktails and tapas. For those who enjoy an active escape, make use of the recreation facilities at both AYANA and RIMBA, which include a golf-putting course and fitness centre amongst a world-class spa. For those strong enough to tear themselves away from the resort, be sure to make use of the complimentary resort shuttle to visit nearby attractions, or simply step straight out onto the white-sand beach and soak up the Balinese bliss or cool off in the azure waters. Don't miss out on this exclusive escape!",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Resort Bali",
    "offer_address": "Jalan Karang Mas Sejahtera Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 6,
    "max_duration": 21,
    "price": 1674.0,
    "value": 3855.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DODo7AAH",
    "hero_image": "https://images.luxuryescapes.com/8i9ghs7j8jf1cvn8uyx",
    "image_two": "https://images.luxuryescapes.com/v38puvy4o7kghiuujzd",
    "image_three": "https://images.luxuryescapes.com/wvws3tz1c3b1i04ybic",
    "vendor_name": "The Leaf Jimbaran",
    "title": "Luxe Bali Private Pool Villas in Tranquil Jimbaran with Massages, Daily Breakfast & Nightly Cocktails",
    "description": "Take some time out and treat yourself to a heavenly private pool villa escape at The Leaf Jimbaran, a peaceful sanctuary ideally located near the beautiful shores of Jimbaran Beach. This intimate collection of just 40 villas blends traditional Balinese elements with opulent dark wood accents, while modern amenities ensure guests leave feeling rejuvenated. Immerse yourself in Balinese culture with regular cooking and yoga classes hosted at the resort. With traditional and international delicacies on offer at Sattvic Restaurant and a menu of relaxing treatments available at Thyme Spa, it's easy to spend your entire stay at this haven of serenity.\n\nWhen you're ready to explore, venture beyond your private villa to find the idyllic Jimbaran Beach, famed for its white sands, sapphire waters, and iconic beachfront restaurants, which lure hungry locals and tourists alike for the freshest seafood delights in Bali. Further afield, Seminyak's vibrant nightlife and Uluwatu’s perfect surf breaks are just a short taxi ride away.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Leaf Jimbaran",
    "offer_address": "Jalan Jepun, Karang Mas Sejahtera No 81, Jimbaran, Bali 80361, Indonesia",
    "percentage_discount": 74.0,
    "min_duration": 5,
    "max_duration": 25,
    "price": 557.0,
    "value": 2118.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DV2gAAG",
    "hero_image": "https://images.luxuryescapes.com/g11xub0jel9owvo4nij",
    "image_two": "https://images.luxuryescapes.com/z2aphylsfrbrfrkwsg3l",
    "image_three": "https://images.luxuryescapes.com/4xe6gzbno52lk3lnbh0mr",
    "vendor_name": "Kayumanis Jimbaran Private Estate & Spa",
    "title": "Five-Star Bali Pool Villa Luxury near Jimbaran Beach with Daily Dining, Sunset Cocktails & Roundtrip Airport Transfers",
    "description": "Set moments from the pristine sands of Jimbaran Beach, you’ll find the five-star Kayumanis Jimbaran Private Estate & Spa - an exclusive tropical haven of expansive villas with private plunge pools, fringed with tropical greenery. Fusing traditional Balinese elements with opulent dark-wooden accents and thatched roofs while blissfully integrating modern luxuries, each villa has spacious day beds to catch up on some well-deserved relaxation, an expansive courtyard, and wide glass doors that allow the balmy sea breeze in.\n\nWith traditional and international delicacies on offer at Kayumanis Resto Jimbaran, and a menu of relaxing treatments available at the spa, it's easy to spend your entire stay at the resort. But venture beyond the walls of your private villa and you'll find idyllic Jimbaran Beach, famed for its white sands, sapphire waters, casual seafood cafés lining the shore, and hypnotic evening sunsets. For adventures a little further afield, the thundering waves of Uluwatu or the idyllic enclave of Nusa Dua can be reached with a 20-minute drive.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Jimbaran Private Estate & Spa",
    "offer_address": "Jalan Yoga Perkanthi Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 779.0,
    "value": 1637.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z0mZAAQ",
    "hero_image": "https://images.luxuryescapes.com/p2ba6b01f8qah73ceruf",
    "image_two": "https://images.luxuryescapes.com/akqk9kkzoih4lz8rz3t",
    "image_three": "https://images.luxuryescapes.com/wtd4gr3sni6f0sxp78nk",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Five-Star Mövenpick Family Indulgence with Daily Dining & Chocolate Hour",
    "description": "Looking for laidback beach vibes and family indulgence? Look no further than Mövenpick Resort & Spa Jimbaran Bali, a tropical five-star resort just minutes from the shimmering beachfront of Jimbaran. Home to a world-class rooftop bar, high-end restaurants, a kids' club in a pirate ship, a tranquil spa and, of course, plenty of Mövenpick's signature sweet creations, this upscale resort knows what a family wants from an escape.\n\nValid for two adults and one child (aged 11 years and under), your package includes daily breakfast, your choice of daily lunch or dinner, a decadent daily Mövenpick chocolate hour, one 60-minute Balinese massage per adult and four hours of kids' club access per day. Plus, children aged six years and under always eat free with two dining adults.\n\n**Travelling with two children?** Select the Family Upgrade to receive two interconnecting rooms, perfect for a family of two adults and two children (aged 11 years and under).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kabupaten Badung",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali - July 2020",
    "offer_address": "Jl. Wanagiri No.1, Jimbaran, Kec. Kuta Sel., Kabupaten Badung, Bali 80362, Indonesia",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 469.0,
    "value": 1347.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y505DQAR",
    "hero_image": "https://images.luxuryescapes.com/rnfuzxlh7wwlj3f4yjpp",
    "image_two": "https://images.luxuryescapes.com/dact7ebzdufuxixhhdbg",
    "image_three": "https://images.luxuryescapes.com/tzwsdu47exeicoiv71xn",
    "vendor_name": "Akhyana Village by Nagisa Bali",
    "title": "Newly Opened Private Pool Villa Escape, Bali",
    "description": "Find your own private paradise in Bali in stunning Jimbaran. The newly-opened Akhyana Village by Nagisa Bali offers sleek, stylish villas with everything you need for a romantic getaway. Featuring a private pool and relaxed atmosphere, your package includes two delicious dining experiences, one Balinese massage each, a welcome gift of Bintang beers and tasty snacks on arrival, daily à la carte breakfast and return airport transfers.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Ungasan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Akhyana Village by Nagisa Bali",
    "offer_address": "Jl. Binginsari, Jimbaran, Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 563.0,
    "value": 1116.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvmbAQAR",
    "hero_image": "https://images.luxuryescapes.com/phl55g3wmqweyt7uxp0v",
    "image_two": "https://images.luxuryescapes.com/kogqnchwxxigseeseb3d",
    "image_three": "https://images.luxuryescapes.com/fdard9eplym2cuzh3wbs",
    "vendor_name": "Jamahal Private Resort & Spa",
    "title": "Indonesia's Most Romantic Adults-Only Private Villas",
    "description": "Celebrate a truly special occasion on Bali’s rugged south-west coast at the five-star Jamahal Private Resort & Spa, voted Indonesia’s #1 romantic hotel on TripAdvisor. Experience personalised service in your own private villa located just 400 metres from the water’s edge in Jimbaran. Enjoy five nights of bliss with daily breakfast served in your villa, a romantic three-course candlelit dinner for two, another three-course lunch or dinner, private airport transfers, four 60-minute massages to share and much more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Jamahal Private Resort & Spa",
    "offer_address": "Jl. Raya Uluwatu No.1, Jimbaran, Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 5,
    "price": 954.0,
    "value": 2015.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lei7AAC",
    "hero_image": "https://images.luxuryescapes.com/nz8mgpusm3pavipec5s5",
    "image_two": "https://images.luxuryescapes.com/oxke0kao6tvwn4pn4sd",
    "image_three": "https://images.luxuryescapes.com/75g8cc6npcskafenn19",
    "vendor_name": "The Leaf Jimbaran",
    "title": "Serene Private Pool Villa Escape with Gourmet Dining",
    "description": "Relax and rejuvenate at the blissfully secluded The Leaf Jimbaran. Find your private slice of Balinese paradise while staying in a huge 180sqm One-Bedroom Pool Villa with daily buffet breakfast, exquisite dining inclusions at Cilantro Rooftop Bar & Lounge for dinner and at Sattvic Restaurant for lunch, a relaxing 60-minute massage each, a cocktail each as per package inclusions, convenient one-way airport pick-up and a guaranteed leisurely late 1pm checkout.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Leaf Jimbaran",
    "offer_address": "Jalan Jepun, Karang Mas Sejahtera No 81, Jimbaran, Bali 80361, Indonesia",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 619.0,
    "value": 2038.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcSCNAA3",
    "hero_image": "https://images.luxuryescapes.com/tj9lm0w5hgno7sgglkui",
    "image_two": "https://images.luxuryescapes.com/adj7mkw72lnukhiel3e",
    "image_three": "https://images.luxuryescapes.com/uar4evz6anhlnavxy9e",
    "vendor_name": "Kayumanis Jimbaran Private Estate & Spa",
    "title": "Bali Tropical Jimbaran Villas with Daily Breakfast, Daily Lunch or Dinner, Massages & Butler Service",
    "description": "Mere moments from a pristine sweep of sand and hugged by a dense canopy of swaying coconut palms, you’ll find this lavish resort offering ultimate relaxation. Couples and families alike can seek solace in this tranquil oasis that was once a former coconut grove, now a tropical haven that still feels worlds away from reality. Fusing traditional Balinese elements with opulent dark wood accents and thatched roofs while blissfully integrating modern luxuries, each villa has spacious day beds to catch up on some well-deserved relaxation, an expansive courtyard, and wide glass doors that allow the balmy sea breeze in.\n\nWith traditional and international delicacies on offer at Kayumanis Resto Jimbaran, and a menu of relaxing treatments available at the spa, it's easy to spend your entire stay at the resort. With 20 expansive private villas dotted across the coconut tree grove, it's hard to leave, but venture beyond the walls of your private villa and you'll find idyllic Jimbaran Beach, famed for its white sands, sapphire waters, casual seafood cafes and hypnotic evening sunsets. For adventures a little further afield, the thundering waves of Uluwatu or the idyllic enclave of Nusa Dua can be reached with a 20-minute drive.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Jimbaran Private Estate & Spa",
    "offer_address": "Jalan Yoga Perkanthi Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 899.0,
    "value": 2154.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fj6wcAAB",
    "hero_image": "https://images.luxuryescapes.com/nnripbqldz046sejap0n",
    "image_two": "https://images.luxuryescapes.com/spjpc72d1jg2szeym3j",
    "image_three": "https://images.luxuryescapes.com/iy5jf0tmem9rk8f5ujg",
    "vendor_name": "Watermark Hotel & Spa Bali - Jimbaran",
    "title": "Stylish Bali Retreat in Jimbaran with Daily Breakfast, Daily Lunch or Dinner & Roundtrip Airport Transfers",
    "description": "Succumb to the tropical allure of Bali with a stay at Watermark Hotel & Spa Bali in Jimbaran. Nestled between the shimmering Indian Ocean and the bustling Kuta district, this retreat offers a unique blend of local tradition and contemporary comfort. Spend your days basking in the sunshine by the rooftop pool, made all the more enticing by the Splash bar, or rejuvenate at Liang Spa with a massage. Discover a surfers paradise in Uluwatu, just a short drive away, lined with immaculate beaches and towering beach clubs, either on the shoreline or nestled on the cliffs overlooking the sea. Return for a traditional Japanese meal at Imadoki restaurant or dine al fresco on a range of international cuisines at W Senses Restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kedonganan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Watermark Hotel & Spa Bali - Jimbaran",
    "offer_address": "88 Uluwatu Street, Nedonganan, Kuta, Badung Regency 80361, Bali, Indonesia",
    "percentage_discount": 41.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 419.0,
    "value": 708.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070MAIAA2",
    "hero_image": "https://images.luxuryescapes.com/gcc4tzd6seb4r7vnl15o",
    "image_two": "https://images.luxuryescapes.com/i670cenukrj2oeeddr4m",
    "image_three": "https://images.luxuryescapes.com/md6icjboc3unuapodv",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Award-Winning Mövenpick Indulgence at Bali's No.1 Family Resort with Daily Breakfast, Daily Lunch or Dinner & Chocolate Hour",
    "description": "Life doesn’t get much sweeter than a stay at the award-winning Mövenpick Resort & Spa Jimbaran Bali. Enjoy fabulous inclusions, true five-star resort luxury and nonstop family fun, all just minutes from the shimmering beachfront of Jimbaran. This gourmet sanctuary - brought to you by the brand behind the Swiss-style artisan ice cream - is home to a world-class rooftop bar, high-end restaurants and, of course, plenty of Mövenpick's signature sweet creations.\n\nWhile young ones have the time of their lives at the pirate ship-themed kids' club, adults can indulge in afternoon cocktails with sweeping views or a rejuvenating Indonesian treatment at the tranquil spa. The whole family will love the impressive multi-level swimming pool with swim-up hammocks and waterslides, and the myriad activities available to book, from watersport adventures to cultural tours. Then there's the Samasta Lifestyle Village next door - an open-air shopping, dining and entertainment complex just a few steps from the hotel lobby.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jalan Wanagiri No.1, Jimbaran, South Kuta, Bali 80362, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 974.0,
    "value": 2016.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxksYAAR",
    "hero_image": "https://images.luxuryescapes.com/a2s9xxbzsrypzw5fs6gq",
    "image_two": "https://images.luxuryescapes.com/4pkbo15vfzrj6q6b364ch",
    "image_three": "https://images.luxuryescapes.com/60ptc5feuhl0ofuh6nvj",
    "vendor_name": "The Leaf Jimbaran",
    "title": "Bali Private Pool Villa Stay with Massages, Floating Breakfast and Nightly Cocktails",
    "description": "Indulge in blissful relaxation from your private villa nestled between the beach and the hills of Jimbaran, home to golden beaches, dramatic sunsets and a laid-back atmosphere. Enjoy traditional and international delicacies at Sattvic restaurant, or sit back with a cocktail and some light tapas while taking in the tropical views from Cilantro Rooftop Bar & Lounge. For complete relaxation, choose from a menu of treatments available at Thyme Spa, or take advantage of regular cooking and sunset yoga classes hosted by the resort. Shuttles to local beaches run regularly, allowing you to explore the surrounding area whenever you're not luxuriating in all that the resort has to offer.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Leaf Jimbaran",
    "offer_address": "Jalan Jepun, Karang Mas Sejahtera No 81, Jimbaran, Bali 80361, Indonesia",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 359.0,
    "value": 1192.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000COiCQAA1",
    "hero_image": "https://images.luxuryescapes.com/dwpwqpb3e7k10ozy47o8j",
    "image_two": "https://images.luxuryescapes.com/98tikvkr3eurm9byoimh",
    "image_three": "https://images.luxuryescapes.com/afenjg5vod19wl2474yq",
    "vendor_name": "AYANA Resort Bali",
    "title": "AYANA Resort Bali Cliffside Luxury with Daily Breakfast & Dinner Across 11 Restaurants, Massages & Rock Bar Cocktails",
    "description": "This is your VIP invitation to experience Jimbaran's five-star AYANA Resort Bali like never before. Completely exclusive to Luxury Escapes, this incredible package includes everything from cocktails at the world-famous Rock Bar (declared one of the best hotel bars in the world by Travel + Leisure, Forbes, CNN and The New York Times) to daily dining across an unbelievable 11 restaurants. AYANA Resort Bali is a destination in its own right: take the cliffside inclinator up to Rock Bar, where you can sip expertly mixed cocktails to sweeping views of the Indian Ocean and mellow beats from the custom DJ booth, carved directly into the rock face. Savour a sprawling wealth of top-notch luxury facilities, including ultra-hip Kubu Beach Club (located on the resort's very own private, white-sand beach), 14 shimmering pools - three with waterslides and an Aquatonic heated salt-water hydrotherapy pool - and 26 world-class restaurants and bars.\n\nEmbark on an epic culinary odyssey ranging from light Asian plates at Damar Terrace to Mediterranean fare at Scusa and Japanese teppanyaki at HonZEN. After an active escape? Lunge into first-class recreation facilities at both AYANA Resort Bali and sister resort RIMBA by AYANA Bali, which include a golf-putting course, fitness centre and world-class spa. If you can tear yourself away from the grounds, be sure to make use of the complimentary resort shuttle to visit nearby attractions, or simply step straight out onto the picture-perfect private beach to soak up the unrivalled tranquillity.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Resort Bali",
    "offer_address": "Jalan Karang Mas Sejahtera Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 35.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1499.0,
    "value": 2313.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JQyk1YAD",
    "hero_image": "https://images.luxuryescapes.com/1x9yqeuh1soy811er3xi",
    "image_two": "https://images.luxuryescapes.com/zdby2sop2vsikgezny",
    "image_three": "https://images.luxuryescapes.com/nj33t993rbf8nl0gxcd",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Mövenpick Bali Indulgence Is Back with Daily Breakfast, Daily Lunch or Dinner, Chocolate Hour & Children Eat Free",
    "description": "Life doesn’t get much sweeter than a stay at this five-star family resort, offering true resort luxury and non-stop family fun just minutes from the shimmering beachfront of Jimbaran. Mövenpick Resort & Spa Jimbaran Bali is home to stunning swimming pools and high-end eateries like Anarasa restaurant and Mövenpick Cafe. \n\nWhile young ones have the time of their lives at the pirate ship-themed kids' club, adults can indulge in afternoon cocktails with sweeping views or a rejuvenating treatment at the spa.\n\nThe impressive multi-level, water-slide-adorned swimming pool and the dazzling array of activities available to book through Mövenpick - from watersport adventures to cultural tours - will provide endless excitement for the whole family. \n\nThen there's the Samasta Lifestyle Village next door - an open-air shopping, dining and entertainment complex just a few steps from the hotel lobby. You'll also be just a short stroll to the relaxed, cafe-lined sands of Pantai Muaya, famous for its scenic sunsets and relaxed Jimbaran vibes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jalan Wanagiri No.1, Jimbaran, South Kuta, Bali 80362, Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 899.0,
    "value": 1909.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Cj1lpYAB",
    "hero_image": "https://images.luxuryescapes.com/ksfmfzzf8adh7xovjbls",
    "image_two": "https://images.luxuryescapes.com/izgf8siuismi7yxd71ej",
    "image_three": "https://images.luxuryescapes.com/30hjzwpbmwpqki5ptb9",
    "vendor_name": "Kayumanis Jimbaran Private Estate & Spa",
    "title": "Bali Tropical Jimbaran Private Pool Villas with All-Day Breakfast, Nightly Dinner & Kids Stay Free",
    "description": "Mere moments from Jimbaran Beach's white sands and shaded by swaying coconut palms, this lavish Balinese village-style resort awaits. Couples and families alike can seek solace in this oasis, once a coconut grove, now a tropical haven that still feels worlds away from reality.\n\nWith dark wood accents and thatched roofs, all 20 pool villas seamlessly blend traditional Balinese charm with modern comforts, such as expansive private pools. A dedicated butler ensures every desire is attended to, while Kayumanis Spa Jimbaran is the ultimate sanctuary offering rituals inspired by Indonesia's healing traditions. No craving will go uncured with Kayumanis Resto’s exquisite traditional and international delicacies, served in abundance.\n\nAlthough you won’t want to leave your villa, just beyond its walls lies idyllic Jimbaran Beach, famed for its white sands, sapphire waters, casual seafood cafes and hypnotic sunsets. For adventures further afield, both Uluwatu’s world-class surf and the luxurious enclave of Nusa Dua are a 20-minute drive away.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Jimbaran Private Estate & Spa",
    "offer_address": "Jalan Yoga Perkanthi, Jimbaran, Bali 80361, Indonesia",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1449.0,
    "value": 4313.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JIhCIAW",
    "hero_image": "https://images.luxuryescapes.com/jwof27bmcu35ys6u96r",
    "image_two": "https://images.luxuryescapes.com/1avosmdmstws9ehunqx",
    "image_three": "https://images.luxuryescapes.com/la4eava9w77g9kdpgpo2",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Bali Ultimate Indulgence: Family Escape with Nightly Dinner, Chocolate Hour & Kids Eat Free",
    "description": "Life doesn’t get much sweeter than a stay at this five-star family resort, offering true luxury and non-stop family fun just minutes from the shimmering beachfront of Jimbaran. This lavish resort is home to stunning swimming pools and high-end eateries like Anarasa Restaurant, Mövenpick Cafe and the brand-new Mexican-inspired Adriana Cocina & Bar.\n\nWhile young ones have the time of their lives at the pirate ship-themed kids' club, adults can indulge in afternoon cocktails with sweeping views or a rejuvenating treatment at the spa.\n\nThe impressive multi-level, water-slide-adorned swimming pool and the dazzling array of activities available to book through Mövenpick - from water sport adventures to cultural tours - will provide endless excitement for the whole family.\n\nThen there's the Samasta Lifestyle Village next door - an open-air shopping, dining and entertainment complex just a few steps from the hotel lobby. You'll also be just a short stroll to the relaxed, cafe-lined sands of Pantai Muaya, famous for its scenic sunsets and relaxed Jimbaran vibes.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jalan Wanagiri No.1, Jimbaran, South Kuta, Bali 80362, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 959.0,
    "value": 2012.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000QufyLQAR",
    "hero_image": "https://images.luxuryescapes.com/avwub4ughfi0idqlspko",
    "image_two": "https://images.luxuryescapes.com/iyvwmg36qfpugzr3mrq9",
    "image_three": "https://images.luxuryescapes.com/wyxoyr2inhnxnpct40w1",
    "vendor_name": "Gending Kedis Luxury Villas & Spa Jimbaran",
    "title": "Jimbaran Private Pool Villas, Bali",
    "description": "Witness some of Bali’s best sunsets, dine at beachfront seafood restaurants and sip cocktails at cliffside bars in Jimbaran with five nights in a huge 216sqm private pool villa at Gending Kedis. This is a holiday for foodies with daily breakfasts, a cooking class, an alfresco dinner, an afternoon tea and cocktails included, as well as Balinese massages and a salon pampering experience.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Gending Kedis",
    "offer_address": "Jl. Karang Mas Sejahtera No.100Y, Jimbaran, Kuta Selatan, Kabupaten Badung, Bali 80361, Indonesia​",
    "percentage_discount": 69.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 624.0,
    "value": 2003.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nP7nAAE",
    "hero_image": "https://images.luxuryescapes.com/2gy3f0bewldv1068pduj",
    "image_two": "https://images.luxuryescapes.com/zd31ct1xdim5ilwl58x",
    "image_three": "https://images.luxuryescapes.com/h2232oi5tj4alv63e7ai",
    "vendor_name": "Royal Tulip Springhill Resort",
    "title": "Five-Star Bali Rainforest Retreat near Jimbaran Bay with Daily Breakfast & Nightly Cocktails",
    "description": "Pamper the whole family with an exquisite vacation to Royal Tulip Springhill Resort Jimbaran, a luxurious hotel resort surrounded by lush rainforest. Ideally situated in between the bustling town and the beach, the resort offers the perfect opportunity to unwind, with an array of restaurants and vibrant bars just a stone’s throw away. The glamorous resort is also just 15 minutes from Jimbaran Bay, a long stretch of beach famous for its sunset views and the relaxed restaurants along the beachfront.\n\nDespite the gorgeous setting, you may be tempted to spend all your time in the peaceful grounds of the resort: sip on a cocktail by the gorgeous outdoor pool before rejuvenating with traditional Balinese massages. Enjoy a sumptuous Asian or Mediterranean-inspired dinner at Basil & Thyme Restaurant, which doubles as a cocktail bar, open from breakfast to supper. Enjoy some me-time as children participate in the activities and games on offer at the Kids' Club, or keep up your health routine in the fitness centre.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Royal Tulip Springhill Resort Jimbaran",
    "offer_address": "Jalan Jimbaran, Hijau Kelod, Kec. Kuta Sel., Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 171.0,
    "value": 353.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R8tDOQAZ",
    "hero_image": "https://images.luxuryescapes.com/bpdqsl85jx20ahkvnwow",
    "image_two": "https://images.luxuryescapes.com/zgngyci551falegnidk0",
    "image_three": "https://images.luxuryescapes.com/w2xbydhydfbweoxkt1pn",
    "vendor_name": "The Leaf Jimbaran",
    "title": "Private Pool Villa Luxury at The Leaf Jimbaran, Bali",
    "description": "Relax and rejuvenate with a five-night stay in a One Bedroom Pool Villa at The Leaf Jimbaran in Bali. Includes return airport transfers, daily à la carte breakfasts, healthy dining experiences, a 60-minute massage each, cocktails and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Leaf Jimbaran Bali - Jan 18*",
    "offer_address": "Karang Mas Sejahtera No. 81, Jl. Jepun, Jimbaran, Badung, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 69.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 649.0,
    "value": 2083.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004RtW4AAK",
    "hero_image": "https://images.luxuryescapes.com/cn9dzvol19yhs9toa4m5",
    "image_two": "https://images.luxuryescapes.com/cxu2h5sscmcpe90l8dn",
    "image_three": "https://images.luxuryescapes.com/ke50w3ue3uay1i36kbtm",
    "vendor_name": "AYANA Villas Bali",
    "title": "Ultra-Luxe Clifftop Pool Villas Perched above Jimbaran Bay with 30 Restaurants and Bars & 14 Pools",
    "description": "AYANA Villas Bali offers the ultimate in exclusivity and privacy within the lush grounds of AYANA Bali. Spacious one-, two- and three bedroom villas serve as a serene sanctuary for guests seeking seclusion and luxury. Each villa boasts a private pool, expansive living areas, and 24-hour dedicated butler service.\n\nWhile designed to provide a secluded retreat, the villas also grant access to AYANA Bali’s extensive amenities, including fine dining, world-class spa services, and various recreational activities, promising a truly unparalleled escape.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Villas Bali",
    "offer_address": "Karang Mas Estate, Jalan Karang Mas Sejahtera Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 738.0,
    "value": 738.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPLNmAAP",
    "hero_image": "https://images.luxuryescapes.com/eedowpy05kp69iqg40qm",
    "image_two": "https://images.luxuryescapes.com/k1qri5hourbwb5zsik",
    "image_three": "https://images.luxuryescapes.com/m07cw5posg7f9dlsqhlj",
    "vendor_name": "AYANA Segara Bali",
    "title": "Clifftop Bali Oasis Overlooking Jimbaran Bay with 14 Swimming Pools",
    "description": "AYANA Segara Bali, the latest addition to AYANA Bali provides an intimate, boutique experience within a peaceful and personal escape. Its minimalist, modern and chic design offers an exceptional retreat with rooms and suites featuring private balconies that provide stunning views of the sparkling ocean or lush, tropical gardens.\n\nThoughtfully designed spaces create a serene atmosphere, ideal for unwinding and rejuvenating in complete comfort. Sip on sunset cocktails at Luna Rooftop Bar and indulge in a Mediterranean feast at Scusa. With access to the secluded beach, enjoy the best of both worlds; a quiet retreat with the option of indulging in the larger resort's vibrant offerings.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Segara Bali",
    "offer_address": "Jalan Karang Mas Sejahtera, Jimbaran, Bali, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 266.0,
    "value": 266.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BVRuAAO",
    "hero_image": "https://images.luxuryescapes.com/rslmm60bf9oyb2t826xo",
    "image_two": "https://images.luxuryescapes.com/als5l21xjsbpgelfm93",
    "image_three": "https://images.luxuryescapes.com/f3xvykvs18gj9oepeqj",
    "vendor_name": "InterContinental Bali Resort",
    "title": "Five-Star Jimbaran Bay Beachfront Escape at the InterContinental Bali Resort",
    "description": "Immerse yourself in the ambience of a traditional Balinese village at the five-star InterContinental Bali Resort, the first hotel of its kind to be built on the shores of the serene Jimbaran Bay. A mirage of lush tropical foliage opposite the secluded, powder-white shoreline, this village-style retreat invites you to bathe under the glistening sun away from the crowds. Start your days with a delicious buffet at Taman Gita Terrace, feel the sand between your toes at Sunset Beach Bar & Grill, swing by Jimbaran Gardens to soak up the seaside ambiance and indulge in the jetted tub, steam room and sauna at the Spa Uluwatu (all complimentary without a booked treatment). Experience the best of Bali from this next-level beachfront location, within 15 minutes of the airport and easy reach of the Kuta shopping district and the Nusa Dua resort enclave.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "InterContinental Bali Resort",
    "offer_address": "Jalan Uluwatu 45, Jimbaran, Bali 80361, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 141.0,
    "value": 141.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwgIAC",
    "hero_image": "https://images.luxuryescapes.com/fdi3309m5l7xdq37e2o",
    "image_two": "https://images.luxuryescapes.com/r43zveihqrkcqmg3wfg",
    "image_three": "https://images.luxuryescapes.com/ih0f9kcvgtjoa1pmjre",
    "vendor_name": "Raffles Bali",
    "title": "Jimbaran Raffles Private Pool Villas with Three Restaurants & World-Class Spa",
    "description": "It doesn't get much more opulent than a Raffles retreat, and this sprawling Jimbaran paradise is no exception. Savour multi award-winning service and five-star luxuries surrounded by secluded tropical gardens and rolling hills, all just steps from a pristine stretch of beach.\n\nDine at the organic Rumari restaurant or enjoy a casual pizza by the ocean at Loloan Beach Bar & Grill, sip craft cocktails at the signature Writers Bar and walk into a world of calm at the onsite spa. Further afar, explore the nearby Uluwatu Temple, a Balinese sea temple with breathtaking cliffside views.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Raffles Bali",
    "offer_address": "Jalan Karang Mas Sejahtera 1A, Jimbaran, Badung Regency, Bali 80361, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 936.0,
    "value": 936.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DfAdAAK",
    "hero_image": "https://images.luxuryescapes.com/qu4pjsvs10snx7nym1f",
    "image_two": "https://images.luxuryescapes.com/ui5tm9yj76fmyfx43ikg",
    "image_three": "https://images.luxuryescapes.com/kn7obvom08tap8gjyv5q",
    "vendor_name": "Jumeirah Bali",
    "title": "Beachfront Jumeirah Bali Water Palace-Inspired Luxury with Only Pool Villas",
    "description": "Secluded luxury and endless ocean panoramas await at the all-pool villa, five-star Jumeirah Bali, a romantic retreat surrounded by a dramatic coastline, native jungle and lush rice paddies. Perfectly poised on a clifftop on Bali's south coast, overlooking the Indian Ocean, this intimate Hindu water palace-inspired retreat will make you feel like royalty. Let your expectations be met and then surpassed as you luxuriate in the Indian Ocean infinity pool, dine on tantalising open-grill dining at the water-view Akasa restaurant and make the most of an Uluwatu location that's the envy of many.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pecatu",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Jumeirah Bali",
    "offer_address": "Kawasan Pecatu Indah Resort, Jl. Raya Uluwatu, Pecatu, Kuta Selatan, Kab. Badung, Bali, 80361, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 525.0,
    "value": 525.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HEo5AAG",
    "hero_image": "https://images.luxuryescapes.com/qc7icr2pyca0xrjbafs",
    "image_two": "https://images.luxuryescapes.com/na75azj0lec9m726bm6l",
    "image_three": "https://images.luxuryescapes.com/zz9faanhbm2tb27tjci",
    "vendor_name": "Cross Bali Breakers Resort",
    "title": "Bali Five-Star Jimbaran Private Pool Villas",
    "description": "Experience the pinnacle of secluded romance at Cross Bali Breakers Resort in Jimbaran, a five-star sanctuary ideally located on Bali’s pristine southern peninsula. Nestled amid lush forest, this luxury hotel is surrounded by rich Balinese jungle but just 10 minutes from the waves of Kuta's famed Balangan Beach and the cool, calm waters of Dreamland Beach. When you're not relaxing beachside, enjoy the privacy of your very own villa, complete with private pool.\n\nMake the most of the resort’s luxurious amenities, which include a sunken swim-up bar, rooftop pool, adults-only serenity pool, state-of-the-art fitness centre and full-service spa. Enjoy an all-day culinary experience at Point Break restaurant, grab a cup of Jimbaran's finest coffee at The Tube Bar, or swim up and enjoy quality snacks and drinks at the Sunken Pool Bar. In the evening, sample creative cocktails overlooking the resort at the unbeatable Hang Loose Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Cross Bali Breakers Resort",
    "offer_address": "Jl. Pantai Balangan no. 10, Balangan, Jimbaran, Bali, Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 275.0,
    "value": 275.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlveIAC",
    "hero_image": "https://images.luxuryescapes.com/294r6n2jhp3l2pzflkcd",
    "image_two": "https://images.luxuryescapes.com/nh6d2zicdqg01q7lfmg",
    "image_three": "https://images.luxuryescapes.com/ekah8dwrr3116t0ejy37",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Family-Friendly Bali Escape near Jimbaran Beach with Spa & Pirate-Themed Kids' Club",
    "description": "Experience the tranquil beauty of Bali with a stay at this indulgent resort and spa, minutes from popular Jimbaran beach. Rooms that offer scenic views and quintessential island living vibes will ensure you get plenty of relaxation. Taste the flavours of Indonesia at Anarasa Restaurant and sip on cocktails at the Jejala Pool Bar while taking a break from swims in the sprawling pool.\n\nThe hotel also boasts a luxurious spa offering authentic Balinese massages and treatments for finding inner balance. This five-star retreat is a stone's throw from the region's best shopping, dining and nightlife, making it easy for those who want to explore, while beach lovers can stroll to Jimbaran Beach and spend hours lazing on its soft sands.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Mövenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jalan Wanagiri No.1, Jimbaran, South Kuta, Bali 80362, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 141.0,
    "value": 141.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070HRlAAM",
    "hero_image": "https://images.luxuryescapes.com/nbtfg3qjpfj8k0nix7l",
    "image_two": "https://images.luxuryescapes.com/cqh1cfz85i9etf1m79hp",
    "image_three": "https://images.luxuryescapes.com/urtukr3yj82ykxl6dxl",
    "vendor_name": "Kayumanis Jimbaran Private Estate & Spa",
    "title": "Five-Star Pool Villa Retreat Near Jimbaran Beach",
    "description": "Set moments from a pristine sweep of sand and hugged by a dense canopy of swaying coconut palms you’ll find the five-star Kayumanis Jimbaran Private Estate & Spa - a tropical haven ranked within the top 10% of properties on Tripadvisor. Couples and families alike can seek solace in this tranquil oasis that was once a former coconut grove. Today, the stunning resort has been expertly designed with no detail overlooked.\n\nWhile the surrounding area is nothing short of spectacular, with Jimbaran Beach a short walk away, the resort’s exceptional offerings make it difficult to tear yourself away. Within the Kayumanis Spa Jimbaran, you will find a curated offering of luxe treatments for body, mind, and spirit. Yogis can continue their practice with onsite yoga masters who will guide you through your practice or help relieve any jet lag. Meanwhile, gourmands will not be disappointed by the exceptional fusion of traditional Indonesian cuisine with market-fresh ingredients, catch-of-the-day seafood and seasonal delicacies at Kaymanis Resto Jimbaran.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Kayumanis Jimbaran Private Estate & Spa",
    "offer_address": "Jalan Yoga Perkanthi, Jimbaran, Bali 80361, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 312.0,
    "value": 312.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FiI2fAAF",
    "hero_image": "https://images.luxuryescapes.com/2p6cyz0jcomzq7kmfg",
    "image_two": "https://images.luxuryescapes.com/92ru7ea22s8wtusjfkif",
    "image_three": "https://images.luxuryescapes.com/0wktwdzn057kgay3duuh",
    "vendor_name": "Movenpick Resort & Spa Jimbaran Bali",
    "title": "Award-Winning Mövenpick Bali Indulgence with Four Restaurants & Chocolate Hour",
    "description": "Life doesn’t get much sweeter than a stay at Bali's foremost family resort, the five-star award-winning Mövenpick Resort & Spa Jimbaran Bali, offering true resort luxury and nonstop family fun just minutes from the shimmering beachfront of Jimbaran. Make new memories with the whole family splashing around in the huge interconnected swimming pool, complete with swim-up pool bar, a water slide and kids play area, or enjoy one-on-one time as the kids have the time of their lives at the pirate-ship-themed kids' club. Enjoy the privacy of high-end eateries like Anarasa Restaurant or Mövenpick Cafe, indulge in afternoon cocktails with sweeping views or rejuvenate with a relaxing treatment at the spa. When reunited, the dazzling array of activities available to book through Mövenpick - from watersport adventures to cultural tours - will provide endless excitement for the whole family.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta Selatan",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "Movenpick Resort & Spa Jimbaran Bali",
    "offer_address": "Jl. Wanagiri No.1, Jimbaran, Kec. Kuta Selatan Bali, 80362, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 204.0,
    "value": 204.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004RtY5AAK",
    "hero_image": "https://images.luxuryescapes.com/t4z8auocwg0idf5fy0d7rv",
    "image_two": "https://images.luxuryescapes.com/lscme9h39k2a462034g",
    "image_three": "https://images.luxuryescapes.com/9q8jccm6wk6lxox0mk7",
    "vendor_name": "RIMBA by AYANA Bali",
    "title": "Five-Star AYANA Bali Escape Overlooking Jimbaran Bay with 14 Swimming Pools",
    "description": "RIMBA by AYANA Bali is designed for those seeking a balance of modern luxury and a lively atmosphere. Set within the lush tropical gardens of AYANA Bali, RIMBA features contemporary rooms with thoughtful design elements, including the use of driftwood and discarded timber. The resort’s rooms are thoughtfully designed to accommodate families, with options for adjoining rooms and child-friendly amenities that ensure comfort and convenience for guests of all ages. \n\nThis luxurious resort perfectly pairs stunning sunset views with 30 onsite restaurants & bars, entertainment, a unique spa and an 18-hole golf course. Parents can unwind, knowing their little ones are entertained with engaging activities at the kids' club or enjoying the resort's pools, while the whole family can explore the lush surroundings.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "RIMBA by AYANA Bali",
    "offer_address": "Jalan Karang Mas Sejahtera, Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 152.0,
    "value": 152.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Rn5wAAC",
    "hero_image": "https://images.luxuryescapes.com/kbken7kfatv2bln9dtznn",
    "image_two": "https://images.luxuryescapes.com/a2bbizf7ibsyuwa2fq3i",
    "image_three": "https://images.luxuryescapes.com/gt7i68byesbzx5drai5",
    "vendor_name": "AYANA Resort Bali",
    "title": "Tranquil Beachfront Resort with 14 Swimming Pools Perched above Jimbaran Bay",
    "description": "This flagship property of AYANA Bali is an expansive luxury retreat perched on the cliffs of Jimbaran Bay, offering breathtaking ocean vistas. Featuring elegant ocean-view or garden-view rooms and spacious suites, the resort showcases a harmonious blend of traditional Balinese aesthetics and modern comforts. \n\nRenowned for its world-class dining, including the global icon Rock Bar, guests can savour a variety of culinary experiences. With multiple pools, a secluded beach and a wide array of activities encompassing wellness, fitness and cultural experiences, AYANA Resort Bali perfectly combines relaxation and exploration, delivering a truly luxurious escape for every guest.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "AYANA Resort Bali",
    "offer_address": "Jalan Karang Mas Sejahtera Jimbaran, Bali 80364, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 258.0,
    "value": 258.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQQ4YAAX",
    "hero_image": "https://images.luxuryescapes.com/exm9j5cjbjr7vhz5zim9",
    "image_two": "https://images.luxuryescapes.com/hc0o3hys0n6jwk4fkwcx",
    "image_three": "https://images.luxuryescapes.com/3m9ynqehzdhb2teuabxa",
    "vendor_name": "The Jimbaran Villa by Ini Vie Hospitality",
    "title": "Secluded Bali Villa with Rooftop Terrace & Ocean Views",
    "description": "Succumb to the call of Bali’s pristine beaches, palm-fringed landscapes and turquoise waters with a stay at The Jimbaran Villa - a hidden oasis with rooftop ocean views. Perfect for a romantic getaway, this intimate escape offers boutique accommodation in the quieter region of Bali and is easily within walking distance of beachfront restaurants and bars. Relax in divine luxury by enjoying a private floating breakfast and catching the picturesque sunset from the furnished rooftop terrace.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Jimbaran",
    "location_heading": "Jimbaran",
    "location_subheading": "Bali",
    "location_description": "The Jimbaran Villa",
    "offer_address": "Jalan Bukit Permai, Mimpi Resort No. 88, Jimbaran 80361, Bali, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 111.0,
    "value": 111.0
  }
]