[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009C29HAAS",
    "hero_image": "https://images.luxuryescapes.com/1zoxef3n4eib9fgihqc6",
    "image_two": "https://images.luxuryescapes.com/ee2urn8l8rfcgnohr2si",
    "image_three": "https://images.luxuryescapes.com/a8ii4694ck55p1yjw94t",
    "vendor_name": "Kempinski Hotel Jinan",
    "title": "Kempinski Sky-High Escape Overlooking Jinan with Level 51 Spa & Indoor Pool",
    "description": "Indulge in timeless hospitality and distinct European flair at the decadent Kempinski Hotel Jinan, ideally located amidst Jinan's new financial centre and Hanyu Financial Valley. Situated on the upper floors of the 339-metre YUNDING Building, this exquisite oasis offers a palatial escape within a sky-high paradise. Part of the globally recognised Kempinski brand, the hotel features a long list of glamorous facilities, including a heated indoor pool, stylish Roof Garden and four unforgettable restaurants and bars offering a diverse range of locally and internationally-inspired cuisine - including the open-kitchen culinary experience The View and the innovative Spring Palace. For further relaxation, visit the lavish spa, where you can take advantage of tailored treatments while taking in breathtaking views across the city.",
    "offer_country_name": "China",
    "offer_country_code_alpha_2": "CN",
    "offer_geo_area_level_1": "Shandong",
    "offer_geo_area_level_2": "Jinan",
    "location_heading": "Jinan",
    "location_subheading": "China",
    "location_description": "Kempinski Hotel Jinan",
    "offer_address": "Section 5 of Hanyu Financial Business Center, 7000 Jingshi Rd., Licheng District, Jinan, 250000, PRC Jinan, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 10,
    "price": 83.0,
    "value": 83.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CNr4gAAD",
    "hero_image": "https://images.luxuryescapes.com/r9qsik467ohukg8tgkyq",
    "image_two": "https://images.luxuryescapes.com/jfcb8ukvrtd1msk5nkup",
    "image_three": "https://images.luxuryescapes.com/3zl2nksuwuvq2t00dyi7",
    "vendor_name": "InterContinental Jinan City Center",
    "title": "Stylish Escape in the Heart of Jinan City with Indoor Pool & Rooftop Bar",
    "description": "Discover the capital city of China’s Shandong province with a stay at the lavish InterContinental Jinan City Center, an IHG Hotel. Discover why the metropolis is known as the ‘Spring City’ as you stroll the enchanting streets in search of its many natural springs. Spend your days exploring the ancient history of the city, then return to this stylish, modern hotel to take a dip in the pool, enjoy a cocktail at the rooftop bar and enjoy unique dining experiences overlooking the sparkling cityscape.",
    "offer_country_name": "China",
    "offer_country_code_alpha_2": "CN",
    "offer_geo_area_level_1": "Shandong",
    "offer_geo_area_level_2": "Jinan",
    "location_heading": "Jinan",
    "location_subheading": "China",
    "location_description": "InterContinental Jinan City Center, an IHG Hotel",
    "offer_address": "No.3 Tian Di Tan Road, Li Xia District, Jinan, 250011, China",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 90.0,
    "value": 90.0
  }
]