[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007m0yDAAQ",
    "hero_image": "https://images.luxuryescapes.com/casvoniwtao0nz1wl2a",
    "image_two": "https://images.luxuryescapes.com/mgvr2dw1x6g6q5e3py",
    "image_three": "https://images.luxuryescapes.com/u638m6h3qjgfzhng8zoy",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "Iconic K'gari Fraser Island Eco-Resort with Roundtrip Ferry Transfers & Resort Credit",
    "description": "Experience island magic like nowhere else with a stay at Kingfisher Bay Resort, hidden on the UNESCO World Heritage-listed paradise of K'gari (Fraser Island), just off the coast of Queensland. Ranked within the top 10% of properties on Tripadvisor, this eco-oasis is a haven of relaxation and your stepping stone to explore the picturesque sights of the world's largest sand island.\n\nJust a 50-minute scenic ferry ride from Hervey Bay, it’s all too easy to reconnect with nature. From embarking on a guided tour, plunging into one of the more than 100 freshwater lakes, roaming through towering rainforests, or exploring vast stretches of the pristine coastline, you'll be spoiled for choice, all while soaking up the sub-tropical Queensland climate. When you’re ready to relax, head back to the eco-resort - built on stilts to allow Fraser's wildlife to roam freely beneath - and enjoy a delicious meal and lavish cocktail at one of the several onsite restaurants and bars, or unwind on your private deck overlooking tranquil, bushland surrounds. Take a dip in one of the four lagoon-style swimming pools, soak in the outdoor hot tub, enjoy a game of tennis or indulge in a luxurious treatment at the Island Day Spa.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "K'gari (Fraser Island)",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort",
    "offer_address": "Kingfisher Bay, K'gari (Fraser Island) 4581, Queensland, Australia",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 440.0,
    "value": 784.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LipRAAS",
    "hero_image": "https://images.luxuryescapes.com/ijpx9tdgp5zchlmjdkc",
    "image_two": "https://images.luxuryescapes.com/se51djrfwf0kuyy0h3h",
    "image_three": "https://images.luxuryescapes.com/o1xww77wjshex6fpcwes",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "Award-Winning Eco-Resort Kingfisher Bay with Return Ferry Transfers",
    "description": "Discover the magic of Fraser Island with a stay at the internationally renowned Kingfisher Bay Resort. Nestled on beautiful, UNESCO World Heritage-listed Fraser Island off the coast of Queensland, this award-winning eco-resort is the perfect place to reconnect with nature. Your escape includes daily buffet breakfast, unlimited ranger-guided nature walks and talks, A$50 resort experience credit, return passenger ferry transfers, A$50 spa credit valid on purchases of A$100 or more, a bottle of wine to share and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "K'gari (Fraser Island)",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort",
    "offer_address": "Kingfisher Bay, K'gari (Fraser Island) 4581, Queensland, Australia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 247.0,
    "value": 678.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzFEVAA3",
    "hero_image": "https://images.luxuryescapes.com/vhagvymknesv4a75cmh",
    "image_two": "https://images.luxuryescapes.com/anp08605x7l68utl2olg",
    "image_three": "https://images.luxuryescapes.com/zalbi0sl2ri06af62nyl",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "Idyllic K'gari Two-Bedroom Villa Eco-Resort Stay with Roundtrip Ferry Transfers, A$100 Dining Credit + A$100 Activity Credit",
    "description": "Searching for the ultimate Aussie adventure? Soak up K’gari’s magic with a two-bedroom villa stay at Kingfisher Bay Resort, hidden between sighing eucalypts and towering redgums on Queensland’s most beloved UNESCO World Heritage-listed island paradise. Just a 50-minute scenic ferry ride from Hervey Bay, there’s natural wonders galore - spend your days exploring the world's largest sand island on an included guided tour, roaming through ancient rainforests, plunging into countless freshwater lakes or exploring vast stretches of pristine coastline. Return to your spacious, stilt-top two-bedroom villa, boasting a fully equipped kitchen and private deck with spectacular views over rambling bushlands. You’ll never want to leave.\n\nWhen you’re ready to relax, this eco-resort - built on stilts to allow the island’s wildlife to roam freely beneath - offers everything you need to soak up paradise with family or friends. Make a splash in one of the four lagoon-style swimming pools, sip innovative cocktails with a bush tucker spin at Rainforest Bar or indulge in a wellness treatment at Island Day Spa, which makes use of native ingredients like lime caviar and Kakadu plum to offer a decidedly K’gari twist on restoration and renewal.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "K'gari (Fraser Island)",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort",
    "offer_address": "Kingfisher Bay, K'gari (Fraser Island) 4581, Queensland, Australia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 609.0,
    "value": 1139.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Hh6XIAS",
    "hero_image": "https://images.luxuryescapes.com/zxjpj4ze2etls2j3zdci",
    "image_two": "https://images.luxuryescapes.com/29hdcjcej4q1r61b3469",
    "image_three": "https://images.luxuryescapes.com/fbup6hguzsjhtutdwpnm",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "Award-Winning K'gari (Fraser Island) Eco-Resort with Daily Breakfast, A$100 Resort Activity Credit & Return Ferry Transfers",
    "description": "Experience island magic like nowhere else with a stay at this idyllic eco-resort, hidden on the UNESCO World Heritage-listed paradise of K'gari (Fraser Island), off the Queensland coast. Just a 50-minute scenic ferry ride from Hervey Bay, it’s all too easy to reconnect with nature at Kingfisher Bay Resort.\n\nThe ultimate island escape -  this immersive retreat is built on stilts to allow K'gari's environment to flourish. Enjoy a delicious meal and a lavish cocktail at one of the several onsite restaurants and bars, or unwind on your private deck overlooking tranquil bushland surrounds.\n\nTake a dip in one of the four lagoon-style swimming pools, soak in the outdoor hot tub, bask in a golden sunset along the western bay or indulge in a luxurious treatment at the Island Day Spa - truly a haven of relaxation.\n\nFor an awe-inspiring nighttime experience, marvel at the all-new light and sound spectacle - Illumina - an installation by renowned light artist, Bruce Ramus. Set within the resort’s natural environment, watch as K’gari’s breathtaking landscapes come to life in a mesmerising symphony of colour.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "K'gari (Fraser Island)",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort",
    "offer_address": "Kingfisher Bay, K'gari (Fraser Island) 4581, Queensland, Australia",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 369.0,
    "value": 1073.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C3KXvAAN",
    "hero_image": "https://images.luxuryescapes.com/jvgiktdog8vpd0thgkmw",
    "image_two": "https://images.luxuryescapes.com/cl2rx023n6cd4ivad3k",
    "image_three": "https://images.luxuryescapes.com/ouse8oinnmz79z8ffub",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "Idyllic K'gari Fraser Island Eco-Resort with Roundtrip Ferry Transfers & A$100 Experience Credit",
    "description": "Experience island magic like nowhere else with a stay at Kingfisher Bay Resort, hidden on the UNESCO World Heritage-listed paradise of K'gari (Fraser Island), off the Queensland coast. Just a 50-minute scenic ferry ride from Hervey Bay, it’s all too easy to reconnect with nature. From embarking on a guided tour, plunging into one of the more than 100 freshwater lakes, roaming through towering rainforests or exploring vast stretches of the pristine coastline, you'll be spoiled for choice, all while enjoying the sub-tropical Queensland climate.\n\nWhen you’re ready to relax, head back to the eco-resort - built on stilts to allow K'gari's wildlife to roam freely beneath - and enjoy a delicious meal and lavish cocktail at one of the several onsite restaurants and bars, or unwind on your private deck overlooking bushland surrounds. Take a dip in one of the four lagoon-style swimming pools, soak in the outdoor hot tub, enjoy a game of tennis or indulge in a luxurious treatment at the Island Day Spa - truly a haven of relaxation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "K'gari (Fraser Island)",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort",
    "offer_address": "Kingfisher Bay, K'gari (Fraser Island) 4581, Queensland, Australia",
    "percentage_discount": 23.0,
    "min_duration": 4,
    "max_duration": 11,
    "price": 659.0,
    "value": 855.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3ZXFQA3",
    "hero_image": "https://images.luxuryescapes.com/jpay8ebph5n2fravl7wr",
    "image_two": "https://images.luxuryescapes.com/j8ovsxsr3dtoape0qxel",
    "image_three": "https://images.luxuryescapes.com/zrjab6zer4vpxk8c9stz",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "See Why Meghan & Harry Fell in Love with Fraser Island. Includes Return Ferry Transfers and Indulgent Inclusions.",
    "description": "Walk in the footsteps of the Duke and Duchess of Sussex, who visited Fraser Island on their 2018 Australian tour, with a stay at the now internationally-renowned Kingfisher Bay Resort. Nestled on the beautiful UNESCO World Heritage-listed Fraser Island off the coast of Queensland, this award-winning eco-resort is the perfect place to reconnect with nature. Your escape includes daily buffet breakfast, a complimentary bottle of wine to share at the Sunset Bar, unlimited ranger-guided nature walks and talks, AU$50 resort experience credit, return passenger ferry transfers, AU$50 spa credit valid on purchases of AU$100 or more, and one complimentary martini each upon purchase of a main meal at Seabelle Restaurant.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "K'gari (Fraser Island)",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort",
    "offer_address": "Kingfisher Bay, K'gari (Fraser Island) 4581, Queensland, Australia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 245.0,
    "value": 660.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JPLgAAO",
    "hero_image": "https://images.luxuryescapes.com/1iymwpw8gadyel41hd3",
    "image_two": "https://images.luxuryescapes.com/eqk5351i8frejxm2zjmk",
    "image_three": "https://images.luxuryescapes.com/0jskmxpzqorkfu2iab",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "Family-Friendly Fraser Island Villa Escape with Roundtrip Ferry Transfers & A$100 Resort Credit",
    "description": "Experience island magic like nowhere else with a stay at Kingfisher Bay Resort, hidden on the UNESCO World Heritage-listed paradise of Fraser Island, just off the coast of Queensland. Voted one of Australia's top 10 family resorts in the Holidays with Kids Magazine 2020 Readers' Choice Awards and having been frequented by royals (hosting the Duke and Duchess of Sussex, Harry and Meghan, as well as Prince Charles), a stay at this eco-oasis promises to be unforgettable.\n\nJust a 50-minute scenic ferry ride from Hervey Bay, it’s all too easy to reconnect with nature. From plunging into one of the more than 100 dune lakes, forest bathing in the rainforest or paddling along tranquil waters in a canoe, you'll be spoilt for choice, all while soaking up the sub-tropical Queensland climate on the world's largest sand island.\n\nWhen you’re ready to relax, head back to the eco-resort - built on stilts to allow Fraser's wildlife to hurry about their business unhampered - to enjoy a delicious meal and lavish cocktail at one of the several onsite restaurants and bars, including the brand-new Rainforest Bar. Take a dip in the lagoon-style swimming pool (there’s four to choose from), soak in the outdoor spa, enjoy a game of tennis, make use of watersports equipment available, or indulge in a luxurious treatment at the Island Day Spa.\n\n**Your handpicked inclusions:**\n\n- Arrive in style with roundtrip passenger ferry transfers for four guests\n- Celebrate your escape with one cocktail or mocktail per person in the new Rainforest Bar or the Maheno Lounge Bar\n- Feast on a delicious sunset platter to share and drink each at the Sunset Bar\n- A$100 credit to use on resort activities including bush tucker tastings, archery, day tours around the island and more\n\n**This deal has NO peak surcharges:** Travel any time for the same great price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "K'gari (Fraser Island)",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort",
    "offer_address": "Kingfisher Bay, K'gari (Fraser Island) 4581, Queensland, Australia",
    "percentage_discount": 36.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 609.0,
    "value": 959.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNdoHAAT",
    "hero_image": "https://images.luxuryescapes.com/tesjh0ehqdfh7aeuss6",
    "image_two": "https://images.luxuryescapes.com/pb9afoc42vxbqtjkt2q",
    "image_three": "https://images.luxuryescapes.com/krsx6rjnljl0v1urfk5j",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "Idyllic K'gari Fraser Island Eco-Resort with Roundtrip Ferry Transfers & A$200 Dining Credit",
    "description": "Experience island magic like nowhere else with a stay at Kingfisher Bay Resort, hidden on the UNESCO World Heritage-listed paradise of K'gari (Fraser Island), off the Queensland coast. Just a 50-minute scenic ferry ride from Hervey Bay, it’s all too easy to reconnect with nature. From embarking on a guided tour, plunging into one of the more than 100 freshwater lakes, roaming through towering rainforests or exploring vast stretches of the pristine coastline, you'll be spoiled for choice, all while enjoying the sub-tropical Queensland climate. \n\nWhen you’re ready to relax, head back to the eco-resort - built on stilts to allow K'gari's wildlife to roam freely beneath - and enjoy a delicious meal and lavish cocktail at one of the several onsite restaurants and bars, or unwind on your private deck overlooking bushland surrounds. Take a dip in one of the four lagoon-style swimming pools, soak in the outdoor hot tub, enjoy a game of tennis or indulge in a luxurious treatment at the Island Day Spa - truly a haven of relaxation.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "K'gari (Fraser Island)",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort",
    "offer_address": "Kingfisher Bay, K'gari (Fraser Island) 4581, Queensland, Australia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 12,
    "price": 447.0,
    "value": 836.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QrVbAAK",
    "hero_image": "https://images.luxuryescapes.com/tshkelaormjmobj0js1e",
    "image_two": "https://images.luxuryescapes.com/gcz4tf8ldt9m4sfxni88",
    "image_three": "https://images.luxuryescapes.com/2s8r9etramd2r0lehifk",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "Family-Friendly Kingfisher Bay Eco-Resort on UNESCO World Heritage-Listed K'gari (Fraser Island)",
    "description": "Discover the magic of the UNESCO World Heritage-listed K'gari (Fraser Island) off the coast of Queensland with a stay at Kingfisher Bay Resort. The eco-resort is a favourite among royals (hosting the Duke and Duchess of Sussex, Harry and Meghan, as well as Prince Charles) and the perfect place to reconnect with nature. Home to beautiful beaches, soaring sand dunes, verdant rainforest, and incredible wildlife, it's just a 50-minute scenic ferry ride from Hervey Bay. When you need to recharge, the resort has everything you'll need in paradise, including three restaurants, four bars, four lagoon-style pools, an outdoor spa, tennis courts, watersports equipment hire and the luxurious Island Day Spa with tranquil treatment rooms.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "K'gari (Fraser Island)",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort",
    "offer_address": "Kingfisher Bay, K'gari (Fraser Island) 4581, Queensland, Australia",
    "percentage_discount": null,
    "min_duration": 2,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nMO0AAM",
    "hero_image": "https://images.luxuryescapes.com/sbj6pj3aoke9aip4dzrh",
    "image_two": "https://images.luxuryescapes.com/yf1qtvfymznps83hn44",
    "image_three": "https://images.luxuryescapes.com/ex4gda7sz6hw3b7tmu1",
    "vendor_name": "Kingfisher Bay Resort",
    "title": "Iconic K'gari Fraser Island Eco-Resort with Four Lagoon-Style Pools",
    "description": "Experience island magic like nowhere else with a stay at Kingfisher Bay Resort, hidden on the UNESCO World Heritage-listed paradise of K'gari (Fraser Island), just off the coast of Queensland. This eco-oasis - built on stilts to allow the island's wildlife to roam freely beneath - is a haven of relaxation perfectly positioned for exploring the picturesque sights of the world's largest sand island. When you’re ready to relax, enjoy a delicious meal and lavish cocktail at one of the several on-site restaurants and bars, unwind on your private deck overlooking tranquil, bushland surrounds, take a dip in one of the four lagoon-style swimming pools, soak in the outdoor hot tub, enjoy a game of tennis or indulge in a luxurious treatment at the Island Day Spa.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Fraser Island",
    "location_heading": "K'gari (Fraser Island)",
    "location_subheading": "Queensland",
    "location_description": "Kingfisher Bay Resort",
    "offer_address": "Kingfisher Bay, K'gari (Fraser Island) 4581, Queensland, Australia",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 244.0,
    "value": 244.0
  }
]