[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DYJbqYAH",
    "hero_image": "https://images.luxuryescapes.com/gd2s0y4e4dlj5ttkbsla",
    "image_two": "https://images.luxuryescapes.com/h7dxd3d59410flcadet",
    "image_three": "https://images.luxuryescapes.com/445eohb5gcj4otuazapp",
    "vendor_name": "Adaaran Prestige Vadoo",
    "title": "Maldives Adults-Only Overwater Oasis with All-Inclusive Dining, Free-Flow Drinks & Speedboat Transfers",
    "description": "Reset your clocks to island time for a relaxing escape at this all-inclusive adults-only resort in one of the most breathtaking places on Earth. Nestled on a private island in the Maldives' Kaafu Atoll - just a short speedboat ride from Velana International Airport - this deluxe resort is a secluded paradise surrounded by an exotic reef teeming with marine life.\n\nGaze out at the ocean from your spacious private pool villa, savour tropical cocktails at Kandholi Bar and live like royalty with a personalised butler service. Visit a technicolour underwater world with scuba diving at the onsite SSI Dive Centre or snorkel, swim or try your hand at sea-bobbing or flyboarding.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Vadoo Island",
    "location_heading": "Kaafu Atoll",
    "location_subheading": "Maldives",
    "location_description": "Adaaran Prestige Vadoo",
    "offer_address": "Vaadhoo, Kaafu Atoll 20105, Maldives",
    "percentage_discount": 68.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 3609.0,
    "value": 11402.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GOtmMAAT",
    "hero_image": "https://images.luxuryescapes.com/nm927cda3o3nkg2n3xc",
    "image_two": "https://images.luxuryescapes.com/efx4jbil59742kmida43",
    "image_three": "https://images.luxuryescapes.com/b9x1wrsn9dujdf4lhyk",
    "vendor_name": "SO/ Maldives",
    "title": "SO/ Maldives Grand Opening: Modern Luxury Pool Villas with Daily Breakfast, Nightly Dinner & Drinks",
    "description": "Celebrate the grand opening of SO/ Maldives, a luxurious escape where castaway meets catwalk amongst the dazzling azure of the Indian Ocean. This boutique retreat features a collection of bespoke beachfront and overwater villas, each boasting private pools, sun decks and direct access to the turquoise lagoon. Just a 15-minute speedboat ride from Malé International Airport, this breathtaking resort is home to the chic SO/ details that make even the most spectacular paradise even more alluring. Immerse yourself in the island's vibrant spirit at the bohemian Lazuli Beach Club, where you can enjoy refreshing cocktails, live music and stunning ocean vistas. This tropical paradise promises an unforgettable escape filled with sun-soaked days and nights perfect for stargazing.\n\nExperience everything the glistening lagoon has to offer, from moments beneath the surface on a scuba diving adventure to feeling the wind in your hair as you cruise along on a glass-bottomed boat and kayak from beach to beach. Each day promises modern luxuries on an island paradise, where evenings take on a new life courtesy of the delectable Levantine flavours served at the avant-garde Hadaba restaurant.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Emboodhoo Lagoon",
    "location_heading": "Kaafu Atoll",
    "location_subheading": "Maldives",
    "location_description": "SO/ Maldives",
    "offer_address": "Emboodhoo Lagoon, Kaafu Atoll 20028, Maldives",
    "percentage_discount": 71.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 3499.0,
    "value": 12276.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DYUSPYA5",
    "hero_image": "https://images.luxuryescapes.com/hojm4p9ji6sq6yooj5fn",
    "image_two": "https://images.luxuryescapes.com/73fildny5u4efftrngr",
    "image_three": "https://images.luxuryescapes.com/bpbv46cc8bf15bqkwnm",
    "vendor_name": "SO/ Maldives",
    "title": "Maldives Award-Winning Private Pool Glamour with Daily Breakfast, Nightly Dinner & Speedboat Transfers",
    "description": "Experience a new level of island glamour at SO/ Maldives, a luxurious escape where castaway meets catwalk among the dazzling azure of the Indian Ocean. Just a quick 15-minute speedboat ride from Malé International Airport lies the resort’s arrival dock - dubbed ‘the runway’ - where guests congregate each evening for cocktails at the Pavilion Bar and the walkway is lit with red neon.\n\nSituated on the Emboodhoo Lagoon on Kaafu Atoll, on a ring of piercingly white sand, this boutique retreat features a collection of bespoke beachfront and overwater villas, each boasting private pools, sun decks and direct access to the turquoise lagoon.\n\nGuests can relax by the technicolour-striped main pool, home to the Lazuli Beach Club, where refreshing cocktails, live music and stunning ocean vistas await. Next door, The Citronelle Club serves up an Asian fusion menu, while signature restaurant Hadaba offers traditional Middle Eastern fare. Experience everything the glistening lagoon has to offer, from a scuba diving adventure to feeling the wind in your hair as you cruise along on a glass-bottomed boat and kayak from beach to beach.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Emboodhoo Lagoon",
    "location_heading": "Kaafu Atoll",
    "location_subheading": "Maldives",
    "location_description": "SO/ Maldives",
    "offer_address": "Emboodhoo Lagoon, Kaafu Atoll 20028, Maldives",
    "percentage_discount": 70.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 3749.0,
    "value": 12528.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JAkxuYAD",
    "hero_image": "https://images.luxuryescapes.com/pn105rcxvc58nl2yva3",
    "image_two": "https://images.luxuryescapes.com/i6yqem76wigdy6xyncw7",
    "image_three": "https://images.luxuryescapes.com/dcutcbbldo7mbjfwb7j",
    "vendor_name": "Club Med The Finolhu Villas",
    "title": "Award-Winning Maldives Club Med Five-Star Resort with Overwater & Beach Private Pool Villas",
    "description": "Let the rest of the world fall away during a romantic escape at the five-star Exclusive Collection Finolhu Villas, an eco-chic resort in the dreamy Malé Atoll. Encompassing its own private island, this tropical retreat offers endless opportunities to unwind or dive into adventure - whether it’s snorkelling over vibrant coral reefs or embracing high-energy water sports in the crystal-clear lagoon.\n\nSavour local and international flavours at a variety of dining venues, from buffet-style gourmet cuisine at The Vehli to a la carte dishes overlooking the Indian Ocean at The Motu. With its stunning natural beauty, family-friendly amenities and relaxing spa offerings, Club Med Finolhu Villas is the ultimate paradise.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Kaafu Atoll",
    "location_heading": "Kaafu Atoll",
    "location_subheading": "Maldives",
    "location_description": "Club Med Finolhu Villas",
    "offer_address": "N 2051, Gasfinolhu, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 4226.0,
    "value": 4226.0
  }
]