[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HuhfIAC",
    "hero_image": "https://images.luxuryescapes.com/0c3kx4q6d7db3vw8zzo",
    "image_two": "https://images.luxuryescapes.com/3x3otluthen13v3i25gv",
    "image_three": "https://images.luxuryescapes.com/dpp312cd8a0rwu0m6t5q",
    "vendor_name": "Uga Bay Pasikuda",
    "title": "Beachfront Sri Lanka Paradise overlooking Pasikuda Bay with Massages, Daily Breakfast & Nightly Cocktails",
    "description": "Experience the serene beauty of Sri Lanka's eastern coast at this luxury beachfront hotel in Pasikuda. Enjoy a three-kilometre stretch of private beach, world-class scuba diving nearby, fine dining and fresh seafood at the signature restaurant, a unique underground spa with skilled Balinese therapists, and exhilarating water sports.\n\nThe resort's architectural elegance combines Mediterranean charm with tropical simplicity that makes for the perfect elevated yet laid-back beach escape. Set along the pristine shores of Pasikuda Bay, known for its gentle waves and shallow waters, experience the bliss of wading waist-deep to the coral reef's edge or diving under the waves alongside vibrant marine life.",
    "offer_country_name": "Sri Lanka",
    "offer_country_code_alpha_2": "LK",
    "offer_geo_area_level_1": "Eastern Province",
    "offer_geo_area_level_2": "Pasikuda",
    "location_heading": "Kalkudah",
    "location_subheading": "Sri Lanka",
    "location_description": "Uga Bay Pasikuda",
    "offer_address": "Uga Bay, Coconut Board Road, Pasikuda, Kalkudha, 30410, Sri Lanka",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 13,
    "price": 609.0,
    "value": 1534.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ie8Z7AAJ",
    "hero_image": "https://images.luxuryescapes.com/gpqj3nlhppxyhftihn4",
    "image_two": "https://images.luxuryescapes.com/i6m19mi7esgim46fa3ho",
    "image_three": "https://images.luxuryescapes.com/bjftj9pulbkvb46docpi",
    "vendor_name": "Maalu Maalu Resort & Spa | Pasikuda",
    "title": "Sri Lanka Seaside Serenity with Daily Breakfast, Infinity Pool, Spa & Five Restaurants",
    "description": "Discover the tranquil beauty of Sri Lanka's eastern coast with a stay at this laidback resort and spa overlooking the majestic Indian Ocean from Pasikuda Bay. Enjoy a host of top-tier facilities, including a rejuvenating spa, five dining outlets serving Sri Lankan cuisine in a variety of settings, water sport rentals, a children's play area and a beachfront infinity pool.\n\nWhen it's time to explore, venture to nearby Batticaloa Lagoon, or take a leisurely stroll along golden Pasikuda Beach. Call it a day in chalets with the best of amenities and generous hospitality.",
    "offer_country_name": "Sri Lanka",
    "offer_country_code_alpha_2": "LK",
    "offer_geo_area_level_1": "Eastern Province",
    "offer_geo_area_level_2": "Pasikuda",
    "location_heading": "Kalkudah",
    "location_subheading": "Sri Lanka",
    "location_description": "Maalu Maalu Resort & Spa",
    "offer_address": "Coconut Development Board Road, Pasikuda 30410, Sri Lanka",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 185.0,
    "value": 185.0
  }
]