[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FoywQYAR",
    "hero_image": "https://images.luxuryescapes.com/1p8rx40g05z31e404gorj",
    "image_two": "https://images.luxuryescapes.com/5ji7etpy6o5k541typ7",
    "image_three": "https://images.luxuryescapes.com/drrcphvrcpe9b4cvoqk",
    "vendor_name": "The Xcape River Kwai",
    "title": "Secluded Thailand Riverside Serenity with Massages, Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Experience peaceful luxury at this design-led boutique hotel on the banks of the Kwai Noi River in Thailand. Surrounded by rice paddies, sugar cane plantations and nature views, this tranquil retreat is just a 2.5-hour drive from Bangkok, offering a perfect escape from the city.\n\nBeyond the serene setting, there’s plenty to explore on land, with the historic city of Kanchanaburi and the bridge over the River Kwai nearby. Contemporary comforts abound in both private and public areas, including The Bridge Bar & Bistro, where Thai and Western delights are served from morning to well past sundown.\n\nEach room offers lush river vistas, while the infinity pool provides the ultimate water-gazing experience, complete with sunbeds for relaxation. For next-level indulgence, head to MINE Wellness, where traditional Thai healing practices are infused with modern wellness techniques.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Kanchanaburi Province",
    "offer_geo_area_level_2": "Kanchanaburi",
    "location_heading": "Kanchanaburi",
    "location_subheading": "Thailand",
    "location_description": "The Xcape River Kwai",
    "offer_address": "138 4 Nong Ya Soi 5 Ban Wanglan, Nong Ya, Mueang, Kanchanaburi 71000, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 479.0,
    "value": 1292.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HQ8EAAW",
    "hero_image": "https://images.luxuryescapes.com/1f8s21ovu7dhkjclx67y",
    "image_two": "https://images.luxuryescapes.com/am1vtgievjtvkey4q15f",
    "image_three": "https://images.luxuryescapes.com/x5290zfsvu02wchozv9p",
    "vendor_name": "The Xcape River Kwai",
    "title": "Thailand Award-Winning Kwai Noi Riverside Escape with Daily Breakfast",
    "description": "Embrace peaceful luxury living at The Xcape River Kwai, a design-led boutique hotel perched on the banks of the Kwai Noi River in Thailand. Surrounded by rice paddies and sugar cane plantations, with a mountain-range backdrop, this serene sanctuary couldn’t seem further from the bustle of Bangkok - but is just a 2.5-hour drive from the capital. While you may be tempted to spend all your time in the water, there’s plenty to explore on land: the historic city of Kanchanaburi is 20 minutes away, as is the River Kwai bridge, made famous by the iconic 1950s movie The Bridge on the River Kwai.\n\nWith avant-garde architecture that pays homage to the industrial history of the area, The Xcape River Kwai features just eight cabins, styled to resemble shipping containers. Contemporary comforts abound in both private and public areas, including The Bridge Bar & Bistro, where Thai and Western delights are served from sun-up to well past sundown. While each room faces the river, the best spot for water-gazing is the infinity pool, complete with comfortable sunbeds. When the time comes to explore further afield, hop on a complimentary bicycle for an afternoon well spent. Ranked among the top 1% of properties worldwide on Tripadvisor, this hotel is a tranquil Thai luxury at its finest.\n\n**Luxury Escapes inclusions:**\n\n- Start each morning with **daily breakfast** at The Bridge Bar & Bistro\n- Embrace that holiday feeling with a refreshing **welcome cocktail**\n- Head to The Bridge Bar & Bistro for one **two-course lunch or dinner** (for stays of 2+ nights)\n- Float into pure peacefulness with a **30-minute massage per adult** (for stays of 3+ nights)\n\n**Overwater River Upgrade:** Spend your days perched directly over the Kwai Noi River, lounging on your outdoor mesh daybed, exploring the water by kayak or taking in the view from your private rooftop when you upgrade to an XFloat Luxe Cabin.\n\n**Tripadvisor Traveller's Choice Awards 2021** Top Small Hotels - Thailand",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Kanchanaburi Province",
    "offer_geo_area_level_2": "Kanchanaburi",
    "location_heading": "Kanchanaburi",
    "location_subheading": "Thailand",
    "location_description": "The Xcape River Kwai",
    "offer_address": "138 4 Nong Ya Soi 5 Ban Wanglan, Nong Ya, Mueang Kanchanaburi District, Kanchanaburi 71000, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 187.0,
    "value": 187.0
  }
]