[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQyHlAAL",
    "hero_image": "https://images.luxuryescapes.com/n807ytgwtn9ps73kv5s",
    "image_two": "https://images.luxuryescapes.com/pumc7tbwsan844fn21pr",
    "image_three": "https://images.luxuryescapes.com/9527mdpk2aq6nqj6zys",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "Bestselling Maldives Finolhu Overwater Villas with All-Inclusive Drinks & Dining & Malé Seaplane Transfers",
    "description": "Not all Maldives escapes are created equal. The top-rated, all-inclusive Seaside Finolhu Baa Atoll is back - bigger and better than ever. Following comprehensive renovations, this acclaimed resort invites you to enjoy ultra-playful barefoot luxury, surrounded by pristine white sands, aquamarine waters and mesmerising marine life. The heavenly Baa Atoll offers everything you need for pure tropical island relaxation. Indulge at four exceptional beachside restaurants and the two-storey Beach Club, find zen with morning yoga and treat yourself to a spa treatment in one of 10 traditional huts at Fehi Spa - an island-themed spa that’s sure to leave you feeling rested and rejuvenated.\n\nThe resort's prime location on the UNESCO World Heritage-listed Baa Atoll Biosphere Reserve provides a pristine setting for a myriad of water activities, from kayaking to windsurfing, paddle boarding and snorkelling - take your pick. Love to keep fit? Practice your swing at the indoor golf studio, and work up a sweat at the state-of-the-art fitness centre. Succumb to absolute indulgence on this once-in-a-lifetime escape to one of the most spectacular destinations in the world.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Seaside Finolhu Baa Atoll Maldives",
    "offer_address": "Kanufushi Island, Hithaadhoo, Maldives",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 4269.0,
    "value": 9140.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CNUNEAA5",
    "hero_image": "https://images.luxuryescapes.com/06mbfwzuoamg8toqx6ln",
    "image_two": "https://images.luxuryescapes.com/snbj8c5s8di5k5u7ojk",
    "image_three": "https://images.luxuryescapes.com/vh1l74gkeae3h1w9wwqa",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "Bestselling Maldives Finolhu Overwater Villa Returns with All-Inclusive Drinks & Dining & Seaplane Transfers from Malé",
    "description": "Not all Maldives escapes are created equal. Bestselling, all-inclusive Finolhu luxury is back - and now bigger and better than ever. Following comprehensive renovations, this acclaimed resort invites you to dip your toes into ultra-playful barefoot luxury, surrounded by pristine white sands, aquamarine waters and mesmerising marine life. This heavenly Baa Atoll playground offers every indulgence you could want and more. Indulge at four exceptional beachside restaurants and at the two-storey Beach Club, and when you're ready to indulge in some pampering, treat yourself to a spa treatment in one of 10 traditional huts at Fehi Spa - an island-themed spa that’s sure to leave you feeling rested and rejuvenated. \n\nA myriad of water activities means you can make the most of your time here: from kayaking to windsurfing, paddle boarding, jet skiing, diving and snorkelling - take your pick. Love to keep fit? There's yoga, an indoor golf studio and a fitness centre for that. Succumb to absolute indulgence on this once-in-a-lifetime escape to one of the most spectacular destinations in the world.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Seaside Finolhu Baa Atoll Maldives",
    "offer_address": "Kanufushi Island, Hithaadhoo, Maldives",
    "percentage_discount": null,
    "min_duration": null,
    "max_duration": null,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZnTiMQAV",
    "hero_image": "https://images.luxuryescapes.com/v0zwdjsviy2nhozagub3",
    "image_two": "https://images.luxuryescapes.com/sacpwxya5pw8jtihxye8",
    "image_three": "https://images.luxuryescapes.com/f5ckyjhnmuehc8hljeot",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "Award-Winning Finolhu: All-Inclusive Overwater Luxury with Speedboat Transfers and Return Flights from Malé",
    "description": "Surrender to tropical island life with an all-inclusive, overwater stay at the stylish Finolhu, cradled by the crystalline lagoon waters and white sands of the Maldives’ Baa Atoll UNESCO Biosphere Reserve. Experience a quintessential Maldives escape at the winner of the 2018 Best Luxury Beach Retreat in the Indian Ocean Islands at the World Luxury Hotel Awards and indulge in domestic plane and speedboat transfers from Malé, all-inclusive meals including daily breakfast, lunches and dinners, three upgraded dining experiences, unlimited alcoholic and soft drinks, access to the famous 1 Oak Beach Club and the use of snorkelling equipment to explore the underwater nirvana that surrounds.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Finolhu - Dec 2018 Best Of",
    "offer_address": "Kanufushi Island Baa Atoll, Maldives",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 3789.0,
    "value": 10190.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JTTubAAH",
    "hero_image": "https://images.luxuryescapes.com/ryaqhulwkdbyc8qfzba",
    "image_two": "https://images.luxuryescapes.com/eidusoxrfl1v5rn0fbs",
    "image_three": "https://images.luxuryescapes.com/qvxx3sqrc88r8az5ab6q",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "Maldives All-Time Favourite: Finolhu Overwater Villas with All-Inclusive Dining, Free-Flow Drinks & Malé Seaplane Transfers",
    "description": "There’s a reason this is one of our best-loved Maldives escapes: this extraordinary all-inclusive overwater villa hideaway invites you to embrace luxury in the heart of paradise, surrounded by warm sands and the brilliant blue waters of the Baa Atoll. Seaside Finolhu Baa Atoll offers everything you need for pure tropical island relaxation - indulge at four exceptional beachside restaurants or the resort's two-storey Beach Club, find your zen at the Yoga Pavilion and treat yourself to a spa treatment in one of 10 traditional huts at Fehi Spa, featuring an extensive wellness menu that’s sure to leave you feeling rested and rejuvenated.\n\nThe resort's prime location on the UNESCO World Heritage-listed Baa Atoll Biosphere Reserve provides a pristine setting for a myriad of water activities, from kayaking to windsurfing, paddle boarding and snorkelling - take your pick. Love to keep fit? Practice your swing at the indoor golf studio, work up a sweat at the state-of-the-art fitness centre or embrace your creativity at the Art Studio. Succumb to absolute indulgence on this once-in-a-lifetime escape to one of the world's most spectacular destinations.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Seaside Finolhu Baa Atoll Maldives",
    "offer_address": "Kanufushi Island, Hithaadhoo, Maldives",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 4799.0,
    "value": 9891.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CoK6HYAV",
    "hero_image": "https://images.luxuryescapes.com/5eburgiy5ql9k12gm90q",
    "image_two": "https://images.luxuryescapes.com/mwun2o86sqa3s9tavh8q",
    "image_three": "https://images.luxuryescapes.com/m2a6rcbbxirm874po94",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "Maldives All-Time Favourite: All-Inclusive Overwater Villas with Free-Flow Drinks & Seaplane Transfers",
    "description": "There’s a reason this is one of our most-loved Maldives escapes: this extraordinary all-inclusive villa hideaway invites you to embrace luxury in the heart of paradise, surrounded by warm sands and the brilliant blue waters of the Baa Atoll. Succumb to absolute indulgence on this once-in-a-lifetime escape to one of the world's most spectacular destinations.\n\nThis property offers everything that you need for pure tropical island relaxation - indulge at four exceptional beachside restaurants or the resort's two-storey Beach Club, find your zen at the Yoga Pavilion and treat yourself to a spa treatment in one of 10 traditional huts at Fehi Spa, featuring an extensive wellness menu that’s sure to leave you feeling rested and rejuvenated.\n\nThe resort's prime location on the UNESCO World Heritage-listed Baa Atoll Biosphere Reserve provides a pristine setting for a myriad of water activities, from kayaking to windsurfing, paddle boarding and snorkelling - take your pick. Love to keep fit? Practice your swing at the indoor golf studio, work up a sweat at the state-of-the-art fitness centre or embrace your creativity at the Art Lab.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Seaside Finolhu Baa Atoll Maldives",
    "offer_address": "Kanufushi Island, Hithaadhoo, Maldives",
    "percentage_discount": null,
    "min_duration": null,
    "max_duration": null,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zSUoAAM",
    "hero_image": "https://images.luxuryescapes.com/n9vd235x6b947tssyi4e",
    "image_two": "https://images.luxuryescapes.com/x7808faez80dqfjemfn3",
    "image_three": "https://images.luxuryescapes.com/emycqt6g3jwi49hfu1o",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "Finolhu is Back: Grand Reopening Maldives Overwater Luxury with All-Inclusive Drinks & Dining & Seaplane Transfers from Malé",
    "description": "Not all Maldives escapes are created equal. Bestselling, all-inclusive Finolhu luxury is back - and it's now bigger and better than ever. Following a US$20-million-dollar refurbishment, this A-list resort invites you to dip your toes into ultra-playful barefoot luxury, surrounded by pristine coral sands, aquamarine waters and mesmerising marine life. Ranked within Condé Nast Traveler's Top 30 Resorts in the Indian Ocean in the Readers' Choice Awards for 2021, this heavenly Baa Atoll playground offers every indulgence you could want and more.\n\nUnwind in total seclusion on this drop in the ocean. Indulge at four exceptional beachside restaurants and party from sunrise to sunset at the two-storey Beach Club, featuring weekly White Party sundowners. As the sun melts into the Indian Ocean, the dancefloor comes alive with vivid light shows, live DJs and jaw-dropping performances by world-class resident performance artists. When you're ready to indulge in some pampering, treat yourself to a spa treatment in one of 10 pastel-coloured treatment huts at Fehi Spa - an island-themed spa that’s sure to leave you feeling rested and rejuvenated. A myriad of water activities means you can make the most of your time here: from kayaking to windsurfing, paddle boarding, jet skiing, diving and snorkelling - take your pick. Love to keep fit? There's yoga, an indoor golf studio and a fitness centre for that. Succumb to absolute indulgence on this once-in-a-lifetime escape to one of the most spectacular destinations in the world.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Seaside Finolhu Baa Atoll Maldives",
    "offer_address": "Kanufushi Island, Hithaadhoo, Maldives",
    "percentage_discount": 42.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 3799.0,
    "value": 6589.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000I7AQAYA3",
    "hero_image": "https://images.luxuryescapes.com/jf8c2mzt9qu74twdq5nv",
    "image_two": "https://images.luxuryescapes.com/gvypq3ndioc566247m7q",
    "image_three": "https://images.luxuryescapes.com/z0msvu9e9ce5k0lj6978",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "Maldives All-Time Favourite: All-Inclusive Overwater Villas with Free-Flow Drinks & Seaplane Transfers",
    "description": "There’s a reason this is one of our most-loved Maldives escapes: this extraordinary all-inclusive villa hideaway invites you to embrace luxury in the heart of paradise, surrounded by warm sands and the brilliant blue waters of Baa Atoll. Succumb to absolute indulgence on this once-in-a-lifetime escape to one of the world's most spectacular destinations.\n\nThis property offers everything that you need for pure tropical island relaxation - indulge at four exceptional beachside restaurants or the resort's two-story Beach Club, find your zen at the Yoga Pavilion and treat yourself to a spa treatment in one of 10 traditional huts at Fehi Spa, featuring an extensive wellness menu that’s sure to leave you feeling rested and rejuvenated.\n\nThe resort's prime location on the UNESCO World Heritage-listed Baa Atoll Biosphere Reserve provides a pristine setting for myriad of water activities, from kayaking to windsurfing, paddle boarding and snorkelling. Love to keep fit? Practice your swing at the indoor golf studio, work up a sweat at the state-of-the-art fitness centre or embrace your creativity at the Art Studio.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Seaside Finolhu Baa Atoll Maldives",
    "offer_address": "Kanufushi Island, Hithaadhoo, Maldives",
    "percentage_discount": 51.0,
    "min_duration": null,
    "max_duration": null,
    "price": 9789.0,
    "value": 19869.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000crO8sQAE",
    "hero_image": "https://images.luxuryescapes.com/c4r1sf80vhfn9gksfhok",
    "image_two": "https://images.luxuryescapes.com/0so5jx90d851m2aahe4",
    "image_three": "https://images.luxuryescapes.com/25viewo0euptexdecwpnf",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "LAST CHANCE - OUR MOST POPULAR DEAL EVER: Award-Winning Finolhu, All-Inclusive Overwater Luxury with Speedboat Transfers and Return Flights from Malé",
    "description": "Surrender to tropical island life with an all-inclusive, overwater stay at the stylish Finolhu, cradled by the crystalline lagoon waters and white sands of the Maldives’ Baa Atoll UNESCO Biosphere Reserve. Experience the quintessential Maldives escape at the winner of the 2018 Best Luxury Beach Retreat in the Indian Ocean Islands at the World Luxury Hotel Awards and enjoy a carefree getaway with domestic plane and speedboat transfers from Malé, all-inclusive meals including daily breakfast, lunches and dinners, three upgraded dining experiences, unlimited alcoholic and soft drinks, access to the famous Beach Club and the use of snorkelling equipment to explore the underwater nirvana that surrounds. Travel in luxury with upgraded return seaplane transfers available as an add-on to your package at check-out.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Finolhu JUL19",
    "offer_address": "Kanufushi Island Baa Atoll, Maldives",
    "percentage_discount": 48.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 3689.0,
    "value": 7147.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LnryAAC",
    "hero_image": "https://images.luxuryescapes.com/8bad1hzajoqgwrdlhgm",
    "image_two": "https://images.luxuryescapes.com/u5g2ihh55sdpk2hffgk",
    "image_three": "https://images.luxuryescapes.com/1mammbqwkda21y5vd318",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "Award-Winning Finolhu is Back: All-Inclusive Overwater Luxury with Seaplane Transfers from Malé",
    "description": "One of our best deals ever is back: surrender to tropical island life with an all-inclusive, overwater stay at Finolhu Maldives. Arrive to stunning vistas of the Baa Atoll UNESCO Biosphere Reserve's crystalline lagoon and white sands with scenic seaplane transfers from Malé included in your package (available for arrivals before 3pm).\n\nTreat yourself to the quintessential Maldives experience in an overwater Lagoon Villa at this multi-award-winning resort, with a stay including all-inclusive dining and a standard drinks package (daily breakfast, lunch and dinner, three upgraded dining experiences and unlimited select alcoholic and soft drinks), access to the famous Beach Club, and use of snorkelling equipment to explore the Maldives' underwater nirvana. Plus, enjoy a 'Snorkelling Express' excursion on the resort's house reef or a pre-sunset 'Dolphin Cruise' once during your stay.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Seaside Finolhu Baa Atoll Maldives",
    "offer_address": "Kanufushi Island, Hithaadhoo, Maldives",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 3599.0,
    "value": 8418.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LeSJAA0",
    "hero_image": "https://images.luxuryescapes.com/pqew5hwa4slo2kx7k4e2",
    "image_two": "https://images.luxuryescapes.com/x2hoxiyvmn15basw8s2b",
    "image_three": "https://images.luxuryescapes.com/b6xpen72eehaklklk2oq",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "Award-Winning Finolhu All-Inclusive Overwater Luxury with Return Domestic Flights from Malé",
    "description": "Surrender to tropical island life with an all-inclusive, overwater stay at stylish Finolhu, surrounded by the crystalline lagoon waters and white sands of the Maldives’ Baa Atoll UNESCO Biosphere Reserve.\n\nTreat yourself to a quintessential Maldives experience at this multi-award-winning resort and enjoy a carefree escape with domestic plane and speedboat transfers from Malé, an all-inclusive dining and standard drinks package (including daily breakfast, lunch and dinner, three upgraded dining experiences and unlimited select alcoholic and soft drinks), access to the famous Beach Club and use of snorkelling equipment to explore the Maldives' underwater nirvana.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Seaside Finolhu Baa Atoll Maldives",
    "offer_address": "Kanufushi Island, Hithaadhoo, Maldives",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 3719.0,
    "value": 7919.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EgEcAAK",
    "hero_image": "https://images.luxuryescapes.com/z5v8dpwemgdvxk13t7hb",
    "image_two": "https://images.luxuryescapes.com/nvhbignuovjda63mtkkd",
    "image_three": "https://images.luxuryescapes.com/cfpcjnld0g7qk5vlsk7b",
    "vendor_name": "Seaside Finolhu Baa Atoll Maldives",
    "title": "Grand Reopening: All-Inclusive Seaside Finolhu Maldives Overwater Luxury with Seaplane Transfers from Malé",
    "description": "One of our best deals ever is back: surrender to tropical island life with an all-inclusive, overwater stay at Seaside Finolhu Maldives, a heavenly playground in the heart of the Maldives - now bigger and better than ever following an extensive transformation in late 2020. Ranked in the top 10% of all hotels and resorts worldwide in Tripadvisor's Travellers' Choice Awards in 2021 for the second year in a row, Seaside Finolhu is the first Maldives property to be part of the prestigious Design Hotels group. Dine in one of four exceptional beachside restaurants and check out the two-storey Beach Club, which operates day and night to entertain guests with live music, movie nights, and weekly White Party sundowners. In the heart of the resort, the dancefloor comes alive with vivid light shows, live DJs and jaw-dropping performances by world-class resident performance artists. A comprehensive library can be found upstairs above the Beach Bar - a quiet space which opens to an outdoor shisha lounge for those seeking some downtime. Practise your swing at the brand-new, state-of-the-art indoor golf studio, stretch it out in the Yoga Pavilion or hit the gym. When you're ready to indulge in some pampering, treat yourself to a spa treatment in one of 10 pastel-coloured treatment huts at Fehi Spa - an island-themed spa that’s sure to leave you feeling rested and rejuvenated.\n\nThis is the quintessential Maldives paradise you’ve always dreamed of. The resort is located across four islands in the UNESCO-protected Baa Atoll Biosphere Reserve, where you can soak up views of a crystalline lagoon and long, secluded stretches of white sand. A variety of water activities means you can make the most of your time here: from kayaking to windsurfing, paddle boarding, jet skiing, diving and snorkelling - take your pick. Succumb to absolute indulgence on this once-in-a-lifetime escape to one of the most spectacular destinations on Earth.\n\n**Your handpicked inclusions:**\n\n- Arrive to vistas of the Baa Atoll Biosphere Reserve with roundtrip seaplane transfers from Malé\n- All-inclusive standard dining package: daily breakfast at Beach Kitchen, plus lunch and dinner at Beach Kitchen\n- All-inclusive standard drinks package: unlimited, free-flow select alcoholic and soft drinks\n- An upgraded dinner at the award-winning Asian-inspired restaurant Kanusan, once during your stay\n- An upgraded beachfront dinner featuring North African cuisine at Arabian Grill, once during your stay\n- An upgraded seafood lunch at the award-winning Crab Shack, once during your stay\n- US$50 per adult, per day, and US$25 per child, per day, towards additional à la carte dining at Crab Shack, Kanusan or Arabian Grill\n- Enjoy a 30% discount on premium drinks, served by the glass only\n- Relax, knowing green tax charges are included (excludes extra guests)\n- One child aged 11 and under stays free with all-inclusive drinks and dining (transfers and green tax not included)\n\n**Travelling with friends or family?** Upgrade to a Two-Bedroom Water Villa package for up to four guests and enjoy direct ocean access and a private eight-metre infinity pool.\n\n**Book with 100% Confidence:** If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Baa Atoll",
    "offer_geo_area_level_2": "Kanifushi",
    "location_heading": "Kanufushi Island",
    "location_subheading": "Maldives",
    "location_description": "Seaside Finolhu Baa Atoll Maldives",
    "offer_address": "Kanufushi Island, Hithaadhoo, Maldives",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 30,
    "price": 3899.0,
    "value": 7861.0
  }
]