[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005G7VWAA0",
    "hero_image": "https://images.luxuryescapes.com/bk3p1xn497gxwltrorti",
    "image_two": "https://images.luxuryescapes.com/1ijjxkwipndfjh7gg97",
    "image_three": "https://images.luxuryescapes.com/pdwvi7wqr9wiwjb7l4w",
    "vendor_name": "Schloss Roxburghe",
    "title": "Historic Scotland Country Estate with Championship Golf Course",
    "description": "Step back in time and discover Scottish countryside elegance with a well-deserved escape at SCHLOSS Roxburghe Hotel & Golf Course in Kelso - an imposing Georgian mansion formerly owned by the Duke of Roxburghe. Surrounded by beautifully kept gardens, mature woodland and manicured lawns, this laidback luxury hotel exudes elegance: from the grand open fireplaces and lofty ceilings to the natural stone and oak panelling and decorative stucco on the ceilings and walls. Highlighting the history of this time-honoured building, Scottish tartans, colours and patterns blend effortlessly with beautiful textiles to unite timeless elegance with contemporary design.\n\nFacilities include restaurants and bars serving sustainable fare and old-world wines, an immaculate 18-hole, championship golf course, and countless outdoor activities, from country sports to fly-fishing. When you're not making the most of the stunning hotel and its grounds, embrace the charms of market town Kelso and the Scottish Borders. Take in more impressive architecture with visits to Floors Castle & Gardens and Kelso Abbey, or go for a wholesome walk by Yetholm Loch.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "Scotland",
    "offer_geo_area_level_2": "Kelso",
    "location_heading": "Kelso",
    "location_subheading": "Scotland",
    "location_description": "SCHLOSS Roxburghe Hotel & Golf Course",
    "offer_address": "Heiton, Kelso TD5 8JZ, United Kingdom",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 28,
    "price": null,
    "value": null
  }
]