[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvHfvQAF",
    "hero_image": "https://images.luxuryescapes.com/lwjaer9e493b1lxycvfr",
    "image_two": "https://images.luxuryescapes.com/rao0yxaxbpvyg0ty3n6w",
    "image_three": "https://images.luxuryescapes.com/secvqmgsvbgoi6n2altv",
    "vendor_name": "Mai Khao Lak Beach Resort and Spa",
    "title": "Beachfront Thailand Escape",
    "description": "Brilliant family getaway (up to three kids stay free) or a perfect couples escape!  Eight nights of beachfront fun at Mai Khao Lak Resort & Spa, featuring one of Thailand’s longest pools and waterparks for the kids. Enjoy daily buffet breakfasts, airport pickup, four spa treatments, two exotic dining experiences, Thai family cooking class, mocktail making class, cocktail each in the adults-only zone, ice cream or frappe each, kids’ club access and late 2pm checkout. Lots of exciting upgrade options as well, at the adults-only wing with swim-up bar, or waterpark zone.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Mai Khao Lak Beach Resort & Spa OLD",
    "offer_address": "9/16-17 Phetchakasem Rd, Moo. 1, Pakweep Beach,, Khaolak, Phang-nga 82190, Thailand",
    "percentage_discount": 66.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 627.0,
    "value": 1837.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlGGAA0",
    "hero_image": "https://images.luxuryescapes.com/3zac8rqpkk2tfegpm1f2",
    "image_two": "https://images.luxuryescapes.com/4j41m07kdtdbg8hrcar4",
    "image_three": "https://images.luxuryescapes.com/twsgc14qn8g0b8g82b3y",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Beachfront Escape with Gourmet Dining & Nightly Free-Flow Cocktails",
    "description": "Experience a stunning beachfront escape in Khao Lak at the highly acclaimed The Sands by Katathani, an enchanting oasis for couples and families and one of our most popular Thailand deals. Enjoy daily buffet breakfast, daily access to The Sands Luxury Club with nightly free-flow cocktails from 7pm to 8pm, a choice of one 30-minute massage per adult or a cooking class for two or one dinner for two, a convenient airport pick-up and a late 4pm checkout (subject to availability).\n\n**Staying longer in this paradise?** Indulge with even more massages and dining inclusions.\n\n**Travelling with children?** Pick the Family Upgrade for two adults and two kids (aged 11 years and under).",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani - 2020",
    "offer_address": "10/18 Petchkasem rd., Moo 7 Kukkak, Kukkak, Takua Pa District, Phang-nga 82190, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 619.0,
    "value": 1879.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C5dwoAAB",
    "hero_image": "https://images.luxuryescapes.com/j4cq61t27slgtp0tq8",
    "image_two": "https://images.luxuryescapes.com/0zmqy9eax2x436gk7f9",
    "image_three": "https://images.luxuryescapes.com/uezflgnotx51qvs347hm",
    "vendor_name": "Moracea by Khao Lak Resort",
    "title": "Khao Lak Beachfront Oasis with Daily Breakfast & Guaranteed Room Upgrade",
    "description": "Stunning beachfront luxury awaits you at the deluxe Moracea by Khao Lak Resort, a spectacular private resort elevated on a hillside gently sloping towards golden sands. Surrounded by lush greenery for a rainforest feel, the modern resort boasts a tranquil spa, outdoor pools, a vibrant swim-up bar and a glamorous restaurant with stunning sunset views. With a design incorporating traditional Thai elements with a contemporary twist, Moracea by Khao Lak Resort is the ideal secluded island escape.\n\nTrek the depths of Khao Lak National Park, float through the jungle on a bamboo raft, or grab your snorkelling gear and explore the nearby Similan Islands, filled with stunning coral reefs and exciting marine life. Head back after a long day of travelling for a cocktail and breathtaking sunset vistas.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Moracea by Khao Lak Resort",
    "offer_address": "26/20 Khuekkhak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 314.0,
    "value": 745.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DOdwcAAD",
    "hero_image": "https://images.luxuryescapes.com/it75mnllhkkqphnxob6j",
    "image_two": "https://images.luxuryescapes.com/fceu1e6bss3lylfj7644",
    "image_three": "https://images.luxuryescapes.com/r3b48pi7ulxmkcggh4k5",
    "vendor_name": "The Anda Mani Khaolak Beachfront Villas",
    "title": "Secluded Khao Lak Beachfront Luxury with Daily Breakfast, Dinner & Cocktails",
    "description": "Succumb to the enchanting call of Thailand's Andaman Sea with a stay at The Anda Mani Khaolak Beachfront Villas. Nestled amid lush tropical gardens, this boutique resort offers direct access to the pristine sands of Khao Lak beach, while sitting just moments from Khao Lak village. Unrivalled hospitality means your every whim is catered for - start the day with a delicious breakfast at The Kitchen by The Anda Mani, take your pick of a sumptuous lunch or dinner and sip on a cocktail as the sun sets.\n\nVenture out via speedboat to explore the stunning Similan Islands, renowned for their vibrant marine life and crystal-clear waters, or sample authentic Thai cuisine at the local eateries at the Bang Niang Market. Back at the resort, unwind in your tranquil oasis, complete with high-end amenities and breathtaking views of the ocean beyond.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Thai Mueang",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Anda Mani Khaolak Beachfront Villas",
    "offer_address": "7/9 Moo 2, Laem Kaen, Thai Mueang District, Phang Nga 82210, Thailand",
    "percentage_discount": 74.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 899.0,
    "value": 3447.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dq9GWAAZ",
    "hero_image": "https://images.luxuryescapes.com/vuhc1ew5i4vjnn7w5x",
    "image_two": "https://images.luxuryescapes.com/veit6fwhkdcieorgmr4b",
    "image_three": "https://images.luxuryescapes.com/2o1dm3l7btpjcc78xrhq",
    "vendor_name": "JW Marriott Khao Lak Resort and Spa",
    "title": "Bestselling JW Marriot Khao Lak Luxury with Southeast Asia's Longest Pool & All-Inclusive Dining (Select Packages Only)",
    "description": "Our bestselling Thailand resort is back - the five-star JW Marriott Khao Lak Resort & Spa has it all. Situated on one of the best beachfronts in Thailand, the gentle ocean waves are a perfect complement to the meandering curves of one of Southeast Asia’s longest pools. Choose a Pool Access room and dive from your private terrace straight into the shimmering waters, where you could spend hours swimming and never run out of room in the 2.4-kilometre-long pool. The resort is smartly designed to allow privacy and serenity with plenty of dedicated adults-only areas, while families have their own space with waterslides, a wave pool and the Bamboo Shark Nursery and Conservation Centre.\n\nElevate your resort escape with access to incredible culinary delights and fantastic service across a variety of chic eateries. Enjoy breakfast at one of Southern Thailand's most acclaimed buffets -featuring classic Western dishes as well as Asian favourites like bottomless dumplings - savour lunch overlooking the pool and devour dinner at your choice of three mouthwatering restaurants, choosing Italian favourites at Olive, traditional Thai specialties at Ta-Krai, Japanese classics at Sakura or international fare at the Beach Bar. Among all that delicious food, don’t forget to sample a few expertly prepared cocktails at one of the two swim-up bars during happy hour.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "JW Marriott Khao Lak Resort & Spa",
    "offer_address": "41/12 Moo 3 Khuk Khak, Khao Lak, Takua Pa District, Phang-nga 82220, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 8,
    "max_duration": 39,
    "price": 1524.0,
    "value": 95.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AaXy5AAF",
    "hero_image": "https://images.luxuryescapes.com/tguflig867wfyne7c9o",
    "image_two": "https://images.luxuryescapes.com/1ipfgh0wequoq2b6hv3",
    "image_three": "https://images.luxuryescapes.com/awz8mnnrsbnnogdnkcg",
    "vendor_name": "Outrigger Khao Lak Beach Resort",
    "title": "Grand Reopening: Khao Lak Outrigger Beachfront Oasis with Massages, Gourmet Dining, Daily Breakfast & Nightly Free-Flow Drinks",
    "description": "Set amid a luscious backdrop of forested headlands and the palm-fringed sands of Bangsak Beach lies your next tranquil escape - the newly reopened Outrigger Khao Lak Beach Resort. Anyone yearning for an escape will love this peaceful gem - a recently renovated, spacious haven overlooking the azure waters of the Andaman Sea, boasting all the luxuries guests have come to expect from the Outrigger brand.\n\nFeaturing a beautiful lagoon swimming pool, the Massage Sala by the Beach and two restaurants serving up international cuisine with a locally inspired twist, this property has been perfectly designed to cater to everyone’s version of paradise - and even includes a kids' club to keep the little ones entertained. Located only 15 minutes from the vibrant Khao Lak Village and the colourful shopping and dining options of Bangsak and within easy reach of watersports and local attractions, there's no better base for your Thailand adventure.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Outrigger Khao Lak Beach Resort",
    "offer_address": "2/4 Moo 8, Bangmuang, Takuapa, Phang Nga, 82190, Thailand",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 857.0,
    "value": 1983.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IE3uIAG",
    "hero_image": "https://images.luxuryescapes.com/f9kc1b1oz8gkyo7bact",
    "image_two": "https://images.luxuryescapes.com/fn0zpr6allcnduasygc",
    "image_three": "https://images.luxuryescapes.com/il1g55yey8heqs3vd8i9",
    "vendor_name": "Moracea by Khao Lak Resort",
    "title": "Khao Lak Beachfront Retreat with Daily Breakfast & Nightly Cocktails",
    "description": "Jungle meets the beach at this slice of paradise, where turquoise waves kiss golden sands just steps from your room. Surrounded by tropical greenery, Khao Lak awaits you at this sprawling resort elevated on a hillside. Moracea by Khao Lak Resort boasts a fantastic spa, outdoor pools, a vibrant swim-up bar and a casual beach restaurant with stunning sunset views.\n\nHaggle for treasures at nearby Bang Niang's buzzing night market, chase waterfalls in Khao Lak-Lam Ru's lush rainforest, dive into an underwater wonderland at the Similan Islands or take a sobering journey through history at the Tsunami Memorial. This modern resort is the ideal flop-and-drop island escape.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Moracea by Khao Lak Resort",
    "offer_address": "26/20 Khuekkhak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 299.0,
    "value": 955.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csezpQAA",
    "hero_image": "https://images.luxuryescapes.com/4951a0zgh7vcp4epbef",
    "image_two": "https://images.luxuryescapes.com/25ilzbmp190x50z9p64l",
    "image_three": "https://images.luxuryescapes.com/llwn9hffyjylh95u8jo",
    "vendor_name": "JW Marriott Khao Lak Resort and Spa",
    "title": "Beachfront Thailand Escape with All-Inclusive Dining",
    "description": "Experience beachfront bliss at one of our favourite Thailand resorts, staying at the five-star JW Marriott Khao Lak Resort & Spa, winner of Best Luxury Private Beach Resort in Asia, at the 2018 World Luxury Hotel Awards and named Best Resort for Families, Asia, 2019 at the Condé Nast Johansens Awards for Excellence. Enjoy eight nights in a Deluxe Lagoon Pool View Room with all-inclusive meals, including daily buffet breakfast, indulgent seaside lunch and nightly three-course dinners at one of four restaurants, plus indulge with one spa treatment each, an airport pickup and more. Ideal for families, two children (aged 11 and under) stay for free, with airport transfer and meals included!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "JW Marriott Khao Lak Resort & Spa - Aug 2019",
    "offer_address": "41/12 Moo 3, Khuk Khak Khuk Khak, 82, Takua Pa District, Phang-nga 82220, Thailand",
    "percentage_discount": 61.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 1229.0,
    "value": 3126.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxXUeQAN",
    "hero_image": "https://images.luxuryescapes.com/kdqg3w8fzykwv6ngnwjc",
    "image_two": "https://images.luxuryescapes.com/kh3vbjodffjv8ps46ygo",
    "image_three": "https://images.luxuryescapes.com/r9uwpfbmhcg1i95pwpob",
    "vendor_name": "Seaview Resort Khao Lak",
    "title": "Thailand Beachfront Escape - Centara Seaview Resort Khao Lak",
    "description": "Escape to Centara Seaview Resort in Thailand's beautiful Khao Lak. Located on Nang Thong Beach you'll have access to the stunning beach and blue waters of the Andaman sea, as well as being in the heart of Khao Lak. Enjoy daily breakfasts, choice of daily lunches or nightly dinners, a daily cocktail, massages and complimentary kids' club.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Centara Seaview Resort Khao Lak - OLD*",
    "offer_address": "18/1 Moo 7 Nang Thong Beach Khao Lak, Phang-nga 82190",
    "percentage_discount": 66.0,
    "min_duration": 8,
    "max_duration": 12,
    "price": 448.0,
    "value": 1319.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqV6rAAF",
    "hero_image": "https://images.luxuryescapes.com/3laz7nuvkig4yf4guu6o",
    "image_two": "https://images.luxuryescapes.com/9x43w302bnfvwsppw167",
    "image_three": "https://images.luxuryescapes.com/p9zv7ffmtxprh9qo22",
    "vendor_name": "X10 KhaoLak Resort",
    "title": "Thailand Beachside Khao Lak Retreat with Cocktails, Massages & Daily Breakfast",
    "description": "Embrace the tranquillity of a tropical Thailand escape at X10 Khaolak Resort, perfectly located on golden sands overlooking the crystal-clear waters of the Andaman Sea. It might take you a day just to explore the five spectacular swimming pools, let alone the extensive treatments available at The Sun Spa or the gourmet delights at The Main Restaurant and the Seaside Seafood Kitchen. All the while, you will fall in love with the pristine beaches and stunning waters of the Bang La On coastline. Just down the road from the Bang Niang Market, the resort is perfectly placed to discover both the glittering waters of the ocean and the culture found in the nearby Thai villages set against lush green mountains.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "X10 Khaolak Resort",
    "offer_address": "38/9 Moo 6, Petchakasem Road, Khuk Khak, Takuapa, Phangnga, Khao Lak 82220, Thailand",
    "percentage_discount": 48.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 335.0,
    "value": 641.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IctpRAAR",
    "hero_image": "https://images.luxuryescapes.com/9j9jebjo9dgjvjaidg8v",
    "image_two": "https://images.luxuryescapes.com/vkwj14wifr8upqigotwo",
    "image_three": "https://images.luxuryescapes.com/jtcwg3wf0jw0yz48u8cp",
    "vendor_name": "X10 KhaoLak Resort",
    "title": "Contemporary Beachside Khao Lak Retreat with Daily Breakfast, Massages & One-Time Dinner",
    "description": "Crystal-clear waters and breezy palm-lined stretches of golden sands await you at this Thai tropical oasis, perched along the shores of the Andaman Sea. It might take you a day just to explore the five spectacular swimming pools, let alone the extensive treatments available at The Sun Spa or the gourmet delights at The Main Restaurant and the Seaside Seafood Kitchen. \n\nAll the while, you can soak up the stunning waters and pristine beaches of the Bang La On coastline. A short drive from the vibrant Bang Niang Market, the resort is perfectly positioned to discover both the glittering waters of the ocean and the culture found in the nearby Thai villages set against lush green mountains.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "X10 Khaolak Resort",
    "offer_address": "38/9 Moo 6, Petchakasem Road, Khuk Khak, Takuapa, Phangnga, Khao Lak 82220, Thailand",
    "percentage_discount": 48.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 329.0,
    "value": 631.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BfutMAAR",
    "hero_image": "https://images.luxuryescapes.com/9ziorg0t3k3yczstakgo",
    "image_two": "https://images.luxuryescapes.com/w991dvp2o8vtmycuyitk",
    "image_three": "https://images.luxuryescapes.com/4pffmo9cjne95j5xrvi",
    "vendor_name": "Le Menara Khao Lak",
    "title": "Secluded Oceanfront Khao Lak Paradise Retreat with Daily Dining, Massages & Thai Cooking Class",
    "description": "Surrounded by lush jungle and kissed by the shining waters of the Andaman Sea, Le Menara Khao Lak offers guests a family-friendly escape in one of Thailand’s most breathtaking regions. Located on the secluded sweeping shores of Bang Lut Beach - just an hour’s drive from Khlong Phanom National Park’s spectacular limestone mountain ranges - the resort’s authentic, village-inspired layout is backed by timeless French sophistication. Savour open-air dining with magnificent seaside views at L’Amore Restaurant, head to Le Sea Restaurant and Bar for aperitifs and exquisitely barbecued seafood or simply laze the evening away by the resort’s mirage-like central pool.\n\nWhen you’re ready to explore, Khao Lak’s countless treasures await. Venture out Khao Sok National Park to discover breathtaking mountain lake vistas and the oldest evergreen rainforest in the world, surf and splash the day away in Khao Lak’s emerald waters or travel just 90-minutes south to Phuket to discover the island’s vibrant collection of marketplaces, sanctuaries and unforgettable nightlife.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Le Menara Khao Lak",
    "offer_address": "15 Moo 2 Bangmoung, Takua Pa District, Phang-nga 82190, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 1606.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gv5DUAAZ",
    "hero_image": "https://images.luxuryescapes.com/j43z3c9apdvvd6y8xgm",
    "image_two": "https://images.luxuryescapes.com/jnr1t4zy2rr47bgivplg",
    "image_three": "https://images.luxuryescapes.com/oypbwjf00b8t32h0m4w",
    "vendor_name": "Bangsak Village Khao Lak",
    "title": "Romantic Khao Lak Beachfront Getaway with Daily Breakfast, Daily Lunch or Dinner, Cocktails & Massages",
    "description": "Experience the epitome of tropical tranquillity at Bangsak Village Khao Lak, a sanctuary nestled on the pristine shores of Thailand's Khao Lak. This boutique retreat, surrounded by lush palms, offers a serene beachfront setting, perfect for couples seeking a romantic escape. Unwind with rejuvenating treatments at the Kala Spa, savour a culinary journey at the terrace-style Rim Lae Bangsak Restaurant and bask in the panoramic ocean views from the infinity pool, complete with an integrated jacuzzi.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Bangsak Village Khao Lak",
    "offer_address": "1/1 Moo 8, Petchkasem Road, Bangmuang, Takuapa , Phang-nga, Khao Lak 82190, Thailand",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 31,
    "price": 359.0,
    "value": 889.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPaiiQAC",
    "hero_image": "https://images.luxuryescapes.com/wk162xr557pvqagwnq95",
    "image_two": "https://images.luxuryescapes.com/stlw50zj1ubhrktj6e8l",
    "image_three": "https://images.luxuryescapes.com/bxbw9hvu8ig2skhd21vo",
    "vendor_name": "ROBINSON Club Khao Lak",
    "title": "All-Inclusive Beachfront Luxury in Khao Lak",
    "description": "Skip Phuket and head to the unspoiled shores of Khao Lak where cobalt waters, national parks and 13 kilometres of beachfront await you. Experience an all-inclusive escape at Robinson Club Khao Lak featuring daily buffet breakfast, daily buffet lunch, nightly buffet dinner, unlimited free-flow drinks with all lunches and dinners, return private airport transfers, complimentary Kids' Club access for the little ones, complimentary group fitness classes and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Robinson Club Khao Lak - May 2019",
    "offer_address": "9 Moo 1, Tambol Kuk Kak, Khao Lak, Phang-nga 82190, Thailand",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 936.0,
    "value": 3103.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CNrMVAA1",
    "hero_image": "https://images.luxuryescapes.com/lub2p82f1hs8wsnrc6t",
    "image_two": "https://images.luxuryescapes.com/kpehddsfnsnz2m7mtz19",
    "image_three": "https://images.luxuryescapes.com/ertekrjk657v0w6hvw53",
    "vendor_name": "Graceland Khao Lak Resort and Spa",
    "title": "Beachfront Khao Lak Stay with Daily Dining, Nightly Cocktails & Entertainment Complex",
    "description": "Discover a world of family-friendly fun between Thailand’s rugged mountains and the shining Andaman Sea at Graceland Khao Lak Beach Resort, perfectly positioned on the region’s famed golden shoreline. Spend sun-kissed days swimming in fish-filled turquoise waters, sipping cocktails by the resort’s shimmering pool or exploring Lam Ru National Park's extraordinary sea cliffs and waterfalls. Head to Oceano for mouth-watering, open-kitchen steak and seafood, savour contemporary treatments at SEN Spa or spend time in the resort’s Entertainment Complex, which hosts karaoke rooms, snooker tables, a bowling alley and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Graceland Khaolak Beach Resort",
    "offer_address": "30/7 Moo 7, Bang Muang District, Amphur Takua-Pa, Phang Nga, 82000, Thailand",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 409.0,
    "value": 767.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Qu5gxQAB",
    "hero_image": "https://images.luxuryescapes.com/kln7tkdqumtoxo7nt918",
    "image_two": "https://images.luxuryescapes.com/hkcjx57gqojsuzocc2vq",
    "image_three": "https://images.luxuryescapes.com/fymilbdiqto46ooqamzw",
    "vendor_name": "The Leaf on The Sands by Katathani Resort",
    "title": "Iconic Katathani Escape in Khao Lak",
    "description": "Can’t pick between Thailand’s lush green tropical gardens and golden beaches? At the eco-friendly The Leaf on The Sands hotel, part of the iconic Katathani Collection, you don’t have to. This nature lovers’ paradise is set on a flatland surrounded by hundreds of tropical trees and plants and is located just a five-minute stroll from the beautiful Nang Thong beach. Daily breakfast, massages, beach club access and a complimentary cocktail will make this a relaxing break for the whole family.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Leaf on The Sands by Katathani - OLD",
    "offer_address": "40 Phetkasem Road Amphoe Takua Pa Tambon Khuekkhak Chang Wat Phang-nga 82190, Thailand",
    "percentage_discount": 85.0,
    "min_duration": 7,
    "max_duration": 12,
    "price": 191.0,
    "value": 1235.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009COcYAAW",
    "hero_image": "https://images.luxuryescapes.com/nrng3q8oit647mmn473p",
    "image_two": "https://images.luxuryescapes.com/vg3alk1vfdrv0s69xd4e",
    "image_three": "https://images.luxuryescapes.com/tzw11d0bohbfrmmc4co",
    "vendor_name": "Pullman Khao Lak Resort",
    "title": "Pullman Khao Lak Beachfront Escape with All-Inclusive Dining, Unlimited Drinks & Daily Massages",
    "description": "There are some experiences in life that should not be missed, and a heavenly stay at Pullman Khao Lak Resort should be at the top of your travel to-do list. Perfectly positioned facing the cool blue waters of the Andaman Sea, this beachfront resort will cater to your every need in true Pullman style. While there's plenty to discover beyond the hotel, this luxury oasis will entice you to stay and enjoy. Savour a fusion of flavours at Plai Dining Room and Kram Beach Club, or sip on a cocktail at The Hub Pool bar or The Junction, plunge into one of four aquamarine pools, visit the serene Rosalyn Spa, or raise your heart rate at the 24-hour Pullman FIT centre. Plus, little ones can race through the twin-looped water slide, or hang at the kids’ club.\n\nWhile the top-notch facilities make it difficult to tear yourself away from the serenity of the resort, the surrounding wonders reward those who choose to explore. For eager snorkellers or beach lovers, the gorgeous Similan and Surin islands are a must-visit, and for history enthusiasts, Takua Pa Old Town is located a short drive away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Pullman Khao Lak Resort",
    "offer_address": "46/109, Moo 2, Soi 46 Laem Son Takua Pa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1219.0,
    "value": 3182.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Fg6gHYAR",
    "hero_image": "https://images.luxuryescapes.com/v1d32doi49srf5dz2nki",
    "image_two": "https://images.luxuryescapes.com/o9radbgoxh5ri16yea5w",
    "image_three": "https://images.luxuryescapes.com/tuybmyl4v2kqyecyp3nk",
    "vendor_name": "X10 KhaoLak Resort",
    "title": "Beachfront Khao Lak Contemporary Oasis with Daily Breakfast, Massages & Cocktails",
    "description": "Crystal-clear waters and breezy palm-lined stretches of golden sands await at this tropical Thai oasis, perched along the shores of the Andaman Sea. Explore five spectacular swimming pools, extensive treatments available at The Sun Spa or gourmet delights at The Main Restaurant and Seaside Seafood Kitchen.\n\nSoak up the stunning waters and pristine beaches of the Bang La On coastline. A short drive from the vibrant Bang Niang Market, the resort is positioned to discover both the glittering waters of the ocean and the dynamic culture found in the nearby Thai villages set against lush mountains.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "X10 Khaolak Resort",
    "offer_address": "38/9 Moo 6, Petchakasem Road, Khuk Khak, Takuapa, Phangnga, Khao Lak 82220, Thailand",
    "percentage_discount": 48.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 302.0,
    "value": 578.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000QdNviAAF",
    "hero_image": "https://images.luxuryescapes.com/o9pcxvgh3okr9dj4h4df",
    "image_two": "https://images.luxuryescapes.com/zrfqiowmngkbxjytqe6t",
    "image_three": "https://images.luxuryescapes.com/w4rfe05e5noma7ze0dqh",
    "vendor_name": "JW Marriott Khao Lak Resort and Spa",
    "title": "All-Inclusive JW Marriott Khao Lak Beachfront Escape",
    "description": "Experience beachfront bliss in Thailand with an all-inclusive stay at the award-winning five-star JW Marriott Khao Lak Resort & Spa (fly in to Phuket). Enjoy eight nights in a Deluxe Lagoon Pool View Room with all meals including daily buffet breakfasts, indulgent seaside lunches and nightly multi-course dinners. Plus, indulge with two spa treatments to share, an airport pickup and more for two adults and up to two kids (aged 11 years and under) stay free.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "JW Marriott Khao Lak Resort & Spa - OLD",
    "offer_address": "41/12 Moo 3, Khuk Khak, Takuapa, Phang Nga 82190, Thailand",
    "percentage_discount": 54.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 1295.0,
    "value": 2822.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bi73WQAQ",
    "hero_image": "https://images.luxuryescapes.com/4m320f73vm8n8246g0v",
    "image_two": "https://images.luxuryescapes.com/4rjl9ltyta44g7x6mxp2r",
    "image_three": "https://images.luxuryescapes.com/j77d0gkojfzxpqm619in",
    "vendor_name": "Devasom Khao Lak Beach Resort & Villas",
    "title": "Grand Opening: Experience Khao Lak’s Spectacular New Beachfront Hotel with Incredible Dining Inclusions",
    "description": "Discover the natural beauty of Thailand staying at the newest hotel in Khao Lak: the brand-new Devasom Khao Lak, nestled between a natural lagoon and one of the country's most stunning sunset beach. This intimate new property joins Devasom’s ever-expanding list of boutique, multi-award-winning resorts. Savour the flavours of Thai-western fusion with daily breakfast and your choice of either daily lunch or nightly dinner included in your escape. You will also enjoy one daily cocktail per adult, two 30-minute massages each, a one-way airport transfer and a complimentary mini-bar, replenished daily.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Devasom Khao Lak.",
    "offer_address": "Devasom Khao Lak Co., Ltd 79 Moo 3, Khuk Khak, Takuapa, Phang-Nga, Thailand 82220",
    "percentage_discount": 67.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 883.0,
    "value": 2700.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R91rgQAB",
    "hero_image": "https://images.luxuryescapes.com/iojvsza5ntiulo4q46iw",
    "image_two": "https://images.luxuryescapes.com/kivfjg2mopex9gcbg5k0",
    "image_three": "https://images.luxuryescapes.com/rlrvifvv1zcldh36ccmu",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Thailand Ultimate Beachfront Haven With Brand New Aqua Wing",
    "description": "Spend eight or ten nights at the Sands Khao Lak by Katathani and discover the stunning multi-million dollar resort addition: the Aqua Wing. Enjoy daily buffet breakfasts, two multi-course or buffet dinners at a choice of five restaurants around Khao Lak (or try a Thai cooking class), four 30-minute massages to share, nightly free-flow cocktails between 19:00-20:00, private airport pick-up, super-late checkout, free Wi-Fi and more. Romantic couples options or fantastic family inclusions such as one child (2-11 years old) and one infant (2 and under) can stay free with breakfast and transfers included.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani - 2018",
    "offer_address": "10/18 Petchkasem rd., Moo 7 Kukkak, Kukkak, Takua Pa District, Phang-nga 82190, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 627.0,
    "value": 1947.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPFXRAA5",
    "hero_image": "https://images.luxuryescapes.com/k6gmj0ms7rmig0uqwpi",
    "image_two": "https://images.luxuryescapes.com/5lwc6ivw4tjot3qy522d",
    "image_three": "https://images.luxuryescapes.com/bngwjikqwczt1949se9",
    "vendor_name": "X10 KhaoLak Resort",
    "title": "Thailand Five-Star Khao Lak Beachside Retreat with Daily Breakfast & Roundtrip Airport Transfers",
    "description": "Embrace the tranquillity of a tropical Thailand escape at the five-star X10 Khaolak Resort, perfectly located on golden sands overlooking the crystal-clear turquoise waters of the Andaman Sea. It might take you a day just to explore the five spectacular swimming pools, let alone the extensive treatments available at The Sun Spa or the gourmet delights at The Main Restaurant and the Seaside Seafood Kitchen. All the while, you’ll fall in love with the pristine beaches and stunning waters of the Bang La On coastline. Just down the road from the Bang Niang Market, the resort is perfectly placed to discover both the glittering waters of the ocean and the culture found in the nearby Thai villages set against lush green mountains.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "X10 Khaolak Resort",
    "offer_address": "38/9 Moo 6, Petchakasem Road, Khuk Khak, Takuapa, Phangnga, Khao Lak 82220, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 363.0,
    "value": 974.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LdaRAAS",
    "hero_image": "https://images.luxuryescapes.com/d66o5pdmsof12ieojlg",
    "image_two": "https://images.luxuryescapes.com/7wph3h28vx4t4lpa0u7e",
    "image_three": "https://images.luxuryescapes.com/fm9e3bd54j0oystenior",
    "vendor_name": "ROBINSON Club Khao Lak",
    "title": "All-Inclusive Khao Lak Beachfront Luxury",
    "description": "Head to the unspoiled shores of Khao Lak where cobalt waters, national parks and 13 kilometres of beachfront await you. Experience an all-inclusive escape at Robinson Club Khao Lak featuring daily buffet breakfast, daily buffet lunch, nightly buffet dinner, unlimited free-flow drinks with all lunches and dinners, airport pick-up on arrival and complimentary Kids' Club access for the little ones.\n\n**Travelling with kids?** Check out the Family Upgrade, valid for two adults and three children aged 11 years and under.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Robinson Club Khao Lak - 2020",
    "offer_address": "9 Moo 1, Tambol Kuk Kak, Khao Lak, Phang-nga 82190, Thailand",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 929.0,
    "value": 3067.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DR9T6AAL",
    "hero_image": "https://images.luxuryescapes.com/ogt6z4017t2f5m667c",
    "image_two": "https://images.luxuryescapes.com/zgu730eb9fi3jx1195ok",
    "image_three": "https://images.luxuryescapes.com/u3e8i7ntv96m261t7mmo",
    "vendor_name": "Grand Mercure Khao Lak",
    "title": "Khao Lak Beachfront Escape with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Experience the tropical oasis that is Grand Mercure Khao Lak Bangsak, a pristine hideaway ensconced in tropical gardens on Thailand's tranquil southwest coast. Inspired by traditional riverside Thai villages, this unique resort is centred on a picturesque, winding canal, lined by immaculate accommodation. Tucked away in Khao Lak, this palm-fringed oasis is the ideal spot for a true Thai beachside experience. The tranquil town offers fun in the sun, fine-dining restaurants and boutique shops, on a background of jungle-clad mountains - this quiet corner of the country ensures you will leave your Thailand escape feeling completely relaxed.\n\nBack at the resort, high-end amenities invite you to surrender to complete relaxation: enjoy an invigorating swim in the beachfront swimming pool, spoil yourself at the indulgent Pran Spa, or experience a fresh take on traditional Thai favourites at one of the two innovative onsite restaurants, Patio and Green Mango. Spend an afternoon sipping tropical cocktails at Soak Pool Bar, while the kids are entertained at the complimentary Manta Ray Kids' Corner before enjoying a stroll along the white-sand beach, located just moments away from the resort.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Grand Mercure Khao Lak Bangsak",
    "offer_address": "71 Moo 7, Bang Muang Takuapa District, Phang Nga 82190, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 1424.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FdYFSAA3",
    "hero_image": "https://images.luxuryescapes.com/cvc6wqi7dpkl0bzsg42o",
    "image_two": "https://images.luxuryescapes.com/1ej4gv4kqnmgc0g7lni",
    "image_three": "https://images.luxuryescapes.com/scnq18qvfh45uge089x",
    "vendor_name": "Beyond Resort Khao Lak",
    "title": "Serene Adults-Only Khao Lak Beachfront Villa Escape with Daily Breakfast, Dinners, Cocktails & Massages",
    "description": "Escape the crowds with a blissful stay at Beyond Resort Khao Lak, an all-villa beachfront resort set on the pearly-white sands of Pak Weep Beach. Tucked on the serene coast of Phang Nga, around an 80-minute drive from Phuket, this palm-fringed oasis invites you to surrender to complete relaxation. Enjoy an invigorating swim in the oceanfront swimming pool, spoil yourself at the indulgent Kanda Spa or explore the tropical waters on a sea kayak or stand-up paddleboard while surrounded by unspoiled nature and verdant tropical greenery.\n\nKhao Lak is the ideal spot for an authentic Thai beachside experience, with guests spoiled with fun in the sun while staying in a quieter corner of the country. Onsite fine-dining restaurants await to cater to any appetite, whether you dine on succulent seafood under the thatched roof of @Beach Bar and Restaurant, tuck into a flame-seared steak at Motown On Fire or enjoy a refreshing poolside drink in the tropical sun. Outside the resort, guests can find lush waterfalls, markets and monuments, as well as a host of deep sea activities - think world-class snorkelling, surfing and scuba diving.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Beyond Resort Khaolak",
    "offer_address": "9/69 Moo 1, Pak Weep Beach, Khuk Khak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 1595.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPJrfQAG",
    "hero_image": "https://images.luxuryescapes.com/oioblxhwlf835nokbwa7",
    "image_two": "https://images.luxuryescapes.com/eapqxrxy6fv8ovdm0eam",
    "image_three": "https://images.luxuryescapes.com/okvymwcxalr1xh0ie4t4",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Ultimate Beachfront Haven with Massages and Nightly Cocktails",
    "description": "Spend eight or ten nights at the Sands Khao Lak by Katathani and discover the stunning multi-million dollar Aqua Wing. Enjoy daily buffet breakfast, two multi-course or buffet dinners at a choice of five restaurants around Khao Lak (or try a Thai cooking class), four 30-minute massages to share, nightly free-flow cocktails between 19:00-20:00, private airport pick-up, free Wi-Fi and more. Romantic couples options and fantastic family inclusions available.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani - 2019",
    "offer_address": "10/18 Petchkasem rd., Moo 7 Kukkak, Kukkak, Takua Pa District, Phang-nga 82190, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 630.0,
    "value": 1912.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HzH8IAK",
    "hero_image": "https://images.luxuryescapes.com/ddxcr7acv3ocqacrjqo",
    "image_two": "https://images.luxuryescapes.com/ahqepflirnglb8veicxs",
    "image_three": "https://images.luxuryescapes.com/de9z2k92aqjgr899tazs",
    "vendor_name": "Pullman Khao Lak Resort",
    "title": "Khao Lak Beachfront Indulgence with Daily Breakfast, Nightly Dinner & Free-Flow Drinks",
    "description": "Facing the beyond-blue waters of the Andaman Sea and catering to your every whim in true Pullman style, this five-star resort should be at the top of your travel list. There's something for everyone here: little ones can race through waterslides or play at the Kids’ Club while parents sip on cocktails poolside.\n\nCure any craving at Plai Dining Room, where a fusion of flavours is served in a laid-back indoor-outdoor atmosphere. After plunging into one of two aquamarine pools or raising your heart rate at the 24-hour Pullman Fit centre, refresh with five hours of free-flow beers, spirits, cocktails, wine and soft drinks at Tharn Pool Bar (4pm-9pm daily). When tranquillity calls, visit Rosalyn Spa by Pullman Khao Lak for one of your four 60-minute Thai massages included per package.\n\nWhile top-notch facilities make it difficult to tear yourself away, the surrounding wonders invite exploration. For eager snorkelers or beach lovers, the gorgeous Similan and Surin islands are a must-visit, and for history enthusiasts, Takua Pa Old Town is just a short drive away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Pullman Khao Lak Resort",
    "offer_address": "46/109, Moo 2, Soi 46 Laem Son Takua Pa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 74.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 809.0,
    "value": 3166.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CP35cAAD",
    "hero_image": "https://images.luxuryescapes.com/hecjngc3kjsetghfnv",
    "image_two": "https://images.luxuryescapes.com/clcvm39x8joaiy39qon",
    "image_three": "https://images.luxuryescapes.com/j4otd4whe9zbzv5bpl28",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Extended by Popular Demand: Bestselling Khao Lak Beachfront Escape with Daily Breakfast & Nightly Free-Flow Cocktails",
    "description": "Sat amid a luscious forested headland and flowing onto the dazzling sands of Nang Thong Beach, The Sands Khao Lak by Katathani is your tranquil and secluded escape just minutes from the town’s main shopping strip and an hour from vibrant Phuket. You need stray no further than the resort, as each wing is carefully crafted to cater to your need for rest, rejuvenation or play, so you can discover everything this resplendent tropical retreat has to offer, including The Sands Luxury Club.\n\nUnwind across two pools, satiate any craving at your choice of three restaurants - including The Floating Market, overlooking the glistening lagoon - and sip drinks at four bars, all offering unique water vistas. Plus, there are distinct adults-only pool and garden areas, the Sands Castle kids' club and the pavilions of The Spa, which will embrace you with warm sea breezes and the scent of exotic flowers.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani",
    "offer_address": "10/18 Petchkasem rd. Moo 7 Kukkak Takuapa Phang Nga 82220, Thailand",
    "percentage_discount": 43.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 649.0,
    "value": 1137.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqMUGAA3",
    "hero_image": "https://images.luxuryescapes.com/6phsir0cvvd4k3598w79",
    "image_two": "https://images.luxuryescapes.com/mqnz3kjrzc4kx9dmp2du",
    "image_three": "https://images.luxuryescapes.com/5oxjp4wmc6z8i9m9mwsn",
    "vendor_name": "Devasom Khao Lak Beach Resort & Villas",
    "title": "Khao Lak Five-Star Beachfront Luxury with Massages, Daily Breakfast, Nightly Dinner + Nightly Cocktails",
    "description": "Where sea spray punctuates the air, the warm sun pokes its head around every corner and serenity radiates throughout; discover the essence of tranquil Thai luxury at Devasom Khao Lak Beach Resort & Villas. Expanding across three hectares of verdant coast and forest land, this pristine resort boasts plenty of opportunities for family-centred thrills, head-to-toe wellness and delicious coastal delights. Award-winning for a reason, making Tripadvisor’s Traveler’s Choice Best of the Best 2023 list, find five-star oceanfront opulence in abundance through the 69 rooms, suites and villas, which extend all the way to the semi-private shoreline.\n\nTucked away between a lagoon and Khao Lak’s famous sunset beach, enjoy easily tip-toeing directly to the stunning coastline, or venturing inland to explore the vibrant shopping and dining district on the resort’s shuttle. When you’re not soaking up the good vibes at the beach or in the sparkling pool, treat yourself to a pamper session at the resort’s own wellness centre. From nourishing breakfasts to moreish dinner dishes, experience exceptional Michelin-listed dining at one of the resort’s two incredible eateries.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Devasom Khao Lak Beach Resort & Villas",
    "offer_address": "79 Moo 3, Khuk Khak Beach, Takuapa, Phang Nga, Khao Lak 82220, Thailand",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1019.0,
    "value": 2387.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eLCPjQAO",
    "hero_image": "https://images.luxuryescapes.com/bxdjkx7kji4dua14q7m",
    "image_two": "https://images.luxuryescapes.com/8n16vpjyuo25c9tc913ir",
    "image_three": "https://images.luxuryescapes.com/6iu5gyw0jnkzfww4tjhs",
    "vendor_name": "The Waters Khao Lak by Katathani Collection",
    "title": "Adults-only Khao Lak Escape with Daily Breakfast, Cocktails and Massages",
    "description": "Splash in over 3,000 square metres of perfect turquoise pool when you stay at The Waters Khao Lak, part of the iconic Katathani Collection. Embrace tropical serenity at this adults-only resort located in Thailand’s popular Khao Lak area and boasting seven, sparkling pools surrounded by swaying palm trees. Your sun-kissed escape includes daily buffet breakfast, two set lunches or dinners during your stay, a daily 30-minute massage per room, daily cocktails, access to The Sands Beach Club with complimentary transfers as well as private one-way airport transfer from Phuket International Airport.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Waters Khao Lak by Katathani Collection - 2019",
    "offer_address": "67/238 Bang Niang Beach, Khuekkhak, Takua Pa District, Phang Nga 82190, Thailand",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 11,
    "price": 433.0,
    "value": 1269.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gdUOAAY",
    "hero_image": "https://images.luxuryescapes.com/1vendboa8897fd0n983s",
    "image_two": "https://images.luxuryescapes.com/scz5zixq5deeguie8tfs",
    "image_three": "https://images.luxuryescapes.com/zcm2jubleffj6wbr799r",
    "vendor_name": "The Haven Khao Lak",
    "title": "Five-Star Khao Lak Beachside Oasis with Daily Breakfast, Massages & Cocktails",
    "description": "Let your worries drift away at the spectacular Haven Khao Lak, an opulent resort located in a tranquil spot on the golden sands of Khuk Khak Beach, where privacy and comfort are valued above all else. Catering to guests 12 and older, this secluded oasis features an enormous 5,000sqm saltwater pool surrounded by verdant gardens, with the sapphire-blue ocean and a white-sand beach forming the backdrop to an indulgent escape. Pamper yourself with traditional Thai massages at Aqua Spa or indulge in a cocktail or two at Angel Wing Bar as you take in panoramic views of the Andaman Sea.\n\nAfter exploring every inch of this exquisite resort, take a romantic stroll down Khuk Khak Beach and visit the nearby night markets, local restaurants, and bars. If you're a watersports aficionado, practice your snorkelling skills at any of the neighbouring islands or at the impressive Phang Nga Bay (additional charges apply). Then, head back for a decadent dinner at the resort’s Vongole Restaurant, where you’ll be treated to the freshest daily catch of seafood creatively dished up in traditional Thai style or in classic Italian favourites.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Haven Khao Lak",
    "offer_address": "61/4 Moo 3 Khuk Khak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 659.0,
    "value": 1858.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2t9IAC",
    "hero_image": "https://images.luxuryescapes.com/df8wuozj1okulzgsygel",
    "image_two": "https://images.luxuryescapes.com/6k8ih3zfkk15bau52kok",
    "image_three": "https://images.luxuryescapes.com/4hn7o4i60pwnya5zyj4k",
    "vendor_name": "The Little Shore Khao Lak by Katathani",
    "title": "Brand-New Khao Lak Beachfront Pool Suites with Daily Breakfast, Nightly Dinner & Nightly Cocktails",
    "description": "Tucked away on the pristine Nang Thong Beach, this recently-opened resort beckons with signature Katathani luxury and a collection of contemporary suites, each featuring a sparkling private pool. \n\nDiscover the epitome of relaxation amid meticulously manicured resort gardens, savouring daily feasts at The Kati Restaurant, rejuvenating spa treatments at Nalinya Villa Spa and a delectable floating afternoon tea hand-delivered to your private pool.\n\nRenowned for delivering unforgettable experiences with impeccable service, Katathani’s newest beachfront paradise will undoubtedly solidify its status as one of Thailand’s most-loved resort families. \n\nFor those seeking adventure, Khao Lak’s local charm is just a stone’s throw away - explore bustling markets, sample mouthwatering street food or bask in lazy afternoons on the golden and black sands just steps from your luxurious accommodation.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Little Shore Khao Lak by Katathani",
    "offer_address": "10 Kukkak, 28 Phet Kasem Road, Tambon Khuekkhak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1079.0,
    "value": 3343.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RBDIUQA5",
    "hero_image": "https://images.luxuryescapes.com/l7jkxbjn1uckfinvotwz",
    "image_two": "https://images.luxuryescapes.com/k3mpib9xfssari1bo1iy",
    "image_three": "https://images.luxuryescapes.com/ya0gwoz6apccsv6xgynd",
    "vendor_name": "The Haven Khao Lak",
    "title": "Five-Star, Child-Free Thai Beach Oasis",
    "description": "Discover the romance of Thailand with eight nights at the five-star Haven Khao Lak Resort, the most luxurious child-free beach resort in Khao Lak (fly to Phuket). Stay in a Deluxe Room and enjoy daily buffet breakfasts, eight relaxing massages, two exotic dining experiences, poolside cocktails, private airport transfer, super-late checkout and more for two.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Haven Khao Lak 2018",
    "offer_address": "61/4 Moo 3 Khuk Khak Amphoe Takua Pa, Chang Wat Phang-nga 82220, Thailand",
    "percentage_discount": 52.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 637.0,
    "value": 1332.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjhiAAC",
    "hero_image": "https://images.luxuryescapes.com/8jcbnoh3c564a4wktviv",
    "image_two": "https://images.luxuryescapes.com/xbsygv7r2jhffl611xwi",
    "image_three": "https://images.luxuryescapes.com/er3u1tdm7nsmkjd0qmudr",
    "vendor_name": "JW Marriott Khao Lak Resort and Spa",
    "title": "Five-Star Beachfront Luxury with All-Inclusive Dining",
    "description": "Experience beachfront bliss at one of our favourite Thailand resorts: the five-star JW Marriott Khao Lak Resort & Spa, named Thailand's Leading Beach Resort for 2019 at the World Travel Awards and the winner of the Luxury Beach Retreat category at the 2019 World Luxury Hotel Awards.\n\nEnjoy a tropical escape with all-inclusive meals including daily buffet breakfast, indulgent seaside lunches and nightly three-course dinners at one of four restaurants, plus indulge with one massage per person and a convenient airport transfer. Bring the kids along: two children (aged 11 and under) stay for free, with airport transfer and meals included!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "JW Marriott Khao Lak Resort & Spa",
    "offer_address": "41/12 Moo 3 Khuk Khak, Khao Lak, Takua Pa District, Phang-nga 82220, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 1239.0,
    "value": 3293.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dcWc0QAE",
    "hero_image": "https://images.luxuryescapes.com/wugeprx6c6ykg7d2bik",
    "image_two": "https://images.luxuryescapes.com/ckwiw0hsdlf1astxlui",
    "image_three": "https://images.luxuryescapes.com/q6dyd7fgppb97e4khvje",
    "vendor_name": "Beyond Resort Khao Lak",
    "title": "Couples Beachfront Villa Escape with Nightly Cocktails",
    "description": "Treat yourself to a romantic escape at Beyond Resort Khao Lak, a tropical resort set on an idyllic beachfront location on the white sands of Pak Weep Beach. Surrender to complete relaxation on this palm-fringed escape and indulge with daily buffet breakfast, two exotic buffet dinners, a daily cocktail or beer, two 30-minute massages per person, an invite to the resort’s exclusive management cocktail event with free-flow drinks and canapés, a Thai cooking class followed by lunch and a convenient airport pick up on arrival from Phuket.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Beyond Resort Khao Lak - 2020",
    "offer_address": "9/69 Moo 1, Khuk Khak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 622.0,
    "value": 1944.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxrGhQAJ",
    "hero_image": "https://images.luxuryescapes.com/k7pfsryfwxewebz9sl2i",
    "image_two": "https://images.luxuryescapes.com/mlwgrfxqkfaipzwl7m4g",
    "image_three": "https://images.luxuryescapes.com/p2jns17hyzxx3bdbo37o",
    "vendor_name": "Mai Khao Lak Beach Resort and Spa",
    "title": "Family Villa Getaway with Incredible Inclusions - Two Kids Stay Free",
    "description": "Enjoy a getaway at the Mai Khao Lak Beach Resort & Spa, where the focus is on fun for the whole family. Stay in an incredible villa, within easy reach of the gorgeous beach and with dedicated facilities including a lobby, restaurant, bar and swimming pool just for villa guests. The individual Khao Lak villas are spaced apart for privacy amid the resort gardens. Parents can relax at the on-site spa or sip on tropical cocktails at one of the resort’s four bars, while the kids enjoy countless activities, including an all-age kids' club and an indoor cinema. Benefit from incredible inclusions, such as daily buffet breakfast for the whole family, two dinners (kids under seven eat free), four 30-minute massages to share, a fun mocktail class for kids and much more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Mai Khao Lak Resort & Spa - MAY 2018",
    "offer_address": "9/16-17 Phetchakasem Rd, Moo. 1, Pakweep Beach,, Khaolak, Phang-nga 82190, Thailand",
    "percentage_discount": 72.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 1275.0,
    "value": 4557.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuxJvAAJ",
    "hero_image": "https://images.luxuryescapes.com/a7jqf5gb15bt2shaff",
    "image_two": "https://images.luxuryescapes.com/vpy2mql5cpdce9kgrqh",
    "image_three": "https://images.luxuryescapes.com/rxgtm7adikvx6wxo6opl",
    "vendor_name": "Beyond Resort Khao Lak",
    "title": "All-Inclusive Khao Lak Beachfront Villa Escape with Massages & Unlimited Free-Flow Drinks",
    "description": "All-inclusive bliss awaits at Beyond Resort Khao Lak, an all-villa beachfront resort set on the pearly-white sands of Pak Weep Beach. Tucked on the serene coast of Phang Nga, around an 80-minute drive from Phuket, this palm-fringed oasis invites you to surrender to complete relaxation. Enjoy an invigorating swim in the oceanfront swimming pool, spoil yourself at the indulgent Kanda Spa or explore the tropical waters on a sea kayak or stand-up paddleboard while surrounded by unspoiled nature and verdant tropical greenery. Return from your adventures to all-inclusive breakfast, lunch and dinner, plus unlimited free-flow cocktails, beer, spirits and soft drinks to toast days spent in the sun.\n\nKhao Lak is the ideal spot for an authentic Thai beachside experience, with guests spoiled with fun in the sun while staying in a quieter corner of the country. Onsite fine-dining restaurants await to cater to any appetite, whether you dine on succulent seafood under the thatched roof of @Beach Bar and Restaurant, tuck into a flame-seared steak at Motown On Fire Steakhouse or enjoy a refreshing poolside drink in the tropical sun. Outside the resort, guests can find lush waterfalls, markets and monuments, as well as a host of deep sea activities - think world-class snorkelling, surfing and scuba diving.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Beyond Resort Khaolak",
    "offer_address": "9/69 Moo 1, Pak Weep Beach, Khuk Khak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 943.0,
    "value": 2113.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nOY2AAM",
    "hero_image": "https://images.luxuryescapes.com/m5lg4wb6rdyo0vettbb",
    "image_two": "https://images.luxuryescapes.com/ts6qed58owavyxdjux",
    "image_three": "https://images.luxuryescapes.com/byojd5m4ni3itdrfkeoh",
    "vendor_name": "La Vela Khao Lak",
    "title": "Idyllic Khao Lak Beachfront Retreat with Massages, Daily Breakfast & Nightly Beach Club Drinks",
    "description": "Let your worries drift away at the stylish La Vela Khao Lak, an opulent resort tranquilly located on the golden sands of Bang Niang, Khao Lak’s most serene stretch of beach. Inspired by nature, the ocean and the rich cultural heritage of the ancient Takola seaport, this haven features an enormous free-form swimming pool surrounded by verdant gardens, with the sapphire-blue ocean and a white-sand beach forming the backdrop to an indulgent escape.\n\nBe sure to kick-start your day with a fresh breakfast at Spices Restaurant, or take it slow with a coffee in the Cotton Café, before afternoon cocktails at Miner’s Bar. Then ease your tired muscles after a hot day at the beach with a traditional Thai massage at Spa Qaqula, or work up a sweat in the onsite gym or in a Muay Thai or yoga class. When you’re not exploring every inch of this exquisite resort, take a stroll down Bang Niang and Khao Lak Beach, visiting nearby night markets, local restaurants and bars. Then head back for a decadent dock-to-dish seafood bounty and dance party at Kokulo Beach Club.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "La Vela Khao Lak",
    "offer_address": "98/9 Moo 5, Khuk Khak, Takuapa, Khao Lak, Phang Nga, 82220, Thailand",
    "percentage_discount": 44.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 679.0,
    "value": 1220.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ahpkyQAA",
    "hero_image": "https://images.luxuryescapes.com/duutxiv2ftnf9wd0t1xi",
    "image_two": "https://images.luxuryescapes.com/kkd39szypkzglohkgbrb",
    "image_three": "https://images.luxuryescapes.com/kkjjfxgnuyd07svvfhlo",
    "vendor_name": "X10 KhaoLak Resort",
    "title": "Beachfront Family or Couple's Getaway with Massages, Daily Breakfast & More",
    "description": "Embrace the tranquillity of a tropical Thailand escape at X10 Khaolak Resort with its perfect location on golden sands, overlooking crystal blue waters. Ideal for a couple's getaway or family holiday, you’ll love the welcoming Thai hospitality on this easy-to-plan trip with amazing inclusions. Your package includes massages, daily breakfast, two dinners and two-for-one cocktails. Keep the kids entertained at the kids' club and with access to two kids' pools, and with complimentary return airport transfers and a guaranteed 4pm late checkout, you’ll be able to make the most of your holiday in the tropical sun.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "X10 Khaolak Resort - Mar 2019",
    "offer_address": "38/9 Moo 6, Petchakasem Road, Khuk Khak, Takuapa, Phangnga 82220 Khao Lak",
    "percentage_discount": 62.0,
    "min_duration": 8,
    "max_duration": 14,
    "price": 506.0,
    "value": 1320.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HJP2AAO",
    "hero_image": "https://images.luxuryescapes.com/i4wxnwjm1736utokj2og",
    "image_two": "https://images.luxuryescapes.com/2mp3lj9pv935dwzphpmth",
    "image_three": "https://images.luxuryescapes.com/itk0rtqno5sjy8w291q",
    "vendor_name": "Moracea by Khao Lak Resort",
    "title": "Tranquil Khao Lak Five-Star Beachfront Escape with Daily Breakfast, Welcome Cocktails & Massages",
    "description": "Find sun-kissed tranquility at Moracea by Khao Lak Resort, a five-star oasis that sprawls from the serene hilltop onto 400 metres of unspoiled beachfront. The resort is the perfect hideaway to relax, soak up some sun and recharge. Take a dip in one of the four large swimming pools adjacent to the beach, pausing to order a lavish cocktail at the swim-up Bambu Bar. When you can drag yourself out of the water, Baimai Spa awaits to transport you to total relaxation with an aromatic massage, body wrap or scrub treatment (charges apply).\n\nWith peaceful villages, markets, waterfalls, tropical forests and, of course, an abundance of white-sand beaches nearby, including one at your doorstep, Khao Lak is unquestionably one of Thailand’s most popular holiday destinations for a relaxing getaway. And the five-star Moracea by Khao Lak Resort - winner of a Tripadvisor's 2021 Travellers' Choice award - provides the perfect launchpad to discover it all.\n\n**Your handpicked inclusions:**\n\n- Celebrate your escape with a welcome cocktail each on arrival\n- Your escape is off to a great start with seasonal fruits and flowers waiting in your room on arrival\n- Wake up each morning to a delicious daily buffet breakfast at Malila Restaurant\n- Unwind with an indulgent 30-minute massage for two at Baimai Spa\n- Take your tastebuds on a journey through local cuisine with one three-course set lunch or dinner for two\n\n**Extended stay bonus:** Extend your stay to 5+ nights to receive two 30-minute massages per person and a second three-course set lunch or dinner for two. Enjoy an 8+ night escape to receive one 60-minute massage per person and a daily three-course set lunch or dinner for two. For those who opt for a 10-night retreat, they'll enjoy two 60-minute massages per person, while 12-night stays can unwind with three 60-minute massages per person.\n\n**Book with 100% Confidence**: If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Scoopon for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Moracea by Khao Lak Resort",
    "offer_address": "26/20 Khuekkhak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 12,
    "price": 159.0,
    "value": 305.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cJKJ5QAO",
    "hero_image": "https://images.luxuryescapes.com/sryvtswnegmhzm5h86ec",
    "image_two": "https://images.luxuryescapes.com/pskggc5z6kx3eqotgxr",
    "image_three": "https://images.luxuryescapes.com/p6hvbpdylrvmc3gtu9j9",
    "vendor_name": "Khaolak Bhandari Resort & Spa",
    "title": "Boutique Family Escape Minutes from Nang Thong Beach",
    "description": "Soak up the unparalleled natural beauty and crystal-clear waters of Khao Lak with a seven, ten or 12-night escape at Khaolak Bhandari Resort & Spa. Stay in a Thai Style Deluxe Room and enjoy daily buffet breakfast, two three-course lunches or dinners, four 60-minute massages each, four cocktails each, private return airport transfers, guaranteed late 2pm check out, 20% discount at the hotel's spa and 10% discount on food at the hotel's eateries. Plus, two kids aged 11 years and under are included in the package.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Khaolak Bhandari Resort & Spa",
    "offer_address": "หมู่7 26/25 Khuekkhak, Takua Pa District, Phang-nga 82190, Thailand",
    "percentage_discount": 71.0,
    "min_duration": 7,
    "max_duration": 12,
    "price": 443.0,
    "value": 1511.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HPxaAAG",
    "hero_image": "https://images.luxuryescapes.com/q5t9voew08frhv2whmud",
    "image_two": "https://images.luxuryescapes.com/25grj8ivlr1j74711ae",
    "image_three": "https://images.luxuryescapes.com/plyhmkk78havpw9m5lf",
    "vendor_name": "The Haven Khao Lak",
    "title": "Award-Winning Khao Lak Beach Escape with Daily Breakfast, Daily Massages & Cocktails",
    "description": "Delicious dining, five-star facilities and luxurious rooms and villas, all sitting on the golden sands of one of Thailand’s best beaches - it can only be The Haven Khao Lak, a secluded retreat that celebrates Thai hospitality and modern indulgence. Tucked away between the Andaman Sea and a tropical lagoon, this oasis is secluded enough to allow for true escapism but close enough to all of Khao Lak’s action for cultural immersion.\n\nTropical luxury is served in spades at The Haven Khao Lak, with verdant gardens, sapphire-blue waters and a white-sand beach forming the backdrop to an indulgent escape. Explore the resort by water as you float down the 5,000sqm salt-water pool, or find a spot on the 380m-long Khuk Khak Beach, embracing true relaxation with a soundtrack of lapping water. Take that holiday feeling one step further at Aqua Spa, booking in for Thai massages, herbal ball compressions and body scrubs, or sip on a cocktail or two poolside, watching as the sun sets over the azure waters of the Andaman Sea. Every day here is gourmand heaven: begin with Andaman Sea vistas and daily buffet breakfast at Sundial Restaurant, nightly cocktails from The Scallop Bar - featuring submerged bar stools within Thailand's largest saltwater pool - or the serene Angel Wing Bar and finish every evening sampling freshly-caught seafood at Vongole Restaurant, alternating between the Thai and Italian menus for a global culinary experience.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Haven Khao Lak",
    "offer_address": "61/4 Moo 3 Khuk Khak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 629.0,
    "value": 2073.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zXikAAE",
    "hero_image": "https://images.luxuryescapes.com/wbeuk1qv2aj9xnq3fjwe9",
    "image_two": "https://images.luxuryescapes.com/kxx2x81s7w64jr0u6o",
    "image_three": "https://images.luxuryescapes.com/9y2hs98cn2dr88prd18c",
    "vendor_name": "JW Marriott Khao Lak Resort and Spa",
    "title": "Award-Winning Khao Lak Beachfront Escape with All-Inclusive Daily Dining & Daily Cocktails",
    "description": "A secluded tropical paradise awaits at JW Marriott Khao Lak Resort & Spa, voted the Best Luxury Family Hotel in Asia in the 2021 World Luxury Hotel Awards and winner of a Gold Award in the 2021 Thailand Tourism Awards. Perched on the pristine sands of Khuk Khak Beach, this five-star retreat was fully refurbished in July 2020 and boasts a never-ending list of activities and facilities, perfect for families, friends and couples alike.\n\nFloat down Southeast Asia’s longest outdoor lagoon pool or get the heart rate up with a game of tennis or squash, before returning to one of the nine restaurants and bars onsite for a bite to eat, where Thai, Japanese, Italian and international flavours are all bound to make your mouth water. Little ones can splash around the children’s pool or learn and play at the Juniors Club, while the grown-ups can escape for a treatment or two at the rejuvenating Quan Spa. Families will also be delighted with the host of new facilities opening in mid-2022, including a wave pool, water trampolines and games zone.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "JW Marriott Khao Lak Resort & Spa",
    "offer_address": "41/12 Moo 3 Khuk Khak, Khao Lak, Takua Pa District, Phang-nga 82220, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 1259.0,
    "value": 3285.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000F0Ee1AAF",
    "hero_image": "https://images.luxuryescapes.com/8c1nujbn7g8pqow60w",
    "image_two": "https://images.luxuryescapes.com/84e61qya3iixsmyr5w88",
    "image_three": "https://images.luxuryescapes.com/pchibjof7n7r7h4tc46h",
    "vendor_name": "Pullman Khao Lak Resort",
    "title": "Pullman Khao Lak Beachfront Escape with All-Inclusive Dining, Free-Flow Drinks & One Child Stays & Eats Free",
    "description": "There are some experiences in life that should not be missed, and a heavenly stay at Pullman Khao Lak Resort should be at the top of your travel to-do list. Perfectly positioned facing the cool blue waters of the Andaman Sea, this beachfront resort will cater to your every need in true Pullman style. While there's plenty to discover beyond the hotel, this luxury oasis will entice you to stay and enjoy, providing both relaxation and excitement for the entire family. Savour a fusion of flavours at Plai Dining Room and Kram Beach Club, plunge into one of two aquamarine pools, visit the serene Rosalyn Spa by Pullman Khao Lak or raise your heart rate at the 24-hour Pullman Fit centre.\n\nWhile the top-notch facilities make it difficult to tear yourself away from the serenity of the resort, the surrounding wonders reward those who choose to explore. For eager snorkelers or beach lovers, the gorgeous Similan and Surin islands are a must-visit, and for history enthusiasts, Takua Pa Old Town is located a short drive away. Back at the resort, little ones can race through the twin-looped waterslide or hang at the onsite Kids' Club while parents sip on a refreshing cocktail.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Pullman Khao Lak Resort",
    "offer_address": "46/109, Moo 2, Soi 46 Laem Son Takua Pa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1199.0,
    "value": 3902.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UyHWWQA3",
    "hero_image": "https://images.luxuryescapes.com/htpp6mzkftazxzoc1sxg",
    "image_two": "https://images.luxuryescapes.com/nj04f9kdqe9ywa9kaqeu",
    "image_three": "https://images.luxuryescapes.com/qwx34z0dueohjtedum1b",
    "vendor_name": "The Waters Khao Lak by Katathani Collection",
    "title": "Iconic Katathani Stay with Pool-Access Room",
    "description": "Step straight from sunbathing on your private balcony into 3,000 square metres of perfect turquoise pool when you stay at The Waters Khao Lak, part of the iconic Katathani Collection. Your room offers direct access to one of the seven pools that surround this adult-focused resort, located in Thailand’s popular Khao Lak area. Daily breakfast, lunches and massages, plus much more are included in this relaxing break for two.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Waters Khao Lak by Katathani Collection - 2018",
    "offer_address": "67/238 Bang Niang Beach, Khuekkhak, Takua Pa District, Phang Nga 82190, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 7,
    "max_duration": 12,
    "price": 507.0,
    "value": 1880.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPnSIAA1",
    "hero_image": "https://images.luxuryescapes.com/ftg0fbi85kbx0yxuiva",
    "image_two": "https://images.luxuryescapes.com/xfpbvnkju7u46kyb034h",
    "image_three": "https://images.luxuryescapes.com/ck1qa34547mg8yme3lfa",
    "vendor_name": "The Waters Khao Lak by Katathani Collection",
    "title": "Poolside Khao Lak Escape with Beach Club Access, Daily Breakfast, Massages & Cocktails",
    "description": "Enter a world of cascading waterfalls, dazzling turquoise pools and golden sands with a stay at The Waters Khao Lak, part of the award-winning Katathani Collection. Embrace tropical serenity at this modern resort located in Thailand’s vibrant Khao Lak area and boasting over 3,000 square meters of water across seven sparkling pools, each flanked by swaying palm trees. Accept relaxation beyond imagination - snooze late before taking breakfast at Amici, the resort's mouthwatering Italian bistro, spend the afternoon sipping cocktails at the swim-up Bubble Bar or rejuvenate at the onsite Sila Spa.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Waters Khao Lak",
    "offer_address": "67/238 Moo5, Kukkak, Khao Lak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 454.0,
    "value": 1002.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JTKavAAH",
    "hero_image": "https://images.luxuryescapes.com/eyd0kxdvy2o7x84r11yg",
    "image_two": "https://images.luxuryescapes.com/1ff6xs65vac48it286x4",
    "image_three": "https://images.luxuryescapes.com/u2p06xex9m1e6g8mtrh",
    "vendor_name": "Graceland Khao Lak Resort and Spa",
    "title": "Beachfront Khao Lak Tropical Escape with Daily Breakfast, Daily Lunch or Dinner & Entertainment Complex",
    "description": "Discover a world of family-friendly fun between Thailand’s rugged mountains and the shining Andaman Sea at this coastal resort, perfectly positioned on the region’s famed golden shoreline. Spend sun-kissed days swimming in fish-filled turquoise waters, sipping cocktails by the resort’s shimmering pool or exploring Lam Ru National Park's extraordinary sea cliffs and waterfalls. Head to Oceano for mouth-watering steak and seafood, savour contemporary treatments at SEN Spa or spend time in the resort’s entertainment complex, which hosts karaoke rooms, snooker tables, a bowling alley and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Graceland Khaolak Beach Resort",
    "offer_address": "30/7 Moo 7, Bang Muang District, Amphur Takua-Pa, Phang Nga, 82000, Thailand",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 377.0,
    "value": 708.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlFcAAK",
    "hero_image": "https://images.luxuryescapes.com/2ao309ds8yq1c1i6g6x",
    "image_two": "https://images.luxuryescapes.com/e9fdidzvyumznswq79w",
    "image_three": "https://images.luxuryescapes.com/8ukl1zhcua31f54s0y",
    "vendor_name": "Kantary Beach Hotel, Villas and Suites Khao Lak",
    "title": "Beachfront Khao Lak Suite Escape with Dining Experiences & Daily Cocktails",
    "description": "Pristine beachfront and ultimate relaxation await at Kantary Beach Hotel, Villas and Suites Khao Lak, just 90 minutes north of Phuket Airport. Surrounded by ancient Khao Lak rainforest with sleepy lagoons and picture-perfect stretches of sugar-white sand, this TripAdvisor Traveller’s Choice destination is a quiet refuge of contemporary suites and villas.\n\nSettle into beachside luxury with daily buffet breakfast, five three-course set menu dining experiences, one daily cocktail per adult and a one-way private airport transfer.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Kantary Beach Hotel, Khao Lak",
    "offer_address": "64, 65, 72 Moo 2, Petchkasem Rd, Takuapa, Kukkak, Phang Nga 82220, Thailand",
    "percentage_discount": 53.0,
    "min_duration": 8,
    "max_duration": 12,
    "price": 539.0,
    "value": 1135.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DODqeAAH",
    "hero_image": "https://images.luxuryescapes.com/379sf9qhfjflpocrwpp",
    "image_two": "https://images.luxuryescapes.com/6a1sqwz33pmkvdi7nz7m",
    "image_three": "https://images.luxuryescapes.com/ulsq0cr55q8slwp1nto",
    "vendor_name": "Mai Khao Lak Beach Resort and Spa",
    "title": "Khao Lak Beachfront Bliss with Daily Breakfast, Nightly Dinner & Nightly Drinks Plus Two Kids Stay Free",
    "description": "Discover beachside bliss and tropical splendour at the fun-filled Mai Khao Lak Beach Resort & Spa - the ultimate Thai beachfront playground on palm-fringed shores. This acclaimed family-friendly resort boasts incredible facilities, including five lagoon pools, waterslides, a kids' playroom and an indoor cinema. For a splash of sophistication, enjoy a swim-up bar, the tranquil Mind Spa and delectable traditional cuisine at The Sky restaurant and bar, which boasts incredible Andaman Sea views.\n\nWith a brand-new wing, you can now enjoy two giant waterslides, a pirate ship water park, family pools and an exclusive adults-only area: rest assured the young and young at heart will never be short of things to do. Step out of the resort grounds to find yourself surrounded by coconut groves and lush forest, with the sugar-fine sands of Pak Weep Beach at your doorstep. The resort's breathtaking location, just 15 minutes' drive from the town centre, makes it easy to spend days exploring the small, local villages, or setting sail to Similan Island for amazing snorkelling and dive sites.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Mai Khao Lak Beach Resort & Spa",
    "offer_address": "9/16-17 Phetchakasem Road, Moo. 1 Pakweep Beach, Khao Lak, Phang-Nga 82190, Thailand",
    "percentage_discount": 74.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 579.0,
    "value": 2267.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgPUCQA2",
    "hero_image": "https://images.luxuryescapes.com/yrczpv85ocegh8e1qdk4",
    "image_two": "https://images.luxuryescapes.com/pqdoo1pf0crrwqqtpydl",
    "image_three": "https://images.luxuryescapes.com/gdfzs4xs65qmqtnre1l3",
    "vendor_name": "Mai Khao Lak Beach Resort and Spa",
    "title": "Family Favourite: Beachfront Getaway for Two Adults and Three Kids",
    "description": "One of Luxury Escapes’ best-selling family deals is back! Discover beachfront fun for two adults and up to three kids at Mai Khao Lak Beach Resort and Spa - featuring one of Thailand’s longest pools and an exciting waterpark. Enjoy a choice of daily lunches or dinners, daily buffet breakfast, daily cocktail each, daily 30-minute massage to share and a convenient one-way airport pickup from Phuket International Airport. Plus, enjoy exciting upgrade options including the adults-only zone with swim-up pool bars. Plus, up to three kids (aged 11 and under) can stay and eat for free!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Mai Khao Lak Beach Resort and Spa - April 2019",
    "offer_address": "9/16-17 Phetchakasem Rd, Moo. 1, Pakweep Beach,, Khaolak, Phang-nga 82190, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 883.0,
    "value": 2414.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ey5pUAAR",
    "hero_image": "https://images.luxuryescapes.com/1gkd2b50ehx7mnkoip4",
    "image_two": "https://images.luxuryescapes.com/tmpidcxkagfzmcbgatqb",
    "image_three": "https://images.luxuryescapes.com/sw56299ui8x7hkpzu5w",
    "vendor_name": "Graceland Khao Lak Resort and Spa",
    "title": "Beachfront Khao Lak Tropical Escape with Daily Dining, Cocktails & Entertainment Complex",
    "description": "Discover a world of family-friendly fun between Thailand’s rugged mountains and the shining Andaman Sea at Graceland Khaolak Beach Resort, perfectly positioned on the region’s famed golden shoreline. Spend sun-kissed days swimming in fish-filled turquoise waters, sipping cocktails by the resort’s shimmering pool or exploring Lam Ru National Park's extraordinary sea cliffs and waterfalls. Head to Oceano for mouth-watering steak and seafood, savour contemporary treatments at SEN Spa or spend time in the resort’s entertainment complex, which hosts karaoke rooms, snooker tables, a bowling alley and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Graceland Khaolak Beach Resort",
    "offer_address": "30/7 Moo 7, Bang Muang District, Amphur Takua-Pa, Phang Nga, 82000, Thailand",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 384.0,
    "value": 720.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FOPWjAAP",
    "hero_image": "https://images.luxuryescapes.com/8ak2ut0xj953lbe8unwf",
    "image_two": "https://images.luxuryescapes.com/2ih82rs9uearr716guup",
    "image_three": "https://images.luxuryescapes.com/5bs75734tnlpagdnfibr",
    "vendor_name": "Grand Mercure Khao Lak",
    "title": "Khao Lak Beachfront Escape with Daily Breakfast, Daily Lunch or Dinner, Nightly Cocktails & Massage",
    "description": "Experience the tropical oasis that is Grand Mercure Khao Lak Bangsak, a pristine hideaway ensconced in tropical gardens on Thailand's tranquil southwest coast. Inspired by traditional riverside Thai villages, this unique resort is centred on a picturesque, winding canal, lined by immaculate accommodation. Tucked away in Khao Lak, this palm-fringed oasis is the ideal spot for a true Thai beachside experience. The tranquil town offers fun in the sun, fine-dining restaurants and boutique shops, on a background of jungle-clad mountains - this quiet corner of the country ensures you will leave your Thailand escape feeling completely relaxed.\n\nBack at the resort, high-end amenities invite you to surrender to complete relaxation: enjoy an invigorating swim in the beachfront swimming pool, spoil yourself at the indulgent Pran Spa, or experience a fresh take on traditional Thai favourites at one of the two innovative onsite restaurants, Patio and Green Mango. Spend an afternoon sipping tropical cocktails at Soak Pool Bar, while the kids are entertained at the complimentary Manta Ray Kids' Corner before enjoying a stroll along the white-sand beach, located just moments away from the resort.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Grand Mercure Khao Lak Bangsak",
    "offer_address": "71 Moo 7, Bang Muang Takuapa District, Phang Nga 82190, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 589.0,
    "value": 0.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3185QAB",
    "hero_image": "https://images.luxuryescapes.com/ocfx6dlypmklimueq9hy",
    "image_two": "https://images.luxuryescapes.com/fybtxl3sasknzyhanbxo",
    "image_three": "https://images.luxuryescapes.com/s74r2uebb9tigbmzun9s",
    "vendor_name": "JW Marriott Khao Lak Resort and Spa",
    "title": "All-Inclusive JW Marriott Khao Lak Beachfront Escape",
    "description": "Experience beachfront bliss in Thailand with an all-inclusive stay at the award-winning five-star JW Marriott Khao Lak Resort & Spa (fly in to Phuket). Enjoy eight nights in a Deluxe Lagoon Pool View Room with all meals including daily buffet breakfasts, indulgent seaside lunches and nightly multi-course dinners. Plus, indulge with two spa treatments to share, an airport pickup and more for two adults and up to two kids (aged 11 years and under) stay free.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "JW Marriott Khao Lak Resort & Spa OLD",
    "offer_address": "41/12 Moo 3, Khuk Khak, Takuapa, Phang Nga 82190, Thailand",
    "percentage_discount": 54.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 1244.0,
    "value": 2710.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Gmf1GYAR",
    "hero_image": "https://images.luxuryescapes.com/tpplx3boihckfplml9c",
    "image_two": "https://images.luxuryescapes.com/2smjybfzljopqwrcl004",
    "image_three": "https://images.luxuryescapes.com/h06mxsle8ajc812q2g9",
    "vendor_name": "The Anda Mani Khaolak Beachfront Villas",
    "title": "Khao Lak Secluded Beachfront Suites with Daily Breakfast, Lunch or Dinner & Nightly Cocktails",
    "description": "Answer the irresistible call of Thailand’s Andaman coast with a serene escape to this intimate resort. Surrounded by tropical greenery and opening directly onto Khao Lak’s unspoiled sands, the Anda Mani Khaolak Beachfront Villas offers complete seclusion just minutes from the village.\n\nIndulge in warm hospitality and tailored service, start your mornings with a gourmet breakfast at The Kitchen, enjoy a crafted lunch or dinner, and toast to golden sunsets with a signature cocktail.\n\nHop aboard a speedboat to discover the dazzling Similan Islands, famed for vivid reefs and crystal waters, or wander through Bang Niang Market to savour local Thai flavours. Later, return to your private sanctuary and soak in panoramic Khao Lak Beach views and refined comfort.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Thai Mueang",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Anda Mani Khaolak Beachfront Villas",
    "offer_address": "7/9 Moo 2, Laem Kaen, Thai Mueang District, Phang Nga 82210, Thailand",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 749.0,
    "value": 3137.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PR0bAAG",
    "hero_image": "https://images.luxuryescapes.com/pizwpwgn1hogcuftcsv",
    "image_two": "https://images.luxuryescapes.com/4h2bv4xyv9k9kmgym4vi",
    "image_three": "https://images.luxuryescapes.com/qmdqn2jsci2l4l88rxqi",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Beachfront Khao Lak Suite Escape with Room Upgrade, Daily Dining & Nightly Free-Flow Cocktails",
    "description": "Experience a stunning beachfront escape in Khao Lak at the highly acclaimed The Sands by Katathani Khao Lak - an enchanting tropical oasis perfectly suited to families and couples. Situated on Nang Thong Beach and fringed by lush green hills, with the town’s main shopping strip just a five-minute stroll away, the location is nothing short of exceptional.\n\nStay in an upgraded Seaside Suite and make the most of fantastic facilities - with three unique wings catering to travellers of all styles. Little ones and teenagers will love the Aqua Wing, with a waterpark, Sands Castle Kids' Club, child-friendly swimming pool and endless family activities. For adventure seekers, the Seaside Wing offers easy access to the beach, where a game of volleyball on the powdery sand or watersports await. For couples with a more laidback agenda, The Lagoon Wing is the place to recharge. In the midst of it all, you’ll find multiple dining options, a state-of-the-art gymnasium, rejuvenating spa and sun-soaked spots where you can choose to do nothing at all.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani",
    "offer_address": "10/18 Petchkasem rd. Moo 7 Kukkak Takuapa Phang Nga 82220, Thailand",
    "percentage_discount": 77.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 749.0,
    "value": 3215.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GOHNFAA5",
    "hero_image": "https://images.luxuryescapes.com/osg68my1amcgxd5ruu3s",
    "image_two": "https://images.luxuryescapes.com/pu3o75dfbudsjasip7g",
    "image_three": "https://images.luxuryescapes.com/3aw883kl6ewc2a9phczw",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Khao Lak Beachfront Oasis with Daily Breakfast, Nightly Free-Flow Cocktail Hour & Massages",
    "description": "Set amid a luscious forested headland and flowing onto the dazzling sands of Nang Thong Beach, The Sands Khao Lak by Katathani is your tranquil and secluded escape just minutes from the town’s main shopping strip and an hour from vibrant Phuket. You need stray no further than the resort, as each wing is carefully crafted to cater for your primary need of rest, rejuvenation or play - seek serenity amongst the waterlilies and palms of the Lagoon Wing, splash about in a miniature water park in the Aqua Wing or relax poolside in the Seaside Wing.\n\nUnwind by your choice of three pools (including an adults-only enclave), satiate any craving at your choice of three restaurants - including The Floating Market, overlooking the glistening lagoon - and sip drinks at four bars, all offering unique water vistas. Plus, enjoy the benefits of distinct adults-only areas, Sands Castle kids' club and the pavilions of The Spa, perfect for an afternoon spent curing aches and pains with a Thai massage.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani",
    "offer_address": "10/18 Petchkasem rd. Moo 7 Kukkak Takuapa Phang Nga 82220, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 599.0,
    "value": 1410.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Guan9AAB",
    "hero_image": "https://images.luxuryescapes.com/669yp65xxmh1zpagx4w",
    "image_two": "https://images.luxuryescapes.com/ukoh15ocypl6eauy61hf",
    "image_three": "https://images.luxuryescapes.com/v6xdahs55ce0uwrk64upi",
    "vendor_name": "Pullman Khao Lak Resort",
    "title": "Pullman Khao Lak Beachfront Escape with All-Inclusive Dining & Unlimited Free-Flow Drinks",
    "description": "Some experiences in life shouldn't be missed. Place an all-inclusive stay at Pullman Khao Lak Resort at the top of your travel to-do list - perfectly positioned facing the cool blue waters of the Andaman Sea, this beachfront resort will cater to your every whim in true Pullman style. While there's plenty to discover beyond the hotel, this luxury oasis will entice you to stay and enjoy, providing both relaxation and excitement for the entire family. Savour a fusion of flavours at Plai Dining Room and Kram Beach Club, plunge into one of two aquamarine pools, visit the serene Rosalyn Spaor raise your heart rate at the 24-hour Pullman Fit centre.\n\nWhile the top-notch facilities make it difficult to tear yourself away from the serenity of the resort, the surrounding wonders reward those who choose to explore. For eager snorkelers or beach lovers, the gorgeous Similan and Surin islands are a must-visit, and for history enthusiasts, Takua Pa Old Town is located a short drive away. Back at the resort, little ones can race through the twin-looped waterslide or hang at the onsite Kids' Club while parents sip on a refreshing cocktail.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Pullman Khao Lak Resort",
    "offer_address": "46/109, Moo 2, Soi 46 Laem Son Takua Pa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1199.0,
    "value": 4205.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RB9WTQA1",
    "hero_image": "https://images.luxuryescapes.com/ne1j5cplqbz57wfxxwjn",
    "image_two": "https://images.luxuryescapes.com/o8sk3d5bcdds3jtr2hyh",
    "image_three": "https://images.luxuryescapes.com/otp7bcxorcx5ianbmeub",
    "vendor_name": "ROBINSON Club Khao Lak",
    "title": "All-Inclusive Beachfront Luxury in Khao Lak",
    "description": "Skip Phuket and head to the unspoiled shores of Khao Lak where cobalt waters, national parks and 13 kilometres of beachfront await you. Stamped with the TripAdvisor Certificate of Excellence, you’ll experience an eight-night all-inclusive escape at Robinson Club Khao Lak featuring daily buffet breakfast, daily buffet lunch, nightly buffet dinner, unlimited free-flow drinks with all meals, two 60-minute massages to share, return private airport transfers, complimentary Kids Club access for the little ones, complimentary group fitness classes, a luxurious 2pm checkout and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Robinson Club Khao Lak - 2018",
    "offer_address": "9 Moo 1, Tambol Kuk Kak, Khao Lak, Phang-nga 82190, Thailand",
    "percentage_discount": 44.0,
    "min_duration": 8,
    "max_duration": 14,
    "price": 1148.0,
    "value": 2068.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECG1bAAH",
    "hero_image": "https://images.luxuryescapes.com/si07xpmk3nhkzbo9ils",
    "image_two": "https://images.luxuryescapes.com/yq3x68bjrken960pkm9",
    "image_three": "https://images.luxuryescapes.com/hmckqxfanjqed9cy5gj4",
    "vendor_name": "Moracea by Khao Lak Resort",
    "title": "Beachfront Khao Lak Oasis with Two Thai Massages, Nightly Cocktails & Daily Breakfast",
    "description": "Stunning beachfront indulgence awaits you at the Moracea by Khao Lak Resort, a spectacular retreat elevated on a hillside gently sloping towards golden sands of the Andaman Sea. Surrounded by lush, Eden-like greenery, this resort boasts a tranquil spa, multiple outdoor pools, a vibrant swim-up bar and a glamorous restaurant with stunning sunset views. Trek the depths of Khao Lak National Park, float through the jungle on a bamboo raft, or grab your snorkelling gear and explore the nearby Similan Islands, filled with stunning coral reefs and exciting marine life. Head back after a long day of travelling for a cocktail and breathtaking sunset vistas.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Moracea by Khao Lak Resort",
    "offer_address": "26/20 Khuekkhak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 278.0,
    "value": 733.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dcWcZQAU",
    "hero_image": "https://images.luxuryescapes.com/3usovna18n826slx7apu",
    "image_two": "https://images.luxuryescapes.com/5ayp6j0ysh30hgfkrwb",
    "image_three": "https://images.luxuryescapes.com/panf43ijcqauxvmdg3w",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Ultimate Thai Beachfront Escape with Nightly Free-Flow Cocktails",
    "description": "Experience a stunning beachfront escape in Khao Lak at the highly-acclaimed The Sands by Katathani and discover the stunning multi-million dollar Aqua Wing. Enjoy daily buffet breakfast, daily access to the Sands Luxury Club with nightly free-flow cocktails from 7pm to 8pm, a 30-minute massage or your choice of a buffet or three-course dinner during your stay, a convenient airport pick up and a super late 4pm check-out (subject to availability).\n\nStaying longer in this paradise? Indulge with two dinners during your stay and even more 30-minute massages.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani - 2020",
    "offer_address": "10/18 Petchkasem rd., Moo 7 Kukkak, Kukkak, Takua Pa District, Phang-nga 82190, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 609.0,
    "value": 1895.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CuoNMAAZ",
    "hero_image": "https://images.luxuryescapes.com/mvuugpf2vesnlmsbmve",
    "image_two": "https://images.luxuryescapes.com/tac4f4xlvgb0ita7oixd",
    "image_three": "https://images.luxuryescapes.com/875iw45s1m5kex3r25c",
    "vendor_name": "Pullman Khao Lak Resort",
    "title": "Pullman Khao Lak Beachfront Escape with All-Inclusive Dining & Unlimited Free-Flow Drinks",
    "description": "There are some experiences in life that should not be missed, and a heavenly stay at Pullman Khao Lak Resort should be at the top of your travel to-do list. Perfectly positioned facing the cool blue waters of the Andaman Sea, this beachfront resort will cater to your every need in true Pullman style. While there's plenty to discover beyond the hotel, this luxury oasis will entice you to stay and enjoy. Savour a fusion of flavours at Plai Dining Room and Kram Beach Club, plunge into one of four aquamarine pools, visit the serene Rosalyn Spa or raise your heart rate at the 24-hour Pullman Fit centre.\n\nWhile the top-notch facilities make it difficult to tear yourself away from the serenity of the resort, the surrounding wonders reward those who choose to explore. For eager snorkelers or beach lovers, the gorgeous Similan and Surin islands are a must-visit, and for history enthusiasts, Takua Pa Old Town is located a short drive away. Back at the resort, little ones can race through the twin-looped waterslide or hang at the onsite Kids Club while parents sip on a refreshing cocktail.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Pullman Khao Lak Resort",
    "offer_address": "46/109, Moo 2, Soi 46 Laem Son Takua Pa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1219.0,
    "value": 3307.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZmWQwQAN",
    "hero_image": "https://images.luxuryescapes.com/ox0ikkyssvj10m6k2ifp",
    "image_two": "https://images.luxuryescapes.com/i8rlytofh7din1bciens",
    "image_three": "https://images.luxuryescapes.com/oiqr9pbzbsr3amqjkspi",
    "vendor_name": "The Haven Khao Lak",
    "title": "Ultimate Adults-Only Beachfront Haven with VIP Inclusions",
    "description": "Treat your better half to a sun-kissed holiday at the Haven Khao Lak Resort, the most luxurious child-free beach resort in Khao Lak and one of Luxury Escapes’ all-time favourite. Featuring the longest saltwater infinity pool in South East Asia and a pristine stretch of beach, this peaceful oasis is the perfect backdrop to a romantic holiday. Enjoy daily buffet breakfast, two sumptuous buffet dinners or two multi-course dinners during your stay, a poolside cocktail experience, private pick up from Phuket International airport and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Haven Khao Lak 2019",
    "offer_address": "61/4 Moo 3 Khuk Khak Amphoe Takua Pa, Chang Wat Phang-nga 82220, Thailand",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 635.0,
    "value": 1832.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZnrTKQAZ",
    "hero_image": "https://images.luxuryescapes.com/zd2zzsdpzwvhtdzhiyep",
    "image_two": "https://images.luxuryescapes.com/jxabnpzlqdzmm3qfz2wi",
    "image_three": "https://images.luxuryescapes.com/nzsgzw57gxblsffaphxc",
    "vendor_name": "JW Marriott Khao Lak Resort and Spa",
    "title": "Beachfront Thailand Escape with All-Inclusive Dining",
    "description": "Experience beachfront bliss at one of our favourite Thailand resorts, staying at the five-star JW Marriott Khao Lak Resort & Spa, winner of Best Luxury Private Beach Resort, Asia, at the 2018 World Luxury Hotel Awards and named Best Resort for Families, Asia, 2019 at the Condé Nast Johansens Awards for Excellence . Enjoy eight nights in a Deluxe Lagoon Pool View Room with all-inclusive meals, including daily buffet breakfast, indulgent seaside lunch and nightly three-course dinners at one of four restaurants, plus indulge with one spa treatment each, an airport pickup and more.\nIdeal for families, two children (aged 11 and under) stay for free, with airport transfer and meals included!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "JW Marriott Khao Lak Resort & Spa - Jan 2019",
    "offer_address": "41/12 Moo 3, Khuk Khak Khuk Khak, 82, Takua Pa District, Phang-nga 82220, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 1250.0,
    "value": 2965.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMMmxAAH",
    "hero_image": "https://images.luxuryescapes.com/033cinyvverrsadgvpp",
    "image_two": "https://images.luxuryescapes.com/086qlfrsceqdred9gcw",
    "image_three": "https://images.luxuryescapes.com/8kv3kku2qow13kapoxa",
    "vendor_name": "The Haven Khao Lak",
    "title": "Five-Star Khao Lak Beachside Oasis with Daily Breakfast, Daily Lunch or Dinner & Nightly Free-Flow Cocktail Hour",
    "description": "Let your worries drift away at this opulent resort in a tranquil spot on the golden sands of Khuk Khak Beach, where privacy and comfort are valued above all else.\n\nCatering to guests 12 and older, this secluded oasis features an enormous 5,000sqm saltwater pool surrounded by verdant gardens, with the sapphire-blue ocean and a white-sand beach as the backdrop. Pamper yourself at Aqua Spa or indulge in a cocktail or two at Vongole Swim Up Bar as you take in panoramic views of the Andaman Sea.\n\nAfter taking in this exquisite resort, take a romantic stroll down Khuk Khak Beach and visit the nearby night markets, restaurants and bars. If you're a watersports aficionado, try snorkelling at the neighbouring islands or at the impressive Phag Nga Bay (additional charges apply). Enjoy a decadent dinner at the resort’s Vongole Restaurant, where you’ll be treated to a fresh daily catch, creatively dished up in traditional Thai style or in classic Italian favourites.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Haven Khao Lak",
    "offer_address": "61/4 Moo 3 Khuk Khak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 2362.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqSlAAAV",
    "hero_image": "https://images.luxuryescapes.com/8lfcstic8bkrqgg8u5f",
    "image_two": "https://images.luxuryescapes.com/bz0ds2u23exnwf6yjzts",
    "image_three": "https://images.luxuryescapes.com/0ncd28qx8n7yrnemzieg",
    "vendor_name": "The Waters Khao Lak by Katathani Collection",
    "title": "Poolside Khao Lak Escape with Beach Club Day Passes, Daily Breakfast, Massages & Cocktails",
    "description": "Enter a world of cascading waterfalls, dazzling turquoise pools and golden sands with a stay at The Waters Khao Lak, part of the award-winning Katathani Collection. Embrace tropical serenity at this modern resort located in Thailand’s vibrant Khao Lak area and explore over 3,000 square metres of water across seven sparkling pools, each flanked by swaying palm trees. Accept relaxation beyond imagination with a sleep-in before enjoying breakfast at Amici, the resort's mouthwatering Italian bistro. Then, spend the afternoon sipping cocktails at the swim-up Bubble Bar or rejuvenate at the onsite Sila Spa.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Waters Khao Lak",
    "offer_address": "67/238 Moo5, Kukkak, Khao Lak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 412.0,
    "value": 1310.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007m0nAAAQ",
    "hero_image": "https://images.luxuryescapes.com/g54cc38fzluv2m0splqs",
    "image_two": "https://images.luxuryescapes.com/9849d43baxq7c3p5i3wwb",
    "image_three": "https://images.luxuryescapes.com/bq2vil89ijx2wn6roxuh",
    "vendor_name": "Beyond Resort Khao Lak",
    "title": "Serene Khao Lak Beachfront Villa Escape with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Escape the crowds with a blissful stay at Beyond Resort Khao Lak, an all-villa beachfront resort set on the pearly-white sands of Pak Weep Beach, ranked within the top 10% of properties on Tripadvisor.\n\nTucked on the serene coast of Phang Nga, around an 80-minute drive from Phuket International Airport, this palm-fringed oasis invites you to surrender to complete relaxation; enjoy an invigorating swim in the oceanfront swimming pool, spoil yourself at the indulgent Kanda Spa, or explore the tropical waters on a sea kayak or stand-up paddleboard. Khao Lak is the ideal spot for a true Thai beachside experience, offering fun in the sun, jungle-clad mountains, fine-dining restaurants, and boutique shops while remaining a quieter corner of the country to ensure you leave feeling completely relaxed.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Beyond Resort Khaolak",
    "offer_address": "9/69 Moo 1, Pak Weep Beach, Khuk Khak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 629.0,
    "value": 1481.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000d0Pj6QAE",
    "hero_image": "https://images.luxuryescapes.com/3alra5j5ddi0xsqgn6rt",
    "image_two": "https://images.luxuryescapes.com/4uiajnu1yonwia89gj3",
    "image_three": "https://images.luxuryescapes.com/8dhgxf9esxds6ymjq0z",
    "vendor_name": "La Flora Khao Lak",
    "title": "Indulgent Khao Lak Escape with Beachfront Dining and Daily Free-Flow Cocktail Hour",
    "description": "Relax and unwind with dining, massages and more on Khao Lak’s palm-fringed beachfront at La Flora Khao Lak. Nestled right on the golden sands of the beach - and close to the natural beauty of Khao Lak National Park - this newly renovated boutique resort offers contemporary chic overlooking the Andaman Sea. Includes daily buffet breakfast at the beachfront Sire Restaurant, one relaxing 30-minute massage each, a three-course dinner at Sire Restaurant, one hour of free-flow cocktails per day and complimentary pickup from Phuket Airport on arrival. Upgrade for direct pool access and Jacuzzi luxury.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "La Flora Khao Lak",
    "offer_address": "59/1 Moo 5, Khuk Khak, Takua Pa District, Phang-nga 82220, Thailand",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 618.0,
    "value": 2597.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcxLiAAJ",
    "hero_image": "https://images.luxuryescapes.com/o36uav1kranzknz288y",
    "image_two": "https://images.luxuryescapes.com/3k2lu935xi8sy7u97pa",
    "image_three": "https://images.luxuryescapes.com/qtmr4x5o1rzx7r4lpsh",
    "vendor_name": "Beyond Resort Khao Lak",
    "title": "All-Inclusive Khao Lak Beachfront Villa Escape with Massages & Unlimited Free-Flow Drinks",
    "description": "All-inclusive bliss awaits at this all-villa beachfront resort set on the pearly-white sands of Pak Weep Beach. Tucked on the serene coast of Phang Nga, around an 80-minute drive from Phuket, this palm-fringed oasis invites you to surrender to complete relaxation. Enjoy an invigorating swim in the oceanfront swimming pool, spoil yourself at the indulgent Kanda Spa or explore the tropical waters on a sea kayak or stand-up paddleboard while surrounded by unspoiled nature and verdant tropical greenery. Return from your adventures to all-inclusive breakfast, lunch and dinner, plus unlimited free-flow cocktails, beer, spirits and soft drinks to toast days spent in the sun.\n\nKhao Lak is the ideal spot for an authentic Thai beachside experience, with guests spoiled with fun in the sun while staying in a quieter corner of the country. Onsite restaurants await to cater to any appetite, whether you dine on succulent seafood under the thatched roof of @Beach Bar and Restaurant, tuck into a flame-seared ribs at Motown On Fire Steakhouse or enjoy a refreshing poolside drink in the tropical sun. Outside the resort, guests can find lush waterfalls, markets and monuments, as well as a host of deep sea activities - think world-class snorkelling, surfing and scuba diving.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Beyond Resort Khaolak",
    "offer_address": "9/69 Moo 1, Pak Weep Beach, Khuk Khak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 999.0,
    "value": 2629.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lu22AAC",
    "hero_image": "https://images.luxuryescapes.com/bx8z3sqbkdif853jw6c",
    "image_two": "https://images.luxuryescapes.com/cobl3m1ospob0hrhbsq",
    "image_three": "https://images.luxuryescapes.com/pan4sx3c3mqpo13leix",
    "vendor_name": "Kalima Resort & Villas Khao Lak",
    "title": "Khao Lak Secluded Five-Star Escape with Daily Dining & Nightly Cocktails",
    "description": "Enter an impossibly beautiful paradise of vivid azure waters, endless sandy stretches of beach and lush tropical surrounds at the five-star Kalima Resort and Villas Khao Lak, a secluded sanctuary perfect for rest and relaxation.\n\nEffortlessly combining innovative design and awe-inspiring architecture that reflects the area's Sino-Portuguese heritage, each corner of the resort has been meticulously curated to create a sophisticated, avant-garde setting. Expansive wooden ceilings, bespoke furnishings and eclectic décor throughout each room make for an otherworldly experience. Beyond the impeccable rooms, you will be spoilt for choice at the restaurants, bars, lounge and café with a welcoming, laidback atmosphere and an extensive menu of traditional Thai and international dishes. Whether you’re looking to sweat it out in the fitness centre or cool off in the stunning outdoor pool framed by swim-up pool bars, semi-submerged sunbeds and lush trees; it's all possible here.\n\nOn the edge of the Andaman Sea, the location evokes a distinctly relaxed, tropical feel, with days spent on uncrowded beaches or lazing by the pool, exploring spectacular natural waterfalls nearby or hopping in a tuk-tuk to discover the hidden gems within nearby Bang Niang or Khao Lak Village.\n\n**Your handpicked inclusions:**\n\n- Wake up to daily buffet breakfast at Maluka Restaurant\n- Enjoy flexible dining with daily lunch or dinner at Maluka Restaurant or Beach Bar\n- Sip one cocktail per adult, per day, at Tin Bar (swap for a beer, soft drink or mocktail on request)\n\n**Book with 100% Confidence:** Right up until 14 days before check-in you can enjoy unlimited, free date changes, or cancel and get a 100% credit to use at Luxury Escapes for any other Limited Time Lux Exclusive accommodation, tour or cruise offer. Excludes flights, see the Fine Print for details. \n\n**Travelling with family?** Choose the Two-Bedroom Family Suite for up to two adults and two children (11 and under).\n\n**Celebrating a special occasion?** Upgrade to the One-Bedroom Pool Villa Duplex, a huge split-level villa with a private pool, vast outdoor terrace and views overlooking rich tropical gardens/partial sea views.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Thai Mueang",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Kalima Resort and Villas Khao Lak",
    "offer_address": "88 3 Lam Kaen, Thai Mueang District, Phang-nga 82210, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 559.0,
    "value": 1791.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I1BSIA0",
    "hero_image": "https://images.luxuryescapes.com/veq1zv12xn26xrogx06b",
    "image_two": "https://images.luxuryescapes.com/psxtr2a4bpqugeeer6",
    "image_three": "https://images.luxuryescapes.com/6akkxnwja3izhmhidee",
    "vendor_name": "The Anda Mani Khaolak Beachfront Villas",
    "title": "Secluded Khao Lak Beachfront Villas with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Succumb to the enchanting call of Thailand’s Andaman Sea with a stay at The Anda Mani Khao Lak Beachfront Villas. Nestled amid lush tropical gardens, this boutique resort offers direct access to the pristine sands of Khao Lak. Feel total peace and quiet in this secluded paradise just moments from Khao Lak village. \n\nBe treated with personalised service and exceptional hospitality; start the day with a delicious breakfast at The Kitchen by The Anda Mani, take your pick of a sumptuous made-to-order lunch or dinner and sip on a cocktail as the sun sets.\n\nVenture out via speedboat to explore the stunning Similan Islands, renowned for their vibrant marine life and crystal-clear waters, or sample authentic Thai cuisine at the local eateries at the Bang Niang Market just moments away. Back at the resort, unwind in your tranquil oasis, complete with high-end amenities and breathtaking views of Lam Kaen beach.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Thai Mueang",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Anda Mani Khaolak Beachfront Villas",
    "offer_address": "7/9 Moo 2, Laem Kaen, Thai Mueang District, Phang Nga 82210, Thailand",
    "percentage_discount": 77.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 839.0,
    "value": 3642.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LnezAAC",
    "hero_image": "https://images.luxuryescapes.com/1ncgyoytwnqj2vndesim",
    "image_two": "https://images.luxuryescapes.com/pdyvpn74h49exn0kyze",
    "image_three": "https://images.luxuryescapes.com/h6txgktrtsb5xwnyropf",
    "vendor_name": "X10 KhaoLak Resort",
    "title": "Contemporary Khao Lak Beachfront Retreat with Dining Experiences & Massages",
    "description": "Embrace the tranquillity of a tropical Thailand retreat at X10 Khaolak Resort, with its perfect location on golden sands overlooking crystal blue waters. Ideal for a couple's getaway or family escape, you’ll love the welcoming Thai hospitality at this award-winning property. Your package includes daily breakfast, two lunches or dinners, a 60-minute massage each, unlimited buy-one-get-one-free cocktails, beers and wines, return transfers from Phuket Airport and late checkout at 4pm.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "X10 Khaolak Resort APR2020",
    "offer_address": "38/9 Moo 6, Petchakasem Road, Khuk Khak, Takuapa, Phangnga 82220 Khao Lak",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 12,
    "price": 318.0,
    "value": 974.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AbPEnAAN",
    "hero_image": "https://images.luxuryescapes.com/0es1xicny5cboadprolo",
    "image_two": "https://images.luxuryescapes.com/wmyupzdjp5rtse9h024c",
    "image_three": "https://images.luxuryescapes.com/zdnzw5vztj59vsd48ung",
    "vendor_name": "Grand Mercure Khao Lak",
    "title": "Grand Mercure Khao Lak Beachfront Escape with Daily Breakfast, Daily Lunch or Dinner & Cocktails",
    "description": "Experience the tropical oasis that is Grand Mercure Khao Lak Bangsak, a pristine hideaway ensconced in tropical gardens on Thailand's tranquil southwest coast. Inspired by traditional riverside Thai villages, this unique resort is centred on a picturesque, winding canal, lined by immaculate accommodation. High-end amenities invite you to surrender to complete relaxation: enjoy an invigorating swim in the seafront swimming pool, spoil yourself at the indulgent Pran Spa, or taste fresh takes on traditional Thai favourites at two innovative onsite restaurants.\n\nTucked away in Khao Lak, Phang Nga, this palm-fringed oasis is the ideal spot for a true Thai beachside experience. The tranquil town offers fun in the sun, fine-dining restaurants and boutique shops, on a background of jungle-clad mountains - this quiet corner of the country ensures you will end your Thailand escape feeling completely relaxed.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Grand Mercure Khao Lak Bangsak",
    "offer_address": "71 Moo 7, Bang Muang Takuapa District, Phang Nga 82190, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 714.0,
    "value": 2262.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CoEX8YAN",
    "hero_image": "https://images.luxuryescapes.com/dvmw0ggo9dx66tx54i2i",
    "image_two": "https://images.luxuryescapes.com/81gpj7oimvl95lq7y4k",
    "image_three": "https://images.luxuryescapes.com/9i7an4pdr4lfrwtplnp",
    "vendor_name": "Grand Mercure Khao Lak",
    "title": "Khao Lak Beachfront Paradise with Massages, Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Ensconced in tropical gardens on Thailand's tranquil southwest coast, this pristine hideaway offers endless indulgence tucked away by the shores of Khao Lak. Inspired by traditional riverside Thai villages, this unique resort is centred on a picturesque, winding canal, lined by lush greenery and immaculate accommodation.\n\nHigh-end amenities invite complete relaxation: enjoy an invigorating swim in the beachfront pool, spoil yourself at Pran Spa, or experience a fresh take on Thai favourites at one of two innovative restaurants, Patio and Green Mango. Soak Pool Bar is on hand with tropical sips while the kids are entertained at Manta Ray Kids' Corner.\n\nWhen you manage to tear yourself away from your slice of paradise, enjoy a stroll along the white-sand beach mere moments from the resort, or head to one of the nearby elephant sanctuaries to learn about these gentle giants. Along the beachfront, buzzy beach bars and cafes beckon with sundowner cocktails with your toes in the sand.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Grand Mercure Khao Lak Bangsak",
    "offer_address": "71 Moo 7, Bang Muang Takuapa District, Phang Nga 82190, Thailand",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 1776.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IsO6DYAV",
    "hero_image": "https://images.luxuryescapes.com/m2jiaesnygxqpzst3yf3",
    "image_two": "https://images.luxuryescapes.com/gpmrt0vlijac054hdmyu",
    "image_three": "https://images.luxuryescapes.com/690b2g1m9laz7gfoogmj",
    "vendor_name": "The Waters Khao Lak by Katathani Collection",
    "title": "Thailand Poolside Oasis: Khao Lak Luxury with Massages, Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Enter a world of cascading waterfalls, turquoise pools and golden sands at this tranquil resort. Located in Thailand’s breathtaking Khao Lak region, this lavish hideaway boasts more than 3,000 square metres of water across seven pools, each flanked by swaying palm trees. With a guaranteed upgrade to the resort's Water Wing Pool category, every room enjoys easy or direct pool access.\n\nRelax with a sleep-in before enjoying breakfast at Amici Italian Bistro. Then, spend the afternoon sipping cocktails at the swim-up Bubble Bar, rejuvenating at the onsite Sala Massage or keeping little ones entertained at the resort's dedicated games room and tech hub.\n\nFor even more adventure, explore the Water Zone and Sands Castle Kids' Club at the nearby sister property, The Sands Khao Lak, with complimentary entry and shuttle transfers included. With just a five-minute walk down to the beach, the world truly is your oyster at this coastal paradise.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Waters Khao Lak",
    "offer_address": "67/238 Moo5, Kukkak, Khao Lak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 499.0,
    "value": 1413.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DneeAAC",
    "hero_image": "https://images.luxuryescapes.com/13qqp3ocneuhkkix13am",
    "image_two": "https://images.luxuryescapes.com/u9k9noy57at9hgdhqy",
    "image_three": "https://images.luxuryescapes.com/2nk20dycfwd76fw87yj",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Bestselling Khao Lak Beachfront Escape with Daily Breakfast & Nightly Free-Flow Cocktails",
    "description": "Sat amid a luscious forested headland and flowing onto the dazzling sands of Nang Thong Beach, The Sands Khao Lak by Katathani is your tranquil and secluded escape just minutes from the town’s main shopping strip and an hour from vibrant Phuket. You need stray no further than the resort, as each wing is carefully crafted to cater to your need for rest, rejuvenation or play, so you can discover everything this Luxury Escapes favourite has to offer, including The Sands Luxury Club.\n\nUnwind across two pools, satiate any craving at your choice of three restaurants - including The Floating Market, overlooking the glistening lagoon - and sip drinks at four bars, all offering unique water vistas. Plus, there are distinct adults-only pool and garden areas, the Sands Castle kids' club and the pavilions of The Spa, which will embrace you with warm sea breezes and the scent of exotic flowers.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani",
    "offer_address": "10/18 Petchkasem rd. Moo 7 Kukkak Takuapa Phang Nga 82220, Thailand",
    "percentage_discount": 41.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 689.0,
    "value": 1163.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008JBW0AAO",
    "hero_image": "https://images.luxuryescapes.com/bpcn4smb6m15gujjpao",
    "image_two": "https://images.luxuryescapes.com/x8tc2i5998fbuh5x7rj6",
    "image_three": "https://images.luxuryescapes.com/5eom3cdfoip0zmotau6n",
    "vendor_name": "Mai Khao Lak Beach Resort and Spa",
    "title": "Khao Lak Beachfront Family Fun with Daily Breakfast, Daily Lunch or Dinner, All-Inclusive Drinks & Two Kids Stay Free",
    "description": "Experience sandy bliss and tropical splendour at the fun-filled Mai Khao Lak Beach Resort and Spa - the ultimate beachfront playground on the palm-fringed shores of Thailand. This Travellers' Choice 2021 Tripadvisor property boasts incredible facilities, including five lagoon pools, waterslides, a kids club and an indoor cinema. For a splash of sophistication, enjoy a swim-up bar, the tranquil Mind Spa, and a meal at the rooftop Sky Restaurant & Bar, which boasts incredible Andaman Sea views.\n\nWith a brand-new wing built, you can now enjoy two giant waterslides, a pirate ship water park, family pools, kids clubs and an exclusive adults-only area. Rest assured the young and young at heart will never be short on things to do. This hidden gem on the Andaman Sea is perfect for those looking to retreat to the serene beaches of Thailand. Surrounded by coconut groves and lush forest, with the sugar-fine sands of Pak Weep Beach at its doorstep, Mai Khao Lak Beach Resort and Spa enjoys a breathtaking location around 15 minutes drive from the town centre. Spend days exploring the small, local villages, or set sail to the Similan Island for amazing snorkelling and dive sites.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Mai Khao Lak Beach Resort & Spa",
    "offer_address": "9/16-17 Phetchakasem Road, Moo. 1 Pakweep Beach, Khao Lak, Phang-Nga 82190, Thailand",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 639.0,
    "value": 1598.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuWeRAAV",
    "hero_image": "https://images.luxuryescapes.com/pfqkw7ejdir0uybiegf9",
    "image_two": "https://images.luxuryescapes.com/zjwu69wiw4nh91strbeg",
    "image_three": "https://images.luxuryescapes.com/j65qi7395t6lppfzs3sf",
    "vendor_name": "The Little Shore Khao Lak by Katathani",
    "title": "Grand Opening: Little Shore by Katathani Khao Lak Pool Suites with Daily Breakfast, Daily 3-Course Dinner & Nightly Cocktails",
    "description": "Khao Lak's most anticipated grand opening is here! Be among the first to experience the newest jewel in Katathani's prestigious collection of retreats along the Andaman Sea. Tucked away on the pristine Nang Thong Beach, this brand-new resort beckons with contemporary suites and villas, each featuring a sparkling private pool that redefines indulgence. Discover the epitome of relaxation amid meticulously manicured resort gardens, savouring daily feasts at The Kati Restaurant, a rejuvenating massage at Nalinya Villa Spa and a delectable floating breakfast hand-delivered to your private pool.\n\nRenowned for delivering unforgettable experiences with impeccable service, Katathani’s newest beachfront paradise will undoubtedly solidify its status as one of Thailand’s most-loved resort brands. For those seeking adventure, Khao Lak’s local charm is just a stone’s throw away. Explore bustling markets, sample mouthwatering street food or bask in lazy afternoons on the golden and black sands just steps from your luxurious accommodation. However you choose to holiday, The Little Shore Khao Lak by Katathani has you covered - be it a romantic sunset dinner, lively poolside fun with the family or making the most of the resort's prime seaside location.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Little Shore Khao Lak by Katathani",
    "offer_address": "10 Kukkak, 28 Phet Kasem Road, Tambon Khuekkhak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1079.0,
    "value": 2863.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjsWAAS",
    "hero_image": "https://images.luxuryescapes.com/9u8rz9ymbhryme3q0hjh",
    "image_two": "https://images.luxuryescapes.com/csny9gzwsjxlvxgti2o4",
    "image_three": "https://images.luxuryescapes.com/jobnkop41aylftnzgbds",
    "vendor_name": "Outrigger Khao Lak Beach Resort",
    "title": "Idyllic Thailand Beach Escape with Indulgent Dining, Daily Massages & Cocktails",
    "description": "Between a backdrop of lush mountains and the palm-fringed sands of Bangsak Beach lies your next idyllic escape -Outrigger Khao Lak Beach Resort. A spacious haven overlooking the azure waters of the Andaman, this perfectly manicured resort boasts beautifully landscaped gardens, authentic Thai dining, a lagoon pool with sea views and direct beach access. In addition to a one-way private transfer, you'll wake up every morning to an international buffet breakfast, work your worries away with a daily Thai massage, toast to your escape with a daily poolside cocktail and experience an array of international and local flavours with two, two-course dinners at the resort's spectacular restaurants.\n\n**Travelling with family?** Upgrade to the family suite and up to two children (aged 11 years and under) get to stay and eat for free.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Manathai Khao Lak - 2020",
    "offer_address": "2/4 Moo 8, Bangmuang Takua Pa District, Phang-nga 82190, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 8,
    "max_duration": 12,
    "price": 464.0,
    "value": 1246.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CBwkAAG",
    "hero_image": "https://images.luxuryescapes.com/aqy49vrfnkdurnzuzd93",
    "image_two": "https://images.luxuryescapes.com/rhps4l5fz8qkcrh3j0az",
    "image_three": "https://images.luxuryescapes.com/haoeagzk1j3hsl36du6l",
    "vendor_name": "Avani+ Khao Lak Resort",
    "title": "Brand-New Khao Lak Five-Star Oceanfront Escape with All-Inclusive Dining, All-Day Drinks & Onsite Waterpark",
    "description": "Awake each morning to spectacular views of the endlessly shimmering Andaman Sea with an all-inclusive, five-star stay at the brand-new Avani+ Khao Lak Resort. Positioned on its very own stretch of porcelain-white sands, this is a secluded tropical escape that’s romantic and family-friendly in equal measure. Splash across four dazzling lagoon-style pools or hit up the resort’s many top-notch dining venues - savour laidback Italian plates at Mi Scusi, authentic Indian bites at Tiffin by Elements, and infused rum cocktails on Khao Lak’s warm sands at The Mojito Factory.\n\nAvani+ Khao Lak Resort offers a smorgasbord of onsite activities to keep the young - and the young at heart - occupied. Learn authentic Muay Thai techniques at the resort’s boxing ring, ascend the rock-climbing wall, get goofy at the beachside skate park or savour every thrilling moment at Avani+ Khao Lak Resort’s onsite waterpark. When you’re ready to explore outside of the resort, Khao Lak’s unforgettable seascapes and emerald islands await, just a short catamaran ride away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Avani+ Khao Lak Resort",
    "offer_address": "99 Moo 8, Khao Lak Tumbon, Bang-Muang, Takua-Pa, Khao Lak, Phang-Nga 82190, Thailand",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 831.0,
    "value": 1932.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HuKlAAK",
    "hero_image": "https://images.luxuryescapes.com/af1ykfm50b2cx7gmmqam",
    "image_two": "https://images.luxuryescapes.com/t4vqjtunye71aailfcjj",
    "image_three": "https://images.luxuryescapes.com/f3tbs6i4sasmr6ndq47t",
    "vendor_name": "Grand Mercure Khao Lak",
    "title": "Grand Opening: Grand Mercure Khao Lak Bangsak Beachfront Escape with Daily Breakfast, Daily Lunch or Dinner & Cocktails",
    "description": "Be one of the first to experience the tropical oasis that is Grand Mercure Khao Lak Bangsak, a brand-new hideaway ensconced in tropical gardens on Thailand's tranquil southwest coast. Inspired by traditional riverside Thai villages, this unique resort winds around a picturesque canal, lined by pristine new accommodation.\n\nTucked away in Khao Lak, Phang Nga, this palm-fringed oasis invites you to surrender to complete relaxation. Enjoy an invigorating swim in the seafront swimming pool, spoil yourself at the indulgent Pran Spa, or explore the tropical waters on a sea kayak or stand-up paddleboard. Khao Lak is the ideal spot for a true Thai beachside experience, offering fun in the sun, jungle-clad mountains, fine-dining restaurants and boutique shops, while remaining a quieter corner of the country to ensure you leave feeling completely relaxed.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Grand Mercure Khao Lak Bangsak",
    "offer_address": "71 Moo 7, Bang Muang Takuapa District, Phang Nga 82190, Thailand",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 299.0,
    "value": 731.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ed20eAAB",
    "hero_image": "https://images.luxuryescapes.com/bguv8zsv6fb489ypxvrt",
    "image_two": "https://images.luxuryescapes.com/wtfe297kzjpzl1dvxwio",
    "image_three": "https://images.luxuryescapes.com/gtjn5ek12kzdhgtbhdis",
    "vendor_name": "Ramada Resort by Wyndham Khao Lak",
    "title": "Beachfront Khao Lak Paradise with Daily Breakfast, Nightly Dinner & Free-Flow Drinks Hour",
    "description": "Surrender to tropical relaxation at Ramada Resort by Wyndham Khao Lak, a blissful beachfront escape on the popular Bang Niang Beach. Sunny days can be spent kicking back with a cocktail by the pool, wading over to the swim-up Pool Bar to order your next drink, or lazing under the resort’s signature red parasols. Take a break from the beach and head into Sassi's Beach Club for chilled-out beats, tropical cocktails and mouthwatering meals - if you time it right, you'll be perfectly positioned to enjoy a spectacular sunset.\n\nWhen it comes time to relax and recharge, The Spa is the place to be. From facials to detoxifying body scrubs and Thai massages, each heavenly treatment is guaranteed to set your body clock to island time. Plus, each treatment room features a herbal steam room or sauna, a Jacuzzi bath and an outdoor rain shower for added pampering. When you can tear yourself away from your resort, explore Khao Lak with easy access to Bang Niang Market and Ton Chong Fa Waterfall.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Ramada Resort by Wyndham Khao Lak",
    "offer_address": "59 Moo 5, Kukkak, Takuapa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 1963.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PQi1AAG",
    "hero_image": "https://images.luxuryescapes.com/hspvtucy9bjhffbb9gjf",
    "image_two": "https://images.luxuryescapes.com/oytgr27wwu6cty8i4r",
    "image_three": "https://images.luxuryescapes.com/x07ioppd6nx6hr64mz9t",
    "vendor_name": "ROBINSON Club Khao Lak",
    "title": "Five-Star All-Inclusive Khao Lak Luxury with Guaranteed Triple Upgrade to Spacious Bungalow with Private Pool",
    "description": "Soak up the sun and escape the crowds at the incredible Robinson Club Khao Lak - an award-winning five-star beachfront sanctuary rated among the top 10% of properties worldwide on Tripadvisor. Overlooking Khao Lak's western shore, with a private 13-kiometre stretch of sugar-fine sand, Robinson Club Khao Lak's unbeatable location will instantly make you forget the outside world. \n\nSet amid fragrant tropical foliage, close to untouched rainforests, this is as close as you can get to paradise. With several swimming pools, multiple dining options and endless sun-kissed activities to choose from, this elegant resort offers its privileged guests a secluded sanctuary with everything at its fingertips. Find your perfect patch of sand on the resort beachfront, sweat it out in the state-of-the-art gymnasium, cool off in the azure waters with a swathe of watersports, or take up a game of soccer, beach volleyball or tennis before a relaxing treatment in the spa.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Robinson Club Khao Lak",
    "offer_address": "9/9 หมู่ 1 Khuekkhak, Takua Pa District, Phang-nga 82220, Thailand",
    "percentage_discount": 79.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 929.0,
    "value": 4452.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4wlPAAR",
    "hero_image": "https://images.luxuryescapes.com/rsinma42701357jntl",
    "image_two": "https://images.luxuryescapes.com/2vy0mlrhzbygqhvom0zg",
    "image_three": "https://images.luxuryescapes.com/ivwjleapjqdfj0s0e5eb",
    "vendor_name": "The Haven Khao Lak",
    "title": "Five-Star Khao Lak Beachside Oasis with Daily Breakfast, Massages & Cocktails",
    "description": "Let your worries drift away at the spectacular The Haven Khao Lak, an opulent resort located in a tranquil spot on the golden sands of Khuk Khak Beach, where privacy and comfort are valued above all else. Catering to guests 12 and older, this secluded oasis features an enormous 5,000sqm saltwater pool surrounded by verdant gardens, with the sapphire-blue ocean and a white-sand beach forming the backdrop to an indulgent escape. Pamper yourself with daily 30-minute massages at Aqua Spa or indulge in a cocktail or two at Angel Wing Bar or Vongole Swim Up Bar as you take in panoramic views of the Andaman Sea.\n\nAfter exploring every inch of this exquisite resort, take a romantic stroll down Khuk Khak Beach and visit the nearby night markets, local restaurants and bars. If you're a watersports aficionado, practice your snorkelling skills at any of the neighbouring islands or at the impressive Phang Nga Bay (additional charges apply). Then, head back for a decadent dinner at the resort’s Vongole Restaurant, where you’ll be treated to the freshest daily catch of seafood creatively dished up in traditional Thai style or in classic Italian favourites.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Haven Khao Lak",
    "offer_address": "61/4 Moo 3 Khuk Khak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 639.0,
    "value": 2209.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JAXtIAO",
    "hero_image": "https://images.luxuryescapes.com/go4jho4x92zmkcp4cy",
    "image_two": "https://images.luxuryescapes.com/zx36e8rttpzwtxbh5y",
    "image_three": "https://images.luxuryescapes.com/fn2xpu2fnedmk78p7wm",
    "vendor_name": "Casa de la Flora",
    "title": "Boutique Khao Lak Modern Pool Villas with Daily Breakfast, Dinner, Massage & Free-Flow Cocktail Hour",
    "description": "This boutique collection of luxury villas places cutting-edge design in an untouched tropical location in Khao Lak, with the shimmering Andaman Sea right on your doorstep. The 34 impressive villas, beautifully decorated with designer touches, make Casa de La Flora a unique private hideaway. Be one of the few to sip on cocktails from your private deck while staying at the first modernist sanctuary in Khao Lak.\n\nPrivate villas and resort luxury rolled into one, the sprawling complex comes complete with Spa La Casa, boasting tailor-made Thai treatments, and the stylish La Aranya beachfront restaurant and bar, offering international fare with a Thai twist.\n\nFurther afar, hop on a boat and discover the untouched paradise of Similan Islands Marine National Park. Put on your snorkel and discover colourful reefs, countless tropical fish and coral constellations before returning to your tropical oasis for ultimate relaxation.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Casa de La Flora",
    "offer_address": "67/213 Moo 5, Khuk Khak, Khao Lak, Phang Nga 82220, Thailand",
    "percentage_discount": 51.0,
    "min_duration": 5,
    "max_duration": 18,
    "price": 1059.0,
    "value": 2180.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cL9lsQAC",
    "hero_image": "https://images.luxuryescapes.com/c2ihz4ni4dsrmyujv9vq",
    "image_two": "https://images.luxuryescapes.com/53r1pdfh486jkbgchd",
    "image_three": "https://images.luxuryescapes.com/pexsxnmq7olguicem1u",
    "vendor_name": "La Vela Khao Lak",
    "title": "Idyllic Thai Beachfront Retreat with Daily Free-Flow Drinks",
    "description": "Experience Khao Lak’s best-kept secret: La Vela, spectacularly located on the shores of Bang Niang beach. Succumb to the indulgent relaxed holiday vibe while you enjoy daily breakfast, one 45-minute massage per person, two three-course dinners, a convenient airport pick-up and a daily hour of free-flow drinks served at Kokulo Beach Club, Khao Lak's only beach club.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "La Vela Khao Lak",
    "offer_address": "98/9 Moo 5, Khuk Khak, Takuapa, Khao Lak, Phang Nga, 82220, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 621.0,
    "value": 2016.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ItvY3YAJ",
    "hero_image": "https://images.luxuryescapes.com/3m3ackq3am79oga25ugi",
    "image_two": "https://images.luxuryescapes.com/a7i5gwlt9d06leb4ztv",
    "image_three": "https://images.luxuryescapes.com/qlrzsi70k621os8ylol",
    "vendor_name": "Pullman Khao Lak Resort",
    "title": "Khao Lak Beachfront Indulgence with All-Inclusive Dining, Unlimited Free-Flow Drinks & Massages",
    "description": "Some experiences in life shouldn't be missed. Place an all-inclusive stay at this lavish five-star resort at the top of your travel to-do list. Perfectly positioned facing the cool blue waters of the Andaman Sea, this beachfront haven caters to your every whim.\n\nWhile there's plenty to discover beyond the hotel, this luxury oasis will entice you to stay and enjoy, providing both relaxation and excitement for the entire family. Savour a fusion of flavours at Plai Dining Room and Kram Beach Club, plunge into one of two aquamarine pools, or visit the serene Rosalyn Spa for a heavenly treatment.\n\nLittle ones can race through the twin-looped waterslide or make friends at the onsite kids' club while parents sip on a refreshing cocktail at Tharn Pool Bar.\n\nWhile the top-notch facilities make it difficult to tear yourself away from the serenity of the resort, the surrounding wonders reward those who choose to explore. For eager snorkelers or beach lovers, the gorgeous Similan and Surin Islands are a must-visit, and for history enthusiasts, Takua Pa Old Town is located a short drive away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Pullman Khao Lak Resort",
    "offer_address": "46/109, Moo 2, Soi 46 Laem Son Takua Pa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 71.0,
    "min_duration": 6,
    "max_duration": 21,
    "price": 714.0,
    "value": 2463.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Hi4MIAS",
    "hero_image": "https://images.luxuryescapes.com/bh131u89ekaknm5w1atn",
    "image_two": "https://images.luxuryescapes.com/wupcwwh10rl7u3znmkc",
    "image_three": "https://images.luxuryescapes.com/odm0lltrc8had79mnp",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Khao Lak Beachfront Oasis with Daily Breakfast, Nightly Free-Flow Cocktail Hour & Massages",
    "description": "Set amid a luscious forested headland and flowing onto the dazzling sands of Nang Thong Beach, this Khao Lak resort is your tranquil and secluded escape just minutes from the town’s main shopping strip and an hour from vibrant Phuket. \n\nYou need stray no further than the resort, as each wing is carefully crafted to cater for your primary need of rest, rejuvenation or play - seek serenity amongst the waterlilies and palms of the Lagoon Wing, splash about in a miniature water park in the Aqua Wing or relax poolside in the Seaside Wing.\n\nUnwind by your choice of three pools, satiate any craving at your choice of three restaurants - including The Floating Market, overlooking the glistening lagoon - and sip drinks at four bars, all offering unique water vistas. Plus, enjoy the benefits of distinct adults-only areas, Sands Castle kids' club and the pavilions of The Spa, perfect for an afternoon spent curing aches and pains with a Thai massage.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani",
    "offer_address": "10/18 Petchkasem rd. Moo 7 Kukkak Takuapa Phang Nga 82220, Thailand",
    "percentage_discount": 72.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 599.0,
    "value": 2116.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UyNwGQAV",
    "hero_image": "https://images.luxuryescapes.com/ewlupmrg0immwioeu282",
    "image_two": "https://images.luxuryescapes.com/hjdqwzbdzpxntjzbspwl",
    "image_three": "https://images.luxuryescapes.com/mdbvzspfn8zmx6kahjls",
    "vendor_name": "Sensimar Khaolak Beachfront Resort",
    "title": "Adults-Only Indulgence in Khao Lak, Thailand",
    "description": "Escape it all for the beachfront beauty of Khao Lak, Thailand, staying at the adults-only Sensimar Khao Lak Beachfront Resort. Enjoy daily breakfast, your choice of either lunch or dinner daily, two hours of relaxing massage therapy to share, an airport transfer on arrival, early check-in and late check-out, complimentary Wi-Fi and complimentary non-motorised water sports including windsurfing and kayaking.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Sensimar Khao Lak Beachfront Resort",
    "offer_address": "26/15 Moo7 Petchakasem Road, Khuk Khak,, Khao Lak,, Takua Pa District, 82220, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 8,
    "max_duration": 12,
    "price": 442.0,
    "value": 1203.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dq89LAAR",
    "hero_image": "https://images.luxuryescapes.com/tg1sathz1suc8kmp4cx",
    "image_two": "https://images.luxuryescapes.com/ffovftbg3glysznjkb9d",
    "image_three": "https://images.luxuryescapes.com/wfzvp2ecqnpmzx7r95po",
    "vendor_name": "JW Marriott Khao Lak Resort Suites",
    "title": "Khao Lak Ultimate Family Package at One of Asia’s Best Resorts: Two-Bedroom Suites with All-Inclusive Dining",
    "description": "It’s the age-old problem for families - staying at an incredible resort but not being guaranteed connecting rooms. Well, you’ve come to the perfect place - the JW Marriott Khao Lak Suites is designed for families. Not only do you get access to all the spectacular JW Marriott Resort & Spa facilities (think seven restaurants, a mini waterpark, waterslides, lots of beach activities and Southeast Asia’s longest pool) but you can also stay in an expansive two-bedroom suite - the smallest suite on offer is a huge 89 square meters and allows up to five guests. There’s even a separate living area where adults can chill out after the kids have gone to bed. Pool access suites offer even more space at 111 square metres. If you’re wondering how Hollywood celebrities travel with their families, it’s a lot like this.\n\nThe suites are brand new and offer easy access to the super fun kids’ area at the resort. If parents want some time away, drop the kids in the kids’ club for a few hours and head to the separate adults-only section of the resort. Relax with confidence knowing little ones are taken care of with constant activities for kids of all ages throughout the day, from fairy-floss-making to magicians to incredible Thai arts and crafts, all overseen by the fantastic staff.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "JW Marriott Khao Lak Resort Suites",
    "offer_address": "41/12 Moo 3 Khuk Khak, Khao Lak, Takua Pa District, Phang-nga 82220, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 8,
    "max_duration": 39,
    "price": 1852.0,
    "value": 189.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AaO5vAAF",
    "hero_image": "https://images.luxuryescapes.com/58jomf7n2ercf70me14x",
    "image_two": "https://images.luxuryescapes.com/ce28kkuyoock9jpznzd8",
    "image_three": "https://images.luxuryescapes.com/15oeojcr5kodbx8ttpw6",
    "vendor_name": "Mai Khao Lak Beach Resort and Spa",
    "title": "Khao Lak Beachfront Bliss with Daily Breakfast, Daily Dinners & Free-Flow Drinks",
    "description": "Discover beachside bliss and tropical splendour at the fun-filled Mai Khao Lak Beach Resort & Spa - the ultimate Thai beachfront playground on the palm-fringed shores. This acclaimed family-friendly resort boasts incredible facilities, including five lagoon pools, waterslides, a kids' club and an indoor cinema. For a splash of sophistication, enjoy a swim-up bar, the tranquil Mind Spa, and delectable traditional cuisine at the rooftop Sky Restaurant & Bar, which boasts incredible Andaman Sea views.\n\nWith a brand-new wing, you can now enjoy two giant waterslides, a pirate ship water park, family pools and an exclusive adults-only area: rest assured the young and young at heart will never be short on things to do. Step out of the resort grounds to find yourself surrounded by coconut groves and lush forest, with the sugar-fine sands of Pak Weep Beach at your doorstep. The resort's breathtaking location, just 15 minutes' drive from the town centre, makes it easy to spend days exploring the small, local villages, or setting sail to Similan Island for amazing snorkelling and dive sites.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Mai Khao Lak Beach Resort & Spa",
    "offer_address": "9/16-17 Phetchakasem Road, Moo. 1 Pakweep Beach, Khao Lak, Phang-Nga 82190, Thailand",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 649.0,
    "value": 1659.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006yVB6AAM",
    "hero_image": "https://images.luxuryescapes.com/ajtsq6bg4azau90ubxpcj",
    "image_two": "https://images.luxuryescapes.com/8cbdnxua3aej4g72ayx",
    "image_three": "https://images.luxuryescapes.com/mkgm0oy075a61jy335k",
    "vendor_name": "Bangsak Village Khao Lak",
    "title": "Khao Lak Adults-Only Beachside Retreat with Daily Breakfast, Daily Lunch or Dinner, Nightly Cocktails & Massages",
    "description": "On a flawless white sand beach overlooking aqua waters in Khao Lak you'll find the perfect couples retreat, Bangsak Village Khao Lak, ranked within the top 10% of properties on Tripadvisor.\n\nWith no children under 12 years allowed, absolute tranquility is assured. Each room is decorated in warm hues and soaked in natural light with touches of Thai-inspired décor, offering a welcomed refuge when you need to recharge after a day of exploring. Back at the resort, head to the beachfront Kala Spa for a restorative massage then dine at one of the onsite restaurants: the terrace-style Restaurant Rim Lae Bangsak Restaurant serving mouth-watering Thai (or international dishes) for a memorable outdoor dining experience. There's also an infinity pool with an integrated jacuzzi and ocean views where you can bask in the tropical ambience - we're convinced you’ll never want to leave.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Bangsak Village Khao Lak - Oct 2021",
    "offer_address": "1, 1 หมู่ 8 Petchkasem Rd, Takua Pa District, Phang-nga 82190, Thailand",
    "percentage_discount": 66.0,
    "min_duration": 7,
    "max_duration": 10,
    "price": 371.0,
    "value": 1087.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dcetdQAA",
    "hero_image": "https://images.luxuryescapes.com/fazxc4nzwfxep23enh",
    "image_two": "https://images.luxuryescapes.com/byj2hdw16g169ycw9ul9",
    "image_three": "https://images.luxuryescapes.com/tivin3cuz5cz9phzynib",
    "vendor_name": "Le Meridien Khao Lak Beach & Spa Resort",
    "title": "Grand Opening: All-Inclusive Khao Lak Beachfront Luxury with Daily Dining & Free-Flow Drinks",
    "description": "Experience a whole new level of all-inclusive Marriott luxury with our best-ever Khao Lak deal at the newly opened Le Méridien Khao Lak Resort & Spa. A secluded haven of relaxation on the pristine sands of Bangsak Beach, Le Méridien Khao Lak reinvents the quintessential Khao Lak beachfront experience. Enjoy an unmissable all-inclusive package, offering daily buffet breakfast and lunch, a nightly choice of three-course set-menu or buffet dinner, and unlimited drinks across six exceptional venues (drinks available 11am to 10pm).\n\nRound out this Instagram-worthy escape with a 30-minute Thai massage per adult, 4pm late checkout, subject to availability, and one-way private transfer from Phuket International Airport. Plus, there are absolutely zero surcharges, so you can travel any time for the same all-inclusive price.\n\n**Taking the family?** Upgrade to any family room and up to three kids (aged 11 years and under) stay, play and eat free.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Le Méridien Khao Lak Resort & Spa",
    "offer_address": "31 Moo 7, Bangmoung, Takuapa District, Phang Nga Province, Khao Lak, Thailand, 82190",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 1239.0,
    "value": 3457.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C5ASbAAN",
    "hero_image": "https://images.luxuryescapes.com/hiajeitivnhrgbodd5oa",
    "image_two": "https://images.luxuryescapes.com/5wpj1y7mpmg8jlj9904",
    "image_three": "https://images.luxuryescapes.com/8az9ddfzcqyryscqqqjm",
    "vendor_name": "Bangsak Village Khao Lak",
    "title": "Romantic Khao Lak Beachside Retreat with Daily Dining, Cocktails & Massages",
    "description": "On a flawless white-sand beach overlooking aquamarine waters in Khao Lak, Thailand, you'll find the perfect barefoot retreat for couples: Bangsak Village Khao Lak. Welcoming guests aged 12+ only, this boutique resort offers tranquillity and palm-fringed peace on the Andaman Coast. Head to the beachfront Kala Spa for a restorative massage before dining at the terrace-style Rim Lae Bangsak Restaurant, serving mouthwatering Thai, seafood and international dishes. Cool off in the infinity pool with an integrated jacuzzi, where sweeping ocean views mean you’ll never want to leave.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Bangsak Village Khao Lak",
    "offer_address": "1/1 Moo 8, Petchkasem Road, Bangmuang, Takuapa , Phang-nga, Khao Lak 82190, Thailand",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 31,
    "price": 419.0,
    "value": 796.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FlctvAAB",
    "hero_image": "https://images.luxuryescapes.com/8dho2j31xmnqpmbpwxvo",
    "image_two": "https://images.luxuryescapes.com/jncumts3p48kiqove4ge",
    "image_three": "https://images.luxuryescapes.com/6hzkpc804bwxq8ysvvk8",
    "vendor_name": "Pullman Khao Lak Resort",
    "title": "Pullman Khao Lak Beachfront Escape with All-Inclusive Dining, Unlimited Free-Flow Drinks & One Child Stays Free",
    "description": "There are some experiences in life that should not be missed, and a heavenly stay at Pullman Khao Lak Resort should top your travel to-do list. Perfectly positioned facing the cool blue waters of the Andaman Sea, this beachfront resort will cater to your every need in true Pullman style. While there's plenty to discover beyond the hotel, this luxury oasis will entice you to stay and enjoy. Savour a fusion of flavours at Plai Dining Room and Kram Beach Club, plunge into one of four aquamarine pools, visit the serene Rosalyn Spa or raise your heart rate at the 24-hour Pullman Fit centre.\n\nWhile the top-notch facilities make it difficult to tear yourself away from the serenity of the resort, the surrounding wonders reward those who choose to explore. For eager snorkellers or beach lovers, the gorgeous Similan and Surin islands are a must-visit, and for history enthusiasts, Takua Pa Old Town is located a short drive away. Back at the resort, little ones can race through the twin-looped waterslide or hang at the onsite Kids' Club while parents sip on a refreshing cocktail.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Pullman Khao Lak Resort",
    "offer_address": "46/109, Moo 2, Soi 46 Laem Son Takua Pa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1260.0,
    "value": 4059.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZnbhtQAB",
    "hero_image": "https://images.luxuryescapes.com/mirycahkwe2wcdvtmvy0",
    "image_two": "https://images.luxuryescapes.com/hxrzn9uukxphpcwv1yzs",
    "image_three": "https://images.luxuryescapes.com/bmpjf47wfvnc8syh2skf",
    "vendor_name": "Beyond Resort Khao Lak",
    "title": "Adults-Only Private Villa Oasis with Daily Breakfasts, Daily Drinks and Massages",
    "description": "Treat yourself to the ultimate romantic getaway at Beyond Resort Khao Lak, a relaxing adults-only haven set on a beautiful white sand beachfront. Surrender to complete relaxation in this palm-fringed oasis and indulge with daily buffet breakfast, two exotic buffet dinners, a daily cocktail or beer, two 30-minute massages per person, an exclusive invite to the resort’s management cocktail event with free-flow drinks and canapes, a Thai cooking class followed by lunch and a convenient airport pick up from Phuket.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Beyond Resort Khao Lak - Feb 2019",
    "offer_address": "9/69 Moo 1, Khuk Khak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 77.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 629.0,
    "value": 2683.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GhzWrYAJ",
    "hero_image": "https://images.luxuryescapes.com/us038lr1xnac8w9qf9l",
    "image_two": "https://images.luxuryescapes.com/j3s3v6avcms1pp8la7sdh",
    "image_three": "https://images.luxuryescapes.com/7f1cvmoyroj8yyt3i7dq",
    "vendor_name": "Casa de la Flora",
    "title": "Boutique Khao Lak Pool Villas with Daily Breakfast, Nightly Dinner, Massages & Free-Flow Cocktail Hour",
    "description": "This boutique collection of luxury villas places cutting-edge design in an untouched tropical location in Khao Lak, with the shimmering Andaman Sea right on your doorstep. The 34 impressive villas, beautifully decorated with designer touches, make Casa de La Flora a unique hideaway.\n\nPrivate villas and resort luxury rolled into one, the sprawling complex comes complete with Spa La Casa, boasting tailor-made Thai treatments, and the stylish La Aranya beachfront restaurant and bar, offering international fare with a Thai twist.\n\nFurther afar, hop on a boat and discover the untouched paradise of Similan Islands Marine National Park. Put on your snorkel and discover colourful reefs, countless tropical fish and coral constellations before returning to your tropical oasis for ultimate relaxation.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Casa de La Flora",
    "offer_address": "67/213 Moo 5, Khuk Khak, Khao Lak, Phang Nga 82220, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 969.0,
    "value": 2637.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bhDhvQAE",
    "hero_image": "https://images.luxuryescapes.com/lt83g4rqwbkbqzhbyscd",
    "image_two": "https://images.luxuryescapes.com/immzlzjkab8p1iphqftn",
    "image_three": "https://images.luxuryescapes.com/e0byve3heyakonu7835s",
    "vendor_name": "Kalima Resort & Villas Khao Lak",
    "title": "Grand Opening: Secluded Five-Star Indulgence with Daily Dining",
    "description": "Discover true relaxation nestled between the lush tropical jungle and the vivid blue waters of the Andaman Sea at the brand-new Kalima Resort and Villas Khao Lak. Indulge in high-end luxury draped in outstanding service and first-class amenities, and enjoy your choice of daily lunches or dinners, daily buffet breakfast, one-way airport transfer and daily cocktail each.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Thai Mueang",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Kalima Resort and Villas Khao Lak - 2019",
    "offer_address": "88 3 Lam Kaen, Thai Mueang District, Phang-nga 82210, Thailand",
    "percentage_discount": 79.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 630.0,
    "value": 2976.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LdaWAAS",
    "hero_image": "https://images.luxuryescapes.com/7yrb99izd5bow2su9ues",
    "image_two": "https://images.luxuryescapes.com/04pnx7j2q9236bpg7wv",
    "image_three": "https://images.luxuryescapes.com/1dqtd9k1enlxhrhszewm",
    "vendor_name": "Mai Khao Lak Beach Resort and Spa",
    "title": "Beachfront Family Fun in the Heart of Khao Lak for Two Adults and Three Children",
    "description": "Dive into non-stop family fun and adventure at Mai Khao Lak Beach Resort and Spa - the ultimate beachfront playground on the palm-fringed shores of Thailand, around 1.5 hour's drive from Phuket. Featuring lagoon pools, waterslides, a kids club and an adults-only zone, the resort ensures the young and young at heart will never be short of things to do. Enjoy daily buffet breakfast, airport pick-up, one daily cocktail per adult, select spa treatments, a delicious dinner and more.\n\n**Perfect for families**: Up to three kids (aged 11 years and under) stay and play free.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Mai Khao Lak Beach Resort & Spa - Feb 20",
    "offer_address": "9/16-17 Phetchakasem Rd, Moo. 1, Pakweep Beach, Khaolak, Phang-nga 82190, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 619.0,
    "value": 1645.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aht6pQAA",
    "hero_image": "https://images.luxuryescapes.com/unixkjgokj9738dcrhw7",
    "image_two": "https://images.luxuryescapes.com/k0pvsjkcbu6gw8flij92",
    "image_three": "https://images.luxuryescapes.com/tmktkzw2uihsiofsrfdg",
    "vendor_name": "The Leaf on The Sands by Katathani Resort",
    "title": "Iconic Katathani Escape in Khao Lak with Massages, Dining Inclusions and More",
    "description": "Can’t pick between Thailand’s lush green tropical gardens and golden beaches? At the eco-friendly The Leaf on The Sands hotel, part of the iconic Katathani Collection, you don’t have to. This nature lovers’ paradise is set on a flatland surrounded by hundreds of tropical trees and plants and is located just a five-minute stroll from the beautiful Nang Thong beach. Daily breakfast, massages, beach club access, a two-course lunch, a complimentary cocktail, early check-in and late checkout will make this a relaxing break for the whole family.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Leaf on The Sands by Katathani Collection",
    "offer_address": "40 Phetkasem Road Amphoe Takua Pa Tambon Khuekkhak Chang Wat Phang-nga 82190, Thailand",
    "percentage_discount": 79.0,
    "min_duration": 7,
    "max_duration": 12,
    "price": 187.0,
    "value": 897.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IyRRBYA3",
    "hero_image": "https://images.luxuryescapes.com/n8lxio6bdewi64h491k",
    "image_two": "https://images.luxuryescapes.com/kn9qogzas3f2g68js5",
    "image_three": "https://images.luxuryescapes.com/1wbazp8eew591v9vd5s",
    "vendor_name": "Mai Khao Lak Beach Resort and Spa",
    "title": "Khao Lak Beachfront Suites with Daily Breakfast, Dinner & Free-Flow Cocktails + Two Kids Stay Free",
    "description": "Discover beachside bliss and tropical splendour at this fun-filled paradise, ideally positioned on the palm-fringed shores of Khao Lak. This acclaimed resort includes an Adults-Only Wing and a Family Zone, making it the ultimate playground in paradise - take full advantage of the endless summer with two giant waterslides, a pirate ship water park, family pools and an exclusive adults-only area with two bars and a restaurant.\n\nEnjoy the holiday with a drink in hand at one of the four bars, including two swim-up bars, one of which is adults-only. Relax with a massage at the tranquil Mind Spa and indulge in the delectable traditional cuisine at Talay Thai and The Meal Restaurant, or enjoy a variety of international flavours from Green & Grilled Restaurant, The Food Court and The Restaurant.\n\nStep out of the resort grounds to find yourself surrounded by coconut groves and lush forests, with the sugar-fine sands of Pak Weep Beach at your doorstep. The resort’s breathtaking location, just a 15-minute drive from the town centre, makes it easy to spend days exploring the small, local villages, or setting sail to Similan Island for amazing snorkelling and dive sites.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Mai Khao Lak Beach Resort & Spa",
    "offer_address": "9/16-17 Phetchakasem Road, Moo. 1 Pakweep Beach, Khao Lak, Phang-Nga 82190, Thailand",
    "percentage_discount": 71.0,
    "min_duration": 7,
    "max_duration": 21,
    "price": 559.0,
    "value": 1942.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mV1JAAU",
    "hero_image": "https://images.luxuryescapes.com/u2ntksvyrna7oqnc22h",
    "image_two": "https://images.luxuryescapes.com/7yxymcmj5sh2zv823ic",
    "image_three": "https://images.luxuryescapes.com/5y72jxm8z1y8bgmf9hr",
    "vendor_name": "X10 KhaoLak Resort",
    "title": "Thailand Five-Star Khao Lak Beachside Retreat with Daily Breakfast & Roundtrip Airport Transfers",
    "description": "Embrace the tranquillity of a tropical Thailand escape at the five-star X10 Khaolak Resort. Perfectly located on golden sands overlooking the crystal-clear turquoise waters of the Andaman Sea, the resort provides tropical luxury elevated by warm Thai hospitality and a beachy laidback spirit. It might take you a day just to explore the resort’s five spectacular swimming pools, let alone the extensive treatments available at The Sun Spa or the gourmet delights available at The Main Restaurant and the Seaside Seafood Kitchen. No matter where you end up, you're guaranteed to have an incredible time. \n\nAll the while, you’ll fall in love with the pristine beaches and stunning waters of the prestigious Bang La On coastline. Just down the road from the Bang Niang Market, the resort is perfectly placed to discover both the glittering waters of the ocean and the culture found in the nearby Thai villages set against lush green mountains. Whether you’d rather explore Thailand’s wealth of experiences or kick back and take it easy, X10 Khaolak Resort will be your perfect base.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "X10 Khaolak Resort",
    "offer_address": "38/9 Moo 6, Petchakasem Road, Khuk Khak, Takuapa, Phangnga, Khao Lak 82220, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 200.0,
    "value": 649.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007m7HsAAI",
    "hero_image": "https://images.luxuryescapes.com/pollqteyza55d083sowo",
    "image_two": "https://images.luxuryescapes.com/xnp520z073zrjms5sxi",
    "image_three": "https://images.luxuryescapes.com/8y9ceavv0dzgxeud0o5v",
    "vendor_name": "Moracea by Khao Lak Resort",
    "title": "Khao Lak Five-Star Beachfront Escape with Massages & Daily Breakfast",
    "description": "Embrace sun-kissed tranquility at Moracea by Khao Lak Resort, a five-star haven nestled between the beachfront and lush greenery of Khao Lak Hill. This tropical resort is the perfect hideaway where you can relax, soak up some sun and recharge, all in a natural and peaceful environment.\n\nTake a dip in one of the multiple outdoor swimming pools, pausing to order a delicious cocktail at one of the poolside bars, or the swim-up bar. When you're ready to completely submit to relaxation, Baimai Spa awaits where you can treat yourself to an aromatic massage, body wrap, or scrub treatment. With peaceful villages, markets, waterfalls, tropical forests, and an abundance of white-sand beaches nearby, including one right on your doorstep, Khao Lak is unquestionably one of Thailand’s most popular destinations. You can also rest easy knowing Moracea by Khao Lak Resort is ranked within the top 10% of properties on Tripadvisor worldwide, making it the perfect launchpad to discover it all.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Moracea by Khao Lak Resort",
    "offer_address": "26/20 Khuekkhak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 12,
    "price": 258.0,
    "value": 633.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gdy29AAB",
    "hero_image": "https://images.luxuryescapes.com/txohtwpknazfagsnsn4",
    "image_two": "https://images.luxuryescapes.com/58wq7ipdp7v65nlzjnmi",
    "image_three": "https://images.luxuryescapes.com/wt00a1ksklib25q7hf6s",
    "vendor_name": "Moracea by Khao Lak Resort",
    "title": "Khao Lak Beachfront Stay with Daily Breakfast & Daily Cocktails",
    "description": "Thailand's beachfront awaits you at the sprawling Moracea by Khao Lak Resort, a private resort elevated on a hillside gently sloping towards golden sands. Surrounded by lush greenery for a rainforest feel, the modern resort boasts a fantastic spa, outdoor pools, a vibrant swim-up bar and a casual beachside restaurant with stunning sunset views. With a design incorporating traditional Thai elements with a contemporary twist, Moracea by Khao Lak Resort is the ideal flop-and-drop island escape.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Moracea by Khao Lak Resort",
    "offer_address": "26/20 Khuekkhak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 294.0,
    "value": 893.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RAB8tQAH",
    "hero_image": "https://images.luxuryescapes.com/rr6meotopkikcugksruf",
    "image_two": "https://images.luxuryescapes.com/ymazg8o3rvnjzdj0oms6",
    "image_three": "https://images.luxuryescapes.com/y34rfimjxyy1pmpsdqhv",
    "vendor_name": "Beyond Resort Khao Lak",
    "title": "Beachfront Private Villa Oasis",
    "description": "Discover Thailand’s best kept secret with eight nights of beachside romance at the adults-only Beyond Resort Khao Lak (less than 90 minutes' drive from Phuket). Stay in a Private Palm Villa with daily buffet breakfasts, six relaxing Thai massages, two exotic buffet dinners, a Thai cooking class, invitation to a management cocktail event, convenient airport pickup, cocktails and more for two.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Beyond Resort Khao Lak - March 2018",
    "offer_address": "9/69 Moo 1, Khuk Khak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 78.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 653.0,
    "value": 2941.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DozX3YAJ",
    "hero_image": "https://images.luxuryescapes.com/cj42ww8cq7bzo7x8x9t7",
    "image_two": "https://images.luxuryescapes.com/sfmynu3n8q6mi7bjkx95i",
    "image_three": "https://images.luxuryescapes.com/hjkt012kpliv35jk13ca",
    "vendor_name": "The Haven Khao Lak",
    "title": "Bestselling Khao Lak Beachside Oasis with Daily Breakfast, Dinner & Two-Hour Free-Flow Cocktails",
    "description": "Let your worries drift away at this opulent resort in a tranquil spot on the golden sands of Khuk Khak Beach, where privacy and comfort are valued above all else. Catering to guests 12 and older, this secluded oasis features an enormous 5,000sqm saltwater pool surrounded by verdant gardens, with the sapphire-blue ocean and a white-sand beach as the backdrop.\n\nPamper yourself at Aqua Spa or indulge in two-hour free-flow cocktails or drinks at Vongole Restaurant as you take in panoramic views of the Andaman Sea. You can enjoy a decadent dinner at the resort’s Vongole Restaurant, where you’ll be treated to a fresh daily catch, creatively dished up in traditional Thai style or in classic Italian favourites.\n\nAfter taking in this exquisite resort, take a romantic stroll down Khuk Khak Beach and visit the nearby night markets, restaurants and bars. If you're a watersports aficionado, try snorkelling at the neighbouring islands or at the impressive Phag Nga Bay (additional charges apply).",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Haven Khao Lak",
    "offer_address": "61/4 Moo 3 Khuk Khak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 549.0,
    "value": 2027.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000d0NJlQAM",
    "hero_image": "https://images.luxuryescapes.com/buo3361ilm4cb1pfjf78",
    "image_two": "https://images.luxuryescapes.com/tnrs1qofwfde8a3g4ijw",
    "image_three": "https://images.luxuryescapes.com/ztdo0h0uxt4m2k30jaj",
    "vendor_name": "Ramada Resort by Wyndham Khao Lak",
    "title": "Beachfront Khao Lak Paradise with Decadent Dining & Daily Cocktails",
    "description": "Set on Bang Niang Beach, Ramada Resort by Wyndham Khao Lak invites you to discover a Thai beachfront paradise where you can kick back with a cocktail by the pool bar or under the resort’s signature red parasols. Discover romantic rooms with jacuzzis and villas with private pools a stone's throw from Bang Niang Market, the glistening Sai Rung Waterfall and just over an hour's drive from Phuket Airport.\n\nYour blissful escape includes daily breakfast, themed dining experiences as per your package, a daily cocktail per adult, one 30-minute massage each, a convenient transfer from Phuket Airport to the resort, and lazy 4pm late checkout. Plus enjoy special offers including a two-for-one cocktail happy hour (special menu only) and 20% off selected spa treatments during spa happy hour.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Ramada Resort by Wyndham Khao Lak",
    "offer_address": "59 Moo 5, Tumbon Kukkak, Takuapa District, Phang Nga 82220, Thailand",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 609.0,
    "value": 1507.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DODqdAAH",
    "hero_image": "https://images.luxuryescapes.com/ll6mhefcq8ggwt7lg84",
    "image_two": "https://images.luxuryescapes.com/s20bn6czenps1ryhh1lp",
    "image_three": "https://images.luxuryescapes.com/17p42mru0fucdd1h8b9",
    "vendor_name": "The Haven Khao Lak",
    "title": "Five-Star Khao Lak Beachside Oasis with Daily Breakfast, Massages & Cocktails",
    "description": "Let your worries drift away at The Haven Khao Lak, an opulent resort located in a tranquil spot on the golden sands of Khuk Khak Beach, where privacy and comfort are valued above all else. Catering to guests 12 and older, this secluded oasis features an enormous 5,000sqm saltwater pool surrounded by verdant gardens, with the sapphire-blue ocean and a white-sand beach forming the backdrop to an indulgent escape. Pamper yourself with daily 30-minute massages at Aqua Spa or indulge in a cocktail or two at Angel Wing Bar or Vongole Swim Up Bar as you take in panoramic views of the Andaman Sea.\n\nAfter exploring every inch of this exquisite resort, take a romantic stroll down Khuk Khak Beach and visit the nearby night markets, local restaurants and bars. If you're a watersports aficionado, practice your snorkelling skills at any of the neighbouring islands or at the impressive Phang Nga Bay (additional charges apply). Then, head back for a decadent dinner at the resort’s Vongole Restaurant, where you’ll be treated to the freshest daily catch of seafood creatively dished up in traditional Thai style or in classic Italian favourites.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Haven Khao Lak",
    "offer_address": "61/4 Moo 3 Khuk Khak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 74.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 599.0,
    "value": 2304.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gv54XAAR",
    "hero_image": "https://images.luxuryescapes.com/3ekr03df4mheblqghgjc",
    "image_two": "https://images.luxuryescapes.com/3x43zvvfpactusts0h1x",
    "image_three": "https://images.luxuryescapes.com/bum9pxonac6uj2priez",
    "vendor_name": "Le Menara Khao Lak",
    "title": "Khao Lak Secluded Beachfront Paradise with Infinity Pool & Daily Breakfast, Dinner & Free-Flow Cocktails",
    "description": "Surrounded by lush jungle and kissed by the shining waters of the Andaman Sea, this is the ultimate Khao Lak family-friendly escape, set in one of Thailand’s most breathtaking regions. Located on the secluded sweeping shores of Bang Lut Beach - just an hour’s drive from Khlong Phanom National Park’s spectacular limestone mountain ranges - Le Menara Khao Lak's authentic, village-inspired layout is backed by timeless French sophistication. \n\nSavour open-air dining with magnificent seaside views at L’Amore Restaurant, head to Le Sea for aperitifs and exquisitely barbecued seafood or simply laze the evening away by the resort’s mirage-like central pool.\n\nWhen you’re ready to explore, Khao Lak’s countless treasures await. Venture out Khao Sok National Park to discover breathtaking mountain lake vistas and the oldest evergreen rainforest in the world, surf and splash the day away in Khao Lak’s emerald waters or travel just 90 minutes south to Phuket to discover the island’s vibrant collection of marketplaces, sanctuaries and unforgettable nightlife.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Le Menara Khao Lak",
    "offer_address": "15 Moo 2 Bangmoung, Takua Pa District, Phang-nga 82190, Thailand",
    "percentage_discount": 85.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 3885.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cKQeGQAW",
    "hero_image": "https://images.luxuryescapes.com/7aaybqzqciwqmmw67vb",
    "image_two": "https://images.luxuryescapes.com/xlbpem8q89jv4x2nu7e",
    "image_three": "https://images.luxuryescapes.com/2yosr6x8or4qdfd7kbga8",
    "vendor_name": "Khaolak Laguna Resort",
    "title": "Peaceful Beachfront Getaway with Fantastic Dining Inclusions",
    "description": "Treat yourself to a laidback Thai getaway on the sandy beaches of Khao Lak. Boasting an enviable beachfront location, Khaolak Laguna Resort is a four-star resort with traditional Thai ambience and easy access to all this beautiful area has to offer. Enjoy daily buffet breakfast, your choice of daily lunch or dinner, two 60-minute massages at Chiva Spa, a nightly cocktail and return airport transfers. Plus, up to two children (aged 11 years and under) stay free with breakfast!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Khaolak Laguna Resort",
    "offer_address": "26/8 Moo 7 Khuk-khak Takuapa Chang Wat Phang-nga 82220, Thailand",
    "percentage_discount": 78.0,
    "min_duration": 7,
    "max_duration": 12,
    "price": 553.0,
    "value": 2520.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Cffl4YAB",
    "hero_image": "https://images.luxuryescapes.com/e6ic26ducix8v9dbejt",
    "image_two": "https://images.luxuryescapes.com/3sboeehm4ml5nxv9ib4b",
    "image_three": "https://images.luxuryescapes.com/qr6mi3xmlj6z2chw18j",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Khao Lak Ultimate Beachfront Oasis with Daily Breakfast, Club Access & Nightly Free-Flow Cocktail Hour",
    "description": "Set against the golden shores of Khao Lak, this exceptional resort is the ultimate paradise that not only captivates first-time visitors but leaves them eager to return. Boasting separate adults-only and family-friendly wings, this dreamy retreat invites you to choose your own adventure, with everything you need at your fingertips. \n\nFor those longing for a secluded sanctuary, unwind with a cocktail by the expansive adults-only pool, then indulge in a rejuvenating facial, deep tissue massage, or detoxifying body scrub at the spa, leaving all your stress behind. \n\nFor families chasing adventure, the recently renovated Sand Castle kids’ club is second to none. The expansive water zone is complete with slides and splash areas to tire kids of all ages, and inside you'll find a rainbow-coloured ball pit, creative play areas and a game arcade. \n\nCure any craving at one of the three exquisite restaurants, including The Floating Market, where international fare is served over the sparkling lagoon. Then, savour every sip across four bars, best enjoyed when the sky blushes with pink and gold hues.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani",
    "offer_address": "10/18 Petchkasem rd. Moo 7 Kukkak Takuapa Phang Nga 82220, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 599.0,
    "value": 2226.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lm4uAAC",
    "hero_image": "https://images.luxuryescapes.com/yanl11fjitzllu8xzgi",
    "image_two": "https://images.luxuryescapes.com/m4yva2qwgb87jvwhauu9",
    "image_three": "https://images.luxuryescapes.com/lhakd8s56zv91yew203",
    "vendor_name": "Hive Khaolak Beach Resort",
    "title": "Khao Lak Adults-Only Serenity with Dining & Massages",
    "description": "Head to the unspoiled shores of Khao Lak where cobalt waters, national parks and pristine Lam Kaen beachfront awaits you. Stamped with the TripAdvisor Certificate of Excellence, Hive Khao Lak Beach Resort offers tropical adults-only serenity just steps from the beach. Your escape includes daily buffet breakfast, two lunches or dinners, a daily cocktail each and one 30-minute massage per adult.\n\n**Bonus Inclusions**: Check out the bonus dining experiences when you extend your stay to 10 or 12 nights.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Thai Mueang",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Hive Khaolak Beach Resort",
    "offer_address": "7/3 Moo 2 Ramkean, Thai Mueang District, Phang-nga 82210, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 4,
    "max_duration": 12,
    "price": 497.0,
    "value": 1523.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000QuLmEQAV",
    "hero_image": "https://images.luxuryescapes.com/frowroad87blrqavld9d",
    "image_two": "https://images.luxuryescapes.com/v3l0b85p0zrktiorupig",
    "image_three": "https://images.luxuryescapes.com/utgdenngjblhw5mxcgfc",
    "vendor_name": "Khaolak Bhandari Resort & Spa",
    "title": "Tropical Bliss in Khao Lak",
    "description": "Soak up unparalleled natural beauty and crystal-clear waters with a seven-night escape at Khaolak Bhandari Resort & Spa. Stay in a Thai style Bungalow and enjoy daily buffet breakfast, four set lunches or dinners, daily 30-minute massage per adult, one daily cocktail per adult, return airport transfers, guaranteed checkout at 2 pm, 20% discount for the hotel's Spa and 10% discount on food purchases. Two kids aged 12 years and under stay for free, with all meals inclusions!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Khaolak Bhandari Resort & Spa (OLD)",
    "offer_address": "หมู่7 26/25 Khuekkhak, Takua Pa District, Phang-nga 82190, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 7,
    "max_duration": 12,
    "price": 446.0,
    "value": 1666.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JTEhvAAH",
    "hero_image": "https://images.luxuryescapes.com/wr3srxd7gdssolr92gz",
    "image_two": "https://images.luxuryescapes.com/hoh6rwth6e8om874zsch",
    "image_three": "https://images.luxuryescapes.com/akzbzsgr33410za53wce",
    "vendor_name": "The Waters Khao Lak by Katathani Collection",
    "title": "Khao Lak Escape with Beach Club Day Passes, Daily Breakfast, Massages & Cocktails",
    "description": "Enter a world of cascading waterfalls, turquoise pools and golden sands at this modern stay, part of the award-winning Katathani Collection. Located in Thailand’s Khao Lak area, you can explore over 3,000 square metres of water across seven pools, each flanked by swaying palm trees.\n\nRelax with a sleep-in before enjoying breakfast at Amici, the resort's Italian bistro. Then, spend the afternoon sipping cocktails at the swim-up Bubble Bar or rejuvenate at the onsite Sila Spa.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Waters Khao Lak",
    "offer_address": "67/238 Moo5, Kukkak, Khao Lak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 419.0,
    "value": 1657.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ec10JAAR",
    "hero_image": "https://images.luxuryescapes.com/sutq1clti87cu933ipq3",
    "image_two": "https://images.luxuryescapes.com/ybpqsmddz5lhey55r17a",
    "image_three": "https://images.luxuryescapes.com/k882fki7jjmjebsgqsh",
    "vendor_name": "Avani+ Khao Lak Resort",
    "title": "Avani+ Khao Lak Resort Oct 23",
    "description": "x",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Avani+ Khao Lak Resort",
    "offer_address": "99 Moo 8, Khao Lak Tumbon, Bang-Muang, Takua-Pa, Khao Lak, Phang-Nga 82190, Thailand",
    "percentage_discount": null,
    "min_duration": null,
    "max_duration": null,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LmUEAA0",
    "hero_image": "https://images.luxuryescapes.com/1zrwdrjgst0nnlp2ij",
    "image_two": "https://images.luxuryescapes.com/kvd49afeqme94fyugm974",
    "image_three": "https://images.luxuryescapes.com/s4lje9yo8jyixlv0pve7",
    "vendor_name": "Beyond Resort Khao Lak",
    "title": "Tropical Khao Lak Villa Escape with Nightly Cocktails",
    "description": "Treat yourself to a romantic escape at Beyond Resort Khao Lak, a tropical resort set on an idyllic beachfront location on the white sands of Pak Weep Beach. Surrender to complete relaxation on this palm-fringed escape and indulge with daily buffet breakfast, two exotic buffet dinners, a daily cocktail or beer, two 30-minute massages per person, an invite to the resort’s exclusive management cocktail event with free-flow drinks and canapés, a Thai cooking class followed by lunch and a convenient airport pick up on arrival from Phuket.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Beyond Resort Khao Lak - 2020",
    "offer_address": "9/69 Moo 1, Khuk Khak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 622.0,
    "value": 1944.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FmHnVYAV",
    "hero_image": "https://images.luxuryescapes.com/welva25fengocgu8sifg",
    "image_two": "https://images.luxuryescapes.com/b6uqlqdihbzxmtp2ukp4",
    "image_three": "https://images.luxuryescapes.com/u6rnlebz0pqywn80gi6i",
    "vendor_name": "Pullman Khao Lak Resort",
    "title": "Khao Lak Beachfront Indulgence with All-Inclusive Dining, Unlimited Free-Flow Drinks & Massages",
    "description": "Some experiences in life shouldn't be missed. Place an all-inclusive stay at this lavish resort at the top of your travel to-do list. Perfectly positioned facing the cool blue waters of the Andaman Sea, this beachfront resort caters to your every whim.\n\nWhile there's plenty to discover beyond the hotel, this luxury oasis will entice you to stay and enjoy, providing both relaxation and excitement for the entire family. Savour a fusion of flavours at Plai Dining Room and Kram Beach Club, plunge into two aquamarine pools, or visit the serene Rosalyn Spa for a heavenly treatment.\n\nLittle ones can race through the twin-looped waterslide or make friends at the onsite kids' club while parents sip on a refreshing cocktail at Tharn Pool Bar.\n\nWhile the top-notch facilities make it difficult to tear yourself away from the serenity of the resort, the surrounding wonders reward those who choose to explore. For eager snorkelers or beach lovers, the gorgeous Similan and Surin Islands are a must-visit, and for history enthusiasts, Takua Pa Old Town is located a short drive away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Pullman Khao Lak Resort",
    "offer_address": "46/109, Moo 2, Soi 46 Laem Son Takua Pa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 66.0,
    "min_duration": 7,
    "max_duration": 18,
    "price": 899.0,
    "value": 2638.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Qu75eQAB",
    "hero_image": "https://images.luxuryescapes.com/yboy5zsoqe9c6ompvclp",
    "image_two": "https://images.luxuryescapes.com/yrzt5va28wgpqm3ycezw",
    "image_three": "https://images.luxuryescapes.com/gwb8mwyoafsoskdekrsz",
    "vendor_name": "La Vela Khao Lak",
    "title": "La Vela Resort's First Anniversary: Celebrate in Style with Daily Free-Flow Drinks and Indulgent Inclusions",
    "description": "Come and celebrate La Vela Resort's first birthday, Khao Lak’s design showpiece and best-kept secret. Embrace the flop-and-drop holiday vibe while you enjoy daily breakfast, one 45-minute massage per person, two multi-course dinners, a convenient airport pick-up and a daily hour of free-flow drinks - served at Kokulo Beach Club, the only beach club in Khao Lak.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "La Vela Khao Lak - Nov 18",
    "offer_address": "98/9, Moo 5,  Tumbon Khuk Khak, Amphoe Takua Pa, Phangnga, Bang Niang Beach, 82220 Khao Lak, Thailand",
    "percentage_discount": 53.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 647.0,
    "value": 1382.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DODqWAAX",
    "hero_image": "https://images.luxuryescapes.com/78dbjux4cqkr9wfvcziq",
    "image_two": "https://images.luxuryescapes.com/v6y2dnjevbsoj6pgmbp5",
    "image_three": "https://images.luxuryescapes.com/13pb4vytgaudr22n7fh",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Bestselling Khao Lak Beachfront Escape with Daily Breakfast & Nightly Free-Flow Cocktails",
    "description": "Set amid a luscious forested headland and flowing onto the dazzling sands of Nang Thong Beach, The Sands Khao Lak by Katathani is your tranquil and secluded escape just minutes from the town’s main shopping strip and an hour from vibrant Phuket. You need stray no further than the resort, as each wing is carefully crafted to cater for your need of rest, rejuvenation or play - seek serenity amongst the waterlilies and palms of the Lagoon Wing, splash about in a miniature water park in the Aqua Wing or relax poolside in the Seaside Wing.\n\nUnwind by your choice of three pools (including an adults-only enclave), satiate any craving at your choice of three restaurants - including The Floating Market, overlooking the glistening lagoon - and sip drinks at four bars, all offering unique water vistas. Plus, enjoy the benefits of distinct adults-only areas, Sands Castle kids' club and the pavilions of The Spa, perfect for an afternoon spent curing aches and pains with a Thai massage.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani",
    "offer_address": "10/18 Petchkasem rd. Moo 7 Kukkak Takuapa Phang Nga 82220, Thailand",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 589.0,
    "value": 1134.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RB3VvQAL",
    "hero_image": "https://images.luxuryescapes.com/prsl6c2zrplw3i1y0brv",
    "image_two": "https://images.luxuryescapes.com/ykibnvvyfkjxjrbkglzl",
    "image_three": "https://images.luxuryescapes.com/k9hszhaqmnoofewumebm",
    "vendor_name": "Le Menara Khao Lak",
    "title": "Newly Opened Beachfront Luxury in Khao Lak",
    "description": "Experience absolute relaxation with a flop-and-drop beachfront holiday including daily breakfast, massages, nightly dinners with free-flow drinks and a one-way airport pickup at the newly opened Le Menara North Khao Lak by Khaolak Laguna Resort. Enjoy lazy mornings by the beach or by the resort’s huge infinity swimming pool, afternoons spent exploring local markets and elephant camps, and evenings dining with ocean views at the hotel’s two restaurants. Plus, two children aged 11 and under stay free with breakfast and dinner!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Le Menara Beachfront Villa & Resort OLD",
    "offer_address": "15 Moo 2, Bangmoung, Takuapa, Phang Nga 82190, Thailand",
    "percentage_discount": 84.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 637.0,
    "value": 3877.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CkXoTYAV",
    "hero_image": "https://images.luxuryescapes.com/vmrvetmej8lrqieav1b",
    "image_two": "https://images.luxuryescapes.com/30k64o7n65czl942fwjm",
    "image_three": "https://images.luxuryescapes.com/1b22lsjiirf89s8yccp",
    "vendor_name": "Ramada Resort by Wyndham Khao Lak",
    "title": "Khao Lak Beachfront Escape with Daily Breakfast, Free-Flow Drinks Hour & All-Inclusive Upgrades Available",
    "description": "Surrender to tropical relaxation at this blissful luxury retreat on Khao Lak's popular Bang Niang Beach. Sunny days can be spent kicking back with a cocktail by the pool, wading over to the swim-up Pool Bar to order your next drink, or lazing under the resort’s signature red parasols.\n\nTake a break from the sand and head into Sassi's Beach Club for chilled-out beats, tropical cocktails and mouthwatering meals - if you time it right, you'll be perfectly positioned to enjoy a spectacular sunset.\n\nWhen it comes time to relax and recharge, The Spa is the place to be. From rejuvenating facials to detoxifying body scrubs and traditional Thai massages, each heavenly treatment is guaranteed to set your body clock to island time. Plus, each treatment room features a herbal steam room or sauna, a Jacuzzi bath and an outdoor rain shower for added pampering.\n\nWhen you can tear yourself away from your resort, explore Khao Lak with easy access to Bang Niang Market and Ton Chong Fa Waterfall.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Ramada Resort by Wyndham Khao Lak",
    "offer_address": "59 Moo 5, Kukkak, Takuapa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 2180.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxPZxAAN",
    "hero_image": "https://images.luxuryescapes.com/q5j9wwee48eyplxoeoje",
    "image_two": "https://images.luxuryescapes.com/niuw1nythaii1u7pj6ha",
    "image_three": "https://images.luxuryescapes.com/y7yokdca7sg7865ywq4",
    "vendor_name": "Ramada Resort by Wyndham Khao Lak",
    "title": "Beachfront Khao Lak Jungle Retreat with Daily Breakfast, Nightly Dinner & Free-Flow Drinks Hour",
    "description": "Surrender to tropical relaxation at this blissful luxury retreat on Khao Lak's popular Bang Niang Beach. Sunny days can be spent kicking back with a cocktail by the pool, wading over to the swim-up Pool Bar to order your next drink, or lazing under the resort’s signature red parasols. Take a break from the sand and head into Sassi's Beach Club for chilled-out beats, tropical cocktails and mouthwatering meals - if you time it right, you'll be perfectly positioned to enjoy a spectacular sunset.\n\nWhen it comes time to relax and recharge, The Spa is the place to be. From facials to detoxifying body scrubs and Thai massages, each heavenly treatment is guaranteed to set your body clock to island time. Plus, each treatment room features a herbal steam room or sauna, a Jacuzzi bath and an outdoor rain shower for added pampering. When you can tear yourself away from your resort, explore Khao Lak with easy access to Bang Niang Market and Ton Chong Fa Waterfall.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Ramada Resort by Wyndham Khao Lak",
    "offer_address": "59 Moo 5, Kukkak, Takuapa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 83.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 3629.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cJITRQA4",
    "hero_image": "https://images.luxuryescapes.com/7v74axpzzi3d89q9bu",
    "image_two": "https://images.luxuryescapes.com/bv876mna7fnfc6dt36dq",
    "image_three": "https://images.luxuryescapes.com/yh10zrn3hh371utgpykqh",
    "vendor_name": "Seaview Resort Khao Lak",
    "title": "Relaxing Beachfront Escape with Fantastic Dining Experiences",
    "description": "Escape to Centara Seaview Resort in Thailand's beautiful Khao Lak. Situated on Nang Thong Beach, you'll have access to the stunning beach and blue waters of the Andaman sea, while also enjoying a prime location in the heart of Khao Lak. Enjoy daily buffet breakfast, your choice of daily lunches or nightly dinners at Talay Thong Restaurant, one daily drink per adult, four blissful massages to share and complimentary kids' club.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Centara Seaview Resort Khao Lak",
    "offer_address": "18/1 Moo 7 Nang Thong Beach Khao Lak, Phang-nga 82190",
    "percentage_discount": 72.0,
    "min_duration": 8,
    "max_duration": 12,
    "price": 506.0,
    "value": 1794.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zmFiAAI",
    "hero_image": "https://images.luxuryescapes.com/wz0ojjrkrfwoi120z9gj",
    "image_two": "https://images.luxuryescapes.com/oh4njf0kcvbu79jjgf7q",
    "image_three": "https://images.luxuryescapes.com/ribh1hwwg8qp6og5838q",
    "vendor_name": "Le Meridien Khao Lak Beach & Spa Resort",
    "title": "Five-Star Khao Lak Beachfront Haven with All-Inclusive Daily Breakfast, Lunch, Dinner & Free-Flow Drinks",
    "description": "Rediscover a whole new level of luxury at the five-star Le Méridien Khao Lak Resort & Spa. A secluded haven of relaxation on the pristine sands of Bangsak Beach, the stunning resort reinvents the quintessential Khao Lak beachfront experience. Make the most of its private location with a plunge in the beach’s crystal-clear waters or indulge in the three signature lagoon pools and the luxury Khao Lak Spa. Children will enjoy access to the Kids' Club, while parents can make use of the Fitness Centre, private Muay Thai classes, and complimentary tennis and water sports equipment.\n\nBangsak Beach is blessed with unspoiled shores, casuarina-fringed inlets and spectacular offshore islands rimmed with azure waters and dense marine life. Outside of your quiet retreat, the Similan Islands are easily accessible and spectacular for seasonal snorkelling. Known to divers globally, this marine national park offers luminous aqua waters and luscious coral reefs with a smooth granite island of rainforest and blindingly white beaches on the surface.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Le Méridien Khao Lak Resort & Spa",
    "offer_address": "31 Moo 7, Bangmoung, Takuapa District, Phang Nga Province, Khao Lak, Thailand, 82190",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 859.0,
    "value": 1769.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cKQYhQAO",
    "hero_image": "https://images.luxuryescapes.com/n8z1ycd9ploiixpcwu9",
    "image_two": "https://images.luxuryescapes.com/h6vc2q5cyjcj8ufz70j8",
    "image_three": "https://images.luxuryescapes.com/0rnels1vzulc1ree9h20rw",
    "vendor_name": "Le Menara Khao Lak",
    "title": "Beachfront Escape in Khao Lak",
    "description": "Experience absolute relaxation with a flop-and-drop beachfront holiday at Le Menara Khao Lak. Enjoy lazy mornings by the beach or by the resort’s huge infinity swimming pool, afternoons spent exploring local markets and evenings dining with ocean views at the hotel’s two restaurants. Included are daily buffet breakfast, your choice of three lunches or dinners for two during your stay, three Thai massages to share, a one-way airport transfer and unlimited buy-one-get-one-free cocktails.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Le Menara Khao Lak - 2019",
    "offer_address": "15 Moo 2, Bangmoung, Takuapa, Phang Nga 82190, Thailand",
    "percentage_discount": 77.0,
    "min_duration": 8,
    "max_duration": 12,
    "price": 491.0,
    "value": 2135.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPVsSAAX",
    "hero_image": "https://images.luxuryescapes.com/1n33l2kus2o1y8fi826",
    "image_two": "https://images.luxuryescapes.com/n91wdvffjidrm7v5a8r",
    "image_three": "https://images.luxuryescapes.com/w588rg1x2qd0zf1hqhi7",
    "vendor_name": "Ramada Resort by Wyndham Khao Lak",
    "title": "Beachfront Khao Lak Paradise with Daily Breakfast, Nightly Dinner & Free-Flow Drinks",
    "description": "Surrender to tropical relaxation at Ramada Resort by Wyndham Khao Lak, a blissful beachfront escape on the popular Bang Niang Beach. Sunny days can be spent kicking back with a cocktail by the pool, wading over to the swim-up Pool Bar to order your next drink, or lazing under the resort’s signature red parasols. Take a break from the beach and head into Sassi's Beach Club for chilled-out music beats, tropical cocktails and mouthwatering meals - if you time it right, you'll be perfectly located to enjoy a spectacular sunset.\n\nWhen it comes time to relax and recharge, The Spa is the place to be. From facials to detoxifying body scrubs and Thai massages, each of these heavenly treatments are guaranteed to set your body clock to island time. Plus, each treatment room features a herbal steam room or sauna, a jacuzzi bath and an outdoor rain shower for added pampering. When you can tear yourself away from your resort, explore Khao Lak with easy access to Bang Niang Market and Ton Chong Fa Waterfall.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Ramada Resort by Wyndham Khao Lak",
    "offer_address": "59 Moo 5, Tumbon Kukkak, Takuapa District, Phang Nga 82220, Thailand",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 649.0,
    "value": 2640.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000K4g1xYAB",
    "hero_image": "https://images.luxuryescapes.com/fmtoxea5lbx9gr94bodb",
    "image_two": "https://images.luxuryescapes.com/82xp61ltt4l6hkrtce9d",
    "image_three": "https://images.luxuryescapes.com/kg26hykn4rhxgsj5rny",
    "vendor_name": "Graceland Khao Lak Resort and Spa",
    "title": "Beachfront Khao Lak Escape with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktail",
    "description": "Discover a world of relaxation at this beachfront haven. Spend your days swimming, sipping cocktails by the pool or exploring the unique entertainment complex, complete with karaoke, snooker tables, an in-resort bowling alley and more.\n\nIf you're looking to try your hand at tennis or squash, or stretch out with a yoga session, there’s no shortage of activities to entertain. Dining is a feast for the senses: start your day with a delicious breakfast at Pakarang, indulge in Italian cuisine for lunch at Oceano or end your evening with dinner overlooking the lagoon at Pla2.\n\nWhether you’re discovering the stunning sea cliffs and waterfalls of Lam Ru National Park, or unwinding on golden shores watching sunsets over the Andaman Sea, Graceland Khaolak Beach Resort is the ideal destination for both adventure and relaxation.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Graceland Khaolak Beach Resort",
    "offer_address": "30/7 Moo 7, Bang Muang District, Amphur Takua-Pa, Phang Nga, 82000, Thailand",
    "percentage_discount": 70.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 373.0,
    "value": 1253.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EeCSwAAN",
    "hero_image": "https://images.luxuryescapes.com/osgy7g89aglg5ui7po8i",
    "image_two": "https://images.luxuryescapes.com/8e3k3evs9esocguc0ssi",
    "image_three": "https://images.luxuryescapes.com/qcpakzkn8rlv4auyx8e",
    "vendor_name": "Outrigger Khao Lak Beach Resort",
    "title": "Khao Lak Outrigger Beachfront Oasis with Unlimited Free-Flow Drinks, Daily Breakfast & Daily Gourmet Lunch or Dinner",
    "description": "Yearning for a peaceful escape set amid a luscious backdrop of forested headlands and palm-fringed sands? Unwind in this spacious haven overlooking the azure waters of Khao Lak's Bangsak Beach. At the newly reopened Outrigger Khao Lak Beach Resort, you'll be treated to all the luxuries you'd expect from the Outrigger brand. Featuring a beautiful lagoon swimming pool, The Massage Sala by the beach and two restaurants serving up international cuisine with a locally inspired twist, this property puts the signature Outrigger spin on an iconic Thai paradise escape.\n\nOutrigger Khao Lak Beach Resort includes a kids' club to keep the little ones entertained, with a rotating schedule of exciting activities - from origami classes to treasure hunts - keeping the days fresh and full of possibility. Located only 15 minutes from the vibrant Khao Lak Village and the colourful shopping and dining options of Bangsak, and within easy reach of watersports and local attractions, there's no better base for your Thailand adventure.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Outrigger Khao Lak Beach Resort",
    "offer_address": "2/4 Moo 8, Bangmuang, Takuapa, Phang Nga, 82190, Thailand",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 899.0,
    "value": 2217.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HPxpAAG",
    "hero_image": "https://images.luxuryescapes.com/x75oiytuw4vgekyqtbh",
    "image_two": "https://images.luxuryescapes.com/afvsmmkj3ewwukb1a0f",
    "image_three": "https://images.luxuryescapes.com/28s5cuwyj6sf31b4fanp",
    "vendor_name": "Pullman Khao Lak Resort",
    "title": "Grand Opening: Pullman Khao Lak Beachfront Escape with All-Inclusive Dining, Unlimited Drinks & Daily Massages",
    "description": "There are some experiences in life that should not be missed, and a heavenly stay at the brand new Pullman Khao Lak Resort should be at the top of your travel to-do list. Facing the cool blue waters of the Andaman Sea, this beachfront resort will cater to your every need in true Pullman style. Make the most of your all-inclusive dining across two exceptional restaurants, and treat yourself with unlimited drinks at the pool bar or beach club.\n\nPlunge into the aquamarine waters with your choice of four inviting pools, visit the serene Rosalyn Spa for daily massages, take part in yoga or tai chi classes, or raise your heart rate at the 24-hour Pullman FIT centre. Little ones can cool off in the wading pool, race through the twin-looped water slide, or hang in the shade of the kids’ club.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Pullman Khao Lak Resort",
    "offer_address": "46/109, Moo 2, Soi 46 Laem Son Takua Pa District, Khao Lak, Phang Nga 82190, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1299.0,
    "value": 4186.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DoYyHYAV",
    "hero_image": "https://images.luxuryescapes.com/r91e9k6xu6wecyw58rd4",
    "image_two": "https://images.luxuryescapes.com/vu4kawtt5plfg4vhxrwv",
    "image_three": "https://images.luxuryescapes.com/o0za6tnwmqhm451bonvr",
    "vendor_name": "Graceland Khao Lak Resort and Spa",
    "title": "Beachfront Khao Lak Escape with Daily Breakfast, Daily Lunch or Dinner & Cocktails",
    "description": "Discover a world of relaxation at this picturesque beachfront haven, located just 90 minutes north of Phuket Airport. Spend your days swimming in turquoise waters, sipping cocktails by the pool or exploring the unique entertainment complex, complete with karaoke, snooker tables, an in-resort bowling alley and more.\n\nIf you're looking to try your hand at tennis or squash, or stretch out with a blissful yoga session, there’s no shortage of activities to entertainment. Dining is a feast for the senses: start your day with a delicious breakfast at Pakarang, indulge in tempting Italian cuisine for lunch at Oceano or end your evening with dinner overlooking the lagoon at Pla2.\n\nWhether you’re discovering the stunning sea cliffs and waterfalls of Lam Ru National Park, or unwinding on golden shores watching mesmerising sunsets over the sparkling Andaman Sea, Graceland Khaolak Beach Resort is the ideal destination for both adventure and relaxation.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Graceland Khaolak Beach Resort",
    "offer_address": "30/7 Moo 7, Bang Muang District, Amphur Takua-Pa, Phang Nga, 82000, Thailand",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 371.0,
    "value": 860.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UyA6XQAV",
    "hero_image": "https://images.luxuryescapes.com/afpeiirrlvgsqq0q79sn",
    "image_two": "https://images.luxuryescapes.com/qxlzyfjyt0dpqpooydlc",
    "image_three": "https://images.luxuryescapes.com/m9jizzrwaqz6qqxys0wg",
    "vendor_name": "Beyond Resort Khao Lak",
    "title": "Adults Only Private Villa Oasis: Dining, Daily Free-flow Spirits & Sodas and Massages",
    "description": "Discover Thailand’s best kept secret at a romantic beachside getaway at the adults-only Beyond Resort Khao Lak - less than 90 minutes' drive from Phuket. Enjoy unspoilt beaches, azure waters and secluded relaxation all the while staying in a Private Palm Villa with daily buffet breakfasts, four hours of massages to share, three exotic buffet dinners for two, daily lounge experience with free flow spirits, pizza lunch for two, convenient return airport transfers, Thai cooking class for two and much more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Phang-nga",
    "offer_geo_area_level_2": "Amphoe Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Beyond Resort Khao Lak 2018",
    "offer_address": "9/69 Moo 1, Khuk Khak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 884.0,
    "value": 3285.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HUjdIAG",
    "hero_image": "https://images.luxuryescapes.com/2mmnskwgcgusjp56h9ci",
    "image_two": "https://images.luxuryescapes.com/v5niwm1ljshpkf0utpep",
    "image_three": "https://images.luxuryescapes.com/dcyqrgr3tszyjaqgnjb",
    "vendor_name": "Mai Khao Lak Beach Resort and Spa",
    "title": "Khao Lak Beachfront Suites & Villas with Breakfast, Daily Lunch or Dinner, Nightly Free-Flow Drinks & Two Kids Stay Free",
    "description": "Discover beachside bliss and tropical splendour at this fun-filled paradise, ideally positioned on the palm-fringed shores of Khao Lak. This acclaimed family-friendly resort is the ultimate playground in paradise - take full advantage of the endless summer with two giant waterslides, a pirate ship water park, family pools and an exclusive adults-only area.\n\nFor a splash of sophistication, enjoy a swim-up bar, the tranquil Mind Spa and delectable traditional cuisine at Talay Thai, one of multiple outstanding dining venues, boasting sweeping views of the sparkling Andaman Sea.\n\nStep out of the resort grounds to find yourself surrounded by coconut groves and lush forests, with the sugar-fine sands of Pak Weep Beach at your doorstep. The resort's breathtaking location, just a 15-minute drive from the town centre, makes it easy to spend days exploring the small, local villages, or setting sail to Similan Island for amazing snorkelling and dive sites.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Mai Khao Lak Beach Resort & Spa",
    "offer_address": "9/16-17 Phetchakasem Road, Moo. 1 Pakweep Beach, Khao Lak, Phang-Nga 82190, Thailand",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 619.0,
    "value": 2583.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000QuYvJQAV",
    "hero_image": "https://images.luxuryescapes.com/jrvrbfus44bzitcark3x",
    "image_two": "https://images.luxuryescapes.com/ojorzyls9iefcsagqfwp",
    "image_three": "https://images.luxuryescapes.com/n2aeeobcc53vkmjvroya",
    "vendor_name": "Casa de la Flora",
    "title": "Private Pool Luxury in Khao Lak",
    "description": "Soak up uninterrupted views over the glistening waters of the Andaman Sea with a relaxing and luxurious stay at Casa de la Flora, a modern urban resort on the palm-fringed beach of Khao Lak. Stay in a Studio Pool Villa with a private pool and indulge in 24/7 private butler service, daily breakfast, three lunches or dinners, complimentary in-room personal minibar replenished daily, two molecular cocktails per person, daily 30-minute massage to share and return airport transfers from Phuket.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Casa de La Flora",
    "offer_address": "67/213 Moo 5, Khuk Khak, Khao Lak, Phang Nga 82220, Thailand",
    "percentage_discount": 74.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 849.0,
    "value": 3302.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gy4h7AAB",
    "hero_image": "https://images.luxuryescapes.com/lx41xeh4s9fkcyevd9",
    "image_two": "https://images.luxuryescapes.com/a2oerjmhzhoahmrov0b",
    "image_three": "https://images.luxuryescapes.com/8bm349r8azyvloy3e6d",
    "vendor_name": "Devasom Khao Lak Beach Resort & Villas",
    "title": "Khao Lak Five-Star Beachfront Luxury with Daily Breakfast, Daily Choice of Lunch or Dinner & Nightly Cocktails",
    "description": "Where sea spray punctuates the air, the warm sun pokes its head around every corner and serenity radiates throughout; discover the essence of tranquil Thai luxury at Devasom Khao Lak Beach Resort & Villas. Expanding across three hectares of verdant coast, this pristine resort boasts plenty of opportunities for family-centred thrills, head-to-toe wellness and delicious coastal delights. Award-winning for a reason, making Tripadvisor’s Traveler’s Choice Best of the Best 2023 list, find five-star oceanfront opulence in abundance through the 69 rooms, suites and villas, which extend all the way to the semi-private shoreline.\n\nTucked away between a lagoon and the golden beach, enjoy easily tip-toeing directly to the stunning coastline, or venturing inland to explore the vibrant shopping and dining district on the resort’s shuttle. When you’re not soaking up the good vibes at the beach or in the sparkling pool, treat yourself to a pamper session at the resort’s own wellness centre. From nourishing breakfasts to moreish dinner dishes, experience exceptional Michelin-listed dining at one of the resort’s two incredible eateries.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Devasom Khao Lak Beach Resort & Villas",
    "offer_address": "79 Moo 3, Khuk Khak Beach, Takuapa, Phang Nga, Khao Lak 82220, Thailand",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1049.0,
    "value": 2569.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CviXYAAZ",
    "hero_image": "https://images.luxuryescapes.com/1rbag4s7sdx5k09752gc",
    "image_two": "https://images.luxuryescapes.com/28nwr8bghve27f23mk7f",
    "image_three": "https://images.luxuryescapes.com/y9aum3uhqt57gglj44fh",
    "vendor_name": "Kantary Beach Hotel, Villas and Suites Khao Lak",
    "title": "Khao Lak Beachfront Paradise with Daily Breakfast & Dinner, Nightly Drinks & Massages",
    "description": "Escape to your own sun-kissed slice of heaven enveloped by the shimmering Andaman Sea at Kantary Beach Hotel, Khao Lak - a peaceful sanctuary located on the pristine coast of Phang Nga. Look out onto towering coconut palms and enjoy the refreshing sea breeze while you dine on local and international fare at Café Andaman, enjoy refreshing cocktails while splashing about at the swim-up Pool Bar or climb to the rooftop Otter's Bar for ice-cold mai tais set against panoramic views of the Thailand's western coast.\n\nWhen you aren't lounging poolside or enjoying a dip in the aquamarine sea, the hotel offers the perfect base to explore Khao Lak's tropical surrounds. Walk to the pristine Coconut Beach, just a short stroll from the hotel, peruse stalls at Bang Niang Market or venture out onto Thailand's exquisite nearby islands, including Similan Islands National Park.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Kantary Beach Hotel, Khao Lak",
    "offer_address": "64, 65, 72 Moo 2, Petchkasem Rd, Takuapa, Kukkak, Phang Nga 82220, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 1950.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DVs3AAG",
    "hero_image": "https://images.luxuryescapes.com/m53ty4rwwy20z2twu8n4",
    "image_two": "https://images.luxuryescapes.com/0yq32764n4zd0vrr0r1",
    "image_three": "https://images.luxuryescapes.com/74zx8yx3zf09269afz8",
    "vendor_name": "Moracea by Khao Lak Resort",
    "title": "Five-Star Khao Lak Beachside Oasis with Daily Breakfast & Guaranteed Room Upgrade",
    "description": "Stunning beachfront luxury awaits you at the deluxe Moracea by Khao Lak Resort, a spectacular private resort elevated on a hillside gently sloping towards golden sands. Surrounded by lush greenery for a rainforest feel, the modern resort boasts a tranquil spa, outdoor pools, a vibrant swim-up bar, and a glamorous restaurant with stunning sunset views. With a design incorporating traditional Thai elements with a contemporary twist, Moracea by Khao Lak Resort is the ideal secluded island escape.\n\nTrek the depths of Khao Lak National Park, float through the jungle on a bamboo raft, or grab your snorkelling gear and explore the nearby Similan Islands, filled with stunning coral reefs and exciting marine life. Head back after a long day of travelling for a cocktail and breathtaking sunset vistas.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Moracea by Khao Lak Resort",
    "offer_address": "26/20 Khuekkhak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 37.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 305.0,
    "value": 481.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BeqbTAAR",
    "hero_image": "https://images.luxuryescapes.com/zzkp2fp3cjvaze8yh905",
    "image_two": "https://images.luxuryescapes.com/5rj574u85hor0a3dtz",
    "image_three": "https://images.luxuryescapes.com/ztw3men7p6r2gadofx1",
    "vendor_name": "Beyond Resort Khao Lak",
    "title": "Serene Khao Lak Beachfront Hideaway with Private Villas, Gourmet Dining, Daily Breakfast & Nightly Cocktails",
    "description": "Escape the crowds with a blissful stay at Beyond Resort Khao Lak, an all-villa beachfront resort set on the pearly-white sands of Pak Weep Beach. Tucked on the serene coast of Phang Nga, around an 80-minute drive from Phuket International Airport, this palm-fringed oasis invites you to surrender to complete relaxation; enjoy an invigorating swim in the oceanfront swimming pool, spoil yourself at the indulgent Kanda Spa, or explore the tropical waters on a sea kayak or stand-up paddleboard. \n\nKhao Lak is the ideal spot for a true Thai beachside experience, offering fun in the sun framed by jungle-clad mountains while remaining a quieter corner of the country to ensure you leave feeling completely relaxed. Fine dining restaurants await to cater to any appetite, whether you choose to dine on succulent seafood under the thatched roof of @Beach Bar and Restaurant, tuck into a flame-seared steak at Motown on Fire or enjoy a refreshing poolside drink in the tropical sun.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Beyond Resort Khaolak",
    "offer_address": "9/69 Moo 1, Pak Weep Beach, Khuk Khak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 639.0,
    "value": 1949.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cqXnNQAU",
    "hero_image": "https://images.luxuryescapes.com/y4o7gbsagh7v7cobx0pe",
    "image_two": "https://images.luxuryescapes.com/xbnf8xgg6koeqa829bz8",
    "image_three": "https://images.luxuryescapes.com/19qgykjadeh96op7fnu",
    "vendor_name": "Moracea by Khao Lak Resort",
    "title": "Stylish Khao Lak Beachfront Stay with Flexible Dining Inclusions",
    "description": "Find beachfront tranquility at Moracea by Khao Lak Resort, a five-star oasis on the gently sloping hills of this popular Thai destination. Wake up to daily buffet breakfast and enjoy flexible dining with your choice of three set-menu lunches or dinners. Also includes a 60-minute massage each and round-trip airport transfers, plus one child (aged 11 years and under) stays free with breakfast and transfers.",
    "offer_country_name": "",
    "offer_country_code_alpha_2": "",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Moracea by Khao Lak Resort - 2019",
    "offer_address": "26/20 M.7, .Petchkasem Rd., T.Khuk khak, A.Takuapa Khaolak Phang-nga 82190, Thailand",
    "percentage_discount": 70.0,
    "min_duration": 7,
    "max_duration": 10,
    "price": 372.0,
    "value": 1243.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eN0wXQAS",
    "hero_image": "https://images.luxuryescapes.com/ub20mgkifut03iv9l2k4",
    "image_two": "https://images.luxuryescapes.com/efwdlgeqg91dut4dfakp",
    "image_three": "https://images.luxuryescapes.com/ac8kg85rgi59afnpojc",
    "vendor_name": "The Haven Khao Lak",
    "title": "Khao Lak Beachfront Escape with Gourmet Dining & Daily Cocktail",
    "description": "A Luxury Escapes all-time favourite is back: The Haven Khao Lak, a luxurious beachfront retreat in Thailand's tranquil Khao Lak. Featuring the longest saltwater infinity pool in South East Asia and a pristine stretch of beach, this peaceful oasis is the perfect backdrop for a romantic holiday. This relaxing resort is strictly for guests aged 12 years and over.\n\nEnjoy daily buffet breakfast, one three-course set-menu or buffet dinner for two, one daily 30-minute foot, back or shoulder massage per room, a daily cocktail per person, a private pick-up from Phuket airport and complimentary shuttle transfers to Khao Lak.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Haven Khao Lak",
    "offer_address": "61/4 Moo 3 Khuk Khak, Takua Pa District, Phang Nga 82220, Thailand",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 495.0,
    "value": 1195.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009E2g4AAC",
    "hero_image": "https://images.luxuryescapes.com/lut7c06ab1y3ei4g6y",
    "image_two": "https://images.luxuryescapes.com/6wsgfq28wl5a261tn0xp",
    "image_three": "https://images.luxuryescapes.com/ym03m36kcr120n6fp59f",
    "vendor_name": "The Waters Khao Lak by Katathani Collection",
    "title": "Poolside Khao Lak Escape with Beach Club Access, Daily Breakfast, Massages & Nightly Cocktails",
    "description": "Enter a world of cascading waterfalls and dazzling turquoise pools with a stay at The Waters Khao Lak, part of the award-winning Katathani Collection. Embrace tropical serenity at this modern resort located in Thailand’s vibrant Khao Lak area and boasting over 3,000 square meters of water across seven sparkling pools, each flanked by swaying palm trees. Accept relaxation beyond imagination - snooze late before taking breakfast at Amici, The Waters Khao Lak's mouthwatering Italian bistro, spend the afternoon sipping cocktails at the swim-up Bubble Bar or rejuvenate at the onsite Sila Spa.\n\nWhen you’re ready to explore, Khao Lak abounds in sleepy golden beaches, hopping bars and magnificent national parks. Check out nearby waterfalls or take a five-minute stroll to Bang Niang Beach, where warm emerald waters await.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Waters Khao Lak",
    "offer_address": "67/238 Moo5, Kukkak, Khao Lak, Takua Pa, Phang Nga 82220, Thailand",
    "percentage_discount": 37.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 454.0,
    "value": 721.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GcGtAAK",
    "hero_image": "https://images.luxuryescapes.com/m6fw6r7tdbh8lk1a7k0a",
    "image_two": "https://images.luxuryescapes.com/g5vyevhkk3xc5ntbcsr",
    "image_three": "https://images.luxuryescapes.com/u2331niq95ui5tdqcu2t",
    "vendor_name": "Mai Khao Lak Beach Resort and Spa",
    "title": "Top-Rated Beachfront Khao Lak Escape with Daily Breakfast",
    "description": "Dive into non-stop fun and adventure at Mai Khao Lak Beach Resort and Spa - the ultimate beachfront playground on the palm-fringed shores of Thailand, around 1.5 hours' drive from Phuket. This hidden gem on the Andaman Sea is perfect for those looking to retreat to the serene beaches of Thailand. Admire the long stretch of sandy shores that line the coast of Khao Lak on your way to this family-friendly haven, ready to create memories that will last a lifetime.\n\nFeaturing lagoon pools, waterslides, a kids' club and an adults-only zone, the resort ensures the young and young at heart will never be short of things to do.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "TUI BLUE Mai Khaolak",
    "offer_address": "9/16-17 Phetchakasem Rd, Moo. 1 Pakweep Beach Khaolak, Phang-nga 82190, Thailand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 10,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlvfIAC",
    "hero_image": "https://images.luxuryescapes.com/rgv4in00a82iul4fl8j",
    "image_two": "https://images.luxuryescapes.com/usrexw1nogg424xeo5qs",
    "image_three": "https://images.luxuryescapes.com/9s9u4tg9h1e5pkot9yd",
    "vendor_name": "Grand Mercure Khao Lak",
    "title": "Sophisticated Khao Lak Beachfront Resort with Two Pools & Dining Venues",
    "description": "Experience a pristine hideaway ensconced in tropical gardens on Thailand's tranquil southwest coast. Enjoy an invigorating swim in the beachfront swimming pool, spoil yourself at the indulgent Pran Spa, or dine on Thai favourites at one of the two innovative onsite restaurants, Patio and Green Mango.\n\nSpend an afternoon sipping tropical cocktails at Soak Pool Bar, while the kids are entertained at the complimentary Manta Ray Kids' Corner before enjoying a stroll along the white-sand beach, located just moments away from the resort.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Grand Mercure Khao Lak Bangsak",
    "offer_address": "71 Moo 7, Bang Muang Distric Takuapa District, Phang Nga, 82190 Khao Lak, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 47.0,
    "value": 47.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECPGEAA5",
    "hero_image": "https://images.luxuryescapes.com/90m25ykd5h6im54hmh5",
    "image_two": "https://images.luxuryescapes.com/z0591br8em8jvi89mv6r",
    "image_three": "https://images.luxuryescapes.com/oaruh0u8e55zd9z1pcfq",
    "vendor_name": "The Leaf on The Sands by Katathani Resort",
    "title": "Tropical Khao Lak Oasis Steps from Nang Thong Beach",
    "description": "Calling all nature lovers - retreat to The Leaf on The Sands, a tropical oasis a mere five-minute walk from the powder-soft sands of Nang Thong Beach and its exciting restaurants and bars. Nestled amid viridescent tropical flora, you'll find a sparkling outdoor pool where you can sip your favourite tipple as you lounge in the sun. Then, amble to the onsite Al Dente Italian Bistro and savour hearty woodfired pizzas and perfectly cooked al dente pasta.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Leaf on The Sands",
    "offer_address": "40, Moo 6, Kukkak, Takuapa, Phang Nga 82220, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 30.0,
    "value": 30.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C3xDBAAZ",
    "hero_image": "https://images.luxuryescapes.com/wj8weoojgnhwdfjwxbh",
    "image_two": "https://images.luxuryescapes.com/4ms5g3teak89dyvthjna",
    "image_three": "https://images.luxuryescapes.com/dp4c22ko11s6l8z9yr",
    "vendor_name": "Avani+ Khao Lak Resort",
    "title": "Khao Lak Five-Star Oceanfront Escape with Onsite Waterpark",
    "description": "Wake up to the turquoise horizon of Thailand's Andaman Sea from the five-star Avani+ Khao Lak Resort, a jewel in Khao Lak's crown. Resting on its own stretch of gleaming white beach, enjoy a tropical oceanfront escape at this 284-room resort that's equally perfect as a family holiday or romantic rendezvous. Swim in the four pristine swimming pools, keep the kids entertained at the fun-filled kids' club and waterpark, and feast on everything from woodfired pizzas and international bites at any of the five restaurants.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Avani+ Khao Lak Resort",
    "offer_address": "99 Moo 8, Khao Lak Tumbon, Bang-Muang, Takua-Pa, Khao Lak, Phang-Nga 82190, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 68.0,
    "value": 68.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECPFMAA5",
    "hero_image": "https://images.luxuryescapes.com/0zmyoddbcr1bwlja0xh",
    "image_two": "https://images.luxuryescapes.com/sa70gfbn3ivixjsxiq7f",
    "image_three": "https://images.luxuryescapes.com/zabt7am56aknb2xrxtp",
    "vendor_name": "The Sands by Katathani  Khao Lak",
    "title": "Bestselling Khao Lak Beachfront Escape with Daily Breakfast, Daily Cocktail & Late Checkout",
    "description": "Sat amid a lush, forested headland and flowing onto the dazzling sands of Nang Thong Beach, The Sands Khao Lak by Katathani is your tranquil and secluded escape, located just minutes from the town’s main shopping strip and an hour from vibrant Phuket. Unwind across two pools, satiate any craving at your choice of three restaurants, sip crisp, cold beer and cocktails at four separate bars, and indulge at The Spa, which will coax you with warm sea breezes and the scent of exotic flowers.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Sands Khao Lak by Katathani",
    "offer_address": "10/18 Petchkasem Road, Tambon Khuekkhak, Takuapa District, Phang Nga 82220, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 65.0,
    "value": 65.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008J9JTAA0",
    "hero_image": "https://images.luxuryescapes.com/ir3dpl6s7hxwzq8qqnq8",
    "image_two": "https://images.luxuryescapes.com/45k43o2jwzoawktlt8nu",
    "image_three": "https://images.luxuryescapes.com/xf0l54ysxdst5abjoac",
    "vendor_name": "Devasom Khao Lak Beach Resort & Villas",
    "title": "Khao Lak Boutique Luxury with Beachfront Infinity Pool",
    "description": "Discover the natural beauty of Thailand with a stay at the stunning Devasom Khao Lak, nestled between a natural lagoon and one of the country's most stunning sunset beaches. This small luxury property offers direct access to the flawless white sands of a private beach, framed by gently swaying palms. Savour the flavours of Thai-western fusion at the oceanfront Takola Thai Restaurant - featured in the Michelin Guide for 2025 - or for a more relaxed dining experience, head to Devasom Beach Grill and Bar, where you can dine alfresco on seafood as you watch the sun go down. Unwind at the onsite wellness centre, which offers Muay Thai classes, morning yoga, a state-of-the-art fitness centre and a serene spa.\n\nYou can make the most of your Khao Lak experience by treating yourself to a Thai cooking class, an oceanfront cocktail party, a Thai garland-making class or by taking the guided spice tour of the property. Travelling with family? Let little ones run free at the kids' club or invite the whole family to the party with a beach picnic experience.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Devasom Khao Lak",
    "offer_address": "Devasom Khao Lak Co., Ltd 79 Moo 3, Khuk Khak, Takuapa, Phang-Nga, Thailand 82220",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 120.0,
    "value": 120.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gkolAAA",
    "hero_image": "https://images.luxuryescapes.com/ls1snqac2wvyqd52e2h",
    "image_two": "https://images.luxuryescapes.com/kwi6t9atzfpb87zlxfyc",
    "image_three": "https://images.luxuryescapes.com/dp3x7t9x3w7slopj0s",
    "vendor_name": "Bangsak Village Khao Lak",
    "title": "Romantic Khao Lak Beachfront Retreat with Ocean-View Infinity Pool",
    "description": "On a flawless white-sand beach overlooking aqua waters in Khao Lak, you'll find the perfect couple's retreat, Bangsak Village Khao Lak. With no children under 12 years allowed, absolute tranquility is assured. Each room is decorated in warm hues and soaked in natural light, with touches of Thai-inspired décor, and offers a welcome refuge after a day of exploring. Head to the beachfront Kala Spa for a restorative massage, then dine at the terrace-style Rim Lae Bangsak Restaurant, which serves mouth-watering Thai and international dishes. There's also an infinity pool with an integrated jacuzzi and ocean views, where you can bask in the tropical ambience - you’ll never want to leave.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Bangsak Village Khao Lak",
    "offer_address": "1/1 Moo 8, Petchkasem Road, Bangmuang, Takuapa , Phang-nga, Khao Lak 82190, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 78.0,
    "value": 78.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECPFLAA5",
    "hero_image": "https://images.luxuryescapes.com/8z14h4n1tffr0mgyq1g7",
    "image_two": "https://images.luxuryescapes.com/75oi1zisavgr6ifo6qh7",
    "image_three": "https://images.luxuryescapes.com/0j8udjntchz77jkog7g2",
    "vendor_name": "The Leaf Oceanside by Katathani Resort",
    "title": "Khao Lak Tropical Gem near Nang Thong Beach with Lush Gardens & Two Swimming Pools",
    "description": "Treat yourself to a dreamy tropical escape, just moments from the beach, with a stay at The Leaf Oceanside. Hidden among the palms you will discover a luxurious oasis of lush green gardens, a tranquil day spa and the thriving Orchid Restaurant serving exquisite Thai and hearty international meals. Spend leisurely days lounging by the two sparkling swimming pools and, as night falls, stay poolside and enjoy a refreshing cocktail.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "The Leaf Oceanside",
    "offer_address": "28/15, Moo 7, Soi Nang Thong Kukkak, Takuapa, Phang Nga 82220, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 31.0,
    "value": 31.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwNIAS",
    "hero_image": "https://images.luxuryescapes.com/3jklm3evybeyyus6nzrs",
    "image_two": "https://images.luxuryescapes.com/sc159lrrfe1b7nhacz",
    "image_three": "https://images.luxuryescapes.com/w8k5e0tnj8n1rawnok",
    "vendor_name": "Pullman Khao Lak Resort",
    "title": "Five-Star Pullman Khao Lak Beachfront Escape with Onsite Beach Club & Day Spa",
    "description": "Place a beachfront stay at Pullman Khao Lak Resort at the top of your travel to-do list - perfectly positioned facing the cool blue waters of the Andaman Sea, this resort will cater to your every whim in true Pullman style.\n\nWhile there's plenty to discover beyond the hotel, this luxury oasis will entice you to stay and enjoy, providing both relaxation and excitement for the entire family. Savour a fusion of flavours at Plai Dining Room and Kram Beach Club, plunge into one of two aquamarine pools, visit the serene Rosalyn Spa or raise your heart rate at the 24-hour Pullman Fit centre.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Pa",
    "location_heading": "Khao Lak",
    "location_subheading": "Thailand",
    "location_description": "Pullman Khao Lak Resort",
    "offer_address": "46/109, Moo 2, Soi 46 Laem Son Takua Pa District, Khao Lak, Phang-nga 82190, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 50.0,
    "value": 50.0
  }
]