[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JTaUAAW",
    "hero_image": "https://images.luxuryescapes.com/6pkrrzvz65im5fsf6hhk",
    "image_two": "https://images.luxuryescapes.com/0fctk703xnhhgj8vunf",
    "image_three": "https://images.luxuryescapes.com/prfszq69bsnia49utp",
    "vendor_name": "Ecoscapes",
    "title": "Lakefront Nature Eco-Cabins just 90 Minutes from Queenstown with Picnic Lunch & Daily Breakfast",
    "description": "If your idea of pure bliss is being surrounded by New Zealand’s glacial peaks, crisp alpine air and gleaming turquoise lakes, EcoScapes is where you need to be.\n\nJourney into nature on one of the world's best drives from Queenstown and into the serenity of this eco-friendly sanctuary, a tranquil abode within Kinloch Wilderness Retreat, built with locally sourced green building technology. Surrounded by beech forest along the glistening Dart River and lakefront, this private hideaway is designed to seamlessly blend with the environment, with each of the cosy cabins showcasing spectacular mountain views.\n\nFeel at one with nature as you unwind in the serene river-front spa, transform your space into a private cinema with an in-room projector and drink in Lake Wakatipu vistas from your private veranda. Beyond the cabin, endless adventures can be found within close reach. Explore nearby Glenorchy, take on the steep challenge of the nearby Glacier Burn or Routeburn Track or pick up a paddle and glide across Lake Wakatipu.\n\n**Your handpicked inclusions:**\n\n- Wake to a delicious gourmet breakfast for two each day\n- Arrive to a local bottle of pinot noir and a platter for two in-room\n- Indulge with a one-time takeaway picnic lunch for two\n- Make time for one last adventure (or sleep-in) with 12pm late checkout (subject to availability)",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Otago",
    "offer_geo_area_level_2": "Kinloch",
    "location_heading": "Kinloch",
    "location_subheading": "New Zealand",
    "location_description": "EcoScapes",
    "offer_address": "876 Kinloch Road Kinloch 9372, New Zealand",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 409.0,
    "value": 679.0
  }
]