[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DRRpdAAH",
    "hero_image": "https://images.luxuryescapes.com/id76vwxhunsg6me8ml2e",
    "image_two": "https://images.luxuryescapes.com/684yzc8rf8xflxs6fj",
    "image_three": "https://images.luxuryescapes.com/xeklyg53mq9e2atve5w4",
    "vendor_name": "Upni Duniya",
    "title": "Private Koh Samui Group Retreat with Beachfront Suites, Five-Star Chef, Massages & Daily Breakfast",
    "description": "This could all be yours - discover the soul of Koh Samui with a private beachfront villa stay at Upni Duniya, perfectly positioned upon the serene shores of Bangrak Bay. Featuring nine individual suites, this entire property is yours to enjoy in complete privacy - after days spent chasing crashing waterfalls, exploring ancient temples or savouring legendary sunsets in the south of Samui, return to a magnificent infinity pool, top-notch fitness centre and a private executive chef specialising in sumptuous Thai and Indian plates. There's no better way to experience Thailand's most beloved island paradise - Upni Duniya's world-class staff are available to help organise your next adventure.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Upni Duniya",
    "offer_address": "25/25 Bo Put, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 3285.0,
    "value": 6289.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lMyrAAE",
    "hero_image": "https://images.luxuryescapes.com/kwvljbh5jt2fajwlbxsg",
    "image_two": "https://images.luxuryescapes.com/30n54lu4ojcjix6622k",
    "image_three": "https://images.luxuryescapes.com/3vn9l7y6vsdu8qd83va",
    "vendor_name": "The Lamai Samui",
    "title": "Koh Samui 5-Star Beachfront Paradise with Daily Breakfast, Nightly Dinner & Daily Cocktails",
    "description": "Wake up to the sound of the ocean and embrace absolute tranquillity at The Lamai Samui, a five-star oasis on the white sands of Lamai Beach. With its stunning ocean views and a luxe beachfront to sink your toes into, this resort offers guests the ultimate picturesque tropical getaway. The Lamai Samui brings to life an oriental heritage village backed by forested mountains and features elegant and spacious rooms and villas in which to hide away. Breathe in the scent of flourishing frangipanis and feel the calming essence of Feng Shui within and among the spaces while you spend your day at the seafront infinity pool or indulge in a relaxing treatment at Le Spa.\n\nYou'll find multiple dining spaces at your doorstep - try The Plate, The Ocean Pier and The Pool Bar, each serving up its own version of delicious international and Thai cuisine. Feel like taking a wander? With car rental and limousine services available, you'll be able to travel to the furthest stretches of Koh Samui in luxury and ease. Soak up serene ambience while attentive staff ensure you have a memorable and relaxing stay.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Lamai Samui",
    "offer_address": "146/24 Moo 4 Lamai Beach, Maret, Koh Samui 84310, Thailand",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1219.0,
    "value": 2535.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Is1PIAS",
    "hero_image": "https://images.luxuryescapes.com/z8wzbube7vvfpodypkdp",
    "image_two": "https://images.luxuryescapes.com/9yrjyd773suoumy2dcs",
    "image_three": "https://images.luxuryescapes.com/38d94wyc6bgxlo2uqy",
    "vendor_name": "Aloha Resort Koh Samui",
    "title": "Koh Samui Boutique Beachfront Bliss with Daily Breakfast, Cocktails & Massages",
    "description": "Make the palm-fringed white sands and turquoise waters of Lamai Beach your backyard at this tropical retreat. The first hotel established on this sought-after stretch of Koh Samui beach, operating for over 40 years, you can expect nothing short of a postcard-perfect getaway, accompanied by warm hospitality. \n\nStart your day with a hearty a la carte or buffet breakfast before making a splash in the resort’s lagoon-like pool. To truly unwind, indulge in a massage with your significant other, or sip on cocktails in tropical surroundings. Step beyond the resort grounds and find yourself enveloped by coconut groves, lush forests and reef-rich waters just waiting to be discovered.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Aloha Resort",
    "offer_address": "128 Lamai Beach, M.3, Maret, Koh Samui, Suratthani 84310, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 304.0,
    "value": 720.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EyzzFAAR",
    "hero_image": "https://images.luxuryescapes.com/83qtvzyaysbofeur645e",
    "image_two": "https://images.luxuryescapes.com/g179hyckvtpsxica2nje",
    "image_three": "https://images.luxuryescapes.com/loo9lte3wbefuhmu5lc",
    "vendor_name": "Nora Beach Resort & Spa",
    "title": "Oceanfront Koh Samui Escape with Massages, Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "This is the Thailand of your dreams - between lush tropical gardens and the dazzling sapphire waters of the Gulf of Thailand, Nora Beach Resort & Spa offers a slice of secluded serenity just moments from Koh Samui’s most beloved beach town, Chaweng, and Samui International Airport. After sun-kissed days spent chasing the region’s incredible surf and sand, return to Prasuthon Restaurant for perfectly grilled, local-catch seafood, or savour happy hour by the resort’s spectacular Pool Bar. Koh Samui’s sunsets are legendary - there’s no finer place to kick back and enjoy the view.\n\nReady to explore? Koh Samui’s acclaimed nightclubs, ancient temples and extraordinary waterfalls all await. Whether it’s lazing in a hammock, sampling Thailand’s brilliant dining scene or diving Koh Samui’s world-class reefs, whatever you desire, it’s yours.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Nora Beach Resort & Spa",
    "offer_address": "222 Moo 2, Chaweng Beach, Bophut, Koh Samui, Suratthani 84320, Thailand",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 2362.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008J4XYAA0",
    "hero_image": "https://images.luxuryescapes.com/d5s98ibukuhrvqfscpg",
    "image_two": "https://images.luxuryescapes.com/h29vmh8bhl8vkubnquz6",
    "image_three": "https://images.luxuryescapes.com/vgdwu5viyampcdstk57",
    "vendor_name": "Avani+ Samui Resort",
    "title": "Tranquil Koh Samui Beachfront Escape with Daily Breakfast & Daily Two-Course Lunch or Dinner",
    "description": "Tune in to island time, where blissful beach days and sunset cocktails are in abundance at Avani+ Samui Resort, a beachfront paradise stamped with a Tripadvisor Travellers’ Choice 2021 award, making it one of the top 10% of properties worldwide. Perched on a slice of secluded beachfront on Koh Samui’s quiet southwestern corner, you can enjoy serene days away from the crowds to rest and recharge. Koh Samui is a treasure trove of fun things to do. Spend days chasing waterfalls or beach hopping before following your tastebuds to some of the island’s renowned dining hot spots. Plus, the resort offers a longtail boat trip to neighbouring island Koh Madsum, where white-sand beaches, vibrant snorkelling and adventurous kayaking is on the menu.\n\nIf you prefer to stay put, Avani+ Samui Resort has you covered. Relax by the swimming pool with a tropical cocktail, feast on authentic Thai or international cuisine at Essence Restaurant or watch the sunset with a drink in hand at the Rooftop Lounge. The AvaniFit fully equipped fitness centre will ensure you won’t have to skip your daily exercise during your escape. When you’re ready to relax, book in a pampering treatment at the indulgent AvaniSpa.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Avani+ Samui Resort",
    "offer_address": "53/5 Moo 4, Phang Ka, Taling Ngam, Koh Samui, Suratthani 84140 Thailand",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 639.0,
    "value": 1472.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4pzDQAR",
    "hero_image": "https://images.luxuryescapes.com/unmr4z2mlxfi1arpx4pr",
    "image_two": "https://images.luxuryescapes.com/gjkuwhn0b4if7pxcnxic",
    "image_three": "https://images.luxuryescapes.com/dyxuhdqrnbww9wzayg9h",
    "vendor_name": "Vana Belle, a Luxury Collection Resort, Koh Samui",
    "title": "Experience Private Pool Seclusion, Personalised Service, Decadent Dining and More",
    "description": "Escape to Thailand’s idyllic island of Koh Samui, where palm-fringed beaches meet tropical rainforest and receive the full VIP treatment at Vana Belle, a Luxury Collection Resort, Koh Samui - a beachfront haven part of Marriott’s prestigious Luxury Collection offering stunning private pool suites, personalised service and some of the finest dining on the island. Enjoy sumptuous daily buffet breakfasts, nightly multi-course dinners at either of the resort’s signature restaurants, a nightly cocktail per person at the stylish Lobby Lounge, a daily ‘Taste of Thai Experience’ with sweet and savoury bites, soft drinks and coffee, a 30-minute massage per person at the luxurious Vana Spa and return airport transfers.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Vana Belle, a Luxury Collection Resort - DEC 2018",
    "offer_address": "9/99 Moo 3, Chaweng Noi Beach Surat Thani Koh Samui TH-84, 84320, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 1943.0,
    "value": 6093.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zRVCAA2",
    "hero_image": "https://images.luxuryescapes.com/74au6z4lzjwkmiq1lhe",
    "image_two": "https://images.luxuryescapes.com/afjdxrnrio156lbgijkp",
    "image_three": "https://images.luxuryescapes.com/3vjvg9eavalp8txx0wiu",
    "vendor_name": "Cape Fahn Hotel",
    "title": "Koh Samui Award-Winning Private Island Pool Villas with Daily Breakfast, Daily Lunch or Dinner & Nightly Drinks",
    "description": "Witness azure waters lap palm-cloaked cliffs and powder-white beaches at the five-star Cape Fahn Hotel - an intimate private island haven only moments from the shores of Koh Samui, yet a million miles from everyday life. A tranquil gem dropped in the ocean just off Choeng Mon Beach, this secluded retreat features an intimate collection of ultra-luxe villas with private pools and mesmerising views. Gaze over lush tropical hills, picture-perfect ocean and the endless horizon, enhanced by an accompanying soundtrack of gentle waves and tropical birdlife.\n\nTranscend bliss with an invigorating treatment at the hotel spa, sink into a beanbag with a good book at the activities pavilion or watch ever-changing sunset hues from the terrace of Long Dtai restaurant. A member of the prestigious Small Luxury Hotels of the World collection, Cape Fahn Hotel is rated among the top 1% of properties worldwide on Tripadvisor and among Travel + Leisure World's Best Awards 2021: Top 10 Resorts in Southeast Asia. Experience a level of paradise you never knew existed on this breathtaking escape.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Cape Fahn Hotel",
    "offer_address": "24/269, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1639.0,
    "value": 3230.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eNJFAQA4",
    "hero_image": "https://images.luxuryescapes.com/vyapiuyoseyxx2x0pj22",
    "image_two": "https://images.luxuryescapes.com/913iwtsvlqax32suzrzo",
    "image_three": "https://images.luxuryescapes.com/4fgrlncm4lxfdo4zdp1j",
    "vendor_name": "Amari Koh Samui",
    "title": "Koh Samui Beachside Luxury with Daily Cocktails and Dining Inclusions",
    "description": "Experience Koh Samui's relaxed island vibe and discover why Chaweng Beach is one of its most popular beaches with a luxurious retreat at Amari Koh Samui. Find blissful seclusion on this impressive stretch of beach known for its pristine white sand and clear blue waters, or choose from one of the resort's two swimming pools to laze your days away. You'll be pampered with a buffet breakfast every day, indulgent dining experiences, daily cocktails, a 60-minute massage per adult and round-trip transfers from Koh Samui Airport.\n\nTreat the whole family to a sun-kissed escape: check out the Family Upgrade, with two children aged 11 years and under staying for free with daily breakfast, round-trip airport transfers and free meals when dining with adults.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Amari Koh Samui",
    "offer_address": "14/3, Chaweng Beach Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 742.0,
    "value": 2562.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQd9iAAD",
    "hero_image": "https://images.luxuryescapes.com/vznzjdmvjdpk7q427cuc",
    "image_two": "https://images.luxuryescapes.com/tufqjcjbndsx70p5w68b",
    "image_three": "https://images.luxuryescapes.com/v2lkni3de8qhu5s0jd3h",
    "vendor_name": "Royal Muang Samui Villas",
    "title": "Five-Star Beachfront Koh Samui Suites with Daily Breakfast, Choice of Three-Course Lunch or Dinner & Nightly Cocktails",
    "description": "Escape to a five-star retreat, Royal Muyang Samui Villas, pocketed away on the northeast sands of Koh Samui. Feel like you’re worlds away in this natural paradise on Choeng Mon Beach and witness the glory of the sun rising and setting over the untouched coastline from your peaceful suite. Launch into luscious experiences and discover all that Thailand has to offer, from cultural experiences, delicious food and exhilarating adventures.\n\nTaste your way around four onsite restaurants, including the intimate Spice Zone Beach Restaurant, which hovers at the oceanfront or indulge in delicious Italian pizza and pasta at Ciccio Ristorante & Pizzeria. If it’s relaxation you’re seeking, get away from it all with a spa treatment at Cave Rai Ra Beach Spa. Though seemingly remote, the action is not too far away. Follow the locals to uncover the local array of restaurants, boutiques and bars in town, or simply walk along the tree-lined sands in search for your next ocean escapade.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Royal Muang Samui Villas",
    "offer_address": "89 Moo 5, Choengmon Beach, Bophut, Koh Samui, Suratthani 84320, Thailand",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1039.0,
    "value": 1869.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nKCbAAM",
    "hero_image": "https://images.luxuryescapes.com/wm25z4n54may3z9u3ewb",
    "image_two": "https://images.luxuryescapes.com/j2tg0ptevr4bs6tisldw",
    "image_three": "https://images.luxuryescapes.com/r0fz8xa9cyqvr1v1wkle",
    "vendor_name": "Silavadee Pool Spa Resort",
    "title": "Five-Star Koh Samui Cliffside Haven with Set Dinners, Daily Breakfast & Nightly Sunset Cocktails",
    "description": "Paradise awaits at the breathtaking Silavadee Pool Spa Resort, a secluded five-star luxury oasis built high up on the coastal cliffs overlooking Laem Nan Beach on Koh Samui. Spend balmy days sipping cocktails by the pool while looking out onto jaw-dropping panoramas or venture to Silavadee Spa, where a slew of rejuvenating treatments await. Then, head to the private beach, available exclusively for resort use, and experience some of the island’s best snorkelling away from the crowds. To round out your day, head to the two onsite restaurants serving up exquisite meals showcasing the flavours of the region, or sip on an expertly shaken cocktail at the Star rooftop bar at sunset for an unforgettable night.\n\nWhen you're ready to explore, the must-visit spots are within easy reach, including  Lamai City Centre, Hin-Ta and Hin-Yai Rocks and lively beach clubs, plus plenty of family-friendly restaurants and attractions.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Silavadee Pool Spa Resort",
    "offer_address": "208/66 Moo 4, Maret, Ko Samui, Surat Thani 84310, Thailand",
    "percentage_discount": 55.0,
    "min_duration": 7,
    "max_duration": 19,
    "price": 1055.0,
    "value": 2339.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbMoUAAV",
    "hero_image": "https://images.luxuryescapes.com/eb5k1w0cg95qq0ypddu",
    "image_two": "https://images.luxuryescapes.com/2dim5kxetjzt48g4qtoi",
    "image_three": "https://images.luxuryescapes.com/nubinqob7hyjh58eeh1b",
    "vendor_name": "Royal Muang Samui Villas",
    "title": "Five-Star Koh Samui Suites with Daily Breakfast, Daily Lunch or Dinner, Nightly Cocktails & Massages",
    "description": "Escape to a five-star retreat, Royal Muang Samui Villas, pocketed away on the northeast sands of Koh Samui. Feel like you’re worlds away in this natural paradise on Choeng Mon Beach and witness the glory of the sun rising and setting over the untouched coastline from your peaceful suite. Launch into luscious experiences and discover all that Thailand has to offer, from cultural experiences, delicious food and exhilarating adventures.Taste your way around four onsite restaurants, including the intimate Spice Zone Beach Restaurant, which hovers at the oceanfront or indulge in delicious Italian pizza and pasta at Ciccio Ristorante & Pizzeria.\n\nIf it’s relaxation you’re seeking, get away from it all with a spa treatment at Cave Rai Ra Beach Spa. Though seemingly remote, the action is not too far away. Follow the locals to uncover the array of restaurants, boutiques and bars in town, or simply walk along the tree-lined sands in search for your next ocean escapade.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Royal Muang Samui Villas",
    "offer_address": "89 Moo 5, Choengmon Beach, Bophut, Koh Samui, Suratthani 84320, Thailand",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 943.0,
    "value": 1949.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvVn1AAF",
    "hero_image": "https://images.luxuryescapes.com/uegc72gubs11e5i7joqc",
    "image_two": "https://images.luxuryescapes.com/ifnjbqo2nl2i048hz32g",
    "image_three": "https://images.luxuryescapes.com/gp8zpfpmbnz2k5ht4jg",
    "vendor_name": "Explorar Koh Samui",
    "title": "Adults-Only Koh Samui Beachfront Oasis with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Welcome to Explorar Koh Samui, an adults-only beachfront hideaway framed by lush gardens, coconut groves and pristine sandy stretches. Enjoy a rejuvenating swim in the glistening infinity pool at this five-star resort, spoil yourself at the spa and deepen your connection to mind and body with morning yoga sessions. Feed your curiosity and set off on a gastronomic adventure at Odyssey Restaurant - delight your senses with a cooking class or indulge in Mediterranean-inspired cuisine paired with a creative cocktail overlooking the turquoise sea.\n\nBeyond the resort, discover Koh Samui's captivating beaches, mountainous jungle terrain and magnificent islands, all within easy reach. Soak up the spirited atmosphere of the nearby Bo Phut, home to Samui's famed Big Buddha Temple, or take a shuttle to Bo Phut and enjoy a drink at the vibrant Fisherman's Village. Make Explorar Koh Samui your home-away-from-home with its advanced fitness centre, plus a well-equipped co-working space perfect for the digital nomad looking for the best of both worlds.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Explorar Koh Samui",
    "offer_address": "44/134 Moo 1, Maenam Beach, Koh Samui, Surat Thani 84330, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 999.0,
    "value": 2988.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvqD5AAJ",
    "hero_image": "https://images.luxuryescapes.com/00bw80thsein4r8yuxr7",
    "image_two": "https://images.luxuryescapes.com/mj0ctr7r17fl0ffr8g",
    "image_three": "https://images.luxuryescapes.com/ydpn7062ioya1ji44q64",
    "vendor_name": "The Lamai Samui",
    "title": "Koh Samui Five-Star Beachfront Paradise with Daily Breakfast, Daily Lunch or Dinner & Free-Flow Cocktail Hour",
    "description": "Wake up to the sound of the ocean and embrace absolute tranquility at this five-star oasis on the white sands of Lamai Beach. With its stunning ocean views and a luxe beachfront to sink your toes into, this resort offers guests the ultimate picturesque tropical getaway. The Lamai Samui brings to life an oriental heritage village backed by forested mountains and features elegant and spacious rooms and villas in which to hide away. Breathe in the scent of flourishing frangipanis and feel the calming essence of Feng Shui within and among the spaces while you spend your day at the seafront infinity pool or indulge in a relaxing treatment at Le Spa.\n\nYou'll find multiple dining spaces at your doorstep - try The Plate, The Ocean Pier and The Pool Bar, each serving up its own version of delicious international and Thai cuisine. Feel like taking a wander? With car rental and limousine services available, you'll be able to travel to the furthest stretches of Koh Samui in luxury and ease. Soak up serene ambience while attentive staff ensure you have a memorable and relaxing stay.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Lamai Samui",
    "offer_address": "146/24 Moo 4 Lamai Beach, Maret, Koh Samui 84310, Thailand",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1229.0,
    "value": 3168.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQ41GAAT",
    "hero_image": "https://images.luxuryescapes.com/6t4kcelr7elsgzxtc1x",
    "image_two": "https://images.luxuryescapes.com/h5d92ppzku0t196sfmxj",
    "image_three": "https://images.luxuryescapes.com/rfodbdieco8f8w91m1bl",
    "vendor_name": "Avani+ Samui Resort",
    "title": "New Dates Added! Tranquil Avani+ Koh Samui Beachfront Escape with Nightly Two-Hour Free-Flow Drinks & Daily Dining",
    "description": "Tune in to island time, at Avani+ Samui Resort, where blissful beach days and sunset cocktails are in abundance. Perched on a slice of secluded beachfront on Koh Samui’s quiet southwestern corner, the resort offers the perfect balance of thrilling tropical activities and serene days away from the crowds to rest and recharge. Spend days chasing waterfalls or beach-hopping before following your tastebuds to some of the island’s renowned dining hot spots. Step aboard a longtail boat for a trip to neighbouring island Koh Madsum, where white-sand beaches, vibrant snorkelling and adventurous kayaking is on the menu.\n\nIf you prefer to stay put, Avani+ Samui Resort has you covered. Feel the serenity by the swimming pool with a tropical cocktail, feast on authentic Thai or international cuisine at Essence Restaurant or watch the sunset with a drink in hand at the Rooftop Lounge. The fully equipped AvaniFit centre will ensure you won’t have to skip your daily exercise during your escape. When you’re ready to relax, book in a pampering treatment at the indulgent AvaniSpa.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Avani+ Samui Resort",
    "offer_address": "53/5 Moo 4, Phang Ka, Taling Ngam, Koh Samui, Suratthani 84140 Thailand",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 639.0,
    "value": 1329.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzN9BAAV",
    "hero_image": "https://images.luxuryescapes.com/txhykffxt2wcy4b4fj",
    "image_two": "https://images.luxuryescapes.com/jw6r4f865ujr1sskzx0m",
    "image_three": "https://images.luxuryescapes.com/j79ut8n0rryxdqefsa8p",
    "vendor_name": "Nora Buri Resort & Spa",
    "title": "Koh Samui Beachfront Luxury with Massages, Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Find island paradise on your doorstep at Nora Buri Resort & Spa Koh Samui, an ocean-facing gem shouldered by lush gardens and the white sands of Chaweng Beach. This resort complex is a sanctuary for the senses, offering the unparalleled tranquility of two pools - one perched on the hillside and the other kissing the ocean's shore - and a signature spa boasting treatment rooms with views over Koh Samui's lush terrain. Dinner is served on The Barge, perfect for catching iconic Samui sunsets, while icy cocktails await in the Lobby Bar or at happy hour in the pool.\n\nWhen the allure of Koh Samui pulls you away from the resort, its bustling eateries and the seemingly bottomless markets of Fisherman's Village are within arms' reach. Closer to home, the nearby Chaweng, with its sumptuous restaurants, colourful markets and beaches, is just minutes away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Nora Buri Resort & Spa Koh Samui",
    "offer_address": "111 Moo 5, Chaweng Beach, Bophut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 779.0,
    "value": 2553.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biXwTQAU",
    "hero_image": "https://images.luxuryescapes.com/kmylnkgl68ncinrsfeg4",
    "image_two": "https://images.luxuryescapes.com/tbcwh13xte1cwla1uxs",
    "image_three": "https://images.luxuryescapes.com/149pjh4w3g7fqmbegfgf",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Boutique Tropical Getaway on the Beach",
    "description": "Experience the relaxed island vibes of Thailand’s famous Koh Samui staying at The Sarann Koh Samui. Includes daily breakfast, a beachside dining experience, daily 30-minute massage per room, daily cocktail each, return airport transfers and complimentary shuttles to nearby Chaweng. Plus, children are included in the package!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui - July 2019",
    "offer_address": "95-96 Moo 3, Chaweng Noi Beach Tambol Bophut, Koh Samui, 84320, Thailand",
    "percentage_discount": 72.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 378.0,
    "value": 1363.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nFr5AAE",
    "hero_image": "https://images.luxuryescapes.com/awc3ezhyaotkqbi4a86",
    "image_two": "https://images.luxuryescapes.com/6q7ka952jrvuqtcb9xg",
    "image_three": "https://images.luxuryescapes.com/74f7wa8wgi0k6qslkxzo",
    "vendor_name": "Rocky's Boutique Resort",
    "title": "Beachfront Koh Samui Resort with Daily Dining, Cocktails & Roundtrip Airport Transfers",
    "description": "Tucked away in a hidden cove on Lamai Beach, the second largest beach in Koh Samui, Rocky’s Boutique Resort is an exclusive secluded spot perfect for a romantic getaway or a calming family escape. Surrounded by lush forests, picturesque waterfalls and coconut trees, this tropical paradise features two gorgeous swimming pools overlooking the ocean and the garden, an award-winning restaurant serving classical French cuisine and a garden bistro perfect for your morning cup of coffee.\n\nIf you’re keen for a taste of Thailand’s renowned beach nightlife outside the idyllic resort, Lamai Beach’s dazzling lights, inviting nightclubs and popular bars are merely a few minutes away with the resort's shuttle. Check out Chaweng Beach’s attractive array of local restaurants and bars, along with colourful shops and vibrant street markets. With the tranquil resort surrounded by three beaches, take this golden opportunity to practice your diving and snorkelling skills, especially with such clear water, magnificent coral reefs, and beautiful tropical marine life.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Rocky's Boutique Resort",
    "offer_address": "438/1 Moo 1, T. Maret, Amphur Koh Samui, Suratthani 84310, Thailand",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 17,
    "price": 919.0,
    "value": 1847.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvZpdQAF",
    "hero_image": "https://images.luxuryescapes.com/cthsqtgmpat957ri4mu8",
    "image_two": "https://images.luxuryescapes.com/kpny9oiyroh2znqq6hag",
    "image_three": "https://images.luxuryescapes.com/epyhpn2kkhyaop2ykfpf",
    "vendor_name": "Mai Samui Beach Resort & Spa",
    "title": "Beachfront Thailand Escape on Koh Samui",
    "description": "Experience the ultimate beachfront holiday on the tropical Thai island paradise of Koh Samui. Spend eight nights at the iconic Mai Samui Beach Resosrt & Spa and enjoy daily buffet breakfasts, an airport pickup, massages, a BBQ beach dinner, a cooking class, a temple and waterfall excursion and more. Plus, two kids stay free in the Deluxe Room!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Mai Samui Beach Resort & Spa - OLD",
    "offer_address": "Ang Thong, Ko Samui District, Surat Thani 84140, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 641.0,
    "value": 1941.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bfX7IQAU",
    "hero_image": "https://images.luxuryescapes.com/xhfwfq4kmz3pzhery4fy",
    "image_two": "https://images.luxuryescapes.com/edhzu6agp7hygkgi0mf1",
    "image_three": "https://images.luxuryescapes.com/hnisngdigsbfhmmppknf",
    "vendor_name": "The Lamai Samui",
    "title": "Five-Star Beachfront Bliss in Tropical Koh Samui",
    "description": "Experience five-star luxury with an oceanfront getaway on the pristine beaches of Koh Samui. Wake up to the sound of the waves lapping at the shore and feel the fresh tropical breeze at Le Méridien Koh Samui Resort & Spa. This stunning oasis boasts an unbeatable location right on Lamai Beach, plus incredible facilities and friendly hospitality. Enjoy daily buffet breakfast, a daily cocktail per adult, two fabulous dining experiences, a blissful 60-minute massage and return shuttle but transfers from Koh Samui Airport. Take your trip to the next level with an upgrade to a chic villa complete with a private pool.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Lamai - Samui (formerly Le Meridien Koh Samui) 2019",
    "offer_address": "146/24 Moo 4 Lamai Beach, Maret, Surat Thani Maret Koh Samui TH-84, 84310, Thailand",
    "percentage_discount": 51.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 1140.0,
    "value": 2336.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxaByQAJ",
    "hero_image": "https://images.luxuryescapes.com/u5mbs0y7z1xdlv9ghf4l",
    "image_two": "https://images.luxuryescapes.com/bwhgrgnruwrvnar1fmb5",
    "image_three": "https://images.luxuryescapes.com/ho0icfcbed6ubhzgmvum",
    "vendor_name": "Kanda Pool Villas Koh Samui",
    "title": "Private Pool Villa Paradise, Koh Samui",
    "description": "Escape to Thailand’s paradise island of Koh Samui, where palm-fringed beaches meet tropical rainforest. Discover your own private haven staying in a pool villa at Kanda Pool Villas Koh Samui, which comes complete with an exotic outdoor shower and fully-equipped gourmet SMEG kitchen. Your package includes daily breakfast, a 60-minute massage each, an in-villa tapas dining experience, a daily cocktail each, return airport transfers and a bottle of sparkling to share.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Kanda Pool Villas Koh Samui - 2018*",
    "offer_address": "80/32 Moo 5, Bophut, Ko Samui District, 84320, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 5,
    "max_duration": 8,
    "price": 891.0,
    "value": 2686.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPYwVQAW",
    "hero_image": "https://images.luxuryescapes.com/fl4csgvlvar5mmzzy7md",
    "image_two": "https://images.luxuryescapes.com/fapojgztjk03bp8dyrng",
    "image_three": "https://images.luxuryescapes.com/b6kv4j0amn7cydbdpqbl",
    "vendor_name": "Mai Samui Beach Resort & Spa",
    "title": "Beachfront Island Escape with Daily Breakfasts, Massages, Cocktails and More",
    "description": "Experience the ultimate beachfront holiday on the tropical Thai island paradise of Koh Samui. Spend eight nights at the iconic Mai Samui Beach Resort & Spa and enjoy daily buffet breakfasts, an airport pickup, massages, a BBQ beach dinner, a cooking class, daily cocktails and more. Plus, two kids stay free in the Deluxe Room!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Mai Samui Beach Resort & Spa Feb 2019",
    "offer_address": "2/6 Moo 5 Angthong, Suratthani 84140 Koh Samui Thailand",
    "percentage_discount": 75.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 625.0,
    "value": 2471.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bipOOQAY",
    "hero_image": "https://images.luxuryescapes.com/vtw6djzbsaqm81kmqhkf",
    "image_two": "https://images.luxuryescapes.com/vbwru7yq74lsoxxtlnl7",
    "image_three": "https://images.luxuryescapes.com/xghw1cllwsnrmmr5jtrx",
    "vendor_name": "W Koh Samui",
    "title": "Ultimate W Sophistication: Private Pool Villa Stay With Indulgent Dining",
    "description": "Live the VIP lifestyle with a chic Thai getaway at the super-luxe W Koh Samui, sister property to the iconic W Bali - Seminyak. Enjoy the exclusive resort’s tranquility during the day, relaxing in your Jungle Oasis Villa’s private pool or unwinding at the AWAY Spa. By night, watch the resort come alive at the famous WOOBAR, offering specially curated music and handcrafted cocktails. Included in your escape is daily buffet breakfast with sparkling wine and Bloody Marys, nightly multi-course dining experiences - including one signature extravaganza at W's premier Japanese restaurant, Namu  - one nightly cocktail each at WOOBAR or the beachfront SIP Bar, a 60-minute Thai massage per person and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "W Koh Samui - APRIL 2019",
    "offer_address": "4/1 Moo 1 Tambol Maenam Surat Thani Koh Samui TH-84, 84330, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1900.0,
    "value": 4575.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DnWPAA0",
    "hero_image": "https://images.luxuryescapes.com/hv0e91iylwmxg228rh",
    "image_two": "https://images.luxuryescapes.com/pzq3pm71yzv5ut5pokr",
    "image_three": "https://images.luxuryescapes.com/l5h3qnwtld0f0i5vdre7",
    "vendor_name": "Bandara Resort & Spa",
    "title": "Beachfront Koh Samui Escape near Fisherman's Village with Daily Breakfast, Lunch or Dinner & Cocktails",
    "description": "Escape to an idyllic home-away-from-home at Bandara Resort and Spa, a surf-and-sand sanctuary providing relaxed beachside fun in Koh Samui. A short walk along the palm-fringed beach is the charming Fisherman’s Village, a buzzing, fairy-light-lit promenade of restaurants and boutiques where you can discover the dazzling sights and people that put Koh Samui on the map.\n\nSavour daily dining overlooking the calming sapphire waves of Bo Phut Beach, indulge in sophisticated cocktails at Chom Dao Beach Club or visit Shine Spa for soothing Thai massages and treatments. Recline and revitalise over afternoon tea at Ling Cafe and relish the sweet serenade of crashing waves.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Bandara Resort and Spa, Samui",
    "offer_address": "178/2 Moo 1, Tambol Bophut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 714.0,
    "value": 1685.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GJwK1YAL",
    "hero_image": "https://images.luxuryescapes.com/0jalyaxrwh0mrcylzwnr",
    "image_two": "https://images.luxuryescapes.com/6x1l7ekcpqcwpzxmw4t",
    "image_three": "https://images.luxuryescapes.com/y3kdsxdaqkvwj4xyih2",
    "vendor_name": "The Lamai Samui",
    "title": "Koh Samui Beachfront Luxury with Daily Breakfast, Daily Lunch or Dinner & Free-Flow Cocktail Hour",
    "description": "Wake to the sound of the ocean and embrace absolute tranquility at this five-star oasis on the white sands of Lamai Beach. With its stunning ocean views and a luxe beachfront to sink your toes into, this resort offers guests the ultimate picturesque tropical getaway. Soak up the serene ambience while attentive staff ensure you have a memorable and relaxing stay.\n\nThe Lamai Samui brings to life an oriental heritage village backed by forested mountains, featuring elegant and spacious rooms and villas in which to hide away. Breathe in the scent of flourishing frangipanis and feel the calming essence of Feng Shui within the spaces while you spend your day at the seafront infinity pool or indulge in a relaxing treatment at Le Spa.\n\nYou'll find multiple dining spaces at your doorstep - try The Plate, The Ocean Pier and The Pool Bar, each serving up delicious bites and tipples paired with ocean or poolside views. Feel like taking a wander? With vehicle rental services available, you'll be able to travel to the furthest stretches of Koh Samui in luxury and ease.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Lamai Samui",
    "offer_address": "146/24 Moo 4 Lamai Beach, Maret, Koh Samui 84310, Thailand",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 1139.0,
    "value": 3768.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cqS3pQAE",
    "hero_image": "https://images.luxuryescapes.com/wla0muskecwv77rcgmih",
    "image_two": "https://images.luxuryescapes.com/najn4ag6pjhm9hhixrg4",
    "image_three": "https://images.luxuryescapes.com/rpyoxaofihu8vtzj0o4g",
    "vendor_name": "Vana Belle, a Luxury Collection Resort, Koh Samui",
    "title": "Private Pool Seclusion with Personalised Service & Daily Dining",
    "description": "Escape to Thailand’s idyllic island of Koh Samui and enjoy VIP treatment at Vana Belle, a Luxury Collection Resort, Koh Samui. A beachfront haven and part of Marriott’s prestigious Luxury Collection, Vana Belle offers stunning private pool suites, personalised service and some of the finest dining on the island. Includes sumptuous daily buffet breakfast, nightly three-course dinner at either of the resort’s signature restaurants, a nightly cocktail per person at the stylish Lobby Lounge, a daily ‘Taste of Thai Experience’ with sweet and savoury snacks plus soft drinks and coffee, a 30-minute massage per person at the luxurious Vana Spa and return airport transfers. Plus, up to two children (aged 11 years and under) stay free on existing bedding with breakfast and transfers.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Vana Belle, a Luxury Collection Resort, Koh Samui",
    "offer_address": "9/99 Moo 3 Chaweng Noi Beach, Surat Thani Surat Thani Koh Samui TH-84, 84320, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 1229.0,
    "value": 4623.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GOCLoAAP",
    "hero_image": "https://images.luxuryescapes.com/n4nrzgk7ri04rxj9oma",
    "image_two": "https://images.luxuryescapes.com/p99ir9idq7if4yr5xhgg",
    "image_three": "https://images.luxuryescapes.com/bwaem7zr6wvdats7b",
    "vendor_name": "Mai Samui Beach Resort & Spa",
    "title": "Koh Samui Beachfront Escape with Daily Breakfast, Daily Two-Course Lunch or Dinner, Free-Flow Drinks & Massages",
    "description": "Set on the shores of the secluded Laem Yai Beach in a tranquil corner of Koh Samui, Mai Samui Beach Resort & Spa's breathtaking location will instantly make you forget the outside world. Offering a laidback, tropical island ambiance with a contemporary Thai design, this intimate resort is the perfect place to recharge your batteries. Onsite you'll find three gorgeous pools and a squash court, while the cosy Mai Pub & Restaurant is the perfect spot to kick back and enjoy a mouthwatering meal.\n\nSpend days lounging on the beachfront with a cocktail in hand, a good book and the sounds of the lapping shores. When you can tear yourself away, don't miss the Fisherman's Village with its hip restaurants and boutiques, less than 20 minutes away by scooter.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Mai Samui Beach Resort & Spa",
    "offer_address": "2/6 Moo 5, Laem Yai Beach, Angthong Koh Samui, Suratthani 84140, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 599.0,
    "value": 1595.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IFSwIAO",
    "hero_image": "https://images.luxuryescapes.com/5v87guh3mrncgj5ly1g9",
    "image_two": "https://images.luxuryescapes.com/z67j5hv3g50yfhmplu",
    "image_three": "https://images.luxuryescapes.com/umh9ia5mvr9v1s56rug",
    "vendor_name": "Paradise Beach Resort Samui",
    "title": "Beachfront Koh Samui Resort with Daily Breakfast & Massages",
    "description": "Lose track of time at this tropical oasis, where Koh Samui’s palm-fringed beaches and dazzling waters are at your doorstep. Boasting a beachfront location on the laidback Maenam Beach, just a stroll away from the vibrant street markets and lively nightlife, Paradise Beach Resort Samui provides the quintessential island experience.\n\nAfter sun-soaked days poolside, venture out to the island's landmarks, with the awe-inspiring Wat Plai Laem and the Big Buddha Temple only a drive away. Then, enjoy a change of scenery at the fisherman village of Bo Phut Beach, where waterfront restaurants and bars await.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Paradise Beach Resort Samui",
    "offer_address": "18/8 Moo 1, Maenam Beach, Koh Samui, Suratthani 84330, Thailand",
    "percentage_discount": 66.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 317.0,
    "value": 926.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CFNv6YAH",
    "hero_image": "https://images.luxuryescapes.com/3lnvid0xtyhal4ao3xyv4",
    "image_two": "https://images.luxuryescapes.com/db611f8lw2zcg7283o6g",
    "image_three": "https://images.luxuryescapes.com/kktr83gd66089l6vw2ar",
    "vendor_name": "Nora Buri Resort & Spa",
    "title": "Koh Samui Beachfront Indulgence with Daily Breakfast, Nightly Dinner & Free-Flow Cocktail Hour",
    "description": "Find island paradise on your doorstep at Nora Buri Resort & Spa Koh Samui, an ocean-facing gem shouldered by lush gardens and the white sands of Chaweng Beach. This resort complex is a sanctuary for the senses, offering the unparalleled tranquility of two pools - one perched on the hillside and the other kissing the ocean's shore.\n\nAndonas Spa Signature boasts treatment rooms with views over Koh Samui's lush terrain. Enjoy dinner at The Barge Restaurant, the perfect spot for catching iconic Samui sunsets, then unwind with icy cocktails at the Lobby Bar or during happy hour by the pool.\n\nWhen the allure of Koh Samui pulls you away from the resort, explore the bustling eateries and markets of Fisherman's Village or the sumptuous restaurants and enticing beaches of nearby Chaweng.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Nora Buri Resort & Spa Koh Samui",
    "offer_address": "111 Moo 5, Chaweng Beach, Bophut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 999.0,
    "value": 3022.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004SuopAAC",
    "hero_image": "https://images.luxuryescapes.com/tl6uoxmj5mey7ryzamw",
    "image_two": "https://images.luxuryescapes.com/xew93zowh69k8ro81gls",
    "image_three": "https://images.luxuryescapes.com/sbwx2039od8fxqn7ndjd",
    "vendor_name": "Santiburi Koh Samui",
    "title": "Award-Winning Five-Star Koh Samui Beachfront Luxury with Decadent Dining & Nightly Cocktails",
    "description": "Soak up the sun and escape the crowds at the ultra-luxe Santiburi Koh Samui - an award-winning beachfront paradise voted one of the Top 25 Hotels in Thailand in the Tripadvisor Travellers' Choice Awards for two years in a row.\n\nOverlooking Koh Samui’s northern shore with a private 300m stretch of sugar-fine sand, Santiburi Koh Samui’s unbeatable location will instantly make you forget the outside world. Set amid 23 acres of tropical palms with a 50m swimming pool, sleek carbon-neutral suites and a stunning 18-hole golf course - located only 10 minutes from the resort - this elegant five-star resort offers its privileged guests a secluded sanctuary away from it all. Find your perfect patch of sand on Maenam Beach and receive the VIP treatment with exclusive beach butler service,  or plunge into the resorts luxuriously large swimming pool. Cool off in the azure waters of the Gulf with complimentary access to all non-motorised watersport equipment, including kayaks, paddleboards and more, or if you're keen to explore, the pristine shores of Bophut Beach are less than a 10-minute drive away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Santiburi Koh Samui",
    "offer_address": "12/12 Moo 1 Maenam Beach Koh Samui 84330, Thailand Koh Samui 84330 Thailand",
    "percentage_discount": null,
    "min_duration": null,
    "max_duration": null,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3VhgQAF",
    "hero_image": "https://images.luxuryescapes.com/qkx5xk9lentkwkl0ns59",
    "image_two": "https://images.luxuryescapes.com/oyyuqecnbbxvzorb7mje",
    "image_three": "https://images.luxuryescapes.com/wzpyswfdwjhpgxx7ugmr",
    "vendor_name": "W Koh Samui",
    "title": "Ultimate Private Pool Villa Luxury in Thailand with Indulgent Dining Inclusions",
    "description": "Live the VIP lifestyle with a chic Thai getaway at the super-luxe W Koh Samui, sister property to the iconic W Bali - Seminyak. Enjoy the exclusive resort’s tranquility during the day, relaxing in your Jungle Oasis Villa’s private pool or unwinding at the AWAY Spa. By night, watch the resort come alive at the famous WOOBAR, offering specially curated music and handcrafted cocktails. Included in your escape is daily buffet breakfast with sparkling wine and Bloody Marys, nightly multi-course dining experiences - including one signature extravaganza at W's premier Japanese restaurant, Namu  - one nightly cocktail each at WOOBAR, a 60-minute Thai massage per person and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "W Koh Samui - 2018",
    "offer_address": "4/1 Moo 1 Tambol Maenam Surat Thani Tambol Maenam Koh Samui TH-84, 84330, Thailand",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 2027.0,
    "value": 4057.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ic5FfYAJ",
    "hero_image": "https://images.luxuryescapes.com/j2anp313eei4gzaez0d",
    "image_two": "https://images.luxuryescapes.com/v7bscpwovwzcqw6symc",
    "image_three": "https://images.luxuryescapes.com/fxj0z6vvljm5dms4wvfd",
    "vendor_name": "Paradise Beach Resort Samui",
    "title": "Beachfront Koh Samui Resort with Daily Breakfast & Massages",
    "description": "Lose track of time at this tropical oasis, where Koh Samui’s palm-fringed beaches and dazzling waters are at your doorstep. Boasting a beachfront location on the laid-back Maenam Beach and just a stroll away from vibrant street markets and lively nightlife, this resort provides the quintessential island experience.\n\nAfter sun-soaked days poolside, venture out to the island’s landmarks, with the awe-inspiring Wat Plai Laem and the Big Buddha Temple only a drive away. Then, enjoy a change of scenery at the fisherman village of Bo Phut Beach where waterfront restaurants and bars await.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Paradise Beach Resort Samui",
    "offer_address": "18/8 Maenam Beach Koh Samui, Surat Thani, 84330 Thailand",
    "percentage_discount": 65.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 357.0,
    "value": 1021.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000COWxaAAH",
    "hero_image": "https://images.luxuryescapes.com/6a2ys71btb1k9z4tt2jv",
    "image_two": "https://images.luxuryescapes.com/b71ru1v6undee7xtrgej",
    "image_three": "https://images.luxuryescapes.com/aosyrwmmrmvum0wf875",
    "vendor_name": "KC Beach Club and Pool Villas",
    "title": "Koh Samui Beach Club Experience with All-Inclusive Dining & Daily Drinks",
    "description": "Embrace good times on the sun-kissed sands of Chaweng Beach with an escape to the super-cool KC Beach Club & Pool Villas on the island paradise of Koh Samui. Perfectly positioned by glistening turquoise waters, the resort boasts spectacular surrounds and no shortage of party atmosphere. It’s an ideal base for those looking to maximise their Thailand fun - settle in to a private beach cabana, enjoy all-day music by the pool, feast on international favourites at Neo Restaurant or sip your way through the extensive cocktail menu. After a night out exploring the best of Chewang, refresh and revitalise in the morning by catching one of the island’s famed sunrises - the sight from the beach will take your breath away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "KC Beach Club & Pool Villas",
    "offer_address": "11/9 Moo 2, Bo Phut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 403.0,
    "value": 1014.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id1ShAAJ",
    "hero_image": "https://images.luxuryescapes.com/9ugujv4c6m1pon917ap",
    "image_two": "https://images.luxuryescapes.com/t0yh6j4f2dwz7yskgptd",
    "image_three": "https://images.luxuryescapes.com/wtqpalf6ez2drcz8f6x",
    "vendor_name": "Beyond Samui",
    "title": "Beachfront Koh Samui Paradise with Daily Breakfast, Nightly Dinner, Beach Massages & Cocktails",
    "description": "Set by a sparkling stretch of Chaweng Beach, this coastal resort is the perfect home away from home for those who enjoy beachside tranquillity and rich culture.\n\nAfter sun-soaked days spent exploring the natural environment and exciting shopping and cultural precincts, treat yourself to a peaceful beachfront massage and let experienced hands knead your stress away.\n\nFind inner serenity under the waving palm trees as you splash around in the shimmering resort pool or as you laze poolside on a comfortable sun lounger with fresh coconut juice and seasonal fruits at your side. Take your tastebuds on a tropical journey at @Beach Restaurant & Bar, where local recipes and international favourites showcase the island’s fresh ingredients.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Beyond Samui",
    "offer_address": "20 Moo 2, Chaweng-Choengmon Road, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 799.0,
    "value": 1885.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LhFTAA0",
    "hero_image": "https://images.luxuryescapes.com/hd6kx0fl96ykchvu4hvd",
    "image_two": "https://images.luxuryescapes.com/h2hlivwi5gf699ynol",
    "image_three": "https://images.luxuryescapes.com/z36gsyx8ms0kjpt7gia",
    "vendor_name": "The Lamai Samui",
    "title": "Tranquil Beachfront Paradise with Nightly Cocktails & Gourmet Dining",
    "description": "Wake up to the sound of the ocean and embrace absolute tranquillity at Le Méridien Koh Samui Resort & Spa, a five-star oasis on the white sands of Lamai Beach. Treat yourself to a luxe beachfront escape and enjoy daily buffet breakfast, a daily cocktail per adult, a fabulous three-course Thai dining experience, a blissful 60-minute Thai massage each, discounts on dining and spa treatments and a one-way shuttle bus transfer from Koh Samui Airport. Your dreamy escape also includes a THB1,000 credit to use towards an unforgettable dining experience at the resort's iconic Ocean Pier restaurant, a floating venue set right on the glistening waters of the Gulf of Thailand.\n\nWant to escape in true VIP style? Take your trip to the next level with an upgrade to a stylish villa complete with a private pool. \n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Lamai Samui",
    "offer_address": "146/24 Moo 4 Lamai Beach, Maret, Koh Samui 84310, Thailand",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 1115.0,
    "value": 2478.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HEY03YAH",
    "hero_image": "https://images.luxuryescapes.com/w8r24irsnapja0lwie0c",
    "image_two": "https://images.luxuryescapes.com/c6hbmkuj95br0c54nzh",
    "image_three": "https://images.luxuryescapes.com/xer8x4blm9c6shxy1t",
    "vendor_name": "Samujana Villas",
    "title": "Award-Winning Koh Samui Clifftop Pool Villas with In-Villa Banquet, Daily Breakfast & Nightly Cocktails",
    "description": "Escape to clifftop luxury at Samujana Villas, an exclusive award-winning collection of 23 spectacular pool villas perched above the Gulf of Thailand. Featured in season three of HBO’s ‘The White Lotus’, this hillside sanctuary is made for indulgence - think breathtaking ocean views from your private oversized infinity pool, spacious indoor-outdoor living areas and your own dedicated villa manager to take care of every detail.\n\nThe only resort on the island to be awarded Three Michelin Keys, you'll be able to spend your days soaking up the island sunshine or entertaining in style with expansive dining spaces, fully equipped kitchens and the latest in-villa entertainment systems. Savour chef-prepared meals, unwind with blissful in-villa spa treatments and let your in-villa attendant handle the rest - so you never have to lift a finger.\n\nPerfect for families or groups of friends, with some villas accommodating up to 11 guests, you’ll enjoy access to a range of on-site activities including tennis, yoga and Muay Thai boxing classes, while activities such as windsurfing and diving are available nearby. And when you’re ready to explore, you’re just minutes from Koh Samui’s vibrant beach clubs, top restaurants and the golden sands of Choeng Mon Beach - one of the island’s finest. This is Koh Samui at its most luxurious.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Samujana Villas",
    "offer_address": "63/154 Moo 5, Plai Laem Soi 11, Suratthani 84320, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 1649.0,
    "value": 4462.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HnPXIA0",
    "hero_image": "https://images.luxuryescapes.com/k8hiq60pvcdjmwb50aa",
    "image_two": "https://images.luxuryescapes.com/u8j1p4qbg78rvzmhqu",
    "image_three": "https://images.luxuryescapes.com/n8t8f05hgmmh5mo6via",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Koh Samui Beachfront Escape with Onsite Spa, All-Inclusive Dining & Nightly Cocktails",
    "description": "Nestled on the crisp sands of Chaweng Noi Beach, this beautiful property offers an intimate oceanfront escape just a stone's throw from Koh Samui's vibrant dining and nightlife. A true haven of relaxation, this boutique resort features an expansive swimming pool framed by sweeping sea views.\n\nThe breezy, onsite beachside restaurant and bar, Wild Ginger, serves up a mix of local and international dishes. When you're not sinking your toes into the resort's stretch of pristine sand or unwinding in the relaxing spa, venture north for a night on the town or take advantage of Koh Samui's enviable gulf location to island-hop across to Koh Phangan or Koh Tao.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui, Suites and Villa",
    "offer_address": "95-96 Moo 3, Chaweng Noi Beach, Tambol Bophut, Koh Samui, Surat Thani, 84320, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 304.0,
    "value": 961.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I2THIA0",
    "hero_image": "https://images.luxuryescapes.com/yc1dqezort8rkn6c2wn",
    "image_two": "https://images.luxuryescapes.com/t09gtmyhrewsmbha08bn",
    "image_three": "https://images.luxuryescapes.com/uitw8jkn0xsx2fyqxupi",
    "vendor_name": "Bandara Resort & Spa",
    "title": "Beachfront Koh Samui Escape near Fisherman's Village with Daily Breakfast, Nightly Dinner & Nightly Drinks",
    "description": "Escape to an idyllic home-away-from-home at this surf-and-sand sanctuary, providing relaxed beachside fun in Koh Samui. Days in the sun never felt so fun as they do at this laidback resort overlooking Bo Phut Beach.\n\nA five-minute walk away along the palm-fringed beach, find the charming Fisherman’s Village night market, a buzzing, fairy-light-lit promenade of restaurants and boutiques where you can discover the dazzling sights and warm hospitality that have put Koh Samui on the map.\n\nSavour daily dining as the calming sapphire waves of Bo Phut Beach lull you, indulge in sophisticated cocktails at Chom Dao Beach Club or visit Shine Spa for soothing Thai massages and treatments. Unwind by one of the resort's four pools and relish the sweet serenade of crashing waves while little ones stay busy monkeying around at Monkey Club kids' club.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Bandara Resort and Spa, Samui",
    "offer_address": "178/2 Moo 1, Tambol Bophut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 72.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 739.0,
    "value": 2639.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000daCY5QAM",
    "hero_image": "https://images.luxuryescapes.com/2f0mkm0tlpu2vsvpu5z",
    "image_two": "https://images.luxuryescapes.com/hvgqiy54hc4i8acw6ps",
    "image_three": "https://images.luxuryescapes.com/hrxvxjxomhcynamprgm",
    "vendor_name": "W Koh Samui",
    "title": "Ultimate W Sophistication: Private Pool Villa Stay With Indulgent Dining",
    "description": "Live the VIP lifestyle with a chic Thai getaway at the super-luxe W Koh Samui. Enjoy the exclusive resort’s tranquillity during the day, relaxing in your private pool or unwinding at the AWAY Spa. By night, watch the resort come alive at the famous WOOBAR, offering specially curated music and handcrafted cocktails. Indulge with daily buffet breakfast with sparkling wine and Bloody Marys, nightly multi-course dining experiences - including one signature extravaganza at W's premier Japanese restaurant, Namu - one nightly cocktail each at WOOBAR or the beachfront SIP Bar, a 60-minute Thai massage per person and more. Want to turn your tropical getaway into a family holiday? No problem - up to two kids (aged 12 years and under) stay free!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "W Koh Samui",
    "offer_address": "4/1 Moo 1 Tambol Maenam Surat Thani Koh Samui TH-84, 84330, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 1163.0,
    "value": 3101.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JN5NhAAL",
    "hero_image": "https://images.luxuryescapes.com/7aw8zd1kn3wjydlsurqr",
    "image_two": "https://images.luxuryescapes.com/92kds2r0qmb4g58n1w8",
    "image_three": "https://images.luxuryescapes.com/a388myq3c9zdqmq0jf6",
    "vendor_name": "Explorar Koh Samui",
    "title": "Five-Star Adults-Only Koh Samui Beachfront Oasis with Daily Breakfast, Nightly Dinner, Free-Flow Cocktail Hour & Massages",
    "description": "Step into bliss on the tropical coastline of Koh Samui at this adults-only beachfront hideaway framed by lush gardens, coconut groves and pristine sandy stretches. Rejuvenate in the glistening infinity pool at this five-star resort, spoil yourself at the spa and deepen your connection to mind and body with morning yoga sessions.\n\nReady for five-star relaxation, romantic gastronomic indulgence and tropical mixology paired with laid-back island life? Feed your curiosity and set off on a gastronomic adventure at Odyssey restaurant - delight your senses with a cooking class or indulge in Mediterranean-inspired cuisine, choice cuts sizzled on a charcoal grill and woodfired pizzas paired with a creative cocktail. Beyond the resort, discover Koh Samui's captivating beaches, mountainous jungle terrain and magnificent islands, all within easy reach.\n\nSoak up the spirited atmosphere of the nearby Bo Phut, home to Samui's famed Big Buddha Temple, or explore the vibrant Fisherman's Village. Make Explorar Koh Samui your home-away-from-home with its advanced fitness centre, plus a well-equipped co-working space perfect for the digital nomad looking for the best of both worlds.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Explorar Koh Samui",
    "offer_address": "44/134 Moo 1, Maenam Beach, Koh Samui, Surat Thani 84330, Thailand",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1119.0,
    "value": 3288.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bg2QgAAJ",
    "hero_image": "https://images.luxuryescapes.com/pbuh6rb0pizkdh2dx7",
    "image_two": "https://images.luxuryescapes.com/8fulmd01ca4we4ecvsme8",
    "image_three": "https://images.luxuryescapes.com/4d9m2e1c96tg81bex14",
    "vendor_name": "Nikki Beach Resort & Spa Koh Samui",
    "title": "Boutique Koh Samui Beachfront Luxury with Daily Breakfast, Three-Course Dinner & Beach Club Drinks",
    "description": "Fusing together traditional Thai elements and modern-day luxury, the opulent Nikki Beach Resort & Spa Koh Samui showcases the internationally recognised beauty of Koh Samui's pristine west coast. Gaze upon breathtaking sunsets in your expansive suites with private sun-kissed terraces, thoughtfully designed with intimacy in mind. Wander around the soft white sands of the nearby Lipa Noi Beach, pamper yourself with indulgent spa treatments at the tranquil spa or party it up at the glamorous Nikki Beach Club, serving up handcrafted cocktails and decadent globally inspired dishes.\n\nTake in verdant jungles, spotless beaches fringed with palm trees, and a dose of sunshine all year round in this tropical paradise. The luscious island is adjacent to more than 60 other picturesque islands, notably the rugged Koh Phangan island known for its notoriously grand Full Moon parties, and Ang Thong National Marine Park, a haven for exotic wildlife and sea creatures with plenty of unique diving and snorkelling opportunities.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Nikki Beach Resort & Spa Koh Samui",
    "offer_address": "96/3 Moo 2, Tambon Lipa Noi, Amphoe Koh Samui, Chang Wat Surat Thani 84140, Thailand",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 19,
    "price": 1138.0,
    "value": 2671.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009De4FAAS",
    "hero_image": "https://images.luxuryescapes.com/tg32bz724f83jnuktee",
    "image_two": "https://images.luxuryescapes.com/d93g6k8zr8ua97t76gv9",
    "image_three": "https://images.luxuryescapes.com/cto0lvdjbnvfl4hr4uer",
    "vendor_name": "Centara Reserve Samui",
    "title": "Brand-New Centara Koh Samui Five-Star Beachfront Escape with Daily Breakfast, Gourmet Dining & Complimentary Minibar",
    "description": "Make those tropical Thailand dreams come true with an escape to the brand-new, five-star Centara Reserve Samui, nestled on the sparkling shores of Koh Samui. The first resort in Centara’s curated luxury collection of refined hotels, Centara Reserve Samui offers a discreet sanctuary home to six exquisite bars and restaurants, two dazzling resort pools and a spa offering tailored treatments using herbs from the organic garden.\n\nTake lazy strolls along Chaweng Beach, then soak up the tropical sunshine on a plush oceanfront lounger. Drinks can be ordered at the Pool Bar or The Terrace, where piazza-style seating invites you to take a break and enjoy a selection of cocktails and light bites. A pre-dinner tipple at The Gin Run bar leads into relaxed evenings dining on contemporary Thai favourites at Sa-Nga restaurant, fresh seafood at Salt Society or modern high-end cuisine at Act 5. This discerning Thai sanctuary is the break from the everyday you've been searching for.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Centara Reserve Samui",
    "offer_address": "38/2 Moo 3, Borpud, Chaweng Beach, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 56.0,
    "min_duration": 7,
    "max_duration": 21,
    "price": 1339.0,
    "value": 3061.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AaYBnAAN",
    "hero_image": "https://images.luxuryescapes.com/5ijwzkkw8ikw3n9t1lh",
    "image_two": "https://images.luxuryescapes.com/8vfjtmrxd930suvte09f",
    "image_three": "https://images.luxuryescapes.com/5ryc91rlk422rc35yzd9",
    "vendor_name": "Samujana Villas",
    "title": "Ultra-Luxe Koh Samui Private Pool Villas with Daily Breakfast & Roundtrip Transfers",
    "description": "Embrace the chilled-out vibes of Koh Samui in true five-star style at the clifftop Samujana Villas. Stay in one of 23 luxury villas dotted among the hillside, all offering breathtaking private infinity pools overlooking the glittering waters of the Gulf of Thailand. Whether you’re looking for romance as a couple or an unforgettable group escape, you’ll discover the perfect home-away-from-home dotted among lush palm trees. Perfect for entertaining, each contemporary villa offers large, airy indoor-outdoor living and dining spaces, a kitchen and the latest audio and media facilities. Add in daily butler service to cater for every whim, delicious in-villa dining, a semi-private beach and a blissful spa, and you may never want to leave this paradise.\n\nDine in or out as you please, as this oasis is just a short drive to a plethora of Koh Samui's most popular bars, restaurants and shops. You’ll also find yourself just five minutes from Choeng Mon Beach - one of Koh Samui's best beaches.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Samujana Villas",
    "offer_address": "63/154 Moo 5, Plai Laem Soi 11, Suratthani 84320, Thailand",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 3014.0,
    "value": 6783.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxPPHAA3",
    "hero_image": "https://images.luxuryescapes.com/r241fk0d11r6a3n327uk",
    "image_two": "https://images.luxuryescapes.com/jjknprgok41gqcelos5",
    "image_three": "https://images.luxuryescapes.com/imy2s7dt5760zq68rvn",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Koh Samui Beachfront Escape with All-Inclusive Dining, Daily Massages & Nightly Cocktails",
    "description": "Nestled on the crisp sands of Chaweng Noi Beach, The Sarann Koh Samui offers an intimate oceanfront escape just a stone's throw from the island's vibrant dining and nightlife. A true haven of relaxation, this boutique resort features an expansive swimming pool framed by sweeping sea views and a breezy beachside restaurant and bar serving up a mix of local and international dishes. When you're not sinking your toes into the resort's stretch of pristine sand or unwinding in the relaxing spa, venture north for a night on the town or take advantage of Koh Samui's enviable gulf location to island-hop across to Koh Phangan or Koh Tao.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui, Suites and Villa",
    "offer_address": "95-96 Moo 3, Chaweng Noi Beach, Tambol Bophut, Koh Samui, Surat Thani, 84320, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 299.0,
    "value": 945.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008fyurAAA",
    "hero_image": "https://images.luxuryescapes.com/kebjy7qf0bjptf2ydu6",
    "image_two": "https://images.luxuryescapes.com/v143y1idfadjw143zic",
    "image_three": "https://images.luxuryescapes.com/vc9giq232r3ucasjc4op",
    "vendor_name": "Mai Samui Beach Resort & Spa",
    "title": "Koh Samui Beachfront Escape with Daily Breakfast, Daily Two-Course Lunch or Dinner & All-Inclusive Drinks",
    "description": "Set on the shores of the secluded Laem Yai Beach in a tranquil corner of Koh Samui, Mai Samui Beach Resort & Spa's breathtaking location will instantly make you forget the outside world. Offering a laidback, tropical island ambience with a contemporary Thai design, the intimate resort is ranked within the top 10% of properties on Tripadvisor. Onsite you'll find exquisite facilities including three pools, a squash court and a wine cellar. Savour stylish poolside dining at Fine Dining Sala, or kick back at the cosy MAI Pub & Restaurant. \n\nSpend days lounging on the beachfront with a cocktail in hand, a good book and the sounds of the lapping shores. When you can tear yourself away, don't miss the Fisherman's Village with its hip restaurants and boutiques, less than 20 minutes by scooter.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Mai Samui Beach Resort & Spa",
    "offer_address": "2/6 Moo 5, Laem Yai Beach, Angthong Koh Samui, Suratthani 84140, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 649.0,
    "value": 1736.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EWUMIYA5",
    "hero_image": "https://images.luxuryescapes.com/tkilveuh20o7t935wn",
    "image_two": "https://images.luxuryescapes.com/lfvbt5ajxr8o4jl5eu",
    "image_three": "https://images.luxuryescapes.com/wwwz86mz0omz5kb5zq",
    "vendor_name": "Cape Fahn Hotel",
    "title": "Award-Winning Koh Samui Private Island Pool Villas with Daily Breakfast, Nightly Dinner & Massages",
    "description": "Check-in to an intimate private island pool villa haven only moments from the shores of Koh Samui, yet a million miles from everyday life. A tranquil treasure dropped in the ocean just off Choeng Mon Beach, this resort promises white sands, unparalleled sunsets and crystal waters.\n\nThis multi-award-winning five-star hotel boasts an in-house spa surrounded by greenery, a sprawling main pool and a fine dining restaurant by world-renowned Australian chef David Thompson. Lose track of time playing games under the pavilion while sipping a complimentary nightly cocktail, or see the island from a different perspective by booking in a luxury yacht charter.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Cape Fahn Hotel",
    "offer_address": "24/269, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 1769.0,
    "value": 4166.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070txiAAA",
    "hero_image": "https://images.luxuryescapes.com/zxk2csfnytvmcavx7obt",
    "image_two": "https://images.luxuryescapes.com/9oizgdv2ldr9h90tjukuk",
    "image_three": "https://images.luxuryescapes.com/58gyxba6zzkgbyh9yya",
    "vendor_name": "Avani+ Samui Resort",
    "title": "Tranquil Koh Samui Pool Villas with Daily Breakfast, Daily Two-Course Lunch or Dinner & Nightly Happy Hour",
    "description": "Tune in to island time where blissful beach days and sunset cocktails are in abundance at Avani + Samui, a beachfront resort stamped with a Tripadvisor Travellers’ Choice 2021 award, making it one of the top 10% properties worldwide. Perched on a slice of secluded beachfront in Pangka Bay on Koh Samui’s quiet southwestern corner, you can enjoy serene days away from the crowds to rest and recharge. Koh Samui is a treasure trove of fun things to do. Spend days chasing waterfalls or beach hopping, and follow your tastebuds to some of the island’s renowned dining hot spots. Plus, the resort offers a longtail boat trip to neighbouring island Koh Matsum, where white-sand beaches, vibrant snorkelling and adventurous kayaking is on the menu.\n\nIf you prefer to stay put, Avani + Samui has you covered. Relax by either of the two swimming pools with a tropical cocktail, feast on authentic Thai or international cuisine at Essence Restaurant or watch the sunset with a drink in hand at the Rooftop Lounge. Kayaks and paddleboards are on offer, along with yoga and Muay Thai classes (additional charges apply), while the AvaniFit fully equipped fitness centre will ensure you won’t have to skip your daily exercise during your escape. When you’re ready to relax, book in a pampering treatment at the indulgent AvaniSpa.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Avani+ Samui Resort",
    "offer_address": "53/5 Moo 4, Phang Ka, Taling Ngam, Koh Samui, Suratthani 84140 Thailand",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 1500.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DARAjYAP",
    "hero_image": "https://images.luxuryescapes.com/enw64by2p6wyvwah6og",
    "image_two": "https://images.luxuryescapes.com/vo9hlxo2flc9o75exw9m",
    "image_three": "https://images.luxuryescapes.com/fjb4wl5mf2idno8nkomp",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Boutique Oceanfront Koh Samui Escape with All-Inclusive Dining, Nightly Cocktails & Massages",
    "description": "Nestled on the sands of Chaweng Noi Beach, this resort offers an intimate oceanfront escape just a stone’s throw from Koh Samui's dining and nightlife. The Sarann Koh Samui features a swimming pool framed by sea views and a breezy beachside restaurant and bar, serving a mix of local and international dishes. When you’re not sinking your toes into the resort’s stretch of sand or unwinding with treatments at the spa, indulge in all-inclusive breakfast, lunch and dinners. Venture north for a night on the town or take advantage of Koh Samui’s enviable gulf location to island-hop across to Koh Phangan or Koh Tao.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui, Suites and Villa",
    "offer_address": "95-96 Moo 3, Chaweng Noi Beach, Tambol Bophut, Koh Samui, Surat Thani, 84320, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 304.0,
    "value": 961.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dcgmqQAA",
    "hero_image": "https://images.luxuryescapes.com/1u604rhywlbf59pf205s",
    "image_two": "https://images.luxuryescapes.com/z6eeajbp3601uxljpv79",
    "image_three": "https://images.luxuryescapes.com/cpkhmnlr5puc2ptehm6h",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Boutique Beachside Getaway with Daily Breakfast, Cocktails and Massages",
    "description": "Experience the relaxed island vibes of Thailand’s famous Koh Samui staying at The Sarann Koh Samui. Includes daily breakfast, a beachside dining experience, daily 30-minute massage per room, daily cocktail each, return airport transfers and complimentary shuttles to nearby Chaweng. Plus, up to two children are included in the package!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui Oct 19",
    "offer_address": "95-96 Moo 3, Chaweng Noi Beach Tambol Bophut, Koh Samui, 84320, Thailand",
    "percentage_discount": 72.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 371.0,
    "value": 1306.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IardzAAB",
    "hero_image": "https://images.luxuryescapes.com/beb1e92y6yy27km5vcb",
    "image_two": "https://images.luxuryescapes.com/v30uakddeaepv85thrb",
    "image_three": "https://images.luxuryescapes.com/aft2no8ujhm7vmh7i1qk",
    "vendor_name": "Renaissance Koh Samui Resort & Spa",
    "title": "Koh Samui Island Opulence with Daily Breakfast, Daily Lunch or Dinner, Nightly Drinks & Daily Massages (Select Packages Only)",
    "description": "Discover an unparalleled paradise on the sparkling shores of Koh Samui at the five-star Renaissance Koh Samui Resort & Spa by the internationally renowned Marriott brand. Nestled amidst manicured gardens, this resort is a stone's throw from the iconic Lamai Beach, Chaweng Beach and Fisherman's Village. Spend your days walking along the pristine sands or, should the turquoise water call your name, enjoy an abundance of watersports with equipment hire available for guests. If you want to get out and explore, the resort's lifestyle concierge can assist with planning your perfect excursion.\n\nBeachfront bliss will be all yours with a daily feast of buffet breakfast and set-menu lunch or dinner, with a nightly drink per adult. Savour an array of culinary delights from the onsite restaurants, offering everything from classic Thai dishes and international cuisine at Banana Leaf and fresh local seafood at TawaNN, to light bites and specialty cocktails at Pool Bar.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Renaissance Koh Samui Resort & Spa",
    "offer_address": "208/1 Moo 4, T. Maret, Lamai Beach, Koh Samui, Amphoe Ko Samui, Chang Wat Surat Thani 84310, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 5,
    "max_duration": 30,
    "price": 1079.0,
    "value": 0.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvYAWQA3",
    "hero_image": "https://images.luxuryescapes.com/uqajza8n2cyc6dohjlu5",
    "image_two": "https://images.luxuryescapes.com/apefomoppvrbsqkd2okt",
    "image_three": "https://images.luxuryescapes.com/xp0pg9yuadabqrsmvzma",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Boutique Oceanfront Escape in Koh Samui",
    "description": "Experience the relaxed island vibes of Thailand’s famous Koh Samui staying at The Sarann. Includes daily breakfast, exotic dining experiences, massages, return airport transfers, shuttles to nearby Chaweng, food and spa discounts, complimentary Wi-Fi and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui - 2018*",
    "offer_address": "95-96 Moo 3, Chaweng Noi Beach Tambol Bophut, Koh Samui, 84320, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 381.0,
    "value": 1021.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbkSuAAJ",
    "hero_image": "https://images.luxuryescapes.com/a5mol5m45fa5cjnajo2q",
    "image_two": "https://images.luxuryescapes.com/1u7yibwl53iaw1xfpsag",
    "image_three": "https://images.luxuryescapes.com/wy2o8axpwlfy6tqpf1",
    "vendor_name": "Pavilion Samui Villas & Resort",
    "title": "Koh Samui Beachfront Retreat with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Powdery-white sands, shimmering turquoise waters and complete tranquillity await at the Pavilion Samui Villas & Resort. With direct access to the serene Lamai Beach and looking out over the Gulf of Thailand, it's the perfect place to unwind. Sip cocktails from The Lookout Bar and soak in spectacular views from the infinity pool, feel revitalised after treatments at Spavilion or enjoy a romantic candle-lit dinner on the beach. When you're not sipping on your included daily cocktail, savour a sumptuous Italian or Thai dish at The Patio Restaurant.\n\nVenture out to Lamai's bustling night market, take a walking tour of Koh Samui's sprawling tropical paradise or simply enjoy your relaxing, Thai-inspired retreat - the choice is yours with every option just a stone's throw from the resort.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Pavilion Samui Villas & Resort",
    "offer_address": "124/24 Moo 3, Lamai, Samui, Surathani 84310, Thailand",
    "percentage_discount": 72.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 2120.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LhrNAAS",
    "hero_image": "https://images.luxuryescapes.com/ka8uqq94adde7bbbw9j",
    "image_two": "https://images.luxuryescapes.com/u3eqmrqcfni0dwffen6",
    "image_three": "https://images.luxuryescapes.com/2v36ii4fdz06vaqr4ls",
    "vendor_name": "Santiburi Koh Samui",
    "title": "Beachfront Koh Samui Luxury with Degustation Dinner & Daily Cocktails",
    "description": "Experience the sort of laidback luxury you'd expect from somewhere voted as one of the Top 25 Hotels in Thailand in the TripAdvisor Travellers' Choice Awards 2019. Nestled on 300m of powdery white shore, this elegant all-suite and villa five-star resort is its own secluded world, set amid 23 acres of tropical palms with a 50m swimming pool, sleek carbon-neutral suites and a stunning 18-hole golf course. Your escape includes daily breakfast, a Thai degustation dining experience for two adults, one daily sunset cocktail per adult, one 60-minute massage per person, return VIP transfers and more.\n\n**Travelling with family?** One child (aged 12 years and under) stays, plays and eats free when dining with an adult. Or, upgrade to the Grand Reserve Pool Villa valid for two adults and two children.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Santiburi Koh Samui Jun 20",
    "offer_address": "หมู่ที่ 1 12/12 ตำบล แม่น้ำ Ko Samui District, Surat Thani 84330, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 779.0,
    "value": 2049.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zkMPAAY",
    "hero_image": "https://images.luxuryescapes.com/dogq3y3cj8m0auzqd9h",
    "image_two": "https://images.luxuryescapes.com/02n6hpe77aqpa9irb78",
    "image_three": "https://images.luxuryescapes.com/ig86yzhmdcksnrihf",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Boutique Beachfront Koh Samui Escape with All-Inclusive Dining, Daily Cocktails & Roundtrip Transfers",
    "description": "Nestled on the tip of Chaweng Noi Beach, The Sarann Koh Samui offers intimate oceanfront luxury just a stone's throw from the island's prime dining and nightlife.\n\nA haven of relaxation, this boutique resort features just 49 beautifully appointed rooms and villas, a dazzling swimming pool framed by sweeping sea views and a breezy beachside restaurant and bar showcasing an eclectic mix of local and international culinary creations. When you're not sinking your toes into the resort's stretch of powder-white sands or unwinding in the indulgent spa, venture 10-minutes north for a night on the town or take advantage of Koh Samui's enviable gulf location and sail across to Koh Phangan or Koh Tao on an island-hopping adventure.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui, Suites and Villa",
    "offer_address": "95-96 Moo 3, Chaweng Noi Beach, Tambol Bophut, Koh Samui, Surat Thani, 84320, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 389.0,
    "value": 1056.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lp4eAAC",
    "hero_image": "https://images.luxuryescapes.com/qizvoyjmn2gs4p9qwcmn",
    "image_two": "https://images.luxuryescapes.com/wz545254nb2wfh8wbx",
    "image_three": "https://images.luxuryescapes.com/cwxmpd53f4h2eybathsi",
    "vendor_name": "Samujana Villas",
    "title": "Ultra-Luxe Koh Samui Private Pool Villas with Gourmet Dining & Daily Cocktails",
    "description": "Embrace the chilled-out vibes of Koh Samui in true five-star style at the clifftop Samujana Villas. Stay in one of 23 luxury villas dotted among the hillside, all offering breathtaking private infinity pools overlooking the glittering waters of the Gulf of Thailand. Whether you’re looking for romance as a couple or an unforgettable group escape, you’ll discover the perfect home-away-from-home dotted among lush palm trees. Perfect for entertaining, each contemporary villa offers large, airy indoor-outdoor living and dining spaces, a kitchen and the latest audio and media facilities. Add in daily butler service to cater for every whim, delicious in-villa dining, a semi-private beach and a blissful spa, and you may never want to leave this paradise.\n\nDine in or out as you please, as this oasis is just a short drive to a plethora of Koh Samui's most popular bars, restaurants and shops. You’ll also find yourself just five minutes from Choeng Mon Beach - one of Koh Samui's best beaches.\n\n**Your handpicked inclusions:**\n\n- Wake each day to à la carte breakfast in the comfort of your villa\n- Enjoy one indulgent, multi-course Thai dining experience in your villa\n- Raise a toast with a daily cocktail per adult at the Beach Bar\n- Convenient roundtrip transfers between Samui Airport and the resort\n- Make the most of a 15% discount on drinks and dining throughout your stay\n\n**Group Upgrades:** Travelling with family or friends? Choose from a range of spacious two, three, four and five-bedroom villas, valid for up to 10 guests. See individual packages for details.\n\n**Extended Stay Bonus:** Stay seven nights or more to enjoy a BBQ feast served in the comfort of your villa on one evening of your stay. Upgrade to 10 nights or more and enjoy not only the BBQ bonus but also an additional in-villa Thai dinner.\n\n**This deal has NO peak surcharges:** travel any time for the same great price.\n\n**Book with 100% Confidence**: If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Samujana Villas",
    "offer_address": "63/154 Moo 5, Plai Laem Soi 11, Suratthani 84320, Thailand",
    "percentage_discount": 33.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 2249.0,
    "value": 3350.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DfC0vYAF",
    "hero_image": "https://images.luxuryescapes.com/3rv3ad56bs6wheri5ww",
    "image_two": "https://images.luxuryescapes.com/ol66k0no47bhf6t87aks",
    "image_three": "https://images.luxuryescapes.com/slhxazkqhvcposycb39u",
    "vendor_name": "InterContinental Koh Samui Resort",
    "title": "Award-Winning Koh Samui Beachfront Stay with Daily Breakfast, Nightly Dinner & Free-Flow Cocktail Hour",
    "description": "Feel the salt breeze on your face and savour every moment of decadence when you step into this immaculate, five-star resort in Koh Samui, dramatically positioned on jungled hilltops overlooking the dazzling Gulf of Thailand. With a 22-acre private beachfront and countless awards and accolades - this resort is one of Koh Samui's most coveted destinations.\n\nDining is accompanied by simmering ocean views at every table, whether you're dining in front of the live cooking station at Amber - paired with a vintage from its 1,000-strong wine cellar - or beneath the stars at the Thai-European fusion restaurant, Flames. Look out onto one of the world's most breathtaking sunsets at Air Bar, featured in a New York Times bestseller, and float into bliss with cocktails at the Pool Bar.\n\nNo island escape would be complete without taking time for personal wellness and relaxation. On a soaring cliffside perch dazzling above coconut trees and shimmering ocean, the award-winning Baan Thai Spa by HARNN await with treatments that capture the essence of Samui. Ascend to the private treatment rooms for moments of 'me time', all while the little ones are enriched at Planet Trekkers kids' club.\n\nYour serene hideaway is located on the spectacular Taling Ngam Bay, boasting views of the famed Five Islands. Perfectly perched off the tourist trails while still brimming with adventure, spend days ziplining through the rainforest, visiting ethical elephant sanctuaries and exploring Angthong National Marine Park.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "InterContinental Koh Samui Resort",
    "offer_address": "295 Moo 3 Taling Ngam, Koh Samui, Surat Thani 84140, Thailand",
    "percentage_discount": 56.0,
    "min_duration": 5,
    "max_duration": 25,
    "price": 1219.0,
    "value": 2795.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqAIUAA3",
    "hero_image": "https://images.luxuryescapes.com/qtt26gniicit35ch34",
    "image_two": "https://images.luxuryescapes.com/mkefbjebv9azdjy66x1s",
    "image_three": "https://images.luxuryescapes.com/szvk9o7r2fhiatm0y6a",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Koh Samui Beachfront Escape with Daily Dining, Nightly Cocktails, Roundtrip Transfers & 2 Kids Stay Free",
    "description": "Nestled on the crisp sands of Chaweng Noi Beach, The Sarann Koh Samui offers an intimate oceanfront escape just a stone's throw from the island's vibrant dining and nightlife. A true haven of relaxation, this boutique resort features an expansive swimming pool framed by sweeping sea views and a breezy beachside restaurant and bar serving up a mix of local and international dishes. When you're not sinking your toes into the resort's stretch of pristine sands or unwinding in the relaxing spa, venture north for a night on the town or take advantage of Koh Samui's enviable gulf location to island hop across to Koh Phangan or Koh Tao.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui, Suites and Villa",
    "offer_address": "95-96 Moo 3, Chaweng Noi Beach, Tambol Bophut, Koh Samui, Surat Thani, 84320, Thailand",
    "percentage_discount": 65.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 359.0,
    "value": 1026.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JAfiIAG",
    "hero_image": "https://images.luxuryescapes.com/tcygflcjisi6k1e89gno",
    "image_two": "https://images.luxuryescapes.com/04qiy0ooyxep4fx6a8x",
    "image_three": "https://images.luxuryescapes.com/0bxulihdh9xuwna584zt",
    "vendor_name": "Fair House Villas & Spa",
    "title": "Beachfront Koh Samui Villa & Suite Haven with Daily Breakfast & Signature Cocktails",
    "description": "Situated in the serene beauty of Koh Samui, this all-villa resort is a haven of Thai-inspired architecture and lush gardens. Bask in the peaceful atmosphere as you wander through fragrant flora, unwind by crystal-clear waters or retreat to your private sanctuary with its thoughtful design and harmonious integration with nature.\n\nSavour exquisite Thai and international flavours at Bre-Eze restaurant with ocean views that complement every meal. Revitalise your mind and body at Panadus Spa with a hot stone massage or enjoy a signature cocktail at the swim-up pool bar for moments infused with tropical bliss.\n\nPositioned on Koh Samui's pristine coastline, Fair House Villas & Spa is your gateway to island adventure. Explore the spiritual wonder of the Big Buddha statue, just a short drive away, or embrace the bustle of the Fisherman's Village night markets. Nature enthusiasts can travel further to the Na Muang waterfalls or dive nearby to see colourful marine life.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Fair House Villas & Spa",
    "offer_address": "39 Moo 1 Maenam Beach, Koh Samui 84330, Thailand",
    "percentage_discount": 45.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 495.0,
    "value": 895.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HuavSYAR",
    "hero_image": "https://images.luxuryescapes.com/qbl80mt4jg4r9tv82eu4",
    "image_two": "https://images.luxuryescapes.com/xt1oclq8bm77xktpwuxn",
    "image_three": "https://images.luxuryescapes.com/gjdyt8rqbg3ns0qool",
    "vendor_name": "Avani+ Samui Resort",
    "title": "Tranquil Koh Samui Beachfront Retreat with All-Inclusive Dining & Four-Hour Nightly Free-Flow Drinks",
    "description": "Tune in to island time at this coastal hideaway, where blissful beach days and sunset cocktails are in abundance. Perched on a secluded slice of beachfront on Koh Samui’s southwestern coast, this resort offers the perfect balance of island adventures and serene days.\n\nEnjoy a day lazing by the beachfront infinity pool or indulge in a heavenly treatment at THE Avani Spa, where ancient traditions meet modern techniques. Feast on authentic Thai or international cuisine at Essence Restaurant or catch a dazzling sunset at the Rooftop Lounge.\n\nSpend days chasing waterfalls or beach hopping before following your tastebuds to some of the island’s renowned street food markets and dining hot spots. Step aboard a longtail boat for a trip to neighbouring island Koh Madsum, where white-sand beaches, jaw-dropping snorkelling and adventurous kayaking are on the menu.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Avani+ Samui Resort",
    "offer_address": "53/5 Moo 4, Phang Ka, Koh Samui, Surat Thani 84140, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 1199.0,
    "value": 4454.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Qu7DdQAJ",
    "hero_image": "https://images.luxuryescapes.com/usmfkccfntdg4dzobniz",
    "image_two": "https://images.luxuryescapes.com/ivlpdyk3zqom6p31yhwe",
    "image_three": "https://images.luxuryescapes.com/uszqwlvlfgjihkttfop8",
    "vendor_name": "Belmond Napasai Koh Samui",
    "title": "Unforgettable Island Indulgence in Koh Samui",
    "description": "Experience a tranquil island escape staying at the secluded five-star oceanfront hideaway, Belmond Napasai, Koh Samui. Enjoy five nights in a luxurious Seaview Villa overlooking the pristine ocean and enjoy daily buffet breakfast, private return airport transfers, nightly cocktails, four two-course dinners for two, one themed buffet dinner and two 30-minute foot massages to share. Plus, two kids 11 and under stay free!",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Belmond Napasai Koh Samui - April 2018",
    "offer_address": "65/10 Baan Tai, Maenam, Koh Samui, Surat Thani, 84330, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 5,
    "max_duration": 8,
    "price": 1253.0,
    "value": 3310.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eNR2yQAG",
    "hero_image": "https://images.luxuryescapes.com/wd20xmkgr1q6b8qlrm",
    "image_two": "https://images.luxuryescapes.com/pyyx99o0qjqnh0f91hub",
    "image_three": "https://images.luxuryescapes.com/yj82c5fpjb7nnjdcwbc",
    "vendor_name": "Royal Muang Samui Villas",
    "title": "Five-Star Thai Suite Luxury with Dining Experiences & Daily Cocktails",
    "description": "Experience authentic Thai luxury and five-star service at Royal Muang Samui Villas, perfectly located along beautiful Choeng Mon Beach. A luxe hideaway for couples or a pristine playground for families, this tranquil resort has it all. Relax in barefoot Thai style with daily breakfast, a 60-minute spa treatment per person at the unique cave-themed spa, select dining inclusions, a daily cocktail each and roundtrip private airport transfers from Koh Samui airport.\n\n**Travelling as a family?** One child aged 11 years and under stays, plays and eats free (when dining with a paying adult). Package upgrades for two adults and two children available.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Royal Muang Samui Villas 2019",
    "offer_address": "89 Ko Samui District, Surat Thani 84320, Thailand",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 1115.0,
    "value": 3846.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4TrUAAV",
    "hero_image": "https://images.luxuryescapes.com/9my7tqtj7cravj1t2x3h",
    "image_two": "https://images.luxuryescapes.com/mqoh8uz6jnjn38usadfp",
    "image_three": "https://images.luxuryescapes.com/22r4wrtmv5425lkbzpq5",
    "vendor_name": "OUTRIGGER Koh Samui Beach Resort",
    "title": "Grand Opening: Outrigger Koh Samui Beachfront Retreat with Daily Dining & Two Hours of Nightly Free-Flow Drinks",
    "description": "Discover a captivating blend of old-world charm and tropical tranquillity with a stay at Outrigger Koh Samui Beach Resort, ideally positioned on Lamai Beach’s serene sands. Perfect for couples seeking a romantic sojourn and families looking for fun in the sun, this recently refurbished resort brings Outrigger’s iconic reputation for top-notch hospitality to soulful Koh Samui. Savour days spent lazing by glistening lagoon pools, sipping cold cocktails on warm sands at the Edgewater Beach Club or wandering the resort’s flawless gardens, artfully shaped to reflect the days of Old Siam.\n\nWhen you’re ready to explore, Koh Samui’s abundance of world-class restaurants, vibrant markets and picture-perfect beaches await. Go north to experience Chaweng’s dazzling collection of beach bars and raucous Green Mango nightlife strip, travel just 20 minutes to experience the natural splendour of the mighty Na Muang Waterfall cascades, or head to the resort’s laidback massage sala for wellness treatments surrounded by the island’s unparalleled beauty.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "OUTRIGGER Koh Samui Beach Resort",
    "offer_address": "173/41 Moo 4, Rob Koh Road, Maret, Koh Samui, Suratthani, Thailand 84310",
    "percentage_discount": 43.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 959.0,
    "value": 1696.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPuNoAAL",
    "hero_image": "https://images.luxuryescapes.com/kyj0alnn8kdvtbc7dvrm",
    "image_two": "https://images.luxuryescapes.com/vplgy1um6fexnda9oohv",
    "image_three": "https://images.luxuryescapes.com/qiz073whd898gz68h2cq",
    "vendor_name": "W Koh Samui",
    "title": "Colourful W Koh Samui Private Pool Villas with Daily Breakfast, Nightly Dinners, Daily Drinks & More (select packages)",
    "description": "Find yourself front and centre to Thailand's golden sands and pristine beaches with a stay at the five-star W Koh Samui oceanfront resort - a true island paradise designed with luxury and sophistication at its core. This ultra-cool island escape is the perfect romantic destination for lovers of luxury, boasting vivid views of the Gulf of Thailand from nearly every angle. Indulge in a poolside cocktail at WOOBAR® or SIP, dine on delicate Japanese dishes and unwind at the tranquil AWAY® Spa. From the moment you step foot inside this luxurious property, you will be surrounded with bold and stylish interior decor that elevates the funky villas from daytime polish to upbeat nightlife destinations.\n\nThe resort's poppy vibe carries through to the communal fairways, including the trendy rooftop infinity pool with a view, lined with sunken lime green cocktail settings. Spend your days basking in the resort's luxurious amenities, or put on your bikini and board shorts for a day of adventurous water-based fun. Choose top-quality kayaks or challenge yourself with an expedition by paddleboard among the famous crystal-clear waters that surround the island. Enjoy sunrise with a guided morning Pilates session and visit the calming Tonic Bar for juice and healthy refreshments after. No matter your style of vacation the W Koh Samui is the perfect destination for top-tier relaxation, dining and fun in the sun.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "W Koh Samui",
    "offer_address": "4/1 Moo 1 Tambol Maenam Surat Thani Koh Samui TH-84, 84330, Thailand",
    "percentage_discount": 39.0,
    "min_duration": 5,
    "max_duration": 36,
    "price": 2169.0,
    "value": 3556.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gw0UHAAZ",
    "hero_image": "https://images.luxuryescapes.com/7toy7e41hevivq3sh8j4",
    "image_two": "https://images.luxuryescapes.com/3qpmzyodnjgo5bw2w8v",
    "image_three": "https://images.luxuryescapes.com/v17sh871pg1w3omc0v4g",
    "vendor_name": "Pavilion Samui Villas & Resort",
    "title": "Koh Samui Beachfront Retreat with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Powdery-white sands, shimmering turquoise waters and complete tranquillity await. With direct access to the serene Lamai Beach and looking out over the Gulf of Thailand, this resort is the perfect place to unwind. \n\nSip cocktails from the Lookout Bar and soak in spectacular views from the infinity pool, feel revitalised after treatments at Spavilion or enjoy a romantic candle-lit dinner on the beach. When you're not sipping on your included nightly cocktail, savour a sumptuous Italian or Thai dish at The Patio Restaurant.\n\nVenture out to Lamai's bustling night market, take a walking tour of Koh Samui's sprawling tropical paradise or simply enjoy your relaxing, Thai-inspired retreat - the choice is yours with every option just a stone's throw from the resort.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Pavilion Samui Villas & Resort",
    "offer_address": "124/24 Moo 3, Lamai, Samui, Surathani 84310, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 1828.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cJISxQAO",
    "hero_image": "https://images.luxuryescapes.com/qikzx4xgz1wpnqd5mmf",
    "image_two": "https://images.luxuryescapes.com/vvg9klvpxxn4h2uwoae",
    "image_three": "https://images.luxuryescapes.com/w87mt8h94t5zkdp0ga5m",
    "vendor_name": "Renaissance Koh Samui Resort & Spa",
    "title": "Beachfront Island Indulgence with All-Inclusive Dining",
    "description": "Discover an unparalleled paradise on the sparkling shores of Koh Samui at the five-star Renaissance Koh Samui Resort & Spa by the internationally renowned Marriot brand and experience all-inclusive beachfront decadence. Indulge in sumptuous dining: daily buffet breakfast, daily set-menu lunches, nightly set-menu dinners, plus a daily cocktail per adult, four blissful 45-minute massages to share, convenient return airport transfers and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Renaissance Koh Samui Resort & Spa - 2019",
    "offer_address": "208/1 Moo 4, T. Maret, Lamai Beach, Koh Samui, Amphoe Ko Samui, Chang Wat Surat Thani 84310, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 1267.0,
    "value": 3953.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zIBXAA2",
    "hero_image": "https://images.luxuryescapes.com/qr31p37upk7l1kh8rbvj",
    "image_two": "https://images.luxuryescapes.com/1735sy9hch4jt7mmxbfs",
    "image_three": "https://images.luxuryescapes.com/gkixnw1zeya9ej143mt",
    "vendor_name": "Belmond Napasai Koh Samui",
    "title": "Belmond Koh Samui Villa Luxury with Daily THB750 Resort Credit & Breakfast",
    "description": "Hidden away from the rest of the world in a tranquil corner of Koh Samui, overlooking the breathtaking island of Koh Phangan and the glistening Gulf of Thailand, the five-star Belmond Napasai promises relaxation and seclusion. Experience pure luxury on a private stretch of Baan Tai Beach, by the lagoon-style pool and amid the jungle that surrounds the 43-acre resort.\n\nIndulge in a Sea-View Villa stay with daily American breakfast, a welcome cocktail per adult and daily THB750 resort credit per villa.\n\n**Travelling with family?** Up to two children (aged 11 years and under) stay, play and eat free with a dining adult.\n\n**Travelling as a bigger family or group?** Upgrade to the 400sqm Two-Bedroom Oceanfront Pool Residence, valid for four adults and two children (aged 11 years and under).",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Belmond Napasai",
    "offer_address": "65/10 Baan Tai, Maenam, Koh Samui, Surat Thani 84330, Thailand",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 249.0,
    "value": 476.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2jsdQAB",
    "hero_image": "https://images.luxuryescapes.com/gcm8uzttf2wpjmg2w7nm",
    "image_two": "https://images.luxuryescapes.com/vq6wpazthikeqkae4zs3",
    "image_three": "https://images.luxuryescapes.com/m5xhkqupc6ikqfjlko7a",
    "vendor_name": "Belmond Napasai Koh Samui",
    "title": "Unforgettable Island Indulgence where Jungle Meets Sea",
    "description": "Experience a tranquil island escape staying at the secluded five-star oceanfront hideaway, Belmond Napasai, Koh Samui. Enjoy seven nights in a luxurious Sea View Villa with views over the Gulf of Thailand, with daily buffet breakfast, one indulgent three-course dining experience, one themed buffet dinner experience, a daily cocktail each, a relaxing one-hour Signature Massage each and convenient return airport transfers.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Belmond Napasai - 2019",
    "offer_address": "65/10 Baan Tai, Maenam, Koh Samui, Surat Thani 84330, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 7,
    "max_duration": 9,
    "price": 1241.0,
    "value": 3963.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AaO6jAAF",
    "hero_image": "https://images.luxuryescapes.com/6xka3y4lm7qa4ya6gmp",
    "image_two": "https://images.luxuryescapes.com/92o0x9kx6itp6wqryjaj",
    "image_three": "https://images.luxuryescapes.com/3h7rn59j4ipndjrnoyj",
    "vendor_name": "Mai Samui Beach Resort & Spa",
    "title": "Koh Samui Beachfront Escape with Daily Breakfast, Daily Two-Course Lunch or Dinner & Free-Flow Drinks",
    "description": "Set on the shores of the secluded Laem Yai Beach in a tranquil corner of Koh Samui, Mai Samui Beach Resort & Spa's breathtaking location will instantly make you forget the outside world. Offering a laidback, tropical island ambiance with a contemporary Thai design, the intimate resort is the perfect place to recharge your batteries. Onsite you'll find three gorgeous pools and a squash court, while the cosy MAI Pub & Restaurant is the perfect spot to kick back and enjoy a mouthwatering meal.\n\nSpend days lounging on the beachfront with a cocktail in hand, a good book and the sounds of the lapping shores. When you can tear yourself away, don't miss the Fisherman's Village with its hip restaurants and boutiques, less than 20 minutes by scooter.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Mai Samui Beach Resort & Spa",
    "offer_address": "2/6 Moo 5, Laem Yai Beach, Angthong Koh Samui, Suratthani 84140, Thailand",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 649.0,
    "value": 1632.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JN5OoAAL",
    "hero_image": "https://images.luxuryescapes.com/2dp7btgytuodqva7viks",
    "image_two": "https://images.luxuryescapes.com/tcrai3x9xlqhk98c6dbh",
    "image_three": "https://images.luxuryescapes.com/53hjzrhctqnepxfflmcl",
    "vendor_name": "Tui Blue, The Passage Samui",
    "title": "Koh Samui All-Inclusive Beachfront Paradise with Unlimited Daily Free-Flow Drinks, Massages & Return Airport Transfers",
    "description": "Step into tropical bliss at this laidback oasis on the north shores of Koh Samui, surrounded by towering palm trees, vibrant marine life and sandy beaches that stretch for miles. Feel born again at the Blue Spa with a curated selection of Thai healing massages and aroma oil treatments, before sipping on a refreshing Mojito as you take in a breathtaking Thai sunset.\n\nIndulge your senses at The Restaurant with zesty Thai dishes from meat to local seafood, topped off with views unfolding across Laem Yai Beach and the Angthong Islands. Outside the resort, you're just a hop, skip and jump away from Koh Samui's jungle terrain, white sand beaches and picture-perfect islands. \n\nWhether you're sipping on your favourite cocktail by the pool, checking out the lively Fisherman's Village night market, or immersing yourself in the local culture at the gilded Big Buddha Temple at the colourful Phra Ya temple, TUI BLUE The Passage Samui is all about finding inner bliss. Soak in the peace and tranquillity, feel worlds away and let island life work its magic.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "TUI BLUE The Passage Samui",
    "offer_address": "57/6-7, Ko Samui District, Surat Thani 84140, Thailand",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 2025.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BoI7AAK",
    "hero_image": "https://images.luxuryescapes.com/d04auemk95rysf1277ll",
    "image_two": "https://images.luxuryescapes.com/vjogqpc557ccw95a6mr",
    "image_three": "https://images.luxuryescapes.com/nrn0862xv0kdjdfi",
    "vendor_name": "Explorar Koh Samui",
    "title": "Grand Opening: Adults-Only Koh Samui Beachfront Oasis with Massages, Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Be one of the first to experience the tropical haven that is the adults-only Explorar Koh Samui, a brand-new island hideaway framed by tropical gardens, coconut groves and pristine sandy stretches. Trace your way to the northern coast of the island and embrace a tranquil stay and truly disconnect from the every day at this romantic retreat. Enjoy a refreshing swim in the glittering infinity pool, spoil yourself at the spa and deepen your connection to mind and body with morning yoga sessions. For the hungry and curious, feed your curiosity with a Thai cooking class or dine at the onsite restaurant and take in sweeping sea views.\n\nBeyond the resort, discover Koh Samui's stunning beaches, mountainous jungle terrain and magnificent islands within easy reach. Soak up the vibrant atmosphere of the nearby Bo Phut, home to Samui’s famed Big Buddha Temple (Phra Yai), hop over to Koh Tao and enjoy a drink at the vibrant Fisherman's Village.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Explorar Koh Samui",
    "offer_address": "44/134 Moo 1, Maenam Beach, Koh Samui, Suratthani 84330, Thailand",
    "percentage_discount": null,
    "min_duration": 3,
    "max_duration": 20,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPuNhAAL",
    "hero_image": "https://images.luxuryescapes.com/0e1i3e7phpzvgvraiut7",
    "image_two": "https://images.luxuryescapes.com/nc2enencuj02q6bjg29o",
    "image_three": "https://images.luxuryescapes.com/wlr7ayhxocpopmi11sq",
    "vendor_name": "Renaissance Koh Samui Resort & Spa",
    "title": "Koh Samui Beach Luxury w. All-Inclusive Dining & Free Flow Drinks",
    "description": "Discover an unparalleled paradise on the sparkling shores of Koh Samui at the five-star Renaissance Koh Samui Resort & Spa by the internationally renowned Marriott brand. Nestled amidst manicured gardens, this resort is a stone's throw from the iconic Lamai Beach, Chaweng Beach and Fisherman's Village. Spend you days walking along the pristine sands or, should the turquoise water call your name, enjoy an abundance of water sports with equipment hire available for guests. If you want to get out an explore, the resort's lifestyle concierge can assits with planning your perfect excursion.\n\nAll-inclusive beachfront bliss will be all yours with a daily feast of buffet breakfast, set-menu lunch and dinner, all complemented by free-flowing drinks. Savour an array of culinary delights from the onsite restaurants, offering everything from classic Thai dishes to fresh local seafood and international cuisine. Unwind with a dip in one of the resort’s sparkling pools or a enjoy rejuvenating treatment at Quan Spa, with a daily 45-minute massage included.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Renaissance Koh Samui Resort & Spa",
    "offer_address": "208/1 Moo 4, T. Maret, Lamai Beach, Koh Samui, Amphoe Ko Samui, Chang Wat Surat Thani 84310, Thailand",
    "percentage_discount": 61.0,
    "min_duration": 7,
    "max_duration": 30,
    "price": 1532.0,
    "value": 3968.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HPm3AAG",
    "hero_image": "https://images.luxuryescapes.com/jd6dbyr5hl0dkcmyq2oh",
    "image_two": "https://images.luxuryescapes.com/8b29ruyto7t1pn2btl9",
    "image_three": "https://images.luxuryescapes.com/khjzuke22mwrp7trekm",
    "vendor_name": "Centara Reserve Samui",
    "title": "Grand Opening: Koh Samui Five-Star Beachfront Retreat with Daily Breakfast, Gourmet Dining & Complimentary Minibar",
    "description": "Make those tropical Thailand dreams come true with an escape to Centara Reserve Samui, a newly opened five-star property on the sparkling shores of Koh Samui. The first resort in Centara’s curated luxury collection of refined hotels, Centara Reserve Samui offers a discreet sanctuary home to five exquisite bars and restaurants, two sparkling resort pools and a spa offering tailored treatments using herbs from the organic garden.\n\nTake lazy strolls along Chaweng Beach, then soak up the tropical sunshine on a plush oceanfront lounger. Drinks can be ordered at the Pool Bar or The Terrace, where piazza-style seating invites you to take a break and enjoy a selection of cocktails and light bites. A pre-dinner tipple at The Gin Run bar leads into relaxed evenings dining on contemporary Thai favourites at Sa-Nga restaurant, fresh seafood at Salt Society or modern high-end cuisine at Act 5. This discerning Thai sanctuary is the break from the everyday you've been searching for.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Centara Reserve Samui",
    "offer_address": "38/2 Moo 3, Borpud, Chaweng Beach, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 1279.0,
    "value": 2712.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DisvAAC",
    "hero_image": "https://images.luxuryescapes.com/n8zz9nqb3ghtsfaqqkmo",
    "image_two": "https://images.luxuryescapes.com/yucmw0uvciodt3ds9fqi",
    "image_three": "https://images.luxuryescapes.com/n149hwowkkiy86w7jjdv",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Koh Samui Family-Friendly Beachfront Escape with All-Inclusive Dining, Daily Cocktails & Roundtrip Transfers",
    "description": "Nestled on the shining alabaster sands of Chaweng Noi Beach, The Sarann Koh Samui offers intimate oceanfront luxury just a stone's throw from the island's vibrant dining and nightlife. A true haven of relaxation, this boutique resort features just 49 beautifully appointed rooms and villas, a dazzling swimming pool framed by sweeping sea views and a breezy beachside restaurant and bar showcasing an eclectic mix of local and international culinary creations. When you're not sinking your toes into the resort's stretch of pristine sands or unwinding in the indulgent spa, venture north for a night on the town or take advantage of Koh Samui's enviable gulf location to sail across to Koh Phangan or Koh Tao on an island-hopping adventure.\n\nThe Sarann Koh Samui strikes the perfect balance between quiet and convenience, and the location is unmatched - the beautiful infinity pool rolls into sweeping ocean views, while the indulgent spa offers authentic treatments designed to stretch and soothe you into absolute bliss. Besides the flawless beaches, the island has a wealth of things to see and do, all within easy travelling distance - see the island's gleaming golden Big Buddha, visit the folkloric grandmother and grandfather rocks, swim through waterfalls and experience some of the best scuba diving in the world.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui, Suites and Villa",
    "offer_address": "95-96 Moo 3, Chaweng Noi Beach, Tambol Bophut, Koh Samui, Surat Thani, 84320, Thailand",
    "percentage_discount": 56.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 359.0,
    "value": 825.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DpVTVAA3",
    "hero_image": "https://images.luxuryescapes.com/fwdj7hgv8rhert3l87tq",
    "image_two": "https://images.luxuryescapes.com/uk950nacn8eyl3flbwaj",
    "image_three": "https://images.luxuryescapes.com/zpc27x304hcwy9lb195",
    "vendor_name": "Beyond Samui",
    "title": "Grand Re-Opening: Coastal Koh Samui Paradise with Daily Dining, Beach Massages & Cocktails",
    "description": "Watch tumbling waves crash on the shore as you dream the day away at Koh Samui’s recently refurbished and refreshed coastal gem: Beyond Kanda Buuri. Set by a sparkling stretch of Chaweng Beach and offering panoramic oceanic vistas from many of the impeccably appointed rooms and suites, this vibrant resort is the perfect home away from home for those who enjoy beachside tranquillity and rich culture amid picturesque tropical surrounds.\n\nAfter sun-soaked days spent exploring the natural environment and exciting shopping and cultural precincts, treat yourself to a peaceful beachfront massage and let experienced hands knead your stress away. Find inner serenity under the waving palm trees as you splash around in the shimmering resort pool or as you laze poolside on a comfortable sun lounger with fresh coconut juice and seasonal fruits at your side. Take your tastebuds on a tropical journey at @Beach Restaurant & Bar, where local recipes and international favourites showcase the island’s fresh ingredients.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Beyond Samui",
    "offer_address": "20 Moo 2, Chaweng-Choengmon Road, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 707.0,
    "value": 1875.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcZYXAA3",
    "hero_image": "https://images.luxuryescapes.com/55hez6pj9uyp0b6tupu",
    "image_two": "https://images.luxuryescapes.com/u28cxy182hin9anjys9fk",
    "image_three": "https://images.luxuryescapes.com/u9c96zpjtswo32ybmgq",
    "vendor_name": "KC Beach Club and Pool Villas",
    "title": "Koh Samui Beachfront Paradise with Daily Breakfast, Massages & Two Swimming Pools",
    "description": "Embrace good times on the sun-kissed sands of Chaweng Beach with a dreamy escape to the island paradise of Koh Samui. Perfectly positioned by glistening turquoise waters, the resort boasts spectacular surrounds and no shortage of party atmosphere. It’s an ideal base for those looking to maximise their Thailand fun - settle into a private beach cabana, enjoy all-day music by the pool, feast on international favourites at KC Beach Restaurant or sip your way through the extensive cocktail menu. After a night out exploring the best of Chewang, refresh and revitalise in the morning by catching one of the island’s famed sunrises - the sight from the beach will take your breath away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "KC Beach Club & Pool Villas",
    "offer_address": "11/9 Moo 2, Bo Phut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 377.0,
    "value": 1380.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HUXhIAO",
    "hero_image": "https://images.luxuryescapes.com/3cs2ifb2ffhp9elbrv",
    "image_two": "https://images.luxuryescapes.com/r7u8bhkj5o3ygg1izqe",
    "image_three": "https://images.luxuryescapes.com/a69k4nwrz1n77bre0ox",
    "vendor_name": "Cape Fahn Hotel",
    "title": "Award-Winning Koh Samui Private Island Pool Villas with Daily Breakfast, Nightly Dinner & Massages",
    "description": "A tranquil treasure dropped in the ocean just off Choeng Mon Beach, Koh Samui is a secluded island exuding white sands, unparalleled sunsets and crystal waters. Each pool villa is only moments from the shores, yet millions of miles from everyday life.\n\nAwarded Tripadvisor’s Best of the Best 2024 for a reason, the five-star Cape Fahn Hotel boasts an in-house spa surrounded by greenery, a main pool spacious enough for exercise and a fine dining restaurant by world-renowned Australian chef David Thompson. Lose track of time playing games under the pavilion while sipping a complimentary nightly cocktail, or see the island from a different perspective by booking in a luxury yacht charter.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Cape Fahn Hotel",
    "offer_address": "24/269, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1799.0,
    "value": 3772.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqAITAA3",
    "hero_image": "https://images.luxuryescapes.com/caq4xrxi6tqa1h666dif",
    "image_two": "https://images.luxuryescapes.com/5xilzwlq6atcygik22w",
    "image_three": "https://images.luxuryescapes.com/26uib0gu5kstq9indoi",
    "vendor_name": "U Samui",
    "title": "Koh Samui Boutique Retreat with Daily Breakfast, Seaview Room Upgrade & One-Way Airport Transfer",
    "description": "Life back home fades into a distant memory when you lounge under a crimson sunset at U Samui - a picturesque boutique hideaway with private access to the serene Bangkok Beach. Find reprieve in the quiet waters lapping against the shore, feel the soft sand under your toes while sipping tipples or cool-off in the palm-lined pool, accompanied by afternoon refreshments from Ur Beach Bar. When the day draws to a close, HIWA KAI KITCHEN & BAR offers flavourful dishes inspired by the Hawaiian Islands, treating your tastebuds to a medley of vibrant dishes.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "U Samui",
    "offer_address": "86 moo 4, Tambon Bophut, Koh Samui, Suratthani, 84320 Thailand",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 454.0,
    "value": 1089.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjhYAAS",
    "hero_image": "https://images.luxuryescapes.com/ve2d4iwjn409vj9wg5ig",
    "image_two": "https://images.luxuryescapes.com/p8mdsvb2vuyxegor6tc7",
    "image_three": "https://images.luxuryescapes.com/nbd0w8pqek623cjuoypv",
    "vendor_name": "ShaSa Resort and Residences Koh Samui",
    "title": "Beachfront Koh Samui Group Stay with Daily Cocktails",
    "description": "If your idea of paradise is relaxing on golden sands, swimming in turquoise waters and exploring a fascinating coral reef just 100m off the beachfront at low tide, then look no further than the beautifully secluded ShaSa Resort & Residences Koh Samui. Hidden in one of the more undiscovered parts of Koh Samui, this beachfront property offers incredible jaw-dropping sea views over the Gulf of Thailand and five-star seclusion for up to four guests. Your stay includes daily buffet breakfast, two three-course set menu lunches or dinners for four, one 30-minute massage per adult, one daily cocktail per adult and private return airport transfers.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "ShaSa Resort & Residences Koh Samui - 2020",
    "offer_address": "116/1 Moo 2, Tambon Mared,, Laem Set, Koh Samui, Surat Thani 84310, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 933.0,
    "value": 2828.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LeSYAA0",
    "hero_image": "https://images.luxuryescapes.com/cwaicd3tj7o2fmho7f",
    "image_two": "https://images.luxuryescapes.com/9ontp0juagg7dd2q8sx",
    "image_three": "https://images.luxuryescapes.com/2v8mnbwmt7jdnqza5pp",
    "vendor_name": "Conrad Koh Samui",
    "title": "Luxe Pool Villa Retreat with Daily Breakfast, Choice of Lunch or Dinner and Cocktails",
    "description": "On the southern tip of Koh Samui, clinging to a palm-studded headland with stunning Gulf of Thailand vistas, the Conrad Koh Samui feels like a world of its own. Incredibly spacious and luxurious villas - all with infinity pools and sun terraces - stretch across the hillside, offering breathtaking sea views and incredible seclusion just 45 minutes from the airport. Be swept away with daily international buffet breakfast, daily multi-course lunches or dinners, one daily cocktail per adult, one 60-minute spa treatment each and return airport transfers.\n\nPlus, one child (aged 11 years and under) stays free with daily breakfast and your choice of daily lunch or dinner.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Conrad Koh Samui",
    "offer_address": "49/8 Hillcrest Road Tambon Taling Ngam, Koh Samui Surat Thani 84140, Thailand",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 1859.0,
    "value": 6361.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eMSkuQAG",
    "hero_image": "https://images.luxuryescapes.com/lxnwsoph8l4os63kg9p",
    "image_two": "https://images.luxuryescapes.com/p9vdhywvz4ggpbh36h9u",
    "image_three": "https://images.luxuryescapes.com/0rrl7ztoc3tr5vetlm6c",
    "vendor_name": "Mai Samui Beach Resort & Spa",
    "title": "Beachfront Island Escape with Daily Cocktails",
    "description": "Set on the immaculate beachfront overlooking the clear blue waters of Laem Yai Beach, in a tranquil corner of Koh Samui, Mai Samui Beach Resort & Spa's breathtaking location will instantly make you forget the outside world. Offering laid back and tropical island ambience with a distinctly Thai touch, this Koh Samui hideaway ⁠- perfect for a couples' escape or family retreat ⁠- invites you to indulge with daily breakfast, a one-way pick-up from Koh Samui Airport, a daily 30-minute massage per room, a Thai set-menu dinner or cooking class, a daily cocktail each, a set-menu BBQ beach dinner and more.\n\nPlus, two kids (aged 11 years and under) stay free in the Deluxe Room with daily breakfast and one-way transfer included.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Mai Samui Beach Resort & Spa Mar 20",
    "offer_address": "2/6 Moo 5 Angthong, Suratthani 84140 Koh Samui Thailand",
    "percentage_discount": 66.0,
    "min_duration": 4,
    "max_duration": 10,
    "price": 380.0,
    "value": 1113.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GSjkAYAT",
    "hero_image": "https://images.luxuryescapes.com/1wy1e3lmkqkllny0rb78",
    "image_two": "https://images.luxuryescapes.com/z0x78mzgvfu4ylzt4s",
    "image_three": "https://images.luxuryescapes.com/pwvd2o71y6a3aomamoy8",
    "vendor_name": "Silavadee Pool Spa Resort",
    "title": "Koh Samui Cliffside Pool Villa Luxury with Massages, Daily Breakfast, Dinner & Free-Flow Cocktail Hour",
    "description": "Paradise awaits at this secluded five-star luxury oasis built high up on the coastal cliffs overlooking Laem Nan Beach on Koh Samui. Spend balmy days sipping cocktails by the pool while looking out onto jaw-dropping panoramas or venture to Silavadee Spa, where a slew of rejuvenating treatments await.\n\nThen, head to the private beach, available exclusively for resort use, and experience some of the island’s best snorkelling away from the crowds. To round out your day, head to the two onsite restaurants serving up exquisite meals showcasing the flavours of the region, or sip on an expertly shaken cocktail at Star Rooftop Bar at sunset for an unforgettable night.\n\nWhen you're ready to explore, the must-visit spots are within easy reach, including Lamai City Centre, Hin-Ta and Hin-Yai Rocks and lively beach clubs, plus plenty of family-friendly restaurants and attractions.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Silavadee Pool Spa Resort",
    "offer_address": "208/66 Moo 4, Maret, Ko Samui, Surat Thani 84310, Thailand",
    "percentage_discount": 66.0,
    "min_duration": 5,
    "max_duration": 25,
    "price": 1649.0,
    "value": 4921.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aiPFOQA2",
    "hero_image": "https://images.luxuryescapes.com/c6h0bqucyojat73ycp0i",
    "image_two": "https://images.luxuryescapes.com/uumeyu0d8omi9k9hzeeu",
    "image_three": "https://images.luxuryescapes.com/dony5gahkkpsz155urak",
    "vendor_name": "Kanda Pool Villas Koh Samui",
    "title": "Cliffside Private Pool Villa Stay",
    "description": "Escape to Thailand’s paradise island of Koh Samui, where palm-fringed beaches meet tropical rainforest. Discover your own private haven staying in a pool villa at Kanda Pool Villas Koh Samui, which comes complete with an exotic outdoor shower and fully-equipped gourmet SMEG kitchen. Your package includes daily breakfast, a 60-minute massage each, an in-villa tapas dining experience at lunch or dinner, a daily cocktail each, return airport transfers and a bottle of sparkling to share.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Kanda Pool Villas Koh Samui",
    "offer_address": "80/32 Moo 5, Bophut, Ko Samui District, 84320, Thailand",
    "percentage_discount": 74.0,
    "min_duration": 5,
    "max_duration": 8,
    "price": 882.0,
    "value": 3438.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biqFNQAY",
    "hero_image": "https://images.luxuryescapes.com/4t7v0w8b7ir38syh6yd",
    "image_two": "https://images.luxuryescapes.com/lwtlzk78klxuowsokkbl",
    "image_three": "https://images.luxuryescapes.com/em8um6j6q6a4bkidt4wi",
    "vendor_name": "Paradise Beach Resort Samui",
    "title": "Relaxing Beachfront Retreat with Fabulous Dining Experiences",
    "description": "Dreaming of a tropical getaway? Escape to the stunning beaches and laidback lifestyle of Koh Samui with a stay at Paradise Beach Resort. Boasting a beachfront location on the peaceful Maenam Beach, you will enjoy easy access to the island’s vibrant shopping and nightlife while still being far away from the hustle and bustle. Relax and unwind with delicious dining experiences, daily buffet breakfast and daily cocktails.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Paradise Beach Resort Samui",
    "offer_address": "18/8 Maenam Beach Koh Samui, Surat Thani, 84330 Thailand",
    "percentage_discount": 74.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 443.0,
    "value": 1714.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R7WY5QAN",
    "hero_image": "https://images.luxuryescapes.com/py48zcvdqen2ducx3mor",
    "image_two": "https://images.luxuryescapes.com/rxi90ohjdcao37mu5s0q",
    "image_three": "https://images.luxuryescapes.com/d29pdey15fbptrxgr8aa",
    "vendor_name": "Amari Koh Samui",
    "title": "Beachfront Koh Samui Escape",
    "description": "Experience the relaxed island vibes of Thailand’s famous Koh Samui with an eight-night holiday at Amari Koh Samui. Includes return airport transfers, daily buffet breakfasts, two exotic dining experiences, daily cocktails, massages, an afternoon tea and more.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Amari Koh Samui - 2018",
    "offer_address": "14/3, Chaweng Beach Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 893.0,
    "value": 2410.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BdSuNAAV",
    "hero_image": "https://images.luxuryescapes.com/rrn34rdaf23ryfo49mcr",
    "image_two": "https://images.luxuryescapes.com/irnsl75kpgkau6x412wc",
    "image_three": "https://images.luxuryescapes.com/g7aclc6c6af1b8tbpcm",
    "vendor_name": "KC Beach Club and Pool Villas",
    "title": "Newly Renovated Koh Samui Beach Club Escape with All-Inclusive Dining, Daily Drinks & Guaranteed Sea Views",
    "description": "Embrace good times on the sun-kissed sweeping sands of Chaweng Beach with an escape to the all-inclusive, super-cool KC Beach Club & Pool Villas, perfectly located on the island paradise of Koh Samui. Directly positioned on the beachfront’s shimmering turquoise waters and newly refurbished and reimagined, the resort boasts two spectacular pools and no shortage of party spirit. It’s the perfect base for families and couples looking to maximise their Thailand fun - sprawl in comfort in a private beach cabana, put your hands up in the air to the beats of the resident DJ, feast on Italian and international favourites at Neo Restaurant or sip your way through the resort’s extensive cocktail menu at the Beach or Lobby Bars.\n\nWithin an easy stroll of Chaweng’s vibrant shopping, entertainment and nightlife scene, and only a 10-minute drive from Samui Airport, KC Beach Club & Pool Villas’ convenience is unmatched. Curry is king in Koh Samui, and you’ll be perfectly placed to taste your way through the island’s countless excellent restaurants and bars. After a night on the sands, refresh and revitalise in the morning by catching one of the island’s famed sunrises - the sight from Chaweng Beach will take your breath away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "KC Beach Club & Pool Villas",
    "offer_address": "11/9 Moo 2, Bo Phut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 434.0,
    "value": 1094.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DO3YpAAL",
    "hero_image": "https://images.luxuryescapes.com/tqzwcke22q2g7capzra",
    "image_two": "https://images.luxuryescapes.com/sf9spwenij8zzgtlrs62",
    "image_three": "https://images.luxuryescapes.com/4zr6ns6414ibzf9bllg",
    "vendor_name": "Rocky's Boutique Resort",
    "title": "Koh Samui Beachfront Bliss with Daily Dining & Cocktails",
    "description": "Tucked away in a hidden cove on Lamai Beach, the second largest beach in Koh Samui, Rocky’s Boutique Resort is a secluded paradise, perfect for romance or a calming family escape. Surrounded by lush forests, picturesque waterfalls and coconut trees, this tropical resort features two gorgeous swimming pools overlooking the ocean and the garden, an award-winning restaurant serving classical French cuisine and a garden bistro perfect for your morning cup of coffee.\n\nIf you’re keen for a taste of Thailand’s renowned beach nightlife outside the idyllic resort, Lamai Beach’s dazzling lights and popular bars are merely minutes away via the resort's shuttle. Check out Chaweng Beach’s attractive array of local restaurants and bars, along with colourful shops and vibrant street markets. Take this golden opportunity to practise your diving and snorkelling skills on the surrounding three beaches, al lof which offer clear waters, magnificent coral reefs and beautiful tropical marine life.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Rocky's Boutique Resort",
    "offer_address": "438/1 Moo 1, T. Maret, Amphur Koh Samui, Suratthani 84310, Thailand",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 929.0,
    "value": 1591.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000G5bdeYAB",
    "hero_image": "https://images.luxuryescapes.com/h8dneie2s3d959dsk2vjt",
    "image_two": "https://images.luxuryescapes.com/ldhnmbcymp320y6g9zew",
    "image_three": "https://images.luxuryescapes.com/owfeon0yabrwdvvpxzf",
    "vendor_name": "Pavilion Samui Villas & Resort",
    "title": "Beachfront Koh Samui Suites & Villas with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktail Hour",
    "description": "Wake up to the sound of waves and step onto the soft sands of Lamai Beach at this five-star sanctuary, nestled on tropical Koh Samui. Pavilion Samui Villas & Resort is designed for indulgence, with Thai-inspired villas and suites, each featuring a private pool or jacuzzi - your own secluded retreat just moments from the ocean.\n\nSpend your days unwinding in the privacy of your exclusive space, indulging in a rejuvenating spa treatment, or savouring fresh Thai flavours at the beachfront restaurant. When adventure calls, explore Lamai’s vibrant night market, marvel at the Hin Ta and Hin Yai rock formations, or dive into the island’s crystal-clear waters.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Pavilion Samui Villas & Resort",
    "offer_address": "124/24 Moo 3, Lamai, Samui, Surathani 84310, Thailand",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 889.0,
    "value": 1874.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IblG3AAJ",
    "hero_image": "https://images.luxuryescapes.com/p3jfvd0nenxq7p9gslt9",
    "image_two": "https://images.luxuryescapes.com/xczaz4hplucro40ghw16",
    "image_three": "https://images.luxuryescapes.com/og848rhhgekpfeercjc",
    "vendor_name": "Saii Koh Samui",
    "title": "Five-Star All-Villa Escape on Koh Samui Beachfront with Daily Breakfast, Choice of Lunch or Dinner & Nightly Free-Flow Cocktails",
    "description": "Step into paradise at this picturesque Koh Samui retreat, set on the pearly sands of Hanuman Bay. Here, the relaxed seclusion of island life awaits. Spend balmy days lounging by the private pool of your spacious villa, an oasis surrounded by lush tropical surrounds.\n\nWake whenever you please and enjoy slow mornings, with breakfast at the Mediterranean-inspired Miss Olive Oyl. Then, soak up the sun at one of three sparkling pools, swimming up to the Pool Bar for a refreshing cocktail with a backdrop of ocean views. If you prefer a day of activity, venture out to see Hanuman Bay's diverse marine life, with kayaks and snorkelling equipment at the ready.\n\nKoh Samui's rich heritage is easily explored, with numerous temples such as the Big Buddha at arm's reach. Wander the vibrant Fisherman's Village for a dose of local culture before retreating to your sanctuary as they day winds down for a moonlit dip.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "SAii Koh Samui Choengmon",
    "offer_address": "63/182 Moo 5, Bophut Koh Samui, Suratthani 84320, Thailand",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 799.0,
    "value": 1647.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Jpc9yYAB",
    "hero_image": "https://images.luxuryescapes.com/lawd8y28b0kupk4pott",
    "image_two": "https://images.luxuryescapes.com/7p043z4nvqiupfl8w6",
    "image_three": "https://images.luxuryescapes.com/neujofgnva66dzs29b39",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Koh Samui Beachfront Getaway with All-Inclusive Dining, Nightly Cocktails & Massages",
    "description": "Nestled on the golden sands of Chaweng Noi Beach, The Sarann Koh Samui, Suites and Villa offers an intimate oceanfront escape just a stone's throw from Koh Samui's vibrant dining and nightlife. A true haven of relaxation, this tranquil resort features an expansive swimming pool framed by sweeping sea views and a breezy beachside restaurant and bar serving up a mix of local and international dishes.\n\nWhen you're not wandering along the resort's pristine stretch of beach or unwinding at the relaxing Sarann Spa, venture north for a night on the town or take advantage of Koh Samui's enviable gulf location to island-hop across to Koh Phangan or Koh Tao.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui, Suites and Villa",
    "offer_address": "95-96 Moo 3, Chaweng Noi Beach, Tambol Bophut, Koh Samui, Surat Thani, 84320, Thailand",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 335.0,
    "value": 838.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Fo2cHYAR",
    "hero_image": "https://images.luxuryescapes.com/vinynqjdhfg4dbaqn2",
    "image_two": "https://images.luxuryescapes.com/xe03g78klibeljhss3b1",
    "image_three": "https://images.luxuryescapes.com/hgwm9l0n8gkufdwnxv1i",
    "vendor_name": "Tui Blue, The Passage Samui",
    "title": "Koh Samui All-Inclusive Beachfront Paradise with Massages & Unlimited Free-Flow Drinks",
    "description": "Step into tropical bliss at this laidback oasis on the north shores of Koh Samui, surrounded by towering palm trees, vibrant marine life and sandy beaches that stretch for miles. Feel born again at BLUE Spa with a curated selection of Thai healing massages and aroma oil treatments, before sipping on a refreshing Mojito as you take in a breathtaking Thai sunset.\n\nIndulge your senses at The Restaurant with zesty Thai dishes from meat to local seafood, topped off with views unfolding across Laem Yai Beach and the Angthong Islands. Outside the resort, you're just a hop, skip and jump away from Koh Samui's jungle terrain, white sand beaches and picture-perfect islands.\n\nWhether you're sipping on your favourite cocktail by the pool, checking out the lively Fisherman's Village night market, or immersing yourself in the local culture at the gilded Big Buddha Temple, TUI BLUE The Passage Samui is all about finding inner bliss. Soak in the peace and tranquillity, feel worlds away and let island life work its magic.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "TUI BLUE The Passage Samui",
    "offer_address": "57/6-7, Ko Samui District, Surat Thani 84140, Thailand",
    "percentage_discount": 69.0,
    "min_duration": 3,
    "max_duration": 26,
    "price": 859.0,
    "value": 2755.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oeBdAAI",
    "hero_image": "https://images.luxuryescapes.com/8iht3qrzuqbacvn1sjtu",
    "image_two": "https://images.luxuryescapes.com/821xwar4elnja0znc87k",
    "image_three": "https://images.luxuryescapes.com/t9ti3jnxmou1wswlnxys",
    "vendor_name": "Mercure Samui Chaweng Beach Tana",
    "title": "Grand Opening: Mercure Koh Samui Beachfront Escape with Daily Breakfast, Roundtrip Transfers & Travel Until 2024",
    "description": "Be one of the first to experience to tropical bliss from Mercure Samui Chaweng Beach Tana, a brand-new boutique hideaway ensconced in tropical gardens on the tranquil island of Koh Samui.\n\nLocated just moments from the golden shores of Chaweng Beach, this lovely oasis invites you to make yourself at home in one of the stylish Thai-inspired rooms then head out to the resort's relaxing pool for a sun-kissed swim or cocktail at the pool bar. When it's time to explore, take a stroll along Chaweng's vibrant streets lined with bars, restaurants and shops, take a dip in the impossibly blue ocean or swing into your escape at the golf course, located just a 20-minute drive away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Mercure Samui Chaweng Beach Tana",
    "offer_address": "17/135 Moo 3 Bo Put, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 66.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 409.0,
    "value": 1186.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Uxw6LQAR",
    "hero_image": "https://images.luxuryescapes.com/upkgaiaorrhh5dgprdvs",
    "image_two": "https://images.luxuryescapes.com/jl5sgmdugzegfhmm32fy",
    "image_three": "https://images.luxuryescapes.com/sokmxhqppf7oyxjjkruq",
    "vendor_name": "Novotel Samui Resort Chaweng Beach",
    "title": "Family-Friendly Escape With Direct Beach Access",
    "description": "Whisk the whole family away on a Thailand break at the iconic Novotel Koh Samui. Make the most of the resort’s direct access to Chaweng Beach, where you can soak up the sun as you walk the peaceful shallow waters of the bay or explore some of the nearby local attractions, including the Big Buddha Temple and Fisherman’s Village. Your indulgent beachside escape includes daily buffet breakfasts, two themed buffet dinners, daily cocktails and four 30-minute massages to share between two. One child aged 11 and under stays free with breakfast or select the family upgrade, allowing two children up to the age of 16 to stay free with breakfast and two dinners.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Novotel Samui Resort Chaweng Beach Kandaburi",
    "offer_address": "20 Moo2 Cheongmon Road Bophut, Chaweng Walk St, Bo Put, KOH Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 67.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 637.0,
    "value": 1914.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EeKW4AAN",
    "hero_image": "https://images.luxuryescapes.com/bqb17u2yotmemijkux",
    "image_two": "https://images.luxuryescapes.com/akd5yriyzueosg741ixtl",
    "image_three": "https://images.luxuryescapes.com/bcga7q7dercbur0u1k8h",
    "vendor_name": "Nikki Beach Resort & Spa Koh Samui",
    "title": "Boutique Koh Samui Beachfront Luxury with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Fusing together traditional Thai elements and modern luxury, the opulent Nikki Beach Resort & Spa Koh Samui showcases the internationally recognised beauty of Koh Samui's pristine west coast. Gaze upon breathtaking sunsets in your suite with a private sun-kissed terrace, thoughtfully designed with intimacy in mind. Wander around the soft white sands of the nearby Lipa Noi Beach and pamper yourself with indulgent treatments at the serene spa. Wake up with a delicious breakfast, take your pick of a decadent lunch at Beach Club or dinner at ESCAPE by Nikki Beach, and watch the sunset with a nightly cocktail, all included in your package so you can make the most of your beachfront escape.\n\nTake in verdant jungles, spotless beaches fringed with palm trees and a dose of sunshine all year round in this tranquil tropical paradise. The luscious island is adjacent to more than 60 other picturesque islands, notably the rugged Koh Phangan island known for its notoriously grand Full Moon parties, and Ang Thong National Marine Park, a haven for exotic wildlife and sea creatures with plenty of unique diving and snorkelling opportunities.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Nikki Beach Resort & Spa Koh Samui",
    "offer_address": "96/3 Moo 2, Tambon Lipa Noi, Amphoe Koh Samui, Chang Wat Surat Thani 84140, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 19,
    "price": 769.0,
    "value": 2391.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cq2eNQAQ",
    "hero_image": "https://images.luxuryescapes.com/bf3j6l0remj12yas4eo5",
    "image_two": "https://images.luxuryescapes.com/f5jvevloj9hd4o5ok2",
    "image_three": "https://images.luxuryescapes.com/00t52vhorlclfp97b92",
    "vendor_name": "Sheraton Samui Resort",
    "title": "Beachfront Sheraton Luxury in Koh Samui",
    "description": "Pure beachfront bliss awaits at the glamorous Sheraton Samui, a tropical oasis spectacularly located on Chaweng Noi Beach, one of Thailand’s best natural swimming beaches. Embrace the laid-back vibes of Koh Samui island and unwind in signature Sheraton luxury as you enjoy daily buffet breakfast, a multi-course dinner, daily cocktails, a relaxing 60-minute Thai massage per person and return airport transfers from Koh Samui International Airport.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Sheraton Samui Resort",
    "offer_address": "86 Moo 3 Chaweng Noi Beach, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 75.0,
    "min_duration": 7,
    "max_duration": 9,
    "price": 614.0,
    "value": 2500.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gv5oQAAR",
    "hero_image": "https://images.luxuryescapes.com/nxv3c62uua4w5sh72zxf",
    "image_two": "https://images.luxuryescapes.com/feeyz28egzylu2fhzjp",
    "image_three": "https://images.luxuryescapes.com/okd5qgmit8i13j3u0mjm",
    "vendor_name": "OUTRIGGER Koh Samui Beach Resort",
    "title": "OUTRIGGER Koh Samui Beachfront Paradise with Daily Breakfast, Nightly Dinner & Two Hours of Nightly Free-Flow Drinks",
    "description": "Discover ultra-stylish coastal tranquility at this beachfront OUTRIGGER destination, ideally positioned on Lamai Beach’s soft sands. Perfect for couples seeking a romantic sojourn and families looking for fun in the sun, this modern resort brings OUTRIGGER's iconic reputation for top-notch hospitality to soulful Koh Samui. Savour days spent lazing by glistening lagoon pools, sipping cold cocktails on warm sands at the Edgewater Beach Club or wandering the resort’s flawless gardens.\n\nWhen you’re ready to explore, Koh Samui’s abundance of world-class restaurants, vibrant markets and abundant beaches await. Go north to experience Chaweng’s dazzling collection of beach bars and the raucous Green Mango nightlife strip, experience the natural splendour of the mighty Na Muang Waterfall cascades, or head to the resort’s laidback massage sala for beachfront treatments with views of the Gulf of Thailand.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "OUTRIGGER Koh Samui Beach Resort",
    "offer_address": "173/41 Moo 4, Rob Koh Road, Maret, Koh Samui, Suratthani, Thailand 84310",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 949.0,
    "value": 1912.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CVASAA4",
    "hero_image": "https://images.luxuryescapes.com/bi9vjv1enaekbgm5pnc",
    "image_two": "https://images.luxuryescapes.com/t68u2h9syvyl5phgi4",
    "image_three": "https://images.luxuryescapes.com/e7ikgt64or26bme9lgwl",
    "vendor_name": "Cape Fahn Hotel",
    "title": "Multi-Award-Winning Koh Samui Private Island Pool Villas with Daily Dining, Michelin-Starred Dinner & Nightly Cocktails",
    "description": "Check in to the five-star Cape Fahn Hotel - an intimate private island pool villa haven only moments from the shores of Koh Samui, yet a million miles from everyday life. A tranquil gem dropped in the ocean just off Choeng Mon Beach, this secluded retreat is a member of the prestigious Small Luxury Hotels of the World collection, rated among the top 1% of properties worldwide on Tripadvisor and ranked among Travel + Leisure World's Best Awards 2021: Top 10 Resorts in Southeast Asia. Stroll beneath palm-cloaked cliffs along white sand, savour an invigorating treatment at the hotel spa, or treat your tastebuds at Michelin-starred chef David Thompson's Long Dtai restaurant. Experience a level of paradise you never knew existed on this breathtaking escape.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Cape Fahn Hotel",
    "offer_address": "24/269, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 46.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 2049.0,
    "value": 3816.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000JJFA4AAP",
    "hero_image": "https://images.luxuryescapes.com/zfqffr12pnixm8kmhkc9",
    "image_two": "https://images.luxuryescapes.com/xeje4tsuxn4ebjp9good",
    "image_three": "https://images.luxuryescapes.com/gsi0izyyb1wsq6oxzeoi",
    "vendor_name": "Kanda Pool Villas Koh Samui",
    "title": "Private Pool Villa Luxury in Koh Samui, Thailand",
    "description": "Fall in love with island life with five nights of private pool villa luxury on the Thai island of Koh Samui - just a one hour flight from Bangkok - staying at Kanda Residences. Includes return airport transfers, a bottle of bubbly on arrival, daily breakfasts, massages, a cooking class, a tapas lunch or dinner, a daily cocktail each, complimentary shuttle service to Chaweng Beach and complimentary Wi-Fi.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Kanda Residences - February 2018*",
    "offer_address": "80/32 Moo 5, Bophut, Ko Samui District, 84320, Thailand",
    "percentage_discount": 56.0,
    "min_duration": 5,
    "max_duration": 8,
    "price": 899.0,
    "value": 2028.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006RNfCAAW",
    "hero_image": "https://images.luxuryescapes.com/deunzd6m5arc9c6g04qf",
    "image_two": "https://images.luxuryescapes.com/lncu09joxrvx0n8ae4a",
    "image_three": "https://images.luxuryescapes.com/jlsdm2a7rvrialq83v1q",
    "vendor_name": "Amari Koh Samui",
    "title": "Koh Samui Five-Star Beachfront Retreat with Dinners, Daily Breakfast, Daily Massages & Nightly Cocktails",
    "description": "Blessed with deep aquamarine waters and sugar-white sandy stretches, lush jungle terrain and bustling villages teeming with endless things to see and do, Koh Samui is the laidback paradise you’ve been dreaming of - and there’s no better place to immerse yourself in the island’s wonders than Amari Koh Samui.\n\nDesirably located on a secluded stretch of Chaweng Beach, with stunning views over the Gulf of Thailand, this idyllic haven places you exactly where you want to be. It's a chilled-out beachfront location, perfect for families and couples who want to soak up the serenity, but with plenty to do. Choose to explore far and wide, with the island’s location the perfect launchpad to the pristine archipelago of Ang Thong National Marine Park, where towering limestone mountains, thick jungle and hidden waterfalls beckon. Although, you could be forgiven for never wanting to leave this stunning resort thanks to its exceptional facilities. Feel immediately refreshed as you plunge into not one, but two gleaming pools, luxuriate at the heavenly onsite spa, watch the sun drop below the horizon as you sip an expertly shaken cocktail at the bar overlooking the ocean, savour delicious fare at the stylish restaurant and rest easy knowing little ones are taken care of with hours of entertainment at the Kids' Club. At the end of the day, retreat to your thoughtfully designed room to rest, recharge and repeat all over again.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Amari Koh Samui",
    "offer_address": "14/3, Chaweng Beach Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 749.0,
    "value": 1633.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DO4ZCAA1",
    "hero_image": "https://images.luxuryescapes.com/mweckp59wphla2plxfam",
    "image_two": "https://images.luxuryescapes.com/12s8jkht7hhkcnntdwkp",
    "image_three": "https://images.luxuryescapes.com/mfpkezxf8fechhveid6f",
    "vendor_name": "Centara Reserve Samui",
    "title": "Centara Koh Samui Five-Star Beachfront Paradise with Daily Breakfast, Signature Set-Menu Dinner Experience & Nightly Cocktails",
    "description": "Make those tropical Thailand dreams come true with an escape to the five-star Centara Reserve Samui, a beachfront retreat centred around you. As the inaugural property in Centara’s carefully curated luxury collection, Centara Reserve Samui is positioned to emerge as one of the most coveted destinations on the island, home to six exquisite bars and restaurants, two dazzling resort pools (including an adults-only reprieve) and a spa offering tailored treatments using herbs from the organic garden.\n\nTake lazy strolls along Chaweng Beach, then soak up the tropical sunshine on a plush oceanfront lounger. Drinks can be ordered at the Pool Bar or The Terrace, where piazza-style seating invites you to take a break and enjoy a selection of cocktails and light bites. A pre-dinner tipple at The Gin Run bar leads into relaxed evenings dining on contemporary Thai favourites at Sa-Nga restaurant, fresh seafood at Salt Society Beach Bar & Kitchen or modern high-end cuisine at Spanish Grill at Act 5. This discerning Thai sanctuary is the break from the every day you've been searching for.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Centara Reserve Samui",
    "offer_address": "38/2 Moo 3, Borpud, Chaweng Beach, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 7,
    "max_duration": 20,
    "price": 1549.0,
    "value": 4160.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R8mzNQAR",
    "hero_image": "https://images.luxuryescapes.com/smablzakfet7v6xejzps",
    "image_two": "https://images.luxuryescapes.com/c2g0uuadst9mjvnr50qq",
    "image_three": "https://images.luxuryescapes.com/xbptvrrfrousirl9yse3",
    "vendor_name": "Mantra Samui Resort",
    "title": "Mantra Samui: Boutique Oceanview Hideaway",
    "description": "Panoramic ocean views and friendly Thai service awaits at the recently reopened Mantra Samui. Wake up to sprawling ocean views from your private balcony, begin each day with complimentary daily buffet breakfasts, unwind by the pool with a daily cocktail each, sample Thai food with two dining experiences, relax with two 45-minute massages each and enjoy convenient return airport transfers for two.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Mantra Samui",
    "offer_address": "9/124 Moo1, Mae Nam, Koh Samui, 84330, Thailand",
    "percentage_discount": 74.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 649.0,
    "value": 2466.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Id0rUAAR",
    "hero_image": "https://images.luxuryescapes.com/vd1n0noo4sn37rihsklc",
    "image_two": "https://images.luxuryescapes.com/e3gpkxfxgpre4rp45ai",
    "image_three": "https://images.luxuryescapes.com/iuism4nu6g0t2ycnysg",
    "vendor_name": "Nora Beach Resort & Spa",
    "title": "Koh Samui Beachfront Paradise with Daily Breakfast, Nightly Dinner, Nightly Cocktails & Massages",
    "description": "Drift off to one of Thailand's most dreamy islands at this oceanfront oasis, set on a private beach in vibrant Chaweng. Reset among lush tropical gardens, steps from the glimmering beachfront and moments away from the centre of Koh Samui's most beloved beach town, easily reached via your resort's complimentary shuttle.\n\nSpend relaxed hours lounging by the oceanfront pool or immersed in it by the Pool Bar, sipping refreshing cocktails. After sun-kissed days, unwind with a blissful treatment or sauna session at The Anodas Spa before heading to beachside Prasuthon Restaurant for perfectly grilled seafood.\n\nWhen you're ready for activity, Koh Samui’s ancient temples and majestic waterfalls are at your fingertips. Whether you choose to explore a nearby night market, savour Thailand's culinary delights at local restaurants or stay at the resort and kayak or paddleboard through the Gulf of Thailand's crystal waters, this escape is yours to shape.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Nora Beach Resort & Spa",
    "offer_address": "222 Moo 2, Chaweng Beach, Bophut, Koh Samui, Suratthani 84320, Thailand",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 689.0,
    "value": 2584.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2ldSQAR",
    "hero_image": "https://images.luxuryescapes.com/hwttcprsxrkf1gfraznw",
    "image_two": "https://images.luxuryescapes.com/chdbsvhqjooaayqckbdo",
    "image_three": "https://images.luxuryescapes.com/yafsafcmyhjvwquilbjs",
    "vendor_name": "The Passage Samui Resort",
    "title": "Escape to a Thai Island Oasis with Massages, Cocktails & More",
    "description": "Soak up the palm-fringed beauty of one of Thailand’s most sought-after island destinations, Koh Samui, staying in a prime beachfront location at The Passage Samui Villas & Resort - a resort that truly has it all with three swimming pools and one of the island’s most impressive oceanfront restaurants. Your escape includes daily buffet breakfast, two three-course Thai dinners, one nightly cocktail each, a daily 30-minute massage and convenient return airport transfers.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Passage Samui Villas & Resort, Thailand",
    "offer_address": "57/6-7, ถนนอ่างทอง, Koh Samui, Surat Thani 84140, Thailand",
    "percentage_discount": 77.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 617.0,
    "value": 2651.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Ll1zAAC",
    "hero_image": "https://images.luxuryescapes.com/015dks5bqep140kr7qzm",
    "image_two": "https://images.luxuryescapes.com/py4ox9p9nhgshnso77u",
    "image_three": "https://images.luxuryescapes.com/cfp8tsy0wk4rchq99wcy",
    "vendor_name": "Renaissance Koh Samui Resort & Spa",
    "title": "Beachfront Marriott Indulgence with All-Inclusive Dining & Daily Cocktails",
    "description": "Discover an unparalleled paradise on the sparkling shores of Koh Samui at the five-star Renaissance Koh Samui Resort & Spa. Experience all-inclusive dining and internationally-renowned Marriott decadence on the beachfront with daily buffet breakfast, daily set-menu lunches, nightly set-menu dinners, a daily cocktail per adult, a massage per adult and convenient return airport transfers.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Renaissance Koh Samui Resort & Spa",
    "offer_address": "208/1 Moo 4, T. Maret, Lamai Beach, Koh Samui, Amphoe Ko Samui, Chang Wat Surat Thani 84310, Thailand",
    "percentage_discount": 74.0,
    "min_duration": 3,
    "max_duration": 12,
    "price": 1199.0,
    "value": 4670.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AaYAGAA3",
    "hero_image": "https://images.luxuryescapes.com/e96jgwlybcxsi8poi8mm",
    "image_two": "https://images.luxuryescapes.com/nid1q6yxztat7mc4xz",
    "image_three": "https://images.luxuryescapes.com/q114qirx2onpgmakk4x6",
    "vendor_name": "Sangsuri Villas",
    "title": "Private Koh Samui Beachside Pool Villas for up to 12 Guests with Daily Breakfast, Thai Massage Each & Roundtrip Transfers",
    "description": "Positioned alongside the calm Rock Beach in Koh Samui, Sangsuri Villas is the opulent and refined island oasis of your dreams. Private and blending indoor and outdoor spaces to perfection, families and groups will savour the beachside location with soft sand just metres from your doorstep. Make use of the kayaks and paddle boards provided, soak up the ocean views and tropical sunshine or take a dip in the infinity pool. If you're ready to relax even further, take in a treatment at the onsite Beach Garden Spa. When you can tear yourself away from this slice of bliss, you are only 10 minutes from the market, dining and lively nightlife at Chaweng.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Sangsuri Villas",
    "offer_address": "33/55-57 Bo Put, Surat Thani, Koh Samui 84320 Thailand",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 3968.0,
    "value": 7232.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bi5L4QAI",
    "hero_image": "https://images.luxuryescapes.com/yxgxmedrseidp2e2erht",
    "image_two": "https://images.luxuryescapes.com/irmopo2v26te73kz1pt8",
    "image_three": "https://images.luxuryescapes.com/p9f8bcljtnquijs9njcw",
    "vendor_name": "Samujana Villas",
    "title": "Koh Samui: Celebrity-Style Private Pool Villa Escape with VIP Butler Service",
    "description": "Holiday like a rockstar with a clifftop escape at Koh Samui’s five-star Samujana, an ultra-luxe, all-pool villa oasis overlooking a spectacular coral cove. Get all your favourite people together for a group getaway in a huge 770sqm villa complete with your own private infinity pool, open-air living area and spectacular ocean and island views. Includes an in-villa dining experience, daily à la carte breakfast served in your villa and return airport transfers. Packages available for six, eight or ten adults.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Samujana Villas - 2019",
    "offer_address": "Plai Leam Soi 11, Tambon Bo Put, Amphoe Ko Samui, Chang Wat Surat Thani 84320, Thailand",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 8,
    "price": 1892.0,
    "value": 4067.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000QH6ZDAA1",
    "hero_image": "https://images.luxuryescapes.com/qqtb7xxlfvvq79htyoam",
    "image_two": "https://images.luxuryescapes.com/kwltjezhcu4d8oy14fxa",
    "image_three": "https://images.luxuryescapes.com/ggka9ptxsjq46kdnsxvg",
    "vendor_name": "The Passage Samui Resort",
    "title": "The Passage Koh Samui: Beachfront Escape",
    "description": "Escape to The Passage Samui - a resort that truly has it all with three swimming pools, a stunning beachfront location and one of the island’s most impressive oceanfront restaurants. Spend eight nights and enjoy daily buffet breakfasts, two three-course Thai dinners, nightly cocktails, eight 30-minute massages to share and return airport transfers for two.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chang Wat Surat Thani",
    "offer_geo_area_level_2": "Amphoe Ko Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Passage Samui Resort - December 2017",
    "offer_address": "Koh Samui, Surat Thani 84140, Thailand",
    "percentage_discount": 74.0,
    "min_duration": 8,
    "max_duration": 10,
    "price": 650.0,
    "value": 2462.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AbQiAAAV",
    "hero_image": "https://images.luxuryescapes.com/6izw5m777abqbk90cnr8",
    "image_two": "https://images.luxuryescapes.com/fd8lqcha5brsf7xxxkofg",
    "image_three": "https://images.luxuryescapes.com/kiya7q381f5zfglnkso",
    "vendor_name": "Avani Chaweng Hotel & Beach Club",
    "title": "Boutique Koh Samui Adults-Only Retro-Cool Oasis on Chaweng Beach",
    "description": "Boutique and brilliantly bodacious, Avani Chaweng Samui Hotel & Beach Club is a retro-cool oasis perfectly positioned on Chaweng Beach’s golden sands. Newly opened in August 2022, this slice of paradise has everything you need to soak up Koh Samui’s chilled-out vibes - sip Long Island iced teas at the upbeat Social Bar, snorkel the magnificent waters of nearby Koh Tan or feast on sushi and sundaes at party-central Seen Beach Club, host to some of the island’s hippest events.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Avani Chaweng Hotel & Beach Club",
    "offer_address": "209/10 Moo 2, Sala Khoy Road, Chaweng Beach, Bo Phut, Koh Samui, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 126.0,
    "value": 126.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v1jKAAQ",
    "hero_image": "https://images.luxuryescapes.com/gu9k0nkhv5j2k7zbnjpl",
    "image_two": "https://images.luxuryescapes.com/61dgn2cu1hpqj6h4ckjvq",
    "image_three": "https://images.luxuryescapes.com/3twzm84ou7zwf1yjhqg",
    "vendor_name": "Anantara Lawana Koh Samui Resort & Spa",
    "title": "Thailand: Koh Samui Beachfront Haven",
    "description": "Experience a luxurious stay at Anantara Lawana Koh Samui Resort, a five-star beachfront hideaway where you're invited to experience true relaxation. Be soothed as you cast your eyes over lush gardens and a sparkling infinity pool, step onto the sandy stretches of Chaweng Beach or enjoy a moment of bliss at Anantara Spa. Later, ascend to the jungle canopy at Tree Tops Sky Dining & Bar or head to The Singing Bird Lounge for a round of cocktails before venturing to SEEN Beach Club Samui.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Anantara Lawana Koh Samui Resort",
    "offer_address": "92/1 Moo 2, Bophut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 208.0,
    "value": 208.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zOSvAAM",
    "hero_image": "https://images.luxuryescapes.com/ldo54bkbcl8uh53rva2",
    "image_two": "https://images.luxuryescapes.com/4l81b4a6trs28e2wb69",
    "image_three": "https://images.luxuryescapes.com/w5bn35fplp9blqec3e4l",
    "vendor_name": "Rocky's Boutique Resort",
    "title": "Beachfront Koh Samui Luxury",
    "description": "Discover paradise in the heart of Koh Samui with a stay at the intimate Rocky’s Boutique Resort. Perfectly poised beachfront, in a secluded cove near Lamai Beach, this luxurious resort is just minutes from all the action yet offers privacy and tranquillity thanks to its expansive lush grounds.\n\nThe unique, individually designed accommodation invites serenity, with traditional Thai artwork, teak furnishings and close proximity to the beach as standard. Spend the day lounging poolside or lazing on the resort’s own beach, where powdery white sand gives way to unparalleled views of the Gulf of Thailand. Unwind at the onsite spa, where a menu of rejuvenating and revitalising treatments await or dine on local favourites and western classics at one of the resort's renowned restaurants. Discover the secrets of fragrant Thai cuisine at a cooking class, travel by cycle around the village, or explore the area with the resort's private boat or complimentary shuttle to local hotspots. For families, a kids' club allows little ones to explore their creativity - and parents to enjoy some much-needed time off.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Rocky's Boutique Resort",
    "offer_address": "438/1 Moo 1, T.Maret, Koh Samui, Surat Thani 84310, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 123.0,
    "value": 123.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Uy2UAAS",
    "hero_image": "https://images.luxuryescapes.com/v7zid9aiibvzf600vu6l",
    "image_two": "https://images.luxuryescapes.com/vm4vbaszz63oioaz0ym",
    "image_three": "https://images.luxuryescapes.com/nbdcnqm0tvtxai79gm1d",
    "vendor_name": "Silavadee Pool Spa Resort",
    "title": "Five-Star Koh Samui Oceanfront Luxury with Daily Breakfast & Nightly Rooftop Cocktails",
    "description": "Paradise awaits at the breathtaking Silavadee Pool Spa Resort, built high up on the coastal cliffs overlooking Laem Nan Beach on Koh Samui. Spend balmy days sipping cocktails by the pool while looking out onto jaw-dropping panoramas of the Gulf of Thailand - pure bliss. Two unique onsite restaurants boast these same glorious views while serving up exquisite meals showcasing the flavours of the region. This resort is the perfect relaxation remedy: treat yourself to an indulgent massage at the Silavadee Spa after a long flight before ordering a lavish cocktail at Star rooftop bar at sunset for a truly unforgettable night in.\n\nEnjoy luxurious seclusion at Silavadee Pool Spa Resort, set away from the hustle and bustle of Koh Samui’s town centre. A private beach is available exclusively for resort use, which means you can experience some of the island’s best snorkelling away from the crowds. And when you’re ready to venture down from the clifftops and back into civilisation, the town is only a five-minute shuttle bus ride away.\n\n**Luxury Escapes inclusions (select nights):**\n\n- Wake up to a delicious **daily buffet breakfast** at Moon restaurant\n- Toast your escape in paradise with a **daily cocktail each** at Star rooftop bar\n- Enjoy **one signature three-course dinner** for two at Moon or The Height (for stays of 3+ nights)\n- Convenient **roundtrip airport transfers** in an air-conditioned vehicle (for stays of 3+ nights)\n- Relax with **one 45-minute foot or head-and-shoulder massage** each (for stays of 5+ nights)\n\n**Pool Villa Upgrades available**: Wake up to glorious ocean views from your plush king bed before slipping into a private infinity pool to while away an afternoon in paradise.\n\nPlease refer to Fine Print for details of renovation works taking place between April 2025 and December 2025.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Silavadee Pool Spa Resort",
    "offer_address": "208/66 Moo 4, Maret, Ko Samui, Surat Thani 84310, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 196.0,
    "value": 196.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HQ5eAAG",
    "hero_image": "https://images.luxuryescapes.com/m0gxm3nzai06avdfj0o",
    "image_two": "https://images.luxuryescapes.com/4j8dpzeszdoithkopap",
    "image_three": "https://images.luxuryescapes.com/ou221oy89qgal4k3dahg",
    "vendor_name": "X2 Koh Samui - A Spa Retreat",
    "title": "Five-Star Koh Samui Villas",
    "description": "Azure waters, dramatic limestone cliffs, lush forest, jungle terrain, exceptional cuisine and vibrant nightlife are just a few of the reasons to visit one of Thailand’s most popular spots - and you’re invited to unearth Thai island tranquility during a luxurious stay at X2 Koh Samui - A Spa Retreat.\n\nImpeccably located on a private beach in the southern corner of Koh Samui, this luxe resort is as glamorous as it is relaxing. A stroll through this tranquil haven reveals something to please all, with an expansive pool - one of the deepest on the island - perfectly manicured gardens, a spa offering relaxing treatments, restaurant serving modern international cuisine and views of the glimmering Gulf of Thailand.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "X2 Koh Samui - A Spa Retreat",
    "offer_address": "442 Moo 1 Baan Hua Thanon, Ko Samui District, Surat Thani 84310, Thailand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BQnUAAW",
    "hero_image": "https://images.luxuryescapes.com/5x1i22n3w9mwld2urwy",
    "image_two": "https://images.luxuryescapes.com/hdgeapdrymmkuuxy554",
    "image_three": "https://images.luxuryescapes.com/girxpgpbhg933f6n7efb",
    "vendor_name": "Anantara Rasananda Koh Phangan Villas",
    "title": "Idyllic Koh Phangan Private Pool Suites with Luxe Jungle Spa",
    "description": "Enveloped by swaying coconut palms, Anantara Rasananda Koh Phangan Villas combines beachfront bliss and jungle seclusion with luxurious private pool accommodation. Positioned on the shores of the  Thong Nai Pan Beach, the resort offers gourmet dining options paired with poolside cocktails, along with wellness treatments from the deluxe spa surrounded by verdant jungle terrain. Take a 40-minute speedboat ride to Koh Samui, where vibrant nightlife and bustling street markets await.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Ko Pha-ngan",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Anantara Rasananda Koh Phangan Villas",
    "offer_address": "5/5 Moo 5 Thong Nai Pan Noi Beach, Baan Tai, Ban Tai, Koh Phangan, Surat Thani 84280, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 230.0,
    "value": 230.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BQo3AAG",
    "hero_image": "https://images.luxuryescapes.com/y70k459tj4ebyqf2y0pj",
    "image_two": "https://images.luxuryescapes.com/lmmo638zqgua836dfd",
    "image_three": "https://images.luxuryescapes.com/m9jtskwzvbuhmeh494cm",
    "vendor_name": "Avani+ Samui Resort",
    "title": "Tranquil Avani Koh Samui Beachfront Escape with Rooftop Lounge",
    "description": "Blissful beach days and sunset cocktails are in abundance at Avani+ Samui Resort, perched on a slice of secluded beachfront on Koh Samui’s quiet southwestern corner. Spend days basking by the swimming pool, feast on authentic Thai or international cuisine at Essence Restaurant or watch the sunset with a drink in hand at the Rooftop Lounge. The AvaniFit fully equipped fitness centre will ensure you won’t have to skip your daily exercise during your escape, and when you’re ready to relax, book in a pampering treatment at the indulgent AvaniSpa.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Avani+ Samui Resort",
    "offer_address": "53/5 Moo 4, Phang Ka, Taling Ngam, Koh Samui, Suratthani 84140 Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 206.0,
    "value": 206.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037K7zAAE",
    "hero_image": "https://images.luxuryescapes.com/kge0p7jkl4p8irjdf3wo",
    "image_two": "https://images.luxuryescapes.com/j6pwwweuqce5j320yup7",
    "image_three": "https://images.luxuryescapes.com/dhznego16rjs7r4bodxx",
    "vendor_name": "The Coast Adults Only Resort and Spa, Koh Samui",
    "title": "Koh Samui Adults-Only Beachfront Retreat with Daily Breakfast & Nightly Cocktails",
    "description": "Lining a secluded 120m stretch of Maenam Beach’s powdery sands, The Coast Resort and Spa Koh Samui is an adults-only paradise where you can enjoy dazzling dawn-to-dusk panoramas across the glittering Gulf of Thailand from the beachfront infinity pool.\n\nPart of Tripadvisor’s prestigious Travellers' Choice 2020 ‘Best of the Best’ and ranked in Thailand’s ‘Top 25 Hotels for Romance’, this top-rated oasis offers intimate seclusion. Stay among the swaying palms, within a stone's throw of Koh Samui’s nightlife, yet far enough away that you can relax on the champagne sand uninterrupted. Watch the sunrise with complimentary rooftop yoga classes, glide along the crystal-clear waters of the Gulf with complimentary kayak hire, and float away in the infinity pool as you’re serenaded by live music every Friday evening.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Coast Koh Samui - Adults Only Resort and Spa",
    "offer_address": "44/134, Koh Samui Surat Thani 84330 Thailand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GexmAAC",
    "hero_image": "https://images.luxuryescapes.com/kk1r5ppmymgggdf754hi",
    "image_two": "https://images.luxuryescapes.com/w5a58qlj5pmlxuw5c5e",
    "image_three": "https://images.luxuryescapes.com/ta2505fk3nwr4h59fdc",
    "vendor_name": "Cape Fahn Hotel",
    "title": "Koh Samui Award-Winning Private Island Pool Villas",
    "description": "Witness azure waters lap palm-cloaked cliffs and powder-white beaches at the five-star Cape Fahn Hotel - an intimate private island haven only moments from the shores of Koh Samui, yet a million miles from everyday life. A tranquil gem dropped in the ocean just off Choeng Mon Beach, this secluded retreat features an intimate collection of ultra-luxe villas with private pools and mesmerising views. Gaze over lush tropical hills, picture-perfect ocean and the endless horizon, enhanced by an accompanying soundtrack of gentle waves and tropical birdlife.\n\nTranscend bliss with an invigorating treatment at the hotel spa, sink into a beanbag with a good book at the activities pavilion or watch ever-changing sunset hues from the terrace of Long Dtai restaurant. A member of the prestigious Small Luxury Hotels of the World collection, Cape Fahn Hotel is rated among the top 1% of properties worldwide on Tripadvisor. Experience a level of paradise you never knew existed and so much more on this breathtaking escape.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Cape Fahn Hotel",
    "offer_address": "24/269, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UKC3AAO",
    "hero_image": "https://images.luxuryescapes.com/i4gh1o4hzjspka9n7r9n",
    "image_two": "https://images.luxuryescapes.com/v011jx6gslkw44zh1bo",
    "image_three": "https://images.luxuryescapes.com/a96ba2tekik6bdlwgnm4",
    "vendor_name": "Buri Rasa Village Samui",
    "title": "Award-Winning Koh Samui Beachfront Bliss",
    "description": "Discover the true meaning of Thai luxury with an escape to Buri Rasa Village Samui, awarded the Best Luxury Beach Hotel and Best Luxury Boutique Resort - Continent Winner at the REVE Luxury Awards 2025. Perched on the pristine sands of Chaweng, on the east coastline of Koh Samui, this boutique resort offers the best of everything, with lapping crystal-clear waters, lush tropical greenery and vibrant nightlife all just seconds away.\n\nRooms and suites combine traditional southern Thai architecture with contemporary luxury to encourage beachfront bliss from the moment you walk in. Once you’ve explored every indulgent detail, set up for a day of sunshine by the slate-sided pool or white sands of Chaweng Beach, with a soundtrack of lapping water and refreshments courtesy of the Beach Bar. When hunger strikes, venture to the oceanfront Beach Club restaurant, where sensational seafood is transformed into modern Thai dishes, served alongside a selection of wines from the old and new world. When you’re ready to be pampered, Nam Thai Herbal Spa is home to one-of-a-kind treatments in a lush tropical setting, dialling up the relaxation levels to ‘heavenly’.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Buri Rasa Village Samui",
    "offer_address": "11/2, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 150.0,
    "value": 150.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UREzAAO",
    "hero_image": "https://images.luxuryescapes.com/h97va30lpkzvob46zk8",
    "image_two": "https://images.luxuryescapes.com/srf1oek9ewambf4n2ag",
    "image_three": "https://images.luxuryescapes.com/yq8wc9r5s8uxbojp19",
    "vendor_name": "Banyan Tree Samui",
    "title": "Five-Star Koh Samui Hilltop Escape with All-Pool Villas",
    "description": "A secluded slice of serenity awaits at the hilltop hideaway of Banyan Tree Samui, a five-star pool-villa resort ranked #4 among resorts in Lamai Beach on Koh Samui by Tripadvisor. Here you'll discover true bliss in the form of a private villa with infinity pool overlooking spectacular garden and ocean scenes, an award-winning day spa with 10 treatment rooms, three superb restaurants, and laidback lounge and pool bars.\n\nUnwind by your private pool, watching the palm trees sway in the sea breeze. For a touch of self-care, head to the Yoga Centre for complimentary stretching and sun salutations, cosy up in the library and games room with a good book or take the little ones to the fun-filled Kids' Club for arts and crafts, games, and traditional Thai dance classes. When you're ready to head out and explore, the buzzing centre of Lamai Beach, home to restaurants, beach bars and shops, is only a 15-minute drive away. Travel a few minutes further to Fisherman's Village with its boutique cafés, shops and famous night market which backs onto Koh Samui's most famous beach, Bophut Beach, or head to Namuang Waterfalls, a set of two cascades that plummet into a refreshing natural swimming hole",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Banyan Tree Samui",
    "offer_address": "99, Maret, Surat Thani 84310, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 479.0,
    "value": 479.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EWrU2AAL",
    "hero_image": "https://images.luxuryescapes.com/gfophi2zpwbjdt79vwld",
    "image_two": "https://images.luxuryescapes.com/hsnr3road9euus5vme4l4",
    "image_three": "https://images.luxuryescapes.com/2tft56om1senc15599v9s",
    "vendor_name": "Bo Phut Resort & Spa Samui",
    "title": "Koh Samui Secluded Beachfront Resort Hideaway",
    "description": "Immerse yourself in tropical bliss at Bo Phut Resort & Spa Samui, a luxurious and secluded hideaway on the tropical island of Koh Samui. Savour authentic Thai cuisine at the resort's beachfront restaurant or indulge in a rejuvenating treatment at the spa. From a serene pool with jacuzzi to a kids' pool, kayaking and a fitness centre, the resort combines the best of traditional and contemporary Thai design.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Bo Phut Resort & Spa",
    "offer_address": "12/12 Tambol Bo Phut Amphur, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DHBlGAAX",
    "hero_image": "https://images.luxuryescapes.com/f81q2g9l2iyfb50h3ld8",
    "image_two": "https://images.luxuryescapes.com/jgb2gq16sdx8nm6f2tyn",
    "image_three": "https://images.luxuryescapes.com/kwsucaylft861uuskon",
    "vendor_name": "Paradise Beach Resort Samui",
    "title": "Relaxing Koh Samui Beachfront Retreat with Onsite Spa, Bar & Restaurant",
    "description": "Dreaming of a tropical getaway? Escape to the stunning beaches and laidback lifestyle of Koh Samui with a stay at Paradise Beach Resort. Boasting a beachfront location on the peaceful Maenam Beach, you will enjoy easy access to the island’s vibrant shopping and nightlife while still having an environment to recharge and rejuvinate. Enjoy unwinding at the onsite spa and toast to a fabulous holiday at the bar before adventuring out into the island.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Paradise Beach Resort Samui",
    "offer_address": "18/8 Moo 1, Maenam Beach, Koh Samui, Suratthani 84330, Thailand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HicENYAZ",
    "hero_image": "https://images.luxuryescapes.com/ygayqt75nqm4seb8i7qur",
    "image_two": "https://images.luxuryescapes.com/hrp6e4daksfysexach19",
    "image_three": "https://images.luxuryescapes.com/tl3z3zswoncpqji9exr",
    "vendor_name": "Hyatt Regency Koh Samui",
    "title": "Koh Samui Hyatt Oceanfront Resort with Five Pools & Four Onsite Restaurants",
    "description": "Experience the epitome of Thai luxury at this five-star oceanfront resort, perched on the idyllic shores of Koh Samui. This tropical paradise boasts five stunning pools, each offering a unique perspective of the resort's lush surroundings and the endless azure of the ocean beyond.\n\nThe resort is home to Verio Spa, five pools and four exquisite onsite restaurants, each offering a unique culinary journey. From authentic Thai cuisine to international delicacies, your taste buds will be tantalised at every turn. Beyond the resort, explore the vibrant local markets, or take a leisurely boat ride to the nearby Ang Thong National Marine Park.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Hyatt Regency Koh Samui",
    "offer_address": "99/11 Moo 5, North Chaweng, Bophut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 177.0,
    "value": 177.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HkF6IAK",
    "hero_image": "https://images.luxuryescapes.com/o40duxt6yezu72xg64q4",
    "image_two": "https://images.luxuryescapes.com/esmk7alctld1ioovhmsv",
    "image_three": "https://images.luxuryescapes.com/l47r77vxstt9204tulx",
    "vendor_name": "Centara Reserve Samui",
    "title": "Sophisticated Centara Koh Samui Beachfront Paradise with Six Bars & Restaurants",
    "description": "Make those tropical Thailand dreams come true with an escape to this sophisticated and tranquil haven, located on a pristine stretch of beachfront. As the inaugural property in Centara’s carefully curated luxury collection, Centara Reserve Samui is home to two dazzling resort pools and a spa offering tailored treatments using herbs from the organic garden.\n\nCulinary indulgence is yours to enjoy with six exquisite bars and restaurants onsite. Try a succulent steak at Act 5, take your seafood with a side of soulful live music at Salt Society's beachfront kitchen, or savour your favourite Thai plates with a modern twist at Sa-Nga.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Centara Reserve Samui",
    "offer_address": "38/2 Moo 3, Borpud, Chaweng Beach, Koh Samui, Surat Thani 84320 ,Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 331.0,
    "value": 331.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gtEEAAY",
    "hero_image": "https://images.luxuryescapes.com/a7jtkmk0hmvhnmhf5fi",
    "image_two": "https://images.luxuryescapes.com/dm3wih4ve4jvedntdk5",
    "image_three": "https://images.luxuryescapes.com/57vobhdad802jlx5k44i",
    "vendor_name": "Six Senses Samui",
    "title": "Koh Samui Five-Star Oceanfront Haven with Clifftop Restaurant & Horizon-Facing Infinity Pool",
    "description": "Lose yourself in stunning panoramas of the Gulf of Thailand from the five-star Six Senses Samui, where a unique location on a sloping headland at the northern tip of the island makes for jaw-dropping ocean views. Take a dip in the horizon-edged infinity pool and spend days on the beach enjoying a variety of watersports. Dine at great heights at Dining on the Rocks, an alfresco restaurant placed on the tip of the headland overlooking the ocean, or head to Drift at the Beach, the new beach bar and poolside lounge, for cocktails and bites. After all that wining and dining, succumb to pampering at the spa and wellness centre, where you can enjoy relaxing treatments like massages and facials, unwind with a steam or sauna session, join a yoga class or try your hand at meditation.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Six Senses Samui",
    "offer_address": "9/10 Moo 5, Baan Plai Laem, Bophut Koh Samui, Suratthani 84320 Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 445.0,
    "value": 445.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BVRQAA4",
    "hero_image": "https://images.luxuryescapes.com/ju4m4655v69dynm2ky9",
    "image_two": "https://images.luxuryescapes.com/24k94ywkgicbblvlt31",
    "image_three": "https://images.luxuryescapes.com/o7bodop7efa6pqdlutr",
    "vendor_name": "InterContinental Koh Samui Resort",
    "title": "Koh Samui Five-Star Boutique Beachside Retreat with Six Infinity Pools",
    "description": "Step onto sun-kissed sands, feel the salt breeze on your face and savour every moment of serenity when you escape to the boutique, five-star InterContinental Koh Samui Resort, dramatically positioned on jungled hilltops overlooking the dazzling Gulf of Thailand. This tranquil oasis boasts six shimmering infinity pools surrounded by sprawling lush gardens, a world-class onsite spa, four mouthwatering restaurants and views of some of the most spectacular sunsets in the world. Koh Samui’s flawless beaches, electrifying cuisine and inimitable hospitality make this the perfect escape for dreamers, romantics or families alike.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Surat Thani",
    "location_description": "InterContinental Koh Samui Resort",
    "offer_address": "295 Moo 3 Taling Ngam, Koh Samui, Surat Thani 84140 Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 215.0,
    "value": 215.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DN687AAD",
    "hero_image": "https://images.luxuryescapes.com/2v23cfczy3lkqshurg",
    "image_two": "https://images.luxuryescapes.com/yg66l3ht4vbjfxqwvtb1j",
    "image_three": "https://images.luxuryescapes.com/tnyxiekt2kge84t7ozcg",
    "vendor_name": "OUTRIGGER Koh Samui Beach Resort",
    "title": "Serene OUTRIGGER Koh Samui Five-Star Beachfront Retreat on Lamai Beach",
    "description": "Discover a captivating blend of old-world charm and tropical tranquillity with a stay at OUTRIGGER Koh Samui Beach Resort, ideally positioned on Lamai Beach’s serene sands. This recently renovated resort brings Outrigger’s iconic reputation for top-notch hospitality to soulful Koh Samui. Savour days spent lazing by shimmering lagoon pools or sipping cocktails on warm sands at the Edgewater Beach Club.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "OUTRIGGER Koh Samui Beach Resort",
    "offer_address": "173/41 Moo 4, Rob Koh Road Lamai Beach, Tumbon, Maret, Surat Thani, Thailand 84310",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 64.0,
    "value": 64.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037K8TAAU",
    "hero_image": "https://images.luxuryescapes.com/j8sjm0cpewufyjggnn",
    "image_two": "https://images.luxuryescapes.com/2idzkroxs3dd3ttfnpvea",
    "image_three": "https://images.luxuryescapes.com/vd6ixui6f8n4cehi9967",
    "vendor_name": "Mai Samui Beach Resort & Spa",
    "title": "Beachfront Koh Samui Paradise with Daily Breakfast",
    "description": "Set on the immaculate beachfront overlooking the clear blue waters of Laem Yai Beach, in a tranquil corner of Koh Samui, Mai Samui Beach Resort & Spa's breathtaking location will instantly make you forget the outside world. Offering laidback tropical island ambience with a distinctly Thai touch, this Koh Samui hideaway ⁠- perfect for a couples' escape or family retreat ⁠- invites you to indulge.\n\nExperience a peaceful island escape with three outdoor swimming pools to choose from, three onsite restaurants and bars and a complimentary shuttle bus to discover the nightlife of Chaweng.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Mai Samui Beach Resort & Spa",
    "offer_address": "2/6 Moo 5 Angthong, Suratthani Koh Samui 84140 Thailand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003H6NYAA0",
    "hero_image": "https://images.luxuryescapes.com/n5c8gt8dstmagri04f61m",
    "image_two": "https://images.luxuryescapes.com/96yt4j4dqygpb5kv2csu",
    "image_three": "https://images.luxuryescapes.com/fw36r9mt26jkjd8umbl7",
    "vendor_name": "SALA Samui Choengmon Beach",
    "title": "Five-Star Koh Samui Beachfront Escape with Upscale Rooms & Infinity Pool",
    "description": "Discover Koh Samui's laidback island lifestyle at SALA Samui Choengmon Beach Resort. Overlooking Choeng Mon, one of the most pristine beaches on the island, this five-star resort promises sophisticated luxury. Enjoy panoramic views of the Gulf of Thailand, explore the spectacular sandy beaches dotted with tropical greenery and calm blue seas, lounge by the infinity pool with a refreshing drink or relax in your tastefully designed room or villa.\n\nEnjoy beachfront dining at the al fresco SALA Samui Restaurant, a magical dining space set just metres from the shores of Choeng Mon Beach. Explore the exciting world of Thai and international flavours here, and enjoy your favourite tipples in the casual and relaxed SALA Samui Bar. What's a Thailand vacation without a massage or two? Head to the resort's extensive SALA Spa, where you can take your first step into the wellness journey. When you're feeling active, enjoy daily complimentary yoga classes and complimentary use of kayaks and paddleboards.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "SALA Samui Choengmon Beach",
    "offer_address": "10/9 Moo 5, Baan Plai Laem Soi 2, Ko Samui District, Surat Thani 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 193.0,
    "value": 193.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CP3a2AAD",
    "hero_image": "https://images.luxuryescapes.com/9zeq9jygtasqqor0sceg",
    "image_two": "https://images.luxuryescapes.com/s5ny1brrq5yxs95xey8",
    "image_three": "https://images.luxuryescapes.com/wmeqggm5o2k0g4q5mlgo",
    "vendor_name": "Kimpton Kitalay Samui",
    "title": "Five-Star Koh Samui Serene Seaside Stay with Spa",
    "description": "Remarkable seaside vistas meet relaxing indulgence with an escape to Choeng Mon Beach at the Kimpton Kitalay Samui, an IHG Hotel. Indulge in a luxurious treatment at the Pimãanda by HARNN or hit the beach with a kayak for some aquatic adventure. Sample and savour a diverse range of culinary delights at the five onsite restaurants, or relish an ice-cold cocktail while floating in the cool comfort of the Olympic-size swimming pool with ocean views.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Kimpton Kitalay Samui, an IHG Hotel",
    "offer_address": "10/79 Moo 5, Bophut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 226.0,
    "value": 226.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004StqtAAC",
    "hero_image": "https://images.luxuryescapes.com/qo52jf1nggudihirkvqa",
    "image_two": "https://images.luxuryescapes.com/ywwrs0zw9bowital2vdn",
    "image_three": "https://images.luxuryescapes.com/2wrs5a2knov133zozo",
    "vendor_name": "Samujana Villas",
    "title": "Koh Samui Private Pool Villa Clifftop Escape with Daily Breakfast & Airport Transfers",
    "description": "Embrace the chilled-out vibes of Koh Samui and live it up in true five-star luxury with a villa escape at the clifftop playground of Samujana Villas. Feel like a celebrity staying in one of the resort’s architect-designed villas, all complete with Insta-worthy infinity pools, breathtaking views and inviting open-air living areas.\n\nIdeally positioned on a cliffside, granting ocean views and secluded privacy in all villas, this luxe property is what dreams are made of: with palatial villas fitted with lavish facilities, daily butler service to cater for every whim, delicious in-villa dining, a semi-private beach and a blissful spa, you may never want to leave this paradise.\n\nThis luxurious oasis is also a short drive to a plethora of Koh Samui's most popular bars, restaurants and shops. You’ll also find yourself just a short drive away from Choeng Mon Beach - one of Koh Samui best beaches.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Samujana Villas",
    "offer_address": "63/154 Moo 5, Plai Laem Soi 11, Suratthani 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 22,
    "price": 1292.0,
    "value": 1292.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GqoMAAS",
    "hero_image": "https://images.luxuryescapes.com/0uv9svqx0i819lxsbw5",
    "image_two": "https://images.luxuryescapes.com/3grybqp2p61gs5f4y1q",
    "image_three": "https://images.luxuryescapes.com/m37dv33krf13of35ru6",
    "vendor_name": "SALA Samui Chaweng Beach Resort",
    "title": "Award-Winning Five-Star Koh Samui Beachfront Escape",
    "description": "Experience Koh Samui's chilled vibes and discover one of the island’s most popular beaches with a sun-kissed escape at SALA Samui Chaweng Beach Resort. Find blissful seclusion at this award-winning, contemporary resort, nestled mere steps from Chaweng's white sand and clear blue waters. Expect nothing but luxury and sweeping views over the Gulf of Thailand from this five-star beachfront oasis, consisting of two interconnecting resorts.\n\nFrom the impeccable facilities - which include a blissful spa and an open-air beachfront restaurant serving Thai and international cuisine - to the lavishly designed and decorated rooms, this designer resort brings another level of luxury to the shores of Chaweng. Whether you are happy chilling by the moon-shaped pool, sipping cocktails at the beachfront bar or want to explore the island, SALA Samui Chaweng Beach Resort is the ultimate base on Koh Samui.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "SALA Samui Chaweng Beach Resort",
    "offer_address": "99/10 Moo 2, Chaweng Beach, Ko Samui District, Surat Thani 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 181.0,
    "value": 181.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003HpCHAA0",
    "hero_image": "https://images.luxuryescapes.com/nx57hjueurww7txajvor",
    "image_two": "https://images.luxuryescapes.com/0fgbryaz1cs9zx5nn2b",
    "image_three": "https://images.luxuryescapes.com/ehz6qznzobx0ynr0fxe",
    "vendor_name": "Santiburi Koh Samui",
    "title": "Five-Star Koh Samui Beachfront Villa Luxury",
    "description": "Indulge in the five-star feeling of truly luxurious Thai hospitality at Santiburi Koh Samui, recognised among the top 1% of hotels worldwide on Tripadvisor. Found on the northern shores of Koh Samui, on the edge of pristine Maenam Beach, this luxe escape offers the best of both worlds, surrounded by 23 acres of explorable tropical greenery.\n\nThis suite-and-villa-only secluded sanctuary blends modern design with traditional Thai touches, creating the perfect base for a luxury break. Unwind by the 50m-long swimming pool, one of Koh Samui’s largest, or head to the beach, where exclusive Santiburi Koh Samui Beach Butler service means there will always be a sunlounger, beach towel and bottled drinking water waiting for you. Take to the water with stand-up paddleboards, catamarans and kayaks, before retiring to the beachfront Lèn Spa, where the expert team will pamper you to new levels of peace, with treatments inspired by Thai tradition.\n\nGolf aficionados will delight at the proximity to the 18-hole championship golf course at Santiburi Samui Country Club, while fitness fans will find fun among the gym, tennis court, Muay Thai boxing classes and private yoga sessions. When you’ve worked up an appetite, you’ll be spoilt for choice: will it be the relaxed garden dining of The Pool House, the traditional Thai flavours of Sala Thai, or the seafood-centric menu of The Beach House?",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Santiburi Koh Samui",
    "offer_address": "12/12 Moo 1, Maenam Beach, Koh Samui, Surat Thani 84330 Thailand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G4zqEAAR",
    "hero_image": "https://images.luxuryescapes.com/1eqc5wtjkntesl2k9kk5",
    "image_two": "https://images.luxuryescapes.com/2vcflrp0ync2chrgo28",
    "image_three": "https://images.luxuryescapes.com/yyicn95e3xd8zmi9dzg",
    "vendor_name": "The Sarann Koh Samui",
    "title": "Beachfront Koh Samui Island Escape with Oceanfront Pool & Rejuvenating Spa",
    "description": "Nestled on the sands of Chaweng Noi Beach, The Sarann Koh Samui offers an oceanfront escape just a stone's throw from the island's vibrant dining and nightlife. A true haven of relaxation, this resort features an expansive swimming pool framed by sweeping sea views and a breezy beachside restaurant and bar serving up a mix of local and international dishes. Unwind in the spa, venture north for a night on the town or take advantage of the location to island hop across to Koh Phangan or Koh Tao.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "The Sarann Koh Samui",
    "offer_address": "95-96 Moo 3 Chaweng Noi Beach, Koh Samui, Suratthani 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 67.0,
    "value": 67.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DO5g1AAD",
    "hero_image": "https://images.luxuryescapes.com/k6wiq4ohqqsaq76vhq95",
    "image_two": "https://images.luxuryescapes.com/66fpg8oqnsqlgjt483y",
    "image_three": "https://images.luxuryescapes.com/k33iebzzew868wgn5tu",
    "vendor_name": "Holiday Inn Resort Samui Bophut Beach",
    "title": "Beachfront Koh Samui Oasis with Children's Waterpark",
    "description": "Discover the unparalleled beauty of Thailand’s Samui Island with a stay at the beachfront Holiday Inn Resort Samui Bophut Beach, an IHG Hotel. The idyllic location of this dreamy resort creates a beach lovers paradise, with days spent basking in the dazzling sunshine and lounging poolside beneath the palms, all while gazing out into the turquoise ocean waters only metres from the resort. Keep the kids entertained for hours with fantastic outdoor playgrounds, including a thrilling waterpark.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Holiday Inn Resort Samui Bophut Beach, an IHG Hotel",
    "offer_address": "Moo 2, Bophut Suratthani, Koh Samui 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 120.0,
    "value": 120.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v1gkAAA",
    "hero_image": "https://images.luxuryescapes.com/1nrbrr5z1udmmzp6yb",
    "image_two": "https://images.luxuryescapes.com/wwzkfc4ye8kj7r3s2caa",
    "image_three": "https://images.luxuryescapes.com/n576uomk1bc1zrvkhll",
    "vendor_name": "Anantara Bophut Koh Samui Resort",
    "title": "Five-Star Koh Samui Resort with Beachfront Infinity Pool & Onsite Beach Club",
    "description": "Sunkissed luxury awaits at the five-star Anantara Bophut Koh Samui Resort, a beachfront sanctuary overlooking the dazzling Gulf of Thailand. Surrounded by dramatic gardens, sapphire waters and world-class marine life, this opulent retreat will exceed your expectation of paradise with its myriad of luxe facilities. Tantalise your tastebuds with fusion delights at a host of bars and restaurants, including chargrilled favourites at Full Moon, casual breakfast bites at High Tide and tropical cocktails at SEEN Beach Club Samui. Relish lazy days at the Instagram-worthy infinity pool and discover true tranquillity at Anantara Spa. Koh Samui’s flawless beaches, electrifying cuisine and inimitable hospitality make this the perfect escape for dreamers, romantics and families alike.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Anantara Bophut Koh Samui Resort",
    "offer_address": "99/9 Bophut Bay, Samui Island, Surat Thani 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 207.0,
    "value": 207.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UxgiAAC",
    "hero_image": "https://images.luxuryescapes.com/43bh2fexdk7jqm02ta5c",
    "image_two": "https://images.luxuryescapes.com/lytz64dcgm7oo4xs5o9i",
    "image_three": "https://images.luxuryescapes.com/tp7bhy6ei9u4i6rpvr",
    "vendor_name": "ShaSa Resort and Residences Koh Samui",
    "title": "Five-Star Ocean-View Koh Samui Escape",
    "description": "If your idea of paradise is relaxing on golden sands, swimming in turquoise waters and exploring a fascinating coral reef just 100m off the beachfront at low tide, then look no further than the beautifully secluded ShaSa Resort & Residences, Koh Samui. Hidden in one of the quieter parts of Koh Samui, this beachfront property offers jaw-dropping sea views over the Gulf of Thailand and blissful seclusion. Enjoy the resort's five-star facilities, including a pool bar overlooking the beachfront, health club, Kids’ Club to entertain younger guests with batik dyeing, rock-painting and a huge collection of LEGO, and a breathtaking lagoon pool for lounging in the glorious Koh Samui sun.\n\nMake ShaSa Resort & Residences, Koh Samui, your tranquil launchpad and dip your toe into the vibrant nightlife of Koh Samui’s most lively district at your leisure, with a complimentary shuttle service to Lamai and Chaweng Beach - arguably one of the most stunning beaches on the Gulf of Thailand. Closer to home, why not hire a kayak and explore the breathtaking Laem Set beachfront with its incredible skittle-coloured coral reef? When you want to truly indulge, head to the incredible beachfront spa, where you can transcend to complete bliss through a menu of luxurious treatments.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "ShaSa Resort & Residences, Koh Samui",
    "offer_address": "116/1 Moo 2, Tambon Mared,, Laem Set, Koh Samui, Surat Thani 84310, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 191.0,
    "value": 191.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnGg1YAF",
    "hero_image": "https://images.luxuryescapes.com/n8qfrweu2ja0ghasyfsn",
    "image_two": "https://images.luxuryescapes.com/li3c1p708loq4xbdukzk",
    "image_three": "https://images.luxuryescapes.com/lcg5wxb7joxq6wwz937",
    "vendor_name": "Mercure Samui Chaweng Beach Tana",
    "title": "Koh Samui Modern Oasis on Chaweng Beach with Beach Bars & Lagoon-Style Pools",
    "description": "Immerse yourself in the tropical allure of Koh Samui at this stunning beachfront property. Nestled in the lively heart of Chaweng, this modern retreat offers easy access to the city’s most picturesque attractions. Savour a delicious burger at the onsite Cielo Restaurant or explore local flavours at Baantana Thai. Enjoy exotic cocktails at the Cape Diem Beach Bar along with delectable snacks, or relax on the beach for sun-soaked moments.\n\nPut on your explorer’s hat and wander through the bustling night markets, treat yourself to a traditional Thai massage at a nearby spa or take a stroll to the pristine Chaweng Beach. For a touch of culture, visit the magnificent Big Buddha Temple, just a short drive away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Surat Thani Province",
    "offer_geo_area_level_2": "Koh Samui",
    "location_heading": "Koh Samui",
    "location_subheading": "Thailand",
    "location_description": "Mercure Samui Chaweng Tana",
    "offer_address": "17/135 Moo 3 Bophut, Koh Samui, Surat Thani 84320, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 61.0,
    "value": 61.0
  }
]