[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMzvwAAD",
    "hero_image": "https://images.luxuryescapes.com/9p60my0pbsghvo67mayh",
    "image_two": "https://images.luxuryescapes.com/w1f67egihr9svr6u3n7",
    "image_three": "https://images.luxuryescapes.com/9n6j9hjv9lj2qs5cb95",
    "vendor_name": "The Royal Sands Koh Rong Resort",
    "title": "Cambodia Private Island Beachfront Villa Luxury with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Experience full serenity at The Royal Sands Koh Rong, a collection of bamboo beachfront villas on Koh Rong, a dreamy private island off the coast of Cambodia's mainland. This intimate resort occupies around half a kilometre of space along a white sand beach, overlooking the sparkling waters of the Gulf of Thailand, with each luxurious villa just steps from sapphire water and warm sands. It's the perfect destination for a truly laidback escape - this roadless natural paradise, seemingly from another age, is home to dense jungles dotted with palm trees, waterfalls that open onto spectacular beaches and waters brimming with tropical fish and coral. Savour it all before returning for sundowners at The Chill or traditional Thai wellness treatments at Sense Spa.",
    "offer_country_name": "Cambodia",
    "offer_country_code_alpha_2": "KH",
    "offer_geo_area_level_1": "Preah Sihanouk",
    "offer_geo_area_level_2": "Koh Rong",
    "location_heading": "Koh Rong",
    "location_subheading": "Cambodia",
    "location_description": "The Royal Sands Koh Rong",
    "offer_address": "Sok San Beach, Koh Rong Koh Rong Island Preah Sihanouk, Cambodia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 719.0,
    "value": 1527.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgRmlQAE",
    "hero_image": "https://images.luxuryescapes.com/nzhi5apz7bfwjhe4mtvp",
    "image_two": "https://images.luxuryescapes.com/mxpdij4swyf0c6sg94zn",
    "image_three": "https://images.luxuryescapes.com/wozhlgdysiqbjxjjtffu",
    "vendor_name": "The Royal Sands Koh Rong Resort",
    "title": "Boutique Beachfront Villa Escape with Daily Dining Inclusions",
    "description": "Set your watch to island time and escape to the striking Koh Rong, Cambodia’s second largest island, a tropical paradise known for its sandy coves and coral reefs, accessible only by plane or boat. Stay in pure luxury at The Royal Sands Koh Rong, a beachfront oasis boasting a collection of boutique villas, and enjoy daily breakfast, your choice of daily lunches or dinners accompanied by a drink per person, a daily basket of fresh fruit delivered to your villa, a 60-minute massage per person, access to non-motorised water sport equipment and return boat transfers from Sihanoukville.",
    "offer_country_name": "Cambodia",
    "offer_country_code_alpha_2": "KH",
    "offer_geo_area_level_1": "Koh Kong Province",
    "offer_geo_area_level_2": "",
    "location_heading": "Koh Rong",
    "location_subheading": "Cambodia",
    "location_description": "The Royal Sands Koh Rong - May 2019",
    "offer_address": "Sok San Beach, Koh Rong Koh Rong Island Krong Preah Sihanouk, Cambodia",
    "percentage_discount": 62.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1248.0,
    "value": 3272.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcXcfAAF",
    "hero_image": "https://images.luxuryescapes.com/tl6es29madsz60ly9lue",
    "image_two": "https://images.luxuryescapes.com/a2yor2dzia4g64gxucm9",
    "image_three": "https://images.luxuryescapes.com/iy00h244wkxozlsg9r",
    "vendor_name": "The Royal Sands Koh Rong Resort",
    "title": "Cambodia Five-Star Beachfront Villas on Private Island with Daily Breakfast, Daily Lunch or Dinner & Nightly Drinks",
    "description": "Experience full serenity at The Royal Sands Koh Rong, Cambodia, a collection of beachfront villas on the dreamy private island of Koh Rong. Occupying a 400-metre-long white sand beach, this intimate resort overlooks the sparkling waters of the Gulf of Thailand, with luxurious villas just steps from the pristine sands. Dive into crystal clear waters and make the best of the complimentary non-motorised watersports equipment provided by the resort, or simply rejuvenate your body and soul at the Sense Spa with a sunset cocktail to follow.\n\nBoasting over 43 kilometres of white sand beaches and blessed with the tropical weather year-round, Koh Rong is the perfect destination for a laidback escape. A natural paradise with no cars and no roads, the island is home to dense jungles dotted with palm trees, waterfalls that open onto spectacular beaches, and waters full to the brim with tropical fish and coral.",
    "offer_country_name": "Cambodia",
    "offer_country_code_alpha_2": "KH",
    "offer_geo_area_level_1": "Preah Sihanouk",
    "offer_geo_area_level_2": "Koh Rong",
    "location_heading": "Koh Rong",
    "location_subheading": "Cambodia",
    "location_description": "The Royal Sands Koh Rong",
    "offer_address": "Sok San Beach, Koh Rong Koh Rong Island Preah Sihanouk, Cambodia",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 803.0,
    "value": 2293.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003HINJAA4",
    "hero_image": "https://images.luxuryescapes.com/g9lbotwf6qycxkrfim3k",
    "image_two": "https://images.luxuryescapes.com/ev0wuzz6vhww3q5nk9kv",
    "image_three": "https://images.luxuryescapes.com/36h3rkvc0pv9pynfknkb",
    "vendor_name": "The Royal Sands Koh Rong Resort",
    "title": "Boutique Cambodia Secluded Island Villa Escape with Beachfront Pool",
    "description": "Travel across the sparkling waters of the Gulf of Thailand to reach one of Cambodia’s most idyllic islands: Koh Rong. Upon arrival, set your watch to island time and relax in a luxury villa at The Royal Sands Koh Rong. Located just 25 kilometres from the port town of Sihanoukville, this is a natural paradise with few cars or roads, where dense jungle dotted with palm trees and waterfalls opens onto spectacular beaches, and the waters are crystal-clear and brimming with tropical fish and coral. Boasting over 43 kilometres of white-sand beaches and blessed with tropical weather year-round, Koh Rong is the perfect destination for a sun-kissed escape.\n\nWith a collection of 67 villas, serenity abounds at The Royal Sands Koh Rong. Enjoy a delicious meal by the sea at The Chill or Ocean Restaurant, rejuvenate your body and soul at Senses Spa, work out at the fully equipped gym, swim in the dramatic swimming pool right by the beach, enjoy a morning yoga class, and make the most of complimentary non-motorised equipment, including kayaks, stand-up paddleboards and more.",
    "offer_country_name": "Cambodia",
    "offer_country_code_alpha_2": "KH",
    "offer_geo_area_level_1": "Preah Sihanouk",
    "offer_geo_area_level_2": "Koh Rong",
    "location_heading": "Koh Rong",
    "location_subheading": "Cambodia",
    "location_description": "The Royal Sands Koh Rong",
    "offer_address": "Sok San Beach, Koh Rong Koh Rong Island Preah Sihanouk, Cambodia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 468.0,
    "value": 468.0
  }
]