[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z5sRAAQ",
    "hero_image": "https://images.luxuryescapes.com/zev6aaax3jn4vgyd01l",
    "image_two": "https://images.luxuryescapes.com/1x4nwnecjdrd5v1kfq6n",
    "image_three": "https://images.luxuryescapes.com/5lypkg100iqgswdi4cts",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "All-Inclusive Maldives with Free-Flow Cocktails & Return Flights from Malé",
    "description": "All-inclusive drinks and dining, stunning white-sand beachfront and an underwater world of colourful marine life make Kooddoo Maldives Resort by Mercure the obvious choice for your Maldives escape. This is Mercure, but not as you know it.\n\nEnjoy all-inclusive drinks and dining throughout this indulgent stay. From daily breakfast, lunch and dinner at the resort’s signature Alita restaurant, to daily afternoon snacks and a complimentary daily in-villa minibar service - this is pure indulgence. Completing this extraordinary package are free-flow drinks with your choice of spirits, cocktails, wine and beer from 10.30am to 11pm daily. Plus, enjoy a one-time upgraded two-course à la carte dinner at Vistas Gastro Bar.\n\nLet your worries float away with return domestic flights from Malè Airport, complimentary airport lounge service - including a private escort to the Moonimaa Lounge - and complimentary non-motorised watersport equipment, including snorkels to discover the Maldives' rich marine life.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Upper South Province",
    "offer_geo_area_level_2": "Gaafu Alifu Atoll",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Kooddoo Maldives Resort by Mercure July 2020",
    "offer_address": "Gaafu Alifu Atoll Kooddoo Island, 20219, Maldives",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 2499.0,
    "value": 4342.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lr2YAAS",
    "hero_image": "https://images.luxuryescapes.com/huoaa9rips7b9c33psu5",
    "image_two": "https://images.luxuryescapes.com/qnqa6z9blbaz0z3lzfog",
    "image_three": "https://images.luxuryescapes.com/ybsi01oa0v9o47fgsh3",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "All-Inclusive Adults-Only Maldives with Free-Flow Cocktails & Return Flights from Malé",
    "description": "All-inclusive drinks and dining, stunning white-sand beachfront and an underwater world of colourful marine life make the adults-only Kooddoo Maldives Resort by Mercure the obvious choice for your Maldives escape. This is Mercure, but not as you know it.\n\nEnjoy all-inclusive drinks and dining throughout this indulgent adults-only stay. From daily breakfast, lunch and dinner at the resort’s signature Alita Restaurant, to daily afternoon snacks and a complimentary daily in-villa minibar service - this is pure indulgence. Completing this extraordinary package are free-flow drinks with your choice of spirits, cocktails, wine and beer from 10.30am to 11pm daily. Plus, enjoy a one-time upgraded two-course à la carte dinner at Vistas Gastro Bar.\n\nLet your worries float away with return domestic flights from Malè Airport, complimentary airport lounge service - including a private escort to the Moonimaa Lounge - and complimentary non-motorised watersport equipment, including snorkels to discover the Maldives' rich marine life.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Upper South Province",
    "offer_geo_area_level_2": "Gaafu Alifu Atoll",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Kooddoo Maldives Resort by Mercure March 2020",
    "offer_address": "Gaafu Alifu Atoll Kooddoo Island, 20219, Maldives",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 2339.0,
    "value": 4349.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004DpXFAA0",
    "hero_image": "https://images.luxuryescapes.com/l599t684vbkqq9b15ia",
    "image_two": "https://images.luxuryescapes.com/1dhplr5uvbxizy1zt1a9",
    "image_three": "https://images.luxuryescapes.com/ddb2e4ri97o5rtnpzrm",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "All-Inclusive Maldives with Free-Flow Cocktails & Return Flights from Malé",
    "description": "All-inclusive drinks and dining, stunning white-sand beachfront and an underwater world of colourful marine life make Kooddoo Maldives Resort by Mercure the obvious choice for your Maldives escape. This is Mercure, but not as you know it.\n\nEnjoy all-inclusive drinks and dining throughout this indulgent stay. From daily breakfast, lunch and dinner at the resort’s signature Alita restaurant, to daily afternoon snacks and a complimentary daily in-villa minibar service - this is pure indulgence. Completing this extraordinary package are free-flow drinks with your choice of spirits, cocktails, wine and beer from 10.30am to 11pm daily. Plus, enjoy a one-time upgraded two-course à la carte dinner at Vistas Gastro Bar.\n\nLet your worries float away with return domestic flights from Malè Airport, complimentary airport lounge service - including a private escort to the Moonimaa Lounge - and complimentary non-motorised watersport equipment, including snorkels to discover the Maldives' rich marine life.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Alifu Atoll",
    "offer_geo_area_level_2": "Kooddoo",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Mercure Maldives Kooddoo OCT21",
    "offer_address": "Gaafu Alifu Atoll Kooddoo Island, 20219, Maldives",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 2399.0,
    "value": 4439.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdnfbAAB",
    "hero_image": "https://images.luxuryescapes.com/ptcyi6qtuul9361fbzgp",
    "image_two": "https://images.luxuryescapes.com/yecbhmrvn2qke1s7fugv",
    "image_three": "https://images.luxuryescapes.com/7snj9efne5p90tt8qwxo",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "Maldives All-Inclusive Adults-Only Oasis with Unlimited Drinks & Roundtrip Domestic Malé Flights",
    "description": "Welcome to Mercure Maldives Kooddoo Resort: you've never experienced pampering quite like this. Just a one-hour flight from Malé, this oasis couldn't feel further from the rest of the world. Discover the Gaafu Alifu Atoll, where you'll be surrounded by the kind of blue ocean you just can't conjure up. Here, you can surrender to pure indulgence as you sip free-flowing cocktails from dawn to sunset, with all-inclusive drinks, meals and snacks, including a personal in-villa minibar customised to your preferences and unparalleled gourmet meals handcrafted by expert chefs. Choose from beachfront and overwater villas, each offering perfect seclusion, with a private terrace and direct access to either the pristine beachfront or the glistening lagoon.\n\nLet your worries float away in an ocean so clear it needs to be seen to be believed and immerse yourself in this unspoilt corner of the world, a long-standing favourite with honeymooners. Choose to experience an oasis of tranquillity at Suvadiva Spa, take a once-in-a-lifetime dolphin cruise or grab your snorkelling gear and plunge into turquoise waters to explore the atoll's pristine underwater ecosystem. Mercure Maldives Kooddoo Resort is now an adults-only resort, which means there are no disturbances while you're admiring jaw-dropping sunsets and no kids splashing in the pool when you're finally getting into the perfect holiday book.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Alifu Atoll",
    "offer_geo_area_level_2": "Kooddoo",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Mercure Maldives Kooddoo Resort",
    "offer_address": "Kooddoo Island, Gaafu Alifu Atoll 20219, Maldives",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 2134.0,
    "value": 5120.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DmJs6YAF",
    "hero_image": "https://images.luxuryescapes.com/fvt0jw3l9f4z4zx852n",
    "image_two": "https://images.luxuryescapes.com/xq9xbau7pyr6wp26xgl6",
    "image_three": "https://images.luxuryescapes.com/vjslptowkwda2ijd1zg",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "Maldives All-Inclusive Oasis: Adults-Only Bliss with Unlimited Free-Flow Drinks & Domestic Flight Transfers",
    "description": "Surrender to the allure of the Maldives at this oasis that feels worlds away from the everyday. Just a 60-minute domestic flight from Malé, the Gaafu Alifu Atoll awaits, surrounded by an ocean so vividly blue it defies imagination. At Mercure Maldives Kooddoo Resort, indulge in all-inclusive luxury with drinks, meals, snacks and an in-villa minibar.\n\nCulinary delights abound, with international flavours at Alita restaurant and authentic Italian dishes at the overwater Vista restaurant. Unwind with a handcrafted cocktail at the Pool Bar before retreating to your private island haven. Each moment here is crafted to deliver quality experiences in a setting of unparalleled natural beauty.\n\nImmerse yourself in this unspoilt paradise, a long-standing favourite with honeymooners. Relax at the serene Suvadiva Spa, or snorkel through the pristine underwater wonders of the atoll. As an adults-only resort, this resort offers the ultimate escape where you can bask in breathtaking sunsets and enjoy uninterrupted peace with your loved one.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Alifu Atoll",
    "offer_geo_area_level_2": "Kooddoo",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Mercure Maldives Kooddoo Resort",
    "offer_address": "Kooddoo Island, Gaafu Alifu Atoll 20219, Maldives",
    "percentage_discount": 48.0,
    "min_duration": 5,
    "max_duration": 22,
    "price": 2564.0,
    "value": 4921.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DP9obAAD",
    "hero_image": "https://images.luxuryescapes.com/47uhowzfklpmy9itp4in",
    "image_two": "https://images.luxuryescapes.com/whqb17msr8sfru1ewzeh",
    "image_three": "https://images.luxuryescapes.com/x60hwta2mneley7w5dgj",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "Mercure Maldives All-Inclusive Adults-Only Oasis with Unlimited Drinks & Roundtrip Domestic Malé Flights",
    "description": "Welcome to Mercure Maldives Kooddoo Resort: you've never experienced pampering quite like this. It's the views that grab you first. Lush, picture-perfect and uninterrupted from the champagne beachfront. Just a one-hour flight from Male, this oasis couldn't feel further from the rest of the world. Discover the Gaafu Alifu Atoll, where you'll be surrounded by the kind of blue ocean you just can't conjure up - even with the help of a filter. Here, you can surrender to pure indulgence as you sip free-flowing cocktails from dawn to sunset, with all-inclusive drinks, meals and snacks, including a personal in-villa minibar customised to your preferences and unparalleled gourmet meals handcrafted by expert chefs. Choose from beachfront and overwater villas, each offering perfect seclusion, with a private terrace and direct access to either the pristine beachfront or the glistening waves.\n\nLet your worries float away in an ocean so clear it needs to be seen to be believed, and immerse yourself in this unspoilt corner of the world, a long-standing favourite with honeymooners. Choose to experience an oasis of tranquility at Suvadiva Spa, take a once-in-a-lifetime dolphin cruise or grab your snorkelling gear and plunge into turquoise waters to explore the atoll's pristine underwater ecosystem. Mercure Maldives Kooddoo Resort is now an adults-only resort, which means there are no disturbances while you're admiring jaw-dropping sunsets and no kids splashing in the pool when you're finally getting into the perfect holiday book. It'll just be you, your special someone and all the rest and relaxation in the world. Enjoy the ultimate pampering that only a child-free, all-inclusive Maldives resort can provide.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Alifu Atoll",
    "offer_geo_area_level_2": "Kooddoo",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Mercure Maldives Kooddoo Resort",
    "offer_address": "Kooddoo Island, Gaafu Alifu Atoll 20219, Maldives",
    "percentage_discount": 37.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 2439.0,
    "value": 3854.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HNwWAAW",
    "hero_image": "https://images.luxuryescapes.com/uvr21qt1gal2c9vtpfeg",
    "image_two": "https://images.luxuryescapes.com/f9og32jkj873tgudy6wj",
    "image_three": "https://images.luxuryescapes.com/n112pf9o39ykg63r2nv",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "All-Inclusive Maldives Romance with Free-Flow Cocktails & Roundtrip Malé Flights",
    "description": "All-inclusive drinks and dining, stunning white-sand beachfront and an underwater world of colourful marine life make Mercure Maldives Kooddoo the obvious choice for your Maldives escape. Surrender yourself to pure indulgence at this private hideaway, surrounded by breathtaking natural wonders. Let your worries float away in the azure ocean - a beauty that needs to be seen to be believed - lounge on sunkissed powder-white sands and immerse yourself in this unspoilt corner of the world, a long-standing favourite with honeymooners.\n\nEscape to the idyllic island of Kooddoo, where you'll be treated to daily taste sensations at Alita restaurant, mouthwatering signature cocktails at the Pool Bar and a front-row seat to the island's stunning sunsets at Vistas bar. Choose to experience an oasis of tranquility at Suvadiva Spa or grab your snorkelling gear and plunge into turquoise waters to explore the atoll's pristine underwater ecosystem.\n\n**Your handpicked inclusions:**\n\n- Unlimited all-inclusive dining with daily breakfast, lunch and dinner at Alita restaurant\n- Free-flow drinks, including spirits, fine and sparkling wine, beer, handcrafted cocktails and all soft drinks, from milkshakes and smoothies to barista coffee and specialty teas\n- Complimentary roundtrip flights between Malé and Kooddoo and shuttle from Kooddoo to the resort\n- Daily afternoon snacks featuring handcrafted cocktails, speciality coffees, teas and more at the pool bar\n- In-villa minibar filled with soft drinks, juices, beer and selected snacks (refreshed daily)\n- One-time two-course à la carte dinner at Vistas plus 30% off any additional purchases at Vistas\n- Complimentary airport lounge service on arrival at Malè Airport with an escort to Moonimaa Lounge\n- Unlimited use of snorkelling and non-motorised watersport equipment\n- Board a traditional dhoni boat and sail the mesmerising Gaafu Alifu Atoll on a spectacular one-time dolphin-watching cruise\n\n**Overwater Sunset Pool Villa Upgrade:** Heighten the romance with a stay in a quintessentially Maldivian overwater villa with private pool. Upgrade to a spacious Overwater Sunset Pool Villa and spend tranquil days overlooking the sparkling lagoon from your own private pool.\n\n**Book with 100% Confidence:** If for whatever reason you don’t want to go on your holiday, you can cancel right up to 72 hours before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Alifu Atoll",
    "offer_geo_area_level_2": "Kooddoo",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Mercure Maldives Kooddoo OCT21",
    "offer_address": "Gaafu Alifu Atoll Kooddoo Island, 20219, Maldives",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1599.0,
    "value": 3034.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cLKyKQAW",
    "hero_image": "https://images.luxuryescapes.com/xkhwcdgb558r6gu40go",
    "image_two": "https://images.luxuryescapes.com/ednx4f5p3a5qs1pxl8j",
    "image_three": "https://images.luxuryescapes.com/uq008qa8i5ood1i7obx",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "All-Inclusive Barefoot Bliss in the Maldives with Return Domestic Flights from Malé",
    "description": "Make memories in one of the world’s most stunning locations at the Kooddoo Maldives Resort by Mercure. Located on tranquil Kooddoo Island, getting there is a breeze thanks to return domestic flights from Malé included in your package. Arrive to 68 intimate villas (with overwater upgrades available), powder-white beach and azure ocean, with free snorkelling equipment hire for discovering the colourful marine life below. With all-inclusive dining taking care of breakfast, lunch and dinner, plus free-flow soft and alcoholic drinks daily, all that’s left to do is enjoy the magic of the Maldives…",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Upper South Province",
    "offer_geo_area_level_2": "Gaafu Alifu Atoll",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Kooddoo Maldives Resort by Mercure 2019",
    "offer_address": "Gaafu Alifu Atoll Kooddoo Island, 20219, Maldives",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 9,
    "price": 2336.0,
    "value": 6474.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuxeHAAR",
    "hero_image": "https://images.luxuryescapes.com/3lfrm34ziwrkm79enqfj",
    "image_two": "https://images.luxuryescapes.com/6ygf1366w8fdourp85i7",
    "image_three": "https://images.luxuryescapes.com/wutfmnnq64ee1dwwvwrd",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "Maldives All-Inclusive Adults-Only Oasis with Unlimited Drinks & Roundtrip Domestic Malé Flights",
    "description": "Welcome to Mercure Maldives Kooddoo Resort: you've never experienced pampering quite like this. Just a 55-minute domestic flight from Malé, this oasis couldn't feel further from the rest of the world. Discover the Gaafu Alifu Atoll, where you'll be surrounded by the kind of blue ocean you just can't conjure up. Here, you can surrender to pure indulgence, with all-inclusive drinks, meals and snacks, including a personal in-villa minibar customised to your preferences and unparalleled gourmet meals handcrafted by expert chefs. Choose from beachfront and overwater villas, each offering perfect seclusion, with a private terrace and direct access to either the pristine beachfront or the glistening lagoon.\n\nImmerse yourself in this unspoilt corner of the world, a long-standing favourite with honeymooners. Choose to experience an oasis of tranquillity at Suvadiva Spa, take a once-in-a-lifetime dolphin cruise or grab your snorkelling gear and plunge into turquoise waters to explore the atoll's pristine underwater ecosystem. Mercure Maldives Kooddoo Resort is now an adults-only resort, which means there are no disturbances while you're admiring jaw-dropping sunsets and no kids splashing in the pool when you're finally getting into the perfect holiday book.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Alifu Atoll",
    "offer_geo_area_level_2": "Kooddoo",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Mercure Maldives Kooddoo Resort",
    "offer_address": "Kooddoo Island, Gaafu Alifu Atoll 20219, Maldives",
    "percentage_discount": 36.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 2399.0,
    "value": 3743.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pQeVAAU",
    "hero_image": "https://images.luxuryescapes.com/qzs76yysfhyaegdi7f",
    "image_two": "https://images.luxuryescapes.com/lemb5veojzzzl68a81m",
    "image_three": "https://images.luxuryescapes.com/pjeptnnhy7drgh0vlke",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "Mercure Maldives All-Inclusive Adults-Only Oasis with Unlimited Drinks & Roundtrip Malé Flights",
    "description": "Welcome to Mercure Maldives Kooddoo Resort: you've never experienced pampering quite like this. It's the views that grab you first. Lush, picture-perfect and uninterrupted from the champagne beachfront. Just a one-hour flight from Malé, this oasis will hide you away from the rest of the world. Discover the Gaafu Alifu Atoll, where you'll be surrounded by the kind of blue ocean you just can't conjure up - even with the help of a filter. \n\nHere, you can surrender to pure indulgence as you sip free-flowing cocktails from dawn to sunset, with all-inclusive drinks, meals and snacks, including a personal in-villa minibar customised to your preferences (from unlimited sparkling wine to never-ending premium spirits) and unparalleled gourmet meals handcrafted by expert chefs. Choose from beachfront and overwater villas, each offering a bespoke hideaway with private terrace, and for those over water, direct access to the glistening waves.\n\nLet your worries float away in the azure ocean - a beauty that needs to be seen to be believed - and immerse yourself in this unspoilt corner of the world, a long-standing favourite with honeymooners. On the idyllic island of Kooddoo, you can choose to experience an oasis of tranquility at Suvadiva Spa, take a once-in-a-lifetime dolphin cruise or grab your snorkelling gear and plunge into turquoise waters to explore the atoll's pristine underwater ecosystem. Mercure Maldives Kooddoo Resort is now an adults-only resort, which means there are no disturbances while you're admiring jaw-dropping sunsets and no kids splashing in the pool when you're finally getting into the perfect holiday book. It'll just be you, your special someone and all the rest and relaxation in the world. Enjoy the ultimate pampering that only a child-free, all-inclusive Maldives resort can provide.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Alifu Atoll",
    "offer_geo_area_level_2": "Kooddoo",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Mercure Maldives Kooddoo Resort",
    "offer_address": "Kooddoo Island, Gaafu Alifu Atoll 20219, Maldives",
    "percentage_discount": 53.0,
    "min_duration": 4,
    "max_duration": 21,
    "price": 2924.0,
    "value": 6267.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JTEG6AAP",
    "hero_image": "https://images.luxuryescapes.com/msqdlglxni2za2mijabj",
    "image_two": "https://images.luxuryescapes.com/85ugme0wi6g5weetnjm",
    "image_three": "https://images.luxuryescapes.com/x1iyoh1ym0fucla3203",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "Maldives All-Inclusive Adults-Only Oasis with Unlimited Drinks & Roundtrip Domestic Malé Flights",
    "description": "Surrender to the allure of the Maldives at this oasis that couldn't feel further from the rest of the world. Just a 60-minute domestic flight from Malé, discover the Gaafu Alifu Atoll, where you'll be surrounded by the kind of blue ocean you just can't conjure up. Here at Mercure Maldives Koodoo Resort, you can surrender to pure indulgence, with all-inclusive drinks, meals and snacks, including a personal in-villa minibar customised to your preferences and unparalleled gourmet meals handcrafted by expert chefs. Choose between international flavours at Alita restaurant or Italian cuisine by overwater Vista restaurant, and sip on a cocktail at the Pool Bar before retiring to your private island haven.\n\nThere's no time like the present to immerse yourself in this unspoilt corner of the world, a long-standing favourite with honeymooners. When you're not taking in the island's beauty from the privacy of your dreamy villa, choose to experience an oasis of tranquillity at Suvadiva Spa, take a once-in-a-lifetime dolphin cruise or grab your snorkelling gear and plunge into turquoise waters to explore the atoll's pristine underwater ecosystem. Mercure Maldives Kooddoo Resort is now an adults-only resort, so you can enjoy jaw-dropping sunsets with your loved one and get stuck into your perfect holiday book in pure tranquility, with no disturbances.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Alifu Atoll",
    "offer_geo_area_level_2": "Kooddoo",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Mercure Maldives Kooddoo Resort",
    "offer_address": "Kooddoo Island, Gaafu Alifu Atoll 20219, Maldives",
    "percentage_discount": 48.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 2699.0,
    "value": 5180.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JDtGgYAL",
    "hero_image": "https://images.luxuryescapes.com/6h3mmxilsmotee3ncs7rl",
    "image_two": "https://images.luxuryescapes.com/r33vy2u8yhvbwp9fxe7q",
    "image_three": "https://images.luxuryescapes.com/rmtzpcrsz8t3coeizpon",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "Maldives All-Inclusive Oasis: Adults-Only Bliss with Free-Flow Drinks & Domestic Flight Transfers",
    "description": "Surrender to the allure of the Maldives at this award-winning oasis that feels worlds away from the everyday. Just a 60-minute domestic flight from Malé, the Gaafu Alifu Atoll awaits, surrounded by an ocean so vividly blue it defies imagination. At Mercure Maldives Kooddoo Resort, indulge in all-inclusive luxury with drinks, meals, snacks and an in-villa minibar.\n\nCulinary delights abound, with international flavours at Alita restaurant and authentic Italian dishes at the overwater restaurant Vista. Unwind with a handcrafted cocktail at the Pool Bar before retreating to your private island haven. Each moment here is crafted to deliver quality experiences in a setting of unparalleled natural beauty.\n\nImmerse yourself in this unspoilt paradise, a long-standing favourite with honeymooners. Relax at the serene Suvadiva Spa, or snorkel through the pristine underwater wonders of the atoll. As an adults-only resort, this retreat offers the ultimate escape where you can bask in breathtaking sunsets and enjoy uninterrupted peace with your loved one.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Alifu Atoll",
    "offer_geo_area_level_2": "Kooddoo",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Mercure Maldives Kooddoo Resort",
    "offer_address": "Kooddoo Island, Gaafu Alifu Atoll 20219, Maldives",
    "percentage_discount": 66.0,
    "min_duration": 5,
    "max_duration": 22,
    "price": 2239.0,
    "value": 6523.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006yJZyAAM",
    "hero_image": "https://images.luxuryescapes.com/rvy7cha0ol6p0vvk7q4k",
    "image_two": "https://images.luxuryescapes.com/q7rnejdxcrsji22l4a9",
    "image_three": "https://images.luxuryescapes.com/vk8ucq29mqly433sl0ae",
    "vendor_name": "Mercure Maldives Kooddoo",
    "title": "Unmissable All-Inclusive Mercure Maldives Oasis with Unlimited Drinks, Dolphin Cruise, Roundtrip Malé Flights & Travel Until December 2023",
    "description": "You've never experienced pampering quite like this. It's the views that grab you first: lush, picture-perfect and interrupted from the champagne beachfront. Just a one-hour flight from Malé, this Mercure Koodoo oasis will hide you away from the rest of the world in the Gaafu Alifu Atoll, where you'll be surrounded by the kind of blue that you just can't create - even with a filter.\n\nHere, you can surrender to pure indulgence as you sip free-flowing cocktails from dawn to sunset with all-inclusive drinks, including a personal minibar in-villa that you can customise to be whatever you want (from unlimited sparkling to never-ending premium spirits) and unparalleled gourmet meals handcrafted by expert chefs. You can choose from beach villas or overwater villas, each offering a bespoke hideaway with private terraces, and for those over water, access to the glistening waves.\n\nLet your worries float away in the azure ocean - a beauty that needs to be seen to be believed - and immerse yourself in this unspoilt corner of the world, a long-standing favourite with honeymooners. On the idyllic island of Kooddoo, you can choose to experience an oasis of tranquillity at Suvadiva Spa, unearth the creatures of the deep with a once-in-a-lifetime dolphin cruise or grab your snorkelling gear and plunge into turquoise waters to explore the atoll's pristine underwater ecosystem.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Gaafu Alifu Atoll",
    "offer_geo_area_level_2": "Kooddoo",
    "location_heading": "Kooddoo Island",
    "location_subheading": "Maldives",
    "location_description": "Mercure Maldives Kooddoo OCT21",
    "offer_address": "Gaafu Alifu Atoll Kooddoo Island, 20219, Maldives",
    "percentage_discount": 67.0,
    "min_duration": 5,
    "max_duration": 30,
    "price": 2499.0,
    "value": 7609.0
  }
]