[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BeayIAAR",
    "hero_image": "https://images.luxuryescapes.com/vim55yvhvgrvwh7fjb3",
    "image_two": "https://images.luxuryescapes.com/y0e71q49c9hxywoyg6",
    "image_three": "https://images.luxuryescapes.com/18ggtabts6zb6l0f2rl",
    "vendor_name": "Alila Kothaifaru Maldives",
    "title": "Grand Opening: Alila Maldives Private Pool Villas with Daily Breakfast, Daily Lunch or Dinner & Roundtrip Malé Transfers",
    "description": "Be one of the first to experience the epitome of elevated luxury with a romantic stay at the brand-new, five-star Alila Kothaifaru Maldives - from the renowned brand behind the famed Alila Seminyak, Uluwatu. This private island paradise, accessible via a scenic 45-minute seaplane journey from Malé, has it all. Picture iridescent waters, prolific greenery and flawless sandy stretches that exist in perfect harmony with a boutique collection of minimalistic private pool villas expertly designed to bring the best of the outdoors within. Unwind in total seclusion, then savour refined fare across the resort’s six restaurants and bars, be dazzled by a selection of world-class treatments at Spa Alila, dive into the impressive infinity pool or get your thrill fix at the watersports and dive centre.\n\nWhile this island paradise feels miles away from the everyday, the archipelago is home to a host of exciting experiences on your doorstep. Venture to the famous Hanifaru Bay UNESCO World Biosphere Reserve or hop over to Vaadhoo Island, one of the best spots to witness the spectacular ‘Sea of Stars’ phenomenon, an extraordinary sight to behold.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Raa Atoll",
    "offer_geo_area_level_2": "Kothaifaru",
    "location_heading": "Kothaifaru Island",
    "location_subheading": "Maldives",
    "location_description": "Alila Kothaifaru Maldives",
    "offer_address": "Kothaifaru Island",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 4139.0,
    "value": 9223.0
  }
]