[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xv07AAA",
    "hero_image": "https://images.luxuryescapes.com/kodr2gqruvdy8p8env",
    "image_two": "https://images.luxuryescapes.com/v2ncrhfgllbj5fyhopbv",
    "image_three": "https://images.luxuryescapes.com/ruwdtl5uami53lexiu2t",
    "vendor_name": "Mamaka by Ovolo",
    "title": "Bali's First-Ever Beachfront Resort by Ovolo with Daily Breakfast, Daily Lunch or Dinner & Nightly Sunset Cocktails",
    "description": "If it’s a Bali escape that you have been dreaming about, there is just one name you need to know - Mamaka by Ovolo - a newly opened urban resort right in the beating heart of Kuta Legian. Drop your bags and arrive at this ultra-cool, beachside haven complete with all the cutting-edge Ovolo touches you would expect from this renowned collection of hotels.\n\nWith an unrivalled location, glittering Mamaka Rooftop Bar & Pool with ocean views, 24-hour wellness zone and Street 32, a vibrant split-level restaurant slinging classic Asian dishes with a modern spin, there is no better place to stay. Budding surfers can hit the Quicksilver Bali Surf Academy to ride waves like a pro, shopping enthusiasts can get their fix at the Kuta Art Market or the Legian Shopping District just a short walk away, and coffee lovers can get their caffeine fix at Street 32's One Pink Goat café, serving up lattes that are practically an art on the Espresso Deck. When you want to delve into the history and culture of this incredible island, visit the Uluwatu Temple or, for a change of scenery, the magical rainforest and terraced rice paddies of Ubud, both of which are within an hours’ drive.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Kuta Legian",
    "location_subheading": "Bali",
    "location_description": "Mamaka by Ovolo",
    "offer_address": "Jl. Pantai Kuta No.32, Legian, Kuta, Kabupaten Badung, Bali 80361, Indonesia",
    "percentage_discount": 38.0,
    "min_duration": 7,
    "max_duration": 20,
    "price": 639.0,
    "value": 1031.0
  }
]