[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GwrmLAAR",
    "hero_image": "https://images.luxuryescapes.com/xzrjbe65yee59x1zovue",
    "image_two": "https://images.luxuryescapes.com/db731xtlif51yeovw8oi",
    "image_three": "https://images.luxuryescapes.com/8g8t4bm18vu36ur5psl",
    "vendor_name": "Hotel Ultimate Provence",
    "title": "Boutique Provence Spa Escape with Daily Breakfast, Vineyard Tours & Wine Tasting",
    "description": "The romance of southern France is undeniable and best enjoyed from the luxurious Ultimate Provence, a boutique spa-cation hidden among the vineyards in sun-kissed Var. The hotel is located on a pristine 113-acre wine estate: while you're here, enjoy a tasting or two in the tasting room or learn from master sommeliers at the ultra-modern winery. Gourmet food and fine wine go hand in hand, and at UP Restaurant, you can indulge in the chef's innovative creations, crafted from ingredients that highlight the flavours of the region. Spend your time soaking up the sunshine by the pool, enjoying a friendly volleyball game and hiking through the hinterland.\n\nDesigned for the utmost relaxation, UP Spa offers massages by the vines and outdoor yoga sessions on the hotel grounds. This hidden haven is a stone's throw from the glamour of Saint-Tropez and the pristine beaches of the Côte d'Azur, or venture a little further along the coast to Cannes and Nice. On your way to and from these elegant cities, stop in at the various hilltop villages, romantic castles and boutique stores.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Provence - Alpes - Cote d'Azur",
    "offer_geo_area_level_2": "La Garde-Freinet",
    "location_heading": "La Garde-Freinet",
    "location_subheading": "France",
    "location_description": "Ultimate Provence",
    "offer_address": "7270 Route du Luc, 83680 La Garde-Freinet, France",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 309.0,
    "value": 990.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009Bn5xAAC",
    "hero_image": "https://images.luxuryescapes.com/3k557uj5mjsi2myuh1ae",
    "image_two": "https://images.luxuryescapes.com/xe9cc3ihkjq411bsyei",
    "image_three": "https://images.luxuryescapes.com/s5q5j4elnhxga67ae3sa",
    "vendor_name": "Hotel Ultimate Provence",
    "title": "Boutique Provence Vineyard Escape with Wine Tasting Room",
    "description": "The romance of southern France is undeniable, best enjoyed from your base at Hôtel UP Ultimate Provence, a boutique spa-cation hidden among the vineyards in sun-kissed Var. The hotel is located on a 113-acre wine estate: while you're here, enjoy a tasting or two in the tasting room or learn from master sommeliers at the ultra-modern winery. Good food and wine go hand in hand, and at UP Restaurant, indulge in the chef's innovative creations crafted from seasonal and locally sourced ingredients.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Provence - Alpes - Cote d'Azur",
    "offer_geo_area_level_2": "La Garde-Freinet",
    "location_heading": "La Garde-Freinet",
    "location_subheading": "France",
    "location_description": "Hôtel UP Ultimate Provence",
    "offer_address": "7270 Route du Luc, 83680 La Garde-Freinet, France",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 132.0,
    "value": 132.0
  }
]