[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lk2PAAQ",
    "hero_image": "https://images.luxuryescapes.com/h4kb9nlyppcu2nlyruwa",
    "image_two": "https://images.luxuryescapes.com/zwr41caieifo22h42tel",
    "image_three": "https://images.luxuryescapes.com/8s0sbajend4jt94n8tde",
    "vendor_name": "Das Holzhaus",
    "title": "Luxury Group Chalet Escape near Thredbo & the Snowy Mountains for up to 8 Guests",
    "description": "Bid farewell to towering buildings and escape the city for the spectacular Snowy Mountains with a blissful stay at das Holzhaus - a three-bedroom luxury chalet in Lake Crackenback, with room for up to eight guests. Built in 2020, this luxe home begs for early mornings spent watching kangaroos or deer roam across the lawn with a steaming cup of coffee, days filled with outdoor adventures and cosy nights by the fireplace with a glass of wine (or two).\n\nInside this bushland oasis, you will find all the makings of an unforgettable escape. Accommodate a group of friends or family with two living areas, a fireplace and supplied wood, kitchen equipped with Bosch appliances, Nespresso coffee machine, and large dining table. No two rooms are the same, yet each is designed to make you feel instantly at home thanks to warm earthy tones that reflect the surrounding environment and expansive windows throughout to showcase the spectacular views of the surrounding bush. With access to resort facilities including an indoor heated pool, gym and sauna, tennis courts, and nine-hole disc golf, this exceptional stay makes for a perfect escape with friends or family in the glorious alpine region, whether you're in town for the ski season or summer.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Crackenback",
    "location_heading": "Lake Crackenback",
    "location_subheading": "New South Wales",
    "location_description": "Das Holzhaus",
    "offer_address": "4 Stockwhip Way, Lake Crackenback NSW 2627",
    "percentage_discount": 25.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 2078.0,
    "value": 2763.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VkEqAAK",
    "hero_image": "https://images.luxuryescapes.com/sl4qbep667sqjpoovj6r",
    "image_two": "https://images.luxuryescapes.com/3orff7no3fm8q4sdpx5",
    "image_three": "https://images.luxuryescapes.com/0a3pm1l9h701q4i5tpj6",
    "vendor_name": "Das Holzhaus",
    "title": "Luxury Group Chalet Escape near Thredbo & the Snowy Mountains for up to 8 Guests",
    "description": "Bid farewell to towering buildings and escape the city for the spectacular Snowy Mountains, with a blissful stay at das Holzhaus - a three-bedroom, luxury chalet in Lake Crackenback, with room for up to eight guests.\n\nNewly built in 2020, this luxe home begs for early mornings spent watching kangaroos or deer roam across the lawn with a steaming cup of coffee in hand, days filled with outdoor adventures and cosy nights by the fireplace with a glass of wine (or two).\n\nInside this bushland oasis, you will find all the makings for an unforgettable escape to accommodate a large group of friends or family, with two living areas, a fireplace and supplied wood, a kitchen equipped with Bosch appliances, a Nespresso coffee machine and a large dining table. No two rooms are the same, yet each one is designed to make you feel instantly at home, thanks to warm earthy tones that reflect the surrounding environment and expansive windows throughout to showcase the spectacular views of the surrounding bush. This exceptional stay is sure to leave a lasting impression and makes for a perfect escape with friends or family in the glorious alpine region, whether you're in town for the ski season or the summer.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Crackenback",
    "location_heading": "Lake Crackenback",
    "location_subheading": "New South Wales",
    "location_description": "Das Holzhaus",
    "offer_address": "4 Stockwhip Way, Lake Crackenback NSW 2627",
    "percentage_discount": 20.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 1826.0,
    "value": 2287.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQXSsAAP",
    "hero_image": "https://images.luxuryescapes.com/k7gn7smn1s0a801ebk5",
    "image_two": "https://images.luxuryescapes.com/et1l7vj1l8rp1bcu0yd6",
    "image_three": "https://images.luxuryescapes.com/zappjbumpm6r0wjk03h",
    "vendor_name": "Das Holzhaus",
    "title": "Luxury Group Chalet Escape near Thredbo & the Snowy Mountains for up to Six Guests with Welcome Champagne",
    "description": "Escape the city for the spectacular Snowy Mountains in New South Wales with a blissful stay at das Holzhaus - a three-bedroom luxury chalet in Lake Crackenback, with room for up to six guests. This luxe home begs for early mornings with a steaming cup of coffee, days filled with outdoor adventures and cosy nights by the fireplace with a glass of wine. Accommodate a group of friends or family with two living areas, a fireplace, kitchen, a Nespresso coffee machine, and a large dining table. With access to resort facilities including an indoor heated pool, sauna, and tennis courts, this exceptional stay makes for a perfect alpine escape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Crackenback",
    "location_heading": "Lake Crackenback",
    "location_subheading": "New South Wales",
    "location_description": "Das Holzhaus",
    "offer_address": "4 Stockwhip Way, Lake Crackenback NSW 2627",
    "percentage_discount": 33.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 2274.0,
    "value": 3411.0
  }
]