[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EcEbAAK",
    "hero_image": "https://images.luxuryescapes.com/ted3ldduie9wrlq72pks",
    "image_two": "https://images.luxuryescapes.com/b8eisjiuq3hoxf4dymm",
    "image_three": "https://images.luxuryescapes.com/djwpleni9jril162s58",
    "vendor_name": "Lakestone Lodge",
    "title": "Lake Pukaki Exclusive Lodge Escape for up to 12 Guests with Gourmet Dining",
    "description": "Leave it all behind for the awe-inspiring natural beauty of Lake Pukaki, located between Queenstown and Christchurch on New Zealand’s South Island. Gather your closest friends and family and enjoy exclusive use of this stunning lakeside lodge, an unforgettable escape for up to 12 people. The entire property is reserved just for you, giving you exclusive access to all lodge facilities and six plush king bedrooms. \n\nRelax and unwind while soaking up some of New Zealand’s best views - including stunning vistas of Mount Cook - stargaze beneath one of the clearest skies in the world from the comfort of your private lake-view bathtub, and indulge in decadent food crafted with fresh, locally sourced produce.\n\nBe greeted with welcome chocolates and a signature cocktail on arrival, enjoy delicious daily home-cooked breakfast, an indulgent three-course dinner featuring local produce on your first night and a picnic lunch to be enjoyed in the privacy of your lakeside lodge.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "",
    "location_heading": "Lake Pukaki",
    "location_subheading": "New Zealand",
    "location_description": "Lakestone Lodge - May 2020",
    "offer_address": "4589, Tekapo-Twizel Rd, Lake Pukaki, Twizel 7944, New Zealand",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 2879.0,
    "value": 5155.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UJ1dGQAT",
    "hero_image": "https://images.luxuryescapes.com/q9lb5sf0jiap5rxwhsgj",
    "image_two": "https://images.luxuryescapes.com/asctfltemkmnzmgm4ofy",
    "image_three": "https://images.luxuryescapes.com/rp8gbdlqpqal2xv5u1bi",
    "vendor_name": "Lakestone Lodge",
    "title": "The Best Views in New Zealand",
    "description": "Leave it all behind for the awe-inspiring natural beauty of Lake Pukaki, located between Queenstown and Christchurch in New Zealand’s South Island. Relax and unwind whilst soaking up some of New Zealand’s best views - including stunning views of Mount Cook - with four days/three nights at the spectacularly-located Lakestone Lodge. Enjoy daily à la carte breakfasts, a three-course dinner, Tekapo Springs pass,  welcome chocolates and signature cocktails on arrival for two.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "",
    "location_heading": "Lake Pukaki",
    "location_subheading": "New Zealand",
    "location_description": "Lakestone Lodge - OLD",
    "offer_address": "4589, Tekapo-Twizel Rd, Lake Pukaki, Twizel 7944, New Zealand",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 637.0,
    "value": 1171.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lp4yAAC",
    "hero_image": "https://images.luxuryescapes.com/rihfplxkvropbwnxazib",
    "image_two": "https://images.luxuryescapes.com/gzx6xx81xr9mmcz8oo7g",
    "image_three": "https://images.luxuryescapes.com/392q98wkoai1w0s6ti89",
    "vendor_name": "Lakestone Lodge",
    "title": "Lake Pukaki Lodge Escape with Gourmet Dining & Hot Springs Access",
    "description": "Leave it all behind for the awe-inspiring natural beauty of Lake Pukaki, located between Queenstown and Christchurch on New Zealand’s South Island. Relax and unwind while soaking up some of New Zealand’s best views - including stunning vistas of Mount Cook - with a romantic escape at the spectacularly located Lakestone Lodge. Picture yourself stargazing in one of the clearest skies in the world from the comfort of your private lake-view bathtub, and indulging in decadent food crafted with fresh, locally-sourced produce.\n\nBe greeted with welcome chocolates and a signature cocktail on arrival, and enjoy delicious daily home-cooked breakfasts and an indulgent three-course dinner featuring local produce on your first night. Plus, make the most of the great outdoors with a pass for the gorgeous Tekapo Springs.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "",
    "location_heading": "Lake Pukaki",
    "location_subheading": "New Zealand",
    "location_description": "Lakestone Lodge - May 2020",
    "offer_address": "4589, Tekapo-Twizel Rd, Lake Pukaki, Twizel 7944, New Zealand",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 584.0,
    "value": 879.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HRmxAAG",
    "hero_image": "https://images.luxuryescapes.com/c5tosa1y23xnm13dto6",
    "image_two": "https://images.luxuryescapes.com/6ud9zbrlrf4m0sssqkb6",
    "image_three": "https://images.luxuryescapes.com/pno9etaxfi5nvmes3fg",
    "vendor_name": "Lakestone Lodge",
    "title": "Off-the-Grid Lake Pukaki Escape with Gourmet Dining & Hot Springs Access",
    "description": "Imagine stargazing from your bathtub under one of the clearest skies in the world, marvelling as the sun melts over the awe-inspiring Aoraki/Mt Cook and watching the rippling reflections in the stunning turquoise waters of Lake Pukaki: welcome to the blissfully majestic Lakestone Lodge. Blending into the hillside above the glistening lake, this serene, off-grid lodge promises romantic seclusion like nowhere else, with a mere six boutique rooms onsite.\n\nLeave it all behind for the awe-inspiring natural beauty of this spectacular hideaway, where you will be treated to lake views from every luxuriously appointed guest room, gourmet, locally sourced produce, an impressive cinema room with a giant screen, complimentary use of bicycles, a massage therapy room with a range of treatments available, and a location that could see you whisked into the mountains by helicopter in minutes (additional costs apply).\n\n**Your handpicked inclusions:**\n\n- Be greeted with welcome chocolates and a signature cocktail on arrival\n- Enjoy delicious daily home-cooked breakfasts in the main dining room, your private guest room or outside in the courtyard\n- Savour an indulgent three-course dinner featuring local produce on your first night\n- Unwind with one pass per person for the gorgeous Tekapo Springs hot pools \n- Hit the snow with a one-time ice skating and snow tubing at Tekapo Springs (between June and October) or go exploring with a gourmet picnic lunch for two (between November and May)",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Pukaki",
    "location_heading": "Lake Pukaki",
    "location_subheading": "New Zealand",
    "location_description": "Lakestone Lodge",
    "offer_address": "4589 Tekapo-Twizel Rd, Lake Pukaki, Twizel 7944, New Zealand",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 639.0,
    "value": 950.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000043PGWAA2",
    "hero_image": "https://images.luxuryescapes.com/caudxur0fohycfassql",
    "image_two": "https://images.luxuryescapes.com/hd5mulz5smg4l220wil",
    "image_three": "https://images.luxuryescapes.com/8xwaiicjkfbyfil30ho",
    "vendor_name": "Lakestone Lodge",
    "title": "Secluded Lake Pukaki Lodge Escape with Gourmet Dining & Hot Springs Access",
    "description": "Imagine stargazing from your bathtub under one of the clearest, starriest skies in the world, and watching the sunset over the awe-inspiring Aoraki/Mt Cook, reflected in the stunning turquoise waters of Lake Pukaki: welcome to the majestic Lakestone Lodge. Set against the glorious Lake Pukaki, this serene, off-grid lodge promises romantic seclusion like nowhere else with a mere six rooms onsite.\n\nLeave it all behind for the awe-inspiring natural beauty of this boutique hideaway, where you will be treated to lake views from every luxuriously appointed guestroom, gourmet, locally-sourced produce, an impressive cinema room with a giant screen and a choice of films, and a location that could see you whisked into the mountains by helicopter in minutes (additional costs apply).",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "",
    "location_heading": "Lake Pukaki",
    "location_subheading": "New Zealand",
    "location_description": "Lakestone Lodge - Nov 2020",
    "offer_address": "4589, Tekapo-Twizel Rd, Lake Pukaki, Twizel 7944, New Zealand",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 599.0,
    "value": 931.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Zovz5QAB",
    "hero_image": "https://images.luxuryescapes.com/zxbmtney9thwx7odjbmo",
    "image_two": "https://images.luxuryescapes.com/eynp61jl59kpughs2vd7",
    "image_three": "https://images.luxuryescapes.com/qiqpnmtotvhpq5uzxf3q",
    "vendor_name": "Lakestone Lodge",
    "title": "Romantic Off-The-Grid Escape with New Zealand's Best Views",
    "description": "Leave it all behind for the awe-inspiring natural beauty of Lake Pukaki, located between Queenstown and Christchurch in New Zealand’s South Island. Relax and unwind whilst soaking up some of New Zealand’s best views - including stunning views of Mount Cook - with a getaway at the spectacularly-located Lakestone Lodge. Picture yourself stargazing in one of the clearest skies in the world, from the comfort of your private bathtub. Enjoy a delicious three-course dinner featuring local produce, daily breakfast, a pass for the gorgeous Tekapo Springs and be greeted with welcome chocolates and signature cocktail on arrival.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "",
    "location_heading": "Lake Pukaki",
    "location_subheading": "New Zealand",
    "location_description": "Lakestone Lodge 2019",
    "offer_address": "4589, Tekapo-Twizel Rd, Lake Pukaki, Twizel 7944, New Zealand",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 541.0,
    "value": 835.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ex1JOAAZ",
    "hero_image": "https://images.luxuryescapes.com/dz3dldrkudt6r2o76ma",
    "image_two": "https://images.luxuryescapes.com/9pv2qemdxf9ds3na01u7",
    "image_three": "https://images.luxuryescapes.com/3eumlnqdbleuzs5efx98",
    "vendor_name": "Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection",
    "title": "New Zealand Five-Star Lake Pukaki Boutique Estate with Private Villas",
    "description": "Immerse yourself in New Zealand’s pristine nature with a stay at the luxurious five-star Mt Cook Lakeside Retreat, High Country Estate - boasting uninterrupted views of Lake Pukaki and the surrounding mountain ranges. Experience utmost seclusion with a private villa stay, and indulge in a romantic evening beneath the canopy of stars at the estate's observatory, with the piece de resistance being the garden-to-plate dining at Moraine Lodge restaurant with a grand degustation menu.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Ben Ohau",
    "location_heading": "Lake Pukaki",
    "location_subheading": "New Zealand",
    "location_description": "Mt Cook Lakeside Retreat, High Country Estate",
    "offer_address": "86 Mount Cook Road (SH80), Lake Pukaki, South Canterbury 7944, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1443.0,
    "value": 1443.0
  }
]