[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GfkEvAAJ",
    "hero_image": "https://images.luxuryescapes.com/rc5yf31ledmio0pjg43b",
    "image_two": "https://images.luxuryescapes.com/unf44qllicpqtb7p53tw",
    "image_three": "https://images.luxuryescapes.com/gx5h2xrgg8flydfon3kt",
    "vendor_name": "Le Méridien Maldives Resort & Spa",
    "title": "Five-Star Maldives Villas with All-Inclusive Daily Dining, Free-Flow Drinks & Roundtrip Seaplane Transfers",
    "description": "Melt into shimmering shades of Maldivian blue on your very own private island at Le Méridien Maldives Resort & Spa. This five-star sanctuary is nestled on the stunning Thilamaafushi Island, covering nine hectares and surrounded by nothing but the glimmering lagoon and lush tropical greenery. Discover families of sea creatures, including turtles and rays in the vibrant coral caves, have fun with an array of water sports or simply unwind with a treatment at Explore Spa. With all of your meals covered, you're sure to discover a new favourite at one of the resort's world-class restaurants: indulge in a distinct Japanese dining experience at Tabemasu, savour Spanish tapas at Riviera Tapas & Bar or enjoy grilled delicacies as the sun sets at Velaa Bar + Grill.\n\nChase your dreams of endless summer at this untouched paradise, with every corner waiting to be explored. Visit the resort's marine conservation hub, enjoy a romantic candlelit dinner on the sand or wander the island's perimeter - the options are boundless. Should you choose to stay in, each mid-century, European-style villa boasts opulent interiors and dazzling views, creating the perfect space to invigorate your soul. Rest easy with roundtrip seaplane transfers so you can make the most of your Maldivian retreat.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Lhaviyani Atoll",
    "offer_geo_area_level_2": "Thilamaafushi Island",
    "location_heading": "Lhaviyani Atoll",
    "location_subheading": "Maldives",
    "location_description": "Le Méridien Maldives Resort & Spa",
    "offer_address": "Thilamaafushi, Lhaviyani Atoll 07040, Maldives",
    "percentage_discount": 44.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 3539.0,
    "value": 6342.0
  }
]