[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BexgKAAR",
    "hero_image": "https://images.luxuryescapes.com/86fc81blano5qmay4wp",
    "image_two": "https://images.luxuryescapes.com/istiigoeja8s8nlasb",
    "image_three": "https://images.luxuryescapes.com/qopb7e0ivryysem6jfhk",
    "vendor_name": "Selong Selo Resort & Residences",
    "title": "Lombok Cliffside Hideaway with Private Pool, Massages & Daily Dining",
    "description": "Lombok luxury awaits at the boutique Selong Selo Resort and Residences, breathtakingly positioned upon jungle-clad clifftops with spectacular views of the vast ocean blues below. The resort’s eco-friendly studios and villas all showcase Seminyak-inspired beach cool, with artisanal furniture, Indonesian sculpture and private infinity pools that blend seamlessly into the horizon. Embrace euphoria at the spa, take to Selong Belanak Beach’s famed surf-kissed sands - easily accessible by complimentary shuttle - or dine on local specialities at Aura Bar and Lounge, accompanied by dreamy sunset views.\n\nHere, Lombok’s mysteries and marvels are open to you: the island’s southern coast is renowned for its first-class fishing and the thunderous waterfalls of the north are unquestionably magnificent. Whatever your plans, the resort's top-notch concierge will work tirelessly to assist you in enjoying the Indonesian escape of a lifetime.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Praya Barat",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Selong Selo Resort and Residences",
    "offer_address": "Jalan Batu Jangkih Sepi, Mungkung, Mangkung, Kec. West Praya Bar., Kabupaten Lombok Tengah, Nusa Tenggara Bar. 83571, Indonesia",
    "percentage_discount": 41.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 620.0,
    "value": 1044.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjcJAAS",
    "hero_image": "https://images.luxuryescapes.com/jw7z61eyfbmr1c84sc5",
    "image_two": "https://images.luxuryescapes.com/h8zp5jsuv9hx1ihxdptdi",
    "image_three": "https://images.luxuryescapes.com/co6raczsg3mfh5bnvyd",
    "vendor_name": "Novotel Lombok Resort and Villas",
    "title": "Secluded Beachfront Paradise in Lombok with Daily Dining - Two Kids Stay Free",
    "description": "Escape to Bali’s pristine sister island Lombok for a serene beachfront escape among the white sands, aquamarine waters and lush fringed palm trees of this gorgeous tropical island. Check-in and chill out at the Novotel Lombok Resort & Villas and enjoy a wealth of inclusions such as daily breakfast, massages, dining experiences, cocktails and authentic local experiences including an Indonesian cooking lesson, monkey feeding and more. Travelling with kids? Check out the family package, with up to two children aged 12 years and under staying for free.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Novotel Lombok Resort and Villas",
    "offer_address": "Pantai Putri Nyale, Kuta, Pujut, Kabupaten Lombok Tengah, Nusa Tenggara Bar. 83001, Indonesia",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 286.0,
    "value": 733.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gv1tWAAR",
    "hero_image": "https://images.luxuryescapes.com/x6r7d1f6pu56oz59w4",
    "image_two": "https://images.luxuryescapes.com/49wxj3gz2oeu1vjqhed",
    "image_three": "https://images.luxuryescapes.com/671a1k3r7ew9vjg35o6",
    "vendor_name": "Kalandara Resort",
    "title": "Idyllic Lombok Clifftop Pool Villas with Daily Breakfast, Nightly Dinner, Cocktails & Massages",
    "description": "Surrender to the call of the ocean and answer your dreams of an Indonesian escape at Kalandara Resort, a boutique hillside oasis looking out over the shores of Lombok. Where modern comforts meet traditional charm, escape to your villa between the palm trees for endless sunny days lounging by your private infinity pool. Embrace the promise of serenity at Kalandara Spa, and indulge in a diverse menu of local fare at Kalandara Restaurant. When it's time to venture out, Senggigi is right at your fingertips with its beaches perfect for surfing and snorkelling and a selection of uber cool bars and restaurants.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Kalandara Resort",
    "offer_address": "Jalan Raya Senggigi, Mangsit, Lombok Barat 83355, Indonesia",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 459.0,
    "value": 1448.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zWQxAAM",
    "hero_image": "https://images.luxuryescapes.com/c8qhq5kr0bu3moi6wjn",
    "image_two": "https://images.luxuryescapes.com/vcfgzcgsqxrnnt6zsx",
    "image_three": "https://images.luxuryescapes.com/41rx8e9f4w68ytv244p",
    "vendor_name": "Jeeva Klui Resort - Lombok",
    "title": "Lombok’s East & West: Combo Resort & Eco Beach Camp Stay with All-Inclusive Dining, Daily Cocktails & Transfers",
    "description": "Unearth the treasures of Lombok with a two-in-one stay at sister resorts Jeeva Klui and Jeeva Beloam Beach Camp. Split your time between these two stunning beachfront properties, designed to encapsulate the soul of Bali's sister island. Perfectly positioned along an uninterrupted stretch of sand, both Jeeva Klui Resort and Jeeva Beloam Beach Camp offer a beautiful blend of local culture, exemplary service and tropical surrounds.\n\nFind everything you need for a serene escape at Jeeva Klui Resort (in Lombok's west), where you can spend days swimming in the warm surf of the Indian Ocean, gazing into the endless horizon from the infinity pool or relaxing with a treatment at the luxurious resort spa. Move on to the island's east and unique hideaway Jeeva Beloam Beach Camp, where you can get lost within 55 hectares of luscious forest fringed by white-sand beaches. Without the distraction of Wi-Fi and TVs, this unique eco-retreat invites you to go off-grid and switch off from the world.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Jeeva Klui Resort",
    "offer_address": "Jalan Pantai Klui No. 1, Senggigi, West Nusa Tenggara, Lombok 83355 Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 959.0,
    "value": 2301.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cIyIbQAK",
    "hero_image": "https://images.luxuryescapes.com/hw1c4iph7hi6vw49zd",
    "image_two": "https://images.luxuryescapes.com/osj4ce3liugnsj6s8",
    "image_three": "https://images.luxuryescapes.com/a8ogilrt20deit3mfq",
    "vendor_name": "Selong Selo Resort & Residences",
    "title": "Private Pool Villa Bliss with Decadent Dining Experiences",
    "description": "Escape to Selong Selo Resort & Residences in Lombok - Bali’s pristine sister island - for a serene beachfront escape amidst the white sands, aquamarine waters and lush fringed palm trees of this gorgeous tropical oasis. Included in your escape is daily breakfast and afternoon tea, two delicious two-course dining experiences at Aura Lounge & Bar, a luxurious 60-minute massage, daily sunset cocktail and so much more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Praya Barat",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Selong Selo Resort and Residences",
    "offer_address": "Jalan Batu Jangkih Sepi, Mungkung, Mangkung, Kec. West Praya Bar., Kabupaten Lombok Tengah, Nusa Tenggara Bar. 83571, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 886.0,
    "value": 1843.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GeIUuAAN",
    "hero_image": "https://images.luxuryescapes.com/8xqbs0uwnp7ho6rgj67a",
    "image_two": "https://images.luxuryescapes.com/zxat6p5dhzwnejbv8t",
    "image_three": "https://images.luxuryescapes.com/2gkylb8yfkp4gdpymzfu",
    "vendor_name": "Somewhere Lombok",
    "title": "Luxury Lombok Villa Hideaway with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Discover Somewhere Lombok, a luxury hideaway boasting bespoke villas with private plunge pools overlooking the pristine bay below. This intimate sanctuary is nestled alongside a world-class surf beach framed by lush palm trees, creating a haven of tranquility. Immerse yourself in the beauty of this idyllic destination as you hit the waves or simply relax poolside, taking in the stunning valley and sea views. Start your day practising mindfulness with a morning yoga session, followed by locally sourced international fusion cuisine.\n\nWhen you’re ready to explore, catch the daily shuttle to downtown Kuta or experience Lombok’s countless treasures, from the towering Mount Rinjani to the postcard-perfect beaches and coral reefs of the nearby Gili Islands. Wind down your day by sinking into a cosy beanbag chair while watching a gorgeous sunset set the sky blazing with hues of burnt orange, bubblegum pink and deep red.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Somewhere Lombok",
    "offer_address": "Gili Nusa Estate, Prabu, Pujut, Lombok Tengah, Nusa Tenggara Barat 83572, Indonesia",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 499.0,
    "value": 2048.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ey6clAAB",
    "hero_image": "https://images.luxuryescapes.com/aqbx0725sj3q7f5fyffl",
    "image_two": "https://images.luxuryescapes.com/hk4nod8z9ei25teoxs",
    "image_three": "https://images.luxuryescapes.com/kxck0ezr807hktv3ear",
    "vendor_name": "Qunci VIllas",
    "title": "Lombok Five-Star Beachfront Retreat with Daily Breakfast, Nightly Dinner, Massages & One-Way Airport Transfer",
    "description": "Immerse yourself in the beach-blessed beauty of Bali's sister island with a boutique escape at Qunci Villas, perfectly poised on Senggigi's Mangsit Beach. This serene hideaway offers the utmost luxury and privacy, backed by five-star hospitality and spectacular hilltop views of the shining Bali Sea. Perfect for those who want to soak up the serenity, the property's exceptional facilities include three dining options - savour exquisite Indonesian favourites at the open-air Quali Asian Dining, local fresh-caught seafood served with fine-dining flair at Qerang and seaside Italian bites at NooQ Sunset Bar & Lounge.\n\nThere's no better place to find your island spirit - relax on the beachfront, slip into one of three shimmering swimming pools (including an adults-only pool) or indulge in wellness treatments inspired by ancient Javanese methods at Qamboja Spa. When you're ready to explore, this villa oasis is the perfect base for discovering the renowned Gili Islands, where underwater kingdoms promise snorkelling and scuba adventures beyond compare.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Qunci Villas",
    "offer_address": "Jalan Raya Senggigi, West Lombok, West Nusa Tenggara 83355, Indonesia",
    "percentage_discount": 77.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 299.0,
    "value": 1280.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LmX8AAK",
    "hero_image": "https://images.luxuryescapes.com/noc920zg672qxsmgib",
    "image_two": "https://images.luxuryescapes.com/5mnp9l41a7s2hzfvkd8c",
    "image_three": "https://images.luxuryescapes.com/qqr03tsw2cnsqf3fh8",
    "vendor_name": "The Kayana Beach - Lombok",
    "title": "Grand Opening: Lombok Pool Villa Sanctuary with Nightly Dinner & Cocktails",
    "description": "This isn’t Lombok as you know it: discover unparalleled seclusion, tranquillity and luxury, hidden within a bay close to the pristine Gili Islands and in the shadow of Mount Rinjani, at The Kayana Beach Lombok. Be amongst the first to experience this brand new paradise of just 34 private villas cocooned by nodding palm trees and mesmerising turquoise waters with a central pool overlooking the horizon for the ultimate sunset vistas - the perfect place to sip your daily cocktail. Relax in a Deluxe Villa with a private pool with daily breakfast, nightly three-course dinner, afternoon tea daily, one 60-minute massage per adult, a convenient one-way transfer and late checkout, subject to availability. \n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Pemenang",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "The Kayana Beach Lombok",
    "offer_address": "Jl. Raya Senggigi, Kecinan, Pemenang, Lombok Utara, Nusa Tenggara Barat, Lombok 83352, Indonesia",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 435.0,
    "value": 1360.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4b9WQAR",
    "hero_image": "https://images.luxuryescapes.com/prygr4f3nunxremynvxy",
    "image_two": "https://images.luxuryescapes.com/ehu43ewrgqvmyiayp0pf",
    "image_three": "https://images.luxuryescapes.com/hq6u2nfcwjzupliql5xc",
    "vendor_name": "Wyndham Sundancer Resort Lombok",
    "title": "Relax & Indulge by the Ocean with Nightly Dinner, Cocktails, Massages & More",
    "description": "Escape to Lombok - Bali’s pristine sister island - for a serene beachfront escape amidst the white sands, aquamarine waters and lush fringed palm trees of this gorgeous tropical island, staying at the brand new Wyndham Sundancer Resort Lombok. Stay in a huge suite with your choice of two-course lunch or dinner daily, daily breakfast, daily afternoon tea, a daily cocktail each, a relaxing 60-minute massage per person, return airport transfers and guaranteed late checkout at 1pm.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Nusa Tenggara Barat",
    "offer_geo_area_level_2": "Kabupaten Lombok Barat",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Wyndham Sundancer Resort Lombok 2018",
    "offer_address": "Raya Pandanan, West Sekotong, Lombok, Indonesia 83365",
    "percentage_discount": 61.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 615.0,
    "value": 1586.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008hIlFAAU",
    "hero_image": "https://images.luxuryescapes.com/okfu38zjjio5xde3p34",
    "image_two": "https://images.luxuryescapes.com/thtti6041tcui7nyjsq8",
    "image_three": "https://images.luxuryescapes.com/2lzocslq5o45bswd2v2bd",
    "vendor_name": "Qunci VIllas",
    "title": "Lombok Beachfront Retreat with Daily Breakfast, Daily Lunch or Dinner & Massages",
    "description": "Immerse yourself in the beach-blessed beauty of Bali's sister island with a boutique escape at Qunci Villas, perfectly poised on Mangsit Beach, around five minutes from Senggigi's centre and a short boat ride to the breathtaking Gili Islands. Ranked among Tripadvisor’s top 10% of properties worldwide, this serene island hideaway offers the utmost in luxury and privacy.\n\nPerfect for those who want to soak up the serenity, the property's exceptional facilities include three dining options: Italian and Indonesian open-air restaurants and a casual waterfront tapas bar. There's also a blissful spa, three impressive swimming pools to choose from - including an infinity pool and adults-only pool - and direct beach access.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Qunci Villas",
    "offer_address": "Jalan Raya Senggigi, West Lombok, West Nusa Tenggara 83355, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 519.0,
    "value": 1202.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2CWCQA3",
    "hero_image": "https://images.luxuryescapes.com/bojdbwg9rkhuloqz9ann",
    "image_two": "https://images.luxuryescapes.com/vzm8wu6mvk493ucygwhj",
    "image_three": "https://images.luxuryescapes.com/hmygrzdomtmguxaopgpa",
    "vendor_name": "Hotel Tugu Lombok",
    "title": "Relaxing Island Break in Boutique Beachside Bungalow",
    "description": "Escape to Hotel Tugu in Lombok - Bali’s pristine sister island - for a serene beachfront escape amidst the white sands, aquamarine waters and lush palm trees of this gorgeous tropical oasis. The artsy hotel is peppered with Indonesian antiques and artwork, paying homage to the area’s culture and history. Your escape includes daily à la carte breakfast, two three-course dinners, one cocktail per person, a 60-minute massage each and more. Travelling with kids? Two children aged ten years and under stay free with breakfast.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Nusa Tenggara Barat",
    "offer_geo_area_level_2": "Kabupaten Lombok Utara",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Hotel Tugu Lombok 2019",
    "offer_address": "Jl. Pantai Sire, Desa Sigar Penjalin, Kecamatan Tanjung, Sigar Penjalin, Tanjung, Kabupaten Lombok Utara, Nusa Tenggara Bar. 83352, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 799.0,
    "value": 1867.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DLfOrYAL",
    "hero_image": "https://images.luxuryescapes.com/5es4zfzjtul09vbb1qd",
    "image_two": "https://images.luxuryescapes.com/otour8f9lrpep060tqcg",
    "image_three": "https://images.luxuryescapes.com/kqzc7rltuinu1gbapnd2",
    "vendor_name": "Somewhere Lombok",
    "title": "Luxury Lombok Villa Hideaway with Daily Breakfast, Daily Free-Flow Cocktail Hour & Massages",
    "description": "Discover a luxury hideaway in Lombok, featuring bespoke villas with private plunge pools overlooking a pristine bay. This intimate sanctuary, set against the backdrop of a world-class surf beach and framed by lush palm trees, offers the perfect tranquil escape.\n\nImmerse yourself in nature's beauty as you hit the waves or simply relax poolside, taking in stunning valley and sea views. Enjoy locally sourced international fusion cuisine, sip on a refreshing sundowner cocktail and embrace tranquillity with ample opportunities for mindfulness and relaxation. End your day in a cosy beanbag chair, watching the sky ignite with the colours of a breathtaking sunset.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Somewhere Lombok",
    "offer_address": "Gili Nusa Estate, Prabu, Pujut, Lombok Tengah, Nusa Tenggara Barat 83572, Indonesia",
    "percentage_discount": 73.0,
    "min_duration": 4,
    "max_duration": 28,
    "price": 609.0,
    "value": 2221.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ic4U7AAJ",
    "hero_image": "https://images.luxuryescapes.com/x4kmonnsqgvg0zi3rhh",
    "image_two": "https://images.luxuryescapes.com/q4yhph1cum6p0jl1bebb",
    "image_three": "https://images.luxuryescapes.com/y652tf9izpewxxgwlr4o",
    "vendor_name": "Seven Secrets by Hanging Gardens",
    "title": "Lombok Suite Escape with All-Inclusive, Anytime Dining, Nightly Cocktails & Roundtrip Transfers",
    "description": "The serene tranquillity of Lombok has been reimagined at Seven Secrets by Hanging Gardens. This five-star oceanfront haven brings an added touch of elegance to all-inclusive indulgence. With interiors handpicked by renowned fashion designer Roberto Cavalli, including Italian Murano chandeliers and European travertine marble, and anywhere, anytime dining including breakfast, lunch and dinner all prepared by some of Indonesia's best chefs, it's the high-end retreat you've been dreaming of. Relax in beachfront cabanas you’ll never need to reserve and discrete butler service to cater to your every whim in this all-suite hideaway known for providing the finest level of impeccable service to guests with the highest standards.\n\nWhen you're not soaking in your suite's private jacuzzi, watch the sunset across the gleaming ocean each night from the sparkling infinity pool, retreat to L’Angelo Bianco to savour delicious all-day dining, or go reef diving and swimming in your own secluded slice of paradise, away from the crowds. As night falls, toast to perfect days with an evening cocktail at the buzzing Secret Beach Swim-Up Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Seven Secrets by Hanging Gardens",
    "offer_address": "Jl. Raya Pemenang No.KM 10, Malaka, Kec. Pemenang, Kab. Lombok Utara, Nusa Tenggara Barat, Indonesia",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 29,
    "price": 889.0,
    "value": 3657.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UySw1QAF",
    "hero_image": "https://images.luxuryescapes.com/umo4s8bsrr2jgfaopwhm",
    "image_two": "https://images.luxuryescapes.com/vly8zwub5qwnecbmbei3",
    "image_three": "https://images.luxuryescapes.com/fs0fgku3bupynforkgmp",
    "vendor_name": "Katamaran Resort",
    "title": "All-Inclusive Dining with Breathtaking Mount Agung Views",
    "description": "Escape to Lombok - Bali’s pristine sister island - for a serene beachfront escape amidst the white sands, aquamarine waters and lush fringed palm trees of this gorgeous tropical island. Stay right on the exquisite Mangsit Beach at Katamaran Hotel & Resort, where you can admire spectacular sunset views across to Bali’s Mount Agung. Your escape includes daily buffet breakfast, three-course lunch and dinner, a blissful 60-minute Balinese massage each and private return airport transfers from Lombok’s international airport.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Katamaran Hotel & Resort Lombok",
    "offer_address": "Jl. Raya Senggigi, Mangsit, Lombok 83355, Indonesia",
    "percentage_discount": 42.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 618.0,
    "value": 1073.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMjITAA1",
    "hero_image": "https://images.luxuryescapes.com/48g3ldty0ugu62tyss8",
    "image_two": "https://images.luxuryescapes.com/ykp7k8k3d5l342140a6",
    "image_three": "https://images.luxuryescapes.com/642avcmtq4f9mui15q",
    "vendor_name": "Seven Secrets by Hanging Gardens",
    "title": "Grand Reopening: Lombok Hanging Gardens Suite Escape with All-Inclusive Anytime Dining & Daily Cocktails",
    "description": "The serene tranquillity of Lombok has been reimagined at the recently reopened Seven Secrets by Hanging Gardens. Newly rebranded under the celebrated Hanging Gardens name (famed for its world-class Ubud, Bali retreat), this five-star oceanfront haven brings an added touch of elegance to all-inclusive indulgence. With interiors handpicked by renowned fashion designer Roberto Cavalli, including Italian Murano chandeliers and European travertine marble, and anywhere, anytime dining prepared by some of Indonesia's best chefs, it's the high-end retreat you've been dreaming of. Relax in beachfront cabanas you’ll never need to reserve and discrete butler service to cater to your every whim in this all-suite hideaway known for providing the finest level of impeccable service to guests with the highest standards.\n\nWhen you're not soaking in the private jacuzzi in your suite, watch the sunrise across the gleaming ocean each night from the sparkling infinity pool, retreat to L’Angelo Bianco to savour delicious all-day dining, or go reef diving and swimming in your own secluded slice of paradise, away from the crowds. As night falls, cheers to perfect days with an evening cocktail at the buzzing Secret Beach Swim-Up Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Seven Secrets by Hanging Gardens",
    "offer_address": "Jl. Raya Pemenang No.KM 10, Malaka, Kec. Pemenang, Kab. Lombok Utara, Nusa Tenggara Barat, Indonesia",
    "percentage_discount": 73.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1219.0,
    "value": 4488.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ey6c1AAB",
    "hero_image": "https://images.luxuryescapes.com/yq0ktdb3js9u5p14etzt",
    "image_two": "https://images.luxuryescapes.com/32unioipvuam5eto79",
    "image_three": "https://images.luxuryescapes.com/8rp1j6bnbxbpuxf13vft",
    "vendor_name": "Royal Avila Boutique Resort",
    "title": "Lombok Santorini-Inspired Retreat with Daily Breakfast, Nightly Dinner & Daily Cocktails at Amavi's Beach Club",
    "description": "Soak up Lombok serenity while overlooking Malimbu Beach at its finest at the chic Santorini-styled Royal Avila Boutique Resort. Arrive in style with comfortable roundtrip airport transfers to this boutique cliffside hideaway. Elegantly fusing traditional Indonesian and Mediterranean-inspired elements, the resort's casual yet sophisticated ambience oozes romance, making it an ideal couples' destination. Take an invigorating dip in the spectacular hot tub, offering breathtaking 180-degree sparkling sea views or enjoy a serene massage at Althea Spa.\n\nWatch the sunset across the gleaming ocean each night from the sparkling infinity pool, or retreat to Olive Restaurant & Bar to savour delicious complimentary breakfasts and sought-after local dishes for lunch or dinner. Cheers to perfect days with a complimentary cocktail at the buzzing Amavi's Beach Club. Stroll along the white sands of the beach before heading up Malimbu Hill for one of the best sunset viewpoints found in Senggigi, or venture further on a day trip to the enchanting Gili Islands for snorkelling.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Royal Avila Boutique Resort",
    "offer_address": "Jalan Raya Senggigi, Malaka, Pemenang, Lombok, 83352, Indonesia",
    "percentage_discount": 43.0,
    "min_duration": 3,
    "max_duration": 22,
    "price": 479.0,
    "value": 834.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csULzQAM",
    "hero_image": "https://images.luxuryescapes.com/n262uc9bsgx6x8mzuno",
    "image_two": "https://images.luxuryescapes.com/8j5q0eku1xhabsex3m5",
    "image_three": "https://images.luxuryescapes.com/tbuk9zki1id3bs3njybk",
    "vendor_name": "Novotel Lombok Resort and Villas",
    "title": "Secluded Beachfront Paradise in Lombok",
    "description": "Escape to Bali’s pristine sister island Lombok for a serene beachfront escape amidst the white sands, aquamarine waters and lush fringed palm trees of this gorgeous tropical island. Check in and chill out at the Novotel Lombok Resort & Villas and enjoy a wealth of inclusions such as daily breakfast, massages, dining experiences, cocktails and authentic local experiences including an Indonesian cooking lesson, monkey feeding and more. Travelling with kids? Check out the family package, with up to two children aged 12 years and under staying for free.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Novotel Lombok Resort and Villas 2020 A",
    "offer_address": "Pantai Putri Nyale, Kuta, Pujut, Kabupaten Lombok Tengah, Nusa Tenggara Bar. 83001, Indonesia",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 264.0,
    "value": 724.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IhMFIA0",
    "hero_image": "https://images.luxuryescapes.com/0w556kdb8xdgcptioii",
    "image_two": "https://images.luxuryescapes.com/mxjvwxfsbjenvrxo2ma8",
    "image_three": "https://images.luxuryescapes.com/ebc2ywq3rik0jlusx0gj",
    "vendor_name": "Qunci VIllas",
    "title": "Lombok Boutique Beachfront Retreat with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Experience the tranquil beauty of Lombok, Bali’s sister island, with a luxurious five-star retreat on Mangsit Beach, just five minutes from Senggigi and a short boat ride to the breathtaking Gili Islands.\n\nThis island sanctuary offers 78 elegantly appointed rooms, many with stunning partial or full views of the Indian Ocean. Guests can enjoy daily breakfast, a two-course a la carte lunch or dinner each day and a nightly cocktail per adult.\n\nPerfect for couples seeking peace and relaxation, the resort features exceptional amenities, including open-air restaurants specialising in seafood and traditional Indonesian dishes, a relaxed beachfront tapas bar, a serene spa, three swimming pools and a private beach for a truly idyllic escape.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Qunci Villas",
    "offer_address": "Jalan Raya Senggigi, West Lombok, West Nusa Tenggara 83355, Indonesia",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 12,
    "price": 369.0,
    "value": 1237.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000NwTOjAAN",
    "hero_image": "https://images.luxuryescapes.com/xapk4vthbuizug7gjuow",
    "image_two": "https://images.luxuryescapes.com/vuypzkeo50jnxvni3jqs",
    "image_three": "https://images.luxuryescapes.com/osxuiagvnxghuadnqq2d",
    "vendor_name": "Living Asia Resort and Spa Lombok",
    "title": "Untouched Beachfront Beauty in Lombok, Indonesia",
    "description": "Escape to Lombok-Bali’s pristine sister island-for a serene beachfront escape amidst the white sands, aquamarine waters and lush fringed palm trees of this gorgeous tropical island. Enjoy five or seven nights at the deluxe Living Asia Resort & Spa Lombok with daily buffet breakfast, a cooking class followed by lunch, a buffet dinner for two, spa treatments to share, nightly sunset cocktail, private airport pickup and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Nusa Tenggara Barat",
    "offer_geo_area_level_2": "Kabupaten Lombok Utara",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Living Asia Resort & Spa Lombok - June 2018",
    "offer_address": "Jl. Raya Senggigi Pemenang 83352 Lombok INDONESIA",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 387.0,
    "value": 924.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eLSsvQAG",
    "hero_image": "https://images.luxuryescapes.com/akqj8prr4gso4awgbtd",
    "image_two": "https://images.luxuryescapes.com/wegx69lmapb84on6fk2",
    "image_three": "https://images.luxuryescapes.com/bdizzdh93ixsla6i1jy",
    "vendor_name": "Jivana Resort Kuta Lombok",
    "title": "Luxurious Lombok Escape with Daily Cocktails and Dining Inclusions",
    "description": "Escape to an all-suite-and-villa resort in Lombok Bali’s pristine sister island brimming with pillowy white sands, aquamarine waters and lush fringed palm trees. Enjoy a one-way airport transfer, daily a la carte breakfast, three-course dinner, nightly cocktail per adult, 60-minute full-body massage each and a late 12pm checkout.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Jivana Resort",
    "offer_address": "Jl. Raya Kuta, Kuta, Pujut, Kabupaten Lombok Tengah, Nusa Tenggara Bar. 83573, Indonesia",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 247.0,
    "value": 486.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECPZzAAP",
    "hero_image": "https://images.luxuryescapes.com/co96u6gu7ckt3e5dwe0r",
    "image_two": "https://images.luxuryescapes.com/1esxlgpefwqj5ayl45s",
    "image_three": "https://images.luxuryescapes.com/wcywp6s2xmghmmoxdr",
    "vendor_name": "Somewhere Lombok",
    "title": "Grand Opening: Lombok Bayview Villas with Daily Dining & Free-Flow Cocktail Hour",
    "description": "Be one of the first to discover Somewhere Lombok, a luxury hideaway boasting bespoke villas with private plunge pools. This intimate sanctuary is nestled alongside a world-class surf beach, framed by lush palm trees and crystal clear seas, creating a haven of tranquility. Immerse yourself in the beauty of this idyllic destination as you hit the waves or simply relax poolside, taking in the stunning valley and bay views. Start your day practising mindfulness with a morning yoga session, followed by locally-sourced Indonesian fusion cuisine.\n\nWhen you’re ready to explore, catch the daily shuttle to downtown Kuta or experience Lombok’s countless treasures, from the towering Mount Rinjani to the pristine beaches and coral reefs of the nearby Gili Islands. Wind down your day by sinking into a cosy beanbag chair while watching a gorgeous sunset.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Somewhere Lombok",
    "offer_address": "Gili Nusa Estate, Prabu, Pujut, Lombok Tengah, Nusa Tenggara Barat 83572, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 805.0,
    "value": 2404.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IeScmAAF",
    "hero_image": "https://images.luxuryescapes.com/0hv9oq7ucrj456pyrlpm",
    "image_two": "https://images.luxuryescapes.com/4w2x408vxr06fn76tzbk",
    "image_three": "https://images.luxuryescapes.com/wu6j3fvcm5opd8o87et",
    "vendor_name": "The Kayana Beach - Lombok",
    "title": "Boutique Lombok Private Pool Villa Sanctuary with Daily Breakfast, Nightly Dinner, Cocktails & Return Transfers",
    "description": "This isn’t Lombok as you know it - between the mighty slopes of Mount Rinjani and the shimmering sea, discover new heights of unparalleled seclusion, tranquillity and luxury. Boasting just 34 private villas cocooned by nodding palm trees and mesmerising waters - all just a 10-minute boat ride to the spectacular Gili Islands - there's nowhere better to soak up the region's legendary calm.\n\nSpend your days swimming or snorkelling in the resort's extraordinary house reef, before returning to the cliffside Blues Restaurant for laidback, open-air dining and soul-stirring sunset vistas - where better to savour your nightly cocktails? With every villa offering countless special touches and a wonderful private pool, you may never want to leave - but Lombok, Bali's sister island, rewards intrepid exploration, with cascading waterfalls, rose-pink beaches and fantastic surf breaks all within easy reach.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Pemenang",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "The Kayana Beach Lombok",
    "offer_address": "Jl. Raya Senggigi, Kecinan, Pemenang, Lombok Utara, Nusa Tenggara Barat, Lombok 83352, Indonesia",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 599.0,
    "value": 1215.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjyjAAC",
    "hero_image": "https://images.luxuryescapes.com/feijuspzd850nwf5wkm",
    "image_two": "https://images.luxuryescapes.com/zgpyn4mhycr822zfvsc",
    "image_three": "https://images.luxuryescapes.com/wdf4rs5vipamwgi2c5",
    "vendor_name": "Wyndham Sundancer Resort Lombok",
    "title": "Lombok Beachfront Seclusion with Daily Dining and Cocktails",
    "description": "Escape to Lombok-Bali’s pristine sister island-for a serene beachfront escape amid the white sands, turquoise waters and lush fringed palm trees, staying at the modern Wyndham Sundancer Resort Lombok. Stay in a huge suite with your choice of two-course lunch or dinner daily, daily buffet breakfast, daily afternoon tea, a daily cocktail each served at the pool bar or at the beach club, a relaxing 60-minute massage per person, return airport transfers and guaranteed late checkout at 1pm.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Sekotong Barat",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Wyndham Sundancer Resort Lombok JAN",
    "offer_address": "Raya Pandanan, West Sekotong, Lombok, Indonesia 83365",
    "percentage_discount": 67.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 309.0,
    "value": 935.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Cw4JsAAJ",
    "hero_image": "https://images.luxuryescapes.com/d350ypafl4v60bppppd",
    "image_two": "https://images.luxuryescapes.com/bw6f6y8cjxh6etjj792n",
    "image_three": "https://images.luxuryescapes.com/afj6j3iy2stqbk3965n",
    "vendor_name": "Qunci VIllas",
    "title": "Five-Star Lombok Beachfront Retreat with Massages, Daily Dining & Airport Transfer",
    "description": "Immerse yourself in the beach-blessed beauty of Bali's sister island with a boutique escape at Qunci Villas, perfectly poised on Mangsit Beach just a short jaunt from Senggigi and the breathtaking Gili Islands. This serene hideaway offers the utmost luxury and privacy, backed by five-star hospitality and spectacular hilltop views of the shining Andaman Sea. Perfect for those who want to soak up the serenity, the property's exceptional facilities include three dining options - savour exquisite Indonesian favourites at the open-air Quali Asian Dining, local fresh-caught seafood served with fine-dining flair at Qerang and Spanish seaside tapas at NooQ Sunset Bar & Lounge.\n\nThere's no better place to find your island spirit - relax on the beachfront, slip into one of three shimmering swimming pools (including an adults-only pool), or indulge in wellness treatments inspired by ancient Javanese methods at Qamboja Health Spa. When you're ready to explore, this villa oasis is the perfect base for discovering the renowned Gili Islands, where underwater kingdoms promise snorkelling and scuba adventures beyond compare.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Qunci Villas",
    "offer_address": "Jalan Raya Senggigi, West Lombok, West Nusa Tenggara 83355, Indonesia",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 319.0,
    "value": 921.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxDQpAAN",
    "hero_image": "https://images.luxuryescapes.com/k1noy1w63h38s2v00f1a",
    "image_two": "https://images.luxuryescapes.com/4dlngdc55uiymnrvoxu",
    "image_three": "https://images.luxuryescapes.com/zo7u1c38omogvhydfk9p",
    "vendor_name": "Royal Avila Boutique Resort",
    "title": "Five-Star Santorini-Inspired Lombok Retreat with Daily Breakfast, Massages & Cocktails at Amavi's Beach Club",
    "description": "Soak up Lombok serenity at this five-star Santorini-inspired retreat overlooking Malimbu Beach. Elegantly fusing traditional Indonesian and Mediterranean-inspired elements, this boutique cliffside hideaway oozes romance, making it an ideal couples' destination. Take an invigorating dip in the spectacular hot tub, offering breathtaking 180-degree sparkling sea views, or enjoy a serene massage at Althea Spa.\n\nWatch the sunset across the gleaming ocean each night from the sparkling infinity pool, or retreat to Olive Restaurant & Bar to savour delicious breakfasts and sought-after local dishes for lunch or dinner. Cheers to perfect days at the buzzing Amavi's Beach Club, lazing in spacious cabanas, or stroll along the beach before heading up Malimbu Hill for one of the best sunset viewpoints found in Senggigi. For the ultimate snorkelling adventure, venture further on a day trip to the enchanting Gili Islands.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Royal Avila Boutique Resort",
    "offer_address": "Jalan Raya Senggigi, Malaka, Pemenang, Lombok, 83352, Indonesia",
    "percentage_discount": 51.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 369.0,
    "value": 751.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Idn2JAAR",
    "hero_image": "https://images.luxuryescapes.com/lbiwg08bi0vxdh4nhxv",
    "image_two": "https://images.luxuryescapes.com/4g4fj2wr18mn64wcsmq",
    "image_three": "https://images.luxuryescapes.com/gzkxjhchyej39i5m753j",
    "vendor_name": "Somewhere Lombok",
    "title": "Luxury Lombok Villa Hideaway with Daily Breakfast, Choice of Lunch or Dinner & Cocktail",
    "description": "Discover a luxury hideaway boasting bespoke villas with private plunge pools overlooking a pristine bay, somewhere in Lombok. This intimate sanctuary is nestled alongside a world-class surf beach framed by lush palm trees, creating a haven of tranquillity. Immerse yourself in nature's idyllic beauty as you hit the waves or simply relax poolside, taking in stunning valley and sea views. Enjoy locally sourced international fusion cuisine twice a day, a cocktail as the sun goes down and plenty of time to practice peace and mindfulness.\n\nWhen you’re ready to explore, catch the daily shuttle to downtown Kuta or experience Lombok’s countless treasures, from the towering Mount Rinjani to the postcard-perfect beaches and coral reefs of the nearby Gili Islands. Wind down your day by sinking into a cosy beanbag chair while watching a gorgeous sunset light the sky with blazing hues of burnt orange, bubblegum pink and deep red.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Somewhere Lombok",
    "offer_address": "Gili Nusa Estate, Prabu, Pujut, Lombok Tengah, Nusa Tenggara Barat 83572, Indonesia",
    "percentage_discount": 43.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 469.0,
    "value": 822.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMWpFAAX",
    "hero_image": "https://images.luxuryescapes.com/qkaigjzmxqy7jmuj4ga5",
    "image_two": "https://images.luxuryescapes.com/aanql50kolxqdtp6cuon",
    "image_three": "https://images.luxuryescapes.com/mhpzwkl6l70ag3abzjxm",
    "vendor_name": "Pullman Lombok Merujani Mandalika Beach Resort",
    "title": "Beachfront Pullman Lombok Escape with Daily Breakfast, Nightly Dinner, Nightly Drinks & Roundtrip Airport Transfers",
    "description": "Set your watch to island time and switch into ultimate relaxation mode with an escape to the five-star Pullman Lombok Merujani Mandalika Beach Resort, a beachfront oasis located on Bali's spectacular sister island. Relax on the private beachfront, slip into the oceanfront infinity pool, pamper yourself with a treatment at the heavenly Pullman Spa, visit the chilled-out Lalo Swim-Up Bar or taste your way around three onsite restaurants, including lite bites at Bites on Wheels, the intimate all-day Aer restaurant or indulge in fresh local produce at Sgara seafood restaurant.\n\nEmbrace the island lifestyle, knowing your only care in the world is which activity to pick. Catch the shuttle to the nearby downtown Kuta or experience Lombok’s countless treasures, ascend the towering Mount Rinjani for majestic sunsets, catch a wave at one of the pristine beaches or use this five-star oasis as your ultimate launchpad to the renowned Gili Islands, where you can snorkel and scuba dive to your heart's content. Wind down your day by sinking into a cosy beach lounger chair while toasting to your stay in paradise.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Pullman Lombok Merujani Mandalika Beach Resort",
    "offer_address": "ITDC Mandalika Tourism Complex, Lot BS-2, 83573 Kuta, Lombok, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 469.0,
    "value": 1051.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eLKLoQAO",
    "hero_image": "https://images.luxuryescapes.com/v4j4sevzyi4690cieo3",
    "image_two": "https://images.luxuryescapes.com/jfgimsbz34ytgsncmq",
    "image_three": "https://images.luxuryescapes.com/b829f7uv5v0zwzvlh0i",
    "vendor_name": "Qunci VIllas",
    "title": "Boutique Beachfront Lombok Escape with Daily Breakfast & Spa Treatments",
    "description": "Immerse yourself in the pristine beauty of Bali’s sister island, Lombok, with a boutique stay at the stylish Qunci Villas, one of Lombok’s leading boutique retreats, rated in the top three hotels in the Mangsit area on TripAdvisor. A serene oasis located in prime beachfront position, this tranquil property is the ideal destination for a relaxing holiday. Your tropical island escape includes daily breakfast, your choice of a signature, Swedish or aromatic 60-minute massage, a foot reflexology session and an evening cocktail served by the resort's three pools or by the beach.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "West Lombok Regency",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Qunci Villas NOV2019",
    "offer_address": "Jl. Raya Mangsit - Senggigi Km. 5, Mangsit, Senggigi, Batu Layar, West Lombok Regency, West Nusa Tenggara, Indonesia",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 309.0,
    "value": 730.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ey6ckAAB",
    "hero_image": "https://images.luxuryescapes.com/l01qzdfdd3xzkja6cem6",
    "image_two": "https://images.luxuryescapes.com/ikb3hvev3mm6la0lm42g",
    "image_three": "https://images.luxuryescapes.com/uzda5ty9ga77lq2gud2",
    "vendor_name": "The Kayana Beach - Lombok",
    "title": "Lombok Five-Star Private Pool Villa Sanctuary with Daily Breakfast, Nightly Dinner, Roundtrip Transfers & Massages",
    "description": "This isn’t Lombok as you know it - between the mighty slopes of Mount Rinjani and the shimmering sea, discover new heights of unparalleled seclusion, tranquillity and luxury at The Kayana Beach Lombok. Boasting just 34 private villas cocooned by nodding palm trees and mesmerising waters - all just a 10-minute boat ride to the spectacular Gili Islands - there's nowhere better to soak up the region's legendary calm.\n\nSpend your days swimming or snorkelling in the resort's extraordinary house reef, before returning to cliffside The Blues Restaurant for laidback, open-air dining and soul-stirring sunset vistas - where better to savour your nightly cocktails? With every villa offering countless special touches and a wonderful private pool, you may never want to leave - but Lombok, Bali's sister island, rewards intrepid exploration, with cascading waterfalls, rose-pink beaches and fantastic surf breaks all within easy reach.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Pemenang",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "The Kayana Beach Lombok",
    "offer_address": "Jl. Raya Senggigi, Kecinan, Pemenang, Lombok Utara, Nusa Tenggara Barat, Lombok 83352, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 469.0,
    "value": 1082.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Ln8BAAS",
    "hero_image": "https://images.luxuryescapes.com/xn1uy241icrs7hyw07q",
    "image_two": "https://images.luxuryescapes.com/k68w4hl0ydhrbd2vul04",
    "image_three": "https://images.luxuryescapes.com/243m8qz6bzda2vfx9p5",
    "vendor_name": "Hotel Tugu Lombok",
    "title": "Romantic Beachfront Bungalow with Massages & Daily Dining",
    "description": "Escape to Hotel Tugu Lombok for a serene beachfront escape amid the white sands, aquamarine waters and lush palm trees of this gorgeous tropical oasis, on Bali’s pristine sister island. The romantic hotel is peppered with Indonesian antiques and artwork, paying homage to the area’s culture and history. Your escape includes daily à la carte breakfast and afternoon tea, nightly three-course dinners, a welcome cocktail per person, return airport transfers and a 60-minute massage each.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Tanjung",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Hotel Tugu Lombok - Apr 20",
    "offer_address": "Jl. Pantai Sire, Desa Sigar Penjalin, Kecamatan Tanjung, Sigar Penjalin, Tanjung, Kabupaten Lombok Utara, Nusa Tenggara Bar. 83352, Indonesia",
    "percentage_discount": 60.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 539.0,
    "value": 1356.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvYCcQAN",
    "hero_image": "https://images.luxuryescapes.com/rpryvoaqadxxxpgtdzxp",
    "image_two": "https://images.luxuryescapes.com/abfjriv84vfd0axjkr8m",
    "image_three": "https://images.luxuryescapes.com/kiryacoxda7hswlelzo7",
    "vendor_name": "Seven Secrets by Hanging Gardens",
    "title": "Indonesia’s Most Exclusive Five-Star Beach Resort",
    "description": "We just can’t get enough of the high-end luxury, gourmet cuisine and VIP-style privacy at Indonesia’s most exclusive five-star beachfront resort, 7 Secrets Resort & Wellness Retreat in Lombok. Think all-inclusive dining prepared by a Michelin-trained chef, personalised butler service and décor by Roberto Cavalli. Enjoy a five-night stay with daily breakfast, daily beachfront lunches, nightly degustation dinner, private return airport transfers, nightly sunset cocktails, a couples massage and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Seven Secrets by Hanging Gardens",
    "offer_address": "Jl. Raya Pemenang No.KM 10, Malaka, Kec. Pemenang, Kab. Lombok Utara, Nusa Tenggara Barat, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 3137.0,
    "value": 6938.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009EEF2AAO",
    "hero_image": "https://images.luxuryescapes.com/35jezmewa7jpwf0olne9",
    "image_two": "https://images.luxuryescapes.com/bm5aiclmujc3bjhw4xim",
    "image_three": "https://images.luxuryescapes.com/3cg9zx6trp7rdhprr9t",
    "vendor_name": "Royal Avila Boutique Resort",
    "title": "Grand Opening: Cliffside Lombok Haven with Daily Breakfast & Nightly Cocktails",
    "description": "Discover Lombok serenity at the brand-new Royal Avila Boutique Resort overlooking Malimbu Beach on the northern coast of the island. This boutique cliffside hideaway elegantly fuses traditional Indonesian and Mediterranean-inspired elements to create a casual yet elegant ambience to ensure a restful stay perfect for couples or honeymooners. Plunge straight into the expansive infinity pool and watch the sun set across the gleaming ocean each night, then retreat to Olive Restaurant & Bar to savour the most sought-after local dishes or hearty bites inspired by Greek delicacies.\n\nLeave it all behind as you stroll along the white sands of the beach before heading up Malimbu Hill for one of the best sunset viewpoints found in Senggigi. Venture a little further to explore Lombok’s vibrant centre or embark on a day trip to the enchanting Gili Islands for the day.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Royal Avila Boutique Resort",
    "offer_address": "Jalan Raya Senggigi, Malaka, Pemenang, Lombok, 83352, Indonesia",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 649.0,
    "value": 1271.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006ywMuAAI",
    "hero_image": "https://images.luxuryescapes.com/ccra3244whdrocmi21qb",
    "image_two": "https://images.luxuryescapes.com/a3pqfthrin7sbjuli7w",
    "image_three": "https://images.luxuryescapes.com/gqfa3598fjpins62j0g",
    "vendor_name": "Qunci VIllas",
    "title": "Lombok Boutique Beachfront Retreat with Daily Breakfast & Daily Lunch or Dinner",
    "description": "Immerse yourself in the beach-blessed beauty of Bali's sister island with a boutique escape at Qunci Villas, perfectly poised on Mangsit Beach, around five minutes from Senggigi's centre and a short boat ride to the breathtaking Gili Islands. Ranked among Tripadvisor’s top 10% of properties worldwide, this serene island hideaway - with 78 air-conditioned rooms and villas, many with full or partial Indian Ocean views - offers the utmost in luxury and privacy.\n\nPerfect for families and couples who want to soak up the serenity, the property's exceptional facilities include three dining options: Italian and Indonesian open-air restaurants and a casual waterfront tapas bar. There's also a blissful spa, three swimming pools to choose from - including an infinity pool and adults-only pool - and a private beach.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Qunci Villas",
    "offer_address": "Jalan Raya Senggigi, West Lombok, West Nusa Tenggara 83355, Indonesia",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 495.0,
    "value": 1147.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y1R4UQAV",
    "hero_image": "https://images.luxuryescapes.com/qcbwmibsdzrjyd5xlwmx",
    "image_two": "https://images.luxuryescapes.com/xasqtwawfxduo2nksamy",
    "image_three": "https://images.luxuryescapes.com/o9wvysnslqgetops2my5",
    "vendor_name": "Qunci VIllas",
    "title": "Boutique Spa Escape with Massage and Reflexology Included",
    "description": "Escape to the Indonesian island of Lombok with a boutique spa break at the stylish Qunci Villas. Rated the #1 hotel in the area of Mangsit on TripAdvisor, this tranquil property is located in front of the beach and offers two restaurants, a bar, spa and three pools. With daily breakfast, a lunch for two, a 60-minute massage, a foot reflexology session and more included, it’s the perfect way to unwind.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "West Lombok Regency",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Qunci Villas - 2018",
    "offer_address": "Jl. Raya Mangsit - Senggigi Km. 5, Mangsit, Senggigi, Batu Layar, West Lombok Regency, West Nusa Tenggara, Indonesia",
    "percentage_discount": 66.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 440.0,
    "value": 1295.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZmVlGQAV",
    "hero_image": "https://images.luxuryescapes.com/oa975km4bz6bv8rkiz6g",
    "image_two": "https://images.luxuryescapes.com/zsm0qgnrcp7e0juwotjf",
    "image_three": "https://images.luxuryescapes.com/mhgiwjzwrq75nc0dze20",
    "vendor_name": "Novotel Lombok Resort and Villas",
    "title": "Tropical Serenity with Massages, Cocktails and More Included",
    "description": "Escape to Bali’s pristine sister island Lombok for a serene beachfront stay amidst the white sands, aquamarine waters and lush fringed palm trees of this gorgeous tropical island. Check in and chill out at the Novotel Lombok Resort & Villas and enjoy a wealth of inclusions such as daily breakfast, massages, two buffet dinners, cocktails, authentic local experiences including an Indonesian cooking lesson and airport pickup on arrival. Family friendly packages available.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Nusa Tenggara Barat",
    "offer_geo_area_level_2": "Kabupaten Lombok Tengah",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Novotel Lombok Resort and Villas 2019",
    "offer_address": "LOMBOK, Pantai Putri Nyale, Kuta, Pujut, Kabupaten Lombok Tengah, Nusa Tenggara Bar. 83001, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 381.0,
    "value": 850.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oejOAAQ",
    "hero_image": "https://images.luxuryescapes.com/7czbr8j9gdenwdqc4asv",
    "image_two": "https://images.luxuryescapes.com/g1nkupm028ycy0lmnxy",
    "image_three": "https://images.luxuryescapes.com/9vm2886xo6fv4fq9qg5l",
    "vendor_name": "Sudamala Resorts Lombok",
    "title": "Lombok Five-Star Beachside Suites with Daily Breakfast & Roundtrip Airport Transfers",
    "description": "If you've been dreaming of soft, white sands and spectacular Indonesian sunsets, the effortless luxury of Sudamala Suites & Villas, Senggigi, Lombok is just what you need. Savour the beauty of Lombok, Bali’s sister island, and its countless alabaster beaches, cascading waterfalls and secluded coves. Drop your bags and let yourself relax as you cherish every incredible Indonesian sunset.  \n\nRanked among Tripadvisor’s top 10% of properties worldwide, Sudamala Suites & Villas, Senggigi, Lombok is conveniently located just minutes away from the Sengiggi city centre and offers unrivalled access to the area’s golden beaches. Each suite showcases a range of artisanal furniture, magical art and luxe five-star amenities. The resort’s onsite Olah-Olah Restaurant offers elevated Indonesian and international favourites alongside dazzling ocean views. If you’re seeking true bliss, the onsite Mango Tree Spa offers a range of Swedish and Balinese treatments, including the signature seashell massage and pearl mango scrub. Whether you’ve always dreamed of getting your diving credentials or are ready to explore Lombok’s rich cultural heritage, the resort’s concierge will be more than happy to assist you with a wide range of tours, experiences and local insights. Or, simply let your troubles fall away as you nurse a tropical drink by the resort’s stunning moon-shaped pool.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Sudamala Suites & Villas, Senggigi, Lombok",
    "offer_address": "Jalan Raya, Senggigi, Kec. Batu Layar, Kabupaten Lombok Barat, Nusa Tenggara Bar. 83355, Indonesia",
    "percentage_discount": 44.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 649.0,
    "value": 1149.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BcWa7AAF",
    "hero_image": "https://images.luxuryescapes.com/atpo00724ca1oqhzww1",
    "image_two": "https://images.luxuryescapes.com/thcd51pp5bhrb45mhgx",
    "image_three": "https://images.luxuryescapes.com/xumiod8y1dwqv4tp4yq",
    "vendor_name": "Anema Wellness & Resort Gili Lombok",
    "title": "Lombok Beachfront Bliss with 60-Minute Massages, Daily Breakfast & Nightly Cocktails",
    "description": "Immerse yourself in the beach-blessed beauty of Bali's sister island at the tranquil Anema Wellness & Resort Gili Lombok. This hypnotic destination combines indescribable beauty and magical beachfront vistas with traditional style - think strolls along the unspoilt shoreline of Sire Beach, dips in the shimmering beachfront pools, and refreshing cocktails served as the golden rays turn to warm hues of pink and orange setting over the horizon.\n\nPerfectly poised on the laidback alabaster sands, surrounded by local eateries and boutiques and a short boat ride to the breathtaking Gili Islands, this serene island hideaway offers the utmost in luxury and privacy. With indulgent daybeds, a purpose-built kids' pool and rejuvenating ocean-facing spa, this retreat is the perfect launchpad for families and couples looking for their slice of paradise.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Tanjung",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Anema Wellness & Resort Gili Lombok",
    "offer_address": "Jl. Pantai Sire Tanjung, Lombok Utara NTB, 83352 Indonesia",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 329.0,
    "value": 695.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000OJLc9AAH",
    "hero_image": "https://images.luxuryescapes.com/pbjyae2yz18zigwy8jwi",
    "image_two": "https://images.luxuryescapes.com/dxuziv0dc1z8xudazn24",
    "image_three": "https://images.luxuryescapes.com/jdsv9kjcrfd199x2zh3j",
    "vendor_name": "Sudamala Resorts Lombok",
    "title": "Sudamala Suites & Villas: Lombok Beachfront Escape",
    "description": "Escape to Bali’s tranquil sister island of Lombok for beachfront relaxation at Sudamala Suites & Villas, Sengiggi including return airport or harbour transfers, daily buffet breakfasts, two lunches, one dinner, two 30-minute Balinese massages each, two sunset cocktails each and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Sudamala Suites & Villas*",
    "offer_address": "Jalan Raya Mangsit - Senggigi, Senggigi, Batu Layar, West Lombok Regency, West Nusa Tenggara 83355, Indonesia",
    "percentage_discount": 61.0,
    "min_duration": 5,
    "max_duration": 5,
    "price": 586.0,
    "value": 1508.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X9G8CQAV",
    "hero_image": "https://images.luxuryescapes.com/vb1hcmvy6rli7qw3ooog",
    "image_two": "https://images.luxuryescapes.com/yr5xmfmfwsl8rvlm0agv",
    "image_three": "https://images.luxuryescapes.com/ni31xbwm5hviqldubdks",
    "vendor_name": "Living Asia Resort and Spa Lombok",
    "title": "Untouched Beachfront Beauty in Lombok, Indonesia",
    "description": "Escape to Lombok-Bali’s pristine sister island-for a serene beachfront escape amidst the white sands, aquamarine waters and lush fringed palm trees of this gorgeous tropical island. Check in to the deluxe Living Asia Resort & Spa Lombok with daily buffet breakfast, a buffet dining experience with live entertainment, a relaxing 30-minute spa treatment each, nightly sunset cocktails, complimentary afternoon tea, private airport pickup and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Living Asia Resort & Spa - Lombok",
    "offer_address": "Jalan Raya Senggigi, Dusun Lendang Luar, Pemenang, Malaka, Pemenang, Kabupaten Lombok Utara, Nusa Tenggara Bar. 83355, Indonesia",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 309.0,
    "value": 842.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4VWFQA3",
    "hero_image": "https://images.luxuryescapes.com/gce0lmab8cl0tvayajdy",
    "image_two": "https://images.luxuryescapes.com/pi5g0qv96vlfii9ywlef",
    "image_three": "https://images.luxuryescapes.com/z84jo21vasb8sdu2nlgv",
    "vendor_name": "Selong Selo Resort & Residences",
    "title": "Private Pool Villa Bliss With Spa Treatments & Cocktails",
    "description": "Escape to Selong Selo Resort & Residences in Lombok - Bali’s pristine sister island - for a serene beachfront escape amidst the white sands, aquamarine waters and lush fringed palm trees of this gorgeous tropical oasis. Included in your escape is daily breakfast and afternoon tea, a choice of two two-course lunches or dinners, one 60-minute massage each, a daily cocktail and more.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Nusa Tenggara Barat",
    "offer_geo_area_level_2": "Kabupaten Lombok Tengah",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Selong Selo Resort & Residences OLD 2018",
    "offer_address": "Jalan Batu Jangkih Sepi Mungkung, Mangkung, West Praya, Central Lombok Regency, West Nusa Tenggara 83571, Indonesia",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 861.0,
    "value": 1789.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HaDSIA0",
    "hero_image": "https://images.luxuryescapes.com/6g65vn4b6h63u4ts48n",
    "image_two": "https://images.luxuryescapes.com/wpy6wcj7ikztx6vbswb",
    "image_three": "https://images.luxuryescapes.com/3o1mhmxwmsziijs1ay",
    "vendor_name": "Kalandara Resort",
    "title": "Idyllic Lombok Clifftop Pool Villas with Daily Breakfast, Nightly Dinner, Cocktails & Massages",
    "description": "Fulfil your dreams of experiencing the quieter side of Indonesia - this boutique hillside oasis looking out over the shores of Lombok is an island paradise still lush with authentic, untouched beauty.\n\nWhere modern comforts meet traditional charm, escape to your villa between the palm trees for endless sunny days lounging by your private infinity pool. Embrace the promise of serenity at Kalandara Spa, and indulge in a diverse menu of local fare at Amatera Restaurant.\n\nWhen it's time to venture out, ultra-serene Senggigi is right at your fingertips with its beaches perfect for surfing and snorkelling and a selection of trendy bars and restaurants. Or, venture out to the spectacular Gili Islands by speedboat to see more coastal splendours.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Kalandara Resort",
    "offer_address": "Jalan Raya Senggigi, Mangsit, Lombok Barat 83355, Indonesia",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 559.0,
    "value": 1441.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvmtYQAR",
    "hero_image": "https://images.luxuryescapes.com/u6aalwhaqmanvmhqhrn5",
    "image_two": "https://images.luxuryescapes.com/y3ph3j2vfmqysgnsxteo",
    "image_three": "https://images.luxuryescapes.com/rtgxjevrsg3ym4e3nwio",
    "vendor_name": "Novotel Lombok Resort and Villas",
    "title": "Secluded Beachfront Paradise in Lombok",
    "description": "Escape to Bali’s pristine sister island Lombok for a serene beachfront escape amidst the white sands, aquamarine waters and lush fringed palm trees of this gorgeous tropical island. Check in and chill out at the Novotel Lombok Resort & Villas and enjoy a wealth of inclusions such as daily breakfasts, return airport transfers, massages, dining experiences, cocktails, yoga and authentic local experiences including an Indonesian cooking lesson. Family-friendly packages available.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Nusa Tenggara Barat",
    "offer_geo_area_level_2": "Kabupaten Lombok Tengah",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Novotel Lombok Resort & Villas - June 2018",
    "offer_address": "LOMBOK, Pantai Putri Nyale, Kuta, Pujut, Kabupaten Lombok Tengah, Nusa Tenggara Bar. 83001, Indonesia",
    "percentage_discount": 59.0,
    "min_duration": 7,
    "max_duration": 7,
    "price": 629.0,
    "value": 1523.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DpmOrAAJ",
    "hero_image": "https://images.luxuryescapes.com/xz5myd0ijlfcq6i6oo2p",
    "image_two": "https://images.luxuryescapes.com/baujd46i5laf5xwlgipc",
    "image_three": "https://images.luxuryescapes.com/ctwwjydgbhzzv8g8e2mr",
    "vendor_name": "Amber Lombok Beach Resort by Cross Collection",
    "title": "Sophisticated Lombok Beachside Eco-Retreat with Daily Massages, Daily Breakfast & Guaranteed Room Upgrade",
    "description": "Catch surfside serenity on the southern shores of one of Indonesia’s most idyllic islands with a beachfront stay at Amber Lombok Beach Resort by Cross Collection. Dripping in minimalist, Mediterranean-inspired style and boasting spectacular seaside views from almost every angle, this eco-chic resort offers laidback vibes in abundance - after days spent conquering volcanoes, hanging ten on some of Asia’s best surf beaches or sipping signature cocktails by the resort’s magnificent central pool, retreat to Bayside lounge for ultra-fresh plates and DJ-spun nights, Mukti Spa for holistic treatments to soothe the soul or wander the Edible Garden in search of flavour-filled lychees and fiery Lombok chilis.\n\nLooking to explore? Lombok’s countless treasures are begging to be discovered - renowned learner’s surf spot Selong Belanak is a short wander away, and the bustling town of Kuta only a 50-minute drive eastward.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Praya Barat",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Amber Lombok Beach Resort by Cross Collection",
    "offer_address": "Pantai Torok, Montong Ajan, Praya Barat Daya, Central Lombok Regency, West Nusa Tenggara 83573, Indonesia",
    "percentage_discount": 39.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 294.0,
    "value": 480.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037KJdAAM",
    "hero_image": "https://images.luxuryescapes.com/dbhbtiwkzqkje276ain",
    "image_two": "https://images.luxuryescapes.com/g1ojd0ivhffh1xs8snlh",
    "image_three": "https://images.luxuryescapes.com/ewxe9prynjrizcqd00sg",
    "vendor_name": "Jeeva Klui Resort - Lombok",
    "title": "Serene Lombok Beachfront Escape with Daily Breakfast & Cocktails",
    "description": "Find everything you need for a serene escape at Jeeva Klui Resort, a stunning beachfront retreat framed by the natural beauty of Lombok. Perfectly positioned along an uninterrupted stretch of sand, Jeeva Klui Resort embodies the soul of Indonesia through its beautiful blend of local culture, exemplary service and tropical surrounds. Take a dip in the warm surf of the Indian Ocean, gaze into the endless horizon from the infinity pool or relax with a treatment in the luxurious resort spa.\n\nEach intimate suite or villa offers a barefoot oasis ensconced in a natural setting. Expect outdoor rain showers, handcrafted design and lush tropical gardens. Onsite dining includes The Waroeng, a celebration of Lombok community and culture, and the breathtaking Pearl's, the perfect spot for ocean-view sunset cocktails.\n\n**Luxury Escapes inclusions (select nights)**\n\n- Wake up to **daily à la carte breakfast** overlooking the ocean at The Waroeng\n- Toast to your escape with a **daily cocktail** and sunset views\n- Unwind with a luxurious one-time **60-minute massage** at Jeevaniya Spa\n- Enjoy your choice of a **one-time set lunch or dinner** at The Waroeng, where you can indulge in Western, Indonesian or Asian cuisine (for stays of 3+ nights)\n- Double the indulgence with **two** **set lunches or dinners** at The Waroeng  (for stays of 5+ nights)\n\n**Looking for added luxury?** Upgrade to an Akasha Pool Villa, featuring your very own private pool.\n\n**Travelling as a group?** Select the Duplex Upgrade, which can accommodate up to six guests (extra guest surcharges apply).",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Jeeva Klui Resort",
    "offer_address": "Jalan Pantai Klui No. 1, Senggigi, West Nusa Tenggara, Lombok 83355 Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 7,
    "price": 84.0,
    "value": 84.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnOvIYAV",
    "hero_image": "https://images.luxuryescapes.com/8c7bv4ln6mpjsoqff7i",
    "image_two": "https://images.luxuryescapes.com/en0517zqsbinv6s3ukk",
    "image_three": "https://images.luxuryescapes.com/jdvzecap1vq2y12tytii",
    "vendor_name": "Novotel Lombok Resort and Villas",
    "title": "Secluded Lombok Beachfront Escape with Two Swimming Pools & Beach Bar",
    "description": "Escape to Bali’s pristine sister island, Lombok, for a serene beachfront escape surrounded by powder-white sands, aquamarine waters and swaying palm trees. Perfectly positioned on the island's scenic southern shore, Novotel Lombok Resort & Villas offers an authentic taste of Indonesia with all the comforts of home.\n\nDine on authentic Indonesian fare as you soak up ocean views at beachfront Spice Market Restaurant, take a dip in one of the resort’s two dazzling swimming pools or visit In Balance Spa for a traditional Sasak massage. No matter how you spend your days, this beachfront paradise is your gateway to Lombok living.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Novotel Lombok Resort & Villas",
    "offer_address": "Mandalika Resort Pantai Putri Nyale, Pujut Lombok Tengah, Kuta 83573, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 67.0,
    "value": 67.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GQ8SzAAL",
    "hero_image": "https://images.luxuryescapes.com/ngr2i6pxh9rkdqhek0t",
    "image_two": "https://images.luxuryescapes.com/55mzol8kaa67ew4j7rr",
    "image_three": "https://images.luxuryescapes.com/llhwy1ah5vjg04ty7dmoe",
    "vendor_name": "Merumatta Senggigi Lombok",
    "title": "Beachfront Lombok Tropical Escape with Private Stretch of Sand, Two Restaurants & Pool",
    "description": "Wander manicured tropical gardens, dive into pristine waters along a private beach and float in the sparkling lagoon pool that snakes through the resort with a luxurious stay at Merumatta Senggigi Lombok. Start each day with spectacular views of the resort's gardens over a delicious breakfast at Rinjani Restaurant, try authentic Italian delicacies at Basilico Restaurant, and later, sip on creative cocktails at Sunset Bar as you watch the sky turn a brilliant shade of orange over the Lombok Strait. When you're not relaxing in your private room or at the tranquil day spa, enjoy a day of adventure with a trip to the nearby Gili Islands.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Merumatta Senggigi Lombok",
    "offer_address": "Jl. Pantai Senggigi, Batu Layar, Lombok Barat, Nusa Tenggara Barat, 83355, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 59.0,
    "value": 59.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EyL7DAAV",
    "hero_image": "https://images.luxuryescapes.com/pv79kidlvuifvipfi59",
    "image_two": "https://images.luxuryescapes.com/2nt2fd40lxp16jio7w9l",
    "image_three": "https://images.luxuryescapes.com/tdhvdnkexcx0iq6qrao",
    "vendor_name": "The Oberoi Beach Resort Lombok",
    "title": "Five-Star Lombok Beachfront Bliss with Onsite Spa and Four Bars & Restaurants",
    "description": "Watch purple sunsets paint the sky every night at The Oberoi Beach Resort, Lombok, an exquisite oasis on the pristine shores of Medana Bay. Explore the enchanting waterfalls and lush rainforests of North Lombok, or immerse yourself in the vibrant local culture at the traditional Sasak village. Savour world-class dining at the resort's restaurants, or unwind in the spa. As the sun sets, retreat to your pavilion or villa, offering breathtaking views of the turquoise sea and Mount Rinjani.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Tanjung",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "The Oberoi Beach Resort, Lombok",
    "offer_address": "Medana Beach, Lombok, Indonesia, 83352",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 202.0,
    "value": 202.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IwKMIA0",
    "hero_image": "https://images.luxuryescapes.com/0mi7bl4y36kais0yrra",
    "image_two": "https://images.luxuryescapes.com/y2cladepn1lao5337g75r",
    "image_three": "https://images.luxuryescapes.com/wbz9gjhk5ix25tkfoha6",
    "vendor_name": "Seven Secrets by Hanging Gardens",
    "title": "Lombok Designer All-Suite Escape with Direct Beach Access & Three Dining Venues",
    "description": "The serene tranquillity of Lombok has been reimagined at this designer oceanfront escape. With interiors designed by Roberto Cavalli, including Italian Murano chandeliers and European marble, this five-star, all-suite retreat provides the best of Indonesian opulence.\n\nEnjoy anytime dining prepared by top chefs, beachfront cabanas, and discreet butler service. Unwind in your suite’s private jacuzzi, swim in the resort's infinity pool, or explore secluded reefs. As night falls, dine at L’Angelo Bianco or enjoy a cocktail at the Secret Beach Swim-Up Bar, while watching the sunset over the ocean.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Seven Secrets Resort by Hanging Gardens",
    "offer_address": "Jalan Raya Pemenang No. KM 10, Malaka, Kec. Pemenang, Kabupaten Lombok Utara, Nusa Tenggara Barat, 83352, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 219.0,
    "value": 219.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CtmEnYAJ",
    "hero_image": "https://images.luxuryescapes.com/ais48jcegnu3yy7g77",
    "image_two": "https://images.luxuryescapes.com/d4gtinljtp09nkrhfjsc",
    "image_three": "https://images.luxuryescapes.com/oec8giyanba2oi42ad",
    "vendor_name": "Royal Avila Boutique Resort",
    "title": "Cliffside Lombok Mediterranean-Inspired Suites with World-Class Spa & Beach Club",
    "description": "Soak up the serenity of Lombok while overlooking Malimbu Beach at this elegant Mediterranean-inspired sanctuary. With 54 intimate suites perched atop majestic cliffs, Royal Aviva Boutique offers a chance to truly switch off.\n\nWatch the sun's colours dance across the sky while sipping on a cocktail at Amavi's Beach Club, cool off in the sparkling infinity pool or enjoy a treatment at the outstanding Althea Spa. After a day trip to the Gili Islands for incredible snorkelling, retreat to Olive Restaurant & Bar to savour a mix of hearty and honest Mediterreanean dishes and sought-after local flavours.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Royal Avila Boutique Resort",
    "offer_address": "Malaka, Pemenang, North Lombok Regency, West Nusa Tenggara, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 306.0,
    "value": 306.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037KJxAAM",
    "hero_image": "https://images.luxuryescapes.com/9vb7mf9g8aagoimtt043",
    "image_two": "https://images.luxuryescapes.com/vrrgrtiytc6xtmffpka",
    "image_three": "https://images.luxuryescapes.com/bm0bb4ms9k63vek8k0g",
    "vendor_name": "Jeeva Beloam Beach Camp",
    "title": "Lombok Beachfront Eco-Lodge Hideaway on a Secluded Cove",
    "description": "Unearth a unique luxury hideaway, where you can get lost within 55 hectares of luscious forest fringed by white-sand beaches, at Jeeva Beloam Beach Camp. Located on the peaceful Indonesian island of Lombok, without the distraction of Wi-Fi or TV, this unique eco-retreat invites you to switch off from the world. Fulfil your castaway fantasies with a stay in one of just 11 beachfront eco-friendly lodges (beruga pantais). Marvel at the unpolluted skies above from the beachfront fire pit and watch the ocean gently lap the shores of Hidden Beach.\n\nFrom the moment you arrive at this secluded cove, you will be immersed in nature with kaleidoscopic snorkelling right off the beachfront, world-class surfing, kayaking, and fishing, and otherworldly hikes. For the best views, wake early to watch the sunrise over neighbouring Sumbawa island and feast on a seasonal, farm-to-plate menu of authentic Indonesian cuisine at the beachfront Tenda restaurant.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Jerowaru",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Jeeva Beloam Beach Camp",
    "offer_address": "Jl. Pantai Beloam Tanjung Ringgit, Sekaroh, Jerowaru, Kabupaten Lombok Timur, Nusa Tenggara Barat. 83672, Indonesia Lombok NTB 83672 Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037MDLAA2",
    "hero_image": "https://images.luxuryescapes.com/jzbhwwsdzpfov1dpm1q7",
    "image_two": "https://images.luxuryescapes.com/50lqaekf7q5p8wdscvo",
    "image_three": "https://images.luxuryescapes.com/s7syjmzxbb5sh0hyr2",
    "vendor_name": "Jeeva Santai Villas",
    "title": "Boutique Lombok Beachfront Suite Escape with Daily Breakfast & Nightly Cocktails",
    "description": "Embrace the pristine beauty of Bali’s sister island, Lombok, with a boutique stay at the serene Jeeva Santai Villas - a blissful property offering a collection of just 14 luxe villas and suites in a spectacular beachfront location. Easily reachable with a short flight or ferry ride from Bali, Lombok offers unspoiled beaches fringed by emerald palm trees, aquamarine waters and far fewer crowds than its more popular neighbour.\n\nExperience all the island has on offer from this boutique launchpad, where you’ll have everything you need at your fingertips, including two restaurants, two pools, private beach access, a serene spa and an open-air library and lounge. Unwind in one of the beautifully decorated suites and villas set amid lush tropical gardens, and let serenity find you on the shores of Lombok.\n\n**Luxury Escapes inclusions (select nights)**\n\n- **Daily à la carte breakfast** at the open-air Pearl’s restaurant\n- Feel relaxed with one **30-minute massage** per person\n- Toast your escape with one **daily cocktail** each\n- Indulge with your choice of set menu **lunch or dinner for two** (for stays of 3+ nights)\n- Enjoy an **additional lunch or dinner for two** (two total; for stays of 5+ nights)\n\n**Villa upgrades available:** For more privacy, upgrade to a Santai Pool Villa, a lavish space boasting a sundeck with private plunge pool and a private garden for intimate dining.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Jeeva Santai Villas",
    "offer_address": "Jl. Raya Mangsit-Sengiggi, Mangsit, Senggigi, Lombok 83355 Indonesia Lombok NTB Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003HFv0AAG",
    "hero_image": "https://images.luxuryescapes.com/hdmxjixidgmmmsd592t",
    "image_two": "https://images.luxuryescapes.com/waabvj1vj4fs8ckqvacs",
    "image_three": "https://images.luxuryescapes.com/kzxjxf6alekzompuvb9mb",
    "vendor_name": "Wyndham Sundancer Resort Lombok",
    "title": "Award-Winning Lombok Beachfront Suites with Daily Breakfast & Cocktails",
    "description": "Indulge all your tropical island dreams with a stay at Wyndham Sundancer Resort Lombok, an award-winning sanctuary surrounded by spectacular Indonesian landscapes. Sitting on a white-sand, azure-water beach and encircled by lush tropical jungle, this idyllic retreat is perfectly placed to experience the breathtaking beauty of Lombok, with easy access to secluded waterfalls, outstanding surf breaks and some of the world’s best coral reefs. Explore local villages to admire resident artisans creating woven goods, or visit one of the island’s pearl farms for an insider look into one of nature’s most revered materials.\n\nWyndham Sundancer Resort Lombok is a suite-only tropical escape, where relaxation is the first priority. Laze on a deck chair by the 900sqm pool, sipping on a cocktail or two, or find your spot at the private beach club to gaze over the crystal-clear ocean. Indulge in a pamper session in the candlelit treatment rooms of the Sundancer Spa, or sweat your way to serenity in the sauna and steam room. You’ll be spoilt for choice when it comes to dining: three distinct restaurants mean there’s always something new to try. Keen scuba divers will be mesmerised by the nearby Southern Gilis, a collection of 13 idyllic islands that hide some of the world’s best underwater scenery. The resort’s Dive Centre will have everything you need to start exploring, but beginners can also build their confidence with exceptionally experienced instructors in a section of the resort pool where depths drop to 3m. Stamped with a Tripadvisor Travellers' Choice Award 2020, this is one of Lombok's most serene spots.\n\n**Luxury Escapes inclusions (select nights/packages)**\n\n- Venture to Sunrise Restaurant for **daily à la carte breakfast** of Asian and Western dishes, including freshly baked pastries by an in-house pastry chef\n- Work your way through the resort’s drinks menu with **one cocktail per adult, per day** \n- Enjoy an indulgent **daily afternoon tea** with cookies, traditional snacks and a selection of teas and coffee (One-Bedroom Grand Suite and Two-Bedroom Deluxe Suite only)\n- With spectacular views over the ocean, your **one complimentary lunch or dinner for two** at The Bukit will be a meal to remember (for stays of 3+ nights)\n\n**Travelling with family?** The Two-Bedroom Deluxe Suite has space for four people, with twin beds in the second bedroom, a full kitchen, living/dining areas and private balcony.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Sekotong Barat",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Wyndham Sundancer Resort Lombok",
    "offer_address": "Raya Pandanan, Dusun Pandanan, Desa, Sekotong Barat, Central Sekotong, West Lombok Regency, West Nusa Tenggara 83000, Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnL4jYAF",
    "hero_image": "https://images.luxuryescapes.com/tkgw8w827jjbew2gs81",
    "image_two": "https://images.luxuryescapes.com/npv427222exh65pzdq16",
    "image_three": "https://images.luxuryescapes.com/kjg3r7ij7fdlw32u8atm",
    "vendor_name": "Pullman Lombok Merujani Mandalika Beach Resort",
    "title": "Beachfront Pullman Lombok Escape with Five Bars & Restaurants, Free-Form Pool & Rooftop Terrace",
    "description": "Set your watch to island time with an escape to this beachfront oasis located on Bali's spectacular sister island. Relax on the private beach, slip into the oceanfront pool, pamper yourself with a treatment at the heavenly Pullman Spa, or taste your way around the onsite restaurants.\n\nEmbrace the island lifestyle, knowing your only care in the world is which activity to pick. Catch the shuttle to nearby Kuta, ascend the towering Mount Rinjani for majestic sunsets, or use this five-star oasis as your launchpad to the Gili Islands, where you can snorkel and scuba dive to your heart's content.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Pullman Lombok Merujani Mandalika Beach Resort",
    "offer_address": "ITDC Tourism Complex BS2 Kuta, Pujut, Central Lombok 83573, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 94.0,
    "value": 94.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003Hv5aAAC",
    "hero_image": "https://images.luxuryescapes.com/3te6mha32zoyjzy3l1o",
    "image_two": "https://images.luxuryescapes.com/0fx80htbccvj2jpcjdof",
    "image_three": "https://images.luxuryescapes.com/0hs3m317lr9xn9if10e",
    "vendor_name": "Katamaran Resort",
    "title": "Idyllic Lombok Beachfront Retreat with Infinity Pool & Sunken Oceanfront Booths",
    "description": "High-end relaxation just got a little closer: welcome to Katamaran Hotel & Resort Lombok, a tropical oasis hidden on Bali’s pristine sister island, Lombok. This decadent destination combines hypnotic beauty and absolute beachfront vistas with designer sophistication - think strolls along Mangsit Beach’s unspoiled shoreline, dips in the glass beachfront infinity pool and sunset cocktails in one of the sunken oceanfront booths, surrounded by aquamarine water and flame torches.\n\nExperience a stay where nothing is out of reach: lounge in a swinging daybed at the pool (complete with kids' area), find your flow with yoga by the beach and discover true relaxation in ocean-facing spa treatment rooms. Let romance find you along the shore at The Sail Café & Bistro, where you can watch the sun melt into the Bali Sea and let your cares recede with the shoreline. As for exploration... Senggigi's tourist strip is effortlessly accessible and optional excursions to the kaleidoscopic Gili Islands, 'pink beach' and Mount Rinjani - an active volcano and Indonesia's second-highest peak - are available to book at reception.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Katamaran Hotel & Resort Lombok",
    "offer_address": "Jl. Raya Senggigi, Mangsit, Lombok 83355, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 7,
    "price": 103.0,
    "value": 103.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GksGAAS",
    "hero_image": "https://images.luxuryescapes.com/0eowa3ra14bx6l7hhjr8",
    "image_two": "https://images.luxuryescapes.com/y2jm2wtkjlm1ku9al4",
    "image_three": "https://images.luxuryescapes.com/bp4ra07q8lrxj9t8lka",
    "vendor_name": "The Oberoi Beach Resort Lombok",
    "title": "Five-Star Oberoi Lombok Beachfront Luxury",
    "description": "Enter into world-renowned luxury at The Oberoi Beach Resort, Lombok's best-kept secret, overlooking the crystal-clear waters of Medana Bay, unspoiled coral reefs and the underwater gardens of the Gili Islands.\n\nPart of the iconic Oberoi group, this is a multi-award-winning, five-star oasis where you can experience traditional thatched luxury in an authentic pavilion or expansive villa. Savour world-class dining across the resort's restaurants, including the unforgettable Ampitheatre - an open-air venue where you can watch traditional music and dance performances by the Indigenous Sasak people. Surrender to true relaxation along the private beachfront with an infinity pool that appears to melt into the glistening Indian Ocean as you soak up the sights and sounds of beautiful Lombok.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Tanjung",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "The Oberoi Beach Resort",
    "offer_address": "Medana Beach, Tanjung, Lombok 83352 Indonesia Lombok Indonesia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ey6a5AAB",
    "hero_image": "https://images.luxuryescapes.com/wfqi06dbkc2d9mp4iy1e",
    "image_two": "https://images.luxuryescapes.com/vb1u3de18cw2myykqz36",
    "image_three": "https://images.luxuryescapes.com/l34853fzz4zy3jdufl7h",
    "vendor_name": "Somewhere Lombok",
    "title": "Luxury Lombok Villa Hideaway with Onsite Restaurant & Spa",
    "description": "Discover a luxury hideaway in Lombok, featuring bespoke villas with private plunge pools overlooking a pristine bay. This intimate sanctuary, set against the backdrop of a world-class surf beach and framed by lush palm trees, offers the perfect tranquil escape.\n\nImmerse yourself in nature’s beauty as you hit the waves or simply relax poolside, taking in stunning valley and sea views. Enjoy locally sourced international fusion cuisine, sip on a refreshing cocktail and embrace tranquillity with ample opportunities for mindfulness and relaxation. End your day watching the sky ignite with the colours of a breathtaking sunset.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Kuta",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Somewhere Lombok",
    "offer_address": "Gili Nusa Estate, Pujut. Lombok Tengah, Tumpak 83572, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 207.0,
    "value": 207.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009C4jIAAS",
    "hero_image": "https://images.luxuryescapes.com/utphe6t43ebp6n53gi3k",
    "image_two": "https://images.luxuryescapes.com/1td9wvuozbewu3kocfff",
    "image_three": "https://images.luxuryescapes.com/2x8h24ct6vnnu2yxn0ar",
    "vendor_name": "Qunci VIllas",
    "title": "Serene Five-Star Lombok Hideaway with Direct Beach Access",
    "description": "Immerse yourself in the beach-blessed beauty of Bali's sister island with a boutique escape at Qunci Villas. Perfectly poised on the laidback golden sands of Mangsit Beach, only five minutes from Senggigi's centre and a short boat ride to the breathtaking Gili Islands, this serene island hideaway offers the utmost in luxury and privacy.  With three exceptional restaurants offering Italian, Indonesian and tapas dining options, a blissful on-site spa, three stunning swimming pools and direct beach access, it is the perfect launchpad for families and couples looking for their slice of paradise.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Senggigi",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Qunci Villas",
    "offer_address": "Jl. Raya Mangsit - Senggigi Km. 5, Mangsit, Senggigi, Batu Layar, West Lombok Regency, West Nusa Tenggara, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 254.0,
    "value": 254.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GffkyAAB",
    "hero_image": "https://images.luxuryescapes.com/vutzmmrnbecit9rsayq",
    "image_two": "https://images.luxuryescapes.com/idcvd4h91pu03x23raqu",
    "image_three": "https://images.luxuryescapes.com/ba9r8f2xqpp82ys73y9",
    "vendor_name": "Selong Selo Resort & Residences",
    "title": "Refined Lombok Cliffside Private Pool Studios & Villas for up to 15 People",
    "description": "Lombok luxury awaits at the boutique Selong Selo Resort & Residences, breathtakingly positioned upon jungle-clad clifftops with spectacular ocean views. The resort’s eco-friendly studios and villas all showcase Seminyak-inspired beach cool, with artisanal furniture, Indonesian sculpture and private infinity pools that blend seamlessly into the horizon. Embrace euphoria at the spa, walk along the beach, and dine on local specialities at Aura Lounge & Bar.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Praya Barat",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Selong Selo Resort & Residences",
    "offer_address": "Jalan Batu Jangkih Sepi Mungkung Selong Belanak, Mangkung, West Praya, Kabupaten Lombok Tengah, West Nusa Tenggara Lombok, 83571, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 101.0,
    "value": 101.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037MDkAAM",
    "hero_image": "https://images.luxuryescapes.com/42gje7mmdjnu5nmlbsn",
    "image_two": "https://images.luxuryescapes.com/ibfail5hbedhbl3wdld",
    "image_three": "https://images.luxuryescapes.com/3e89sz1c5zbh96benhw",
    "vendor_name": "Hotel Tugu Lombok",
    "title": "Romantic Lombok Beachfront Escape with Daily Breakfast & Cocktails",
    "description": "Escape to Hotel Tugu Lombok for a serene beachfront break amid the white sands, aquamarine waters and lush palm trees of Bali's sister island. Situated on pristine Sire Beach, this romantic hotel is peppered with Indonesian antiques and artwork, paying homage to the area’s spirit, culture and history.\n\nA tranquil base for visitors to Lombok, Hotel Tugu Lombok offers every modern amenity guests could dream of, including an indoor and outdoor pool, complimentary Wi-Fi, BBQ facilities, spa, library, bicycle rental, hot tub, bar, restaurant and more. It's little wonder this fantastic hotel ranks among the top five out of almost 400 in Lombok on Tripadvisor and is stamped with a Travellers' Choice Award 2020.\n\n**Luxury Escapes inclusions (select nights)**\n\n- Wake up to **daily à la carte breakfast** at the onsite Kokok Pletok restaurant\n- Enjoy **daily afternoon tea** served between 4.30pm and 6pm\n- Sip one **complimentary tropical cocktail per person every day** at the bar\n- Settle into relaxation with a **15-minute welcome massage per person**\n- Get things off to a great start with **one welcome cocktail per person**\n- Relax with a **60-minute massage** at the onsite spa per adult (for stays of 3+ nights)\n- Savour **one three-course dinner for two** at Kokok Pletok restaurant (for stays of 5+ nights)\n\n**Private pool villa upgrade available:** Upgrade to a Bhagavat Gita Beachfront Pool Villa, housed in a beautiful beachfront building with a private plunge pool and direct beach access.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "West Nusa Tenggara",
    "offer_geo_area_level_2": "Tanjung",
    "location_heading": "Lombok",
    "location_subheading": "Indonesia",
    "location_description": "Hotel Tugu Lombok",
    "offer_address": "Jl. Pantai Sire, Desa Sigar Penjalin, Kecamatan Tanjung, Sigar Penjalin, Tanjung, Kabupaten Lombok Utara, Nusa Tenggara Bar. 83352, Indonesia Lombok Lombok 83352 Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 195.0,
    "value": 195.0
  }
]