[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002GRDhAAO",
    "hero_image": "https://images.luxuryescapes.com/e3y2egyj1o3spx627az7",
    "image_two": "https://images.luxuryescapes.com/y0wudqlj10z5pp8i3i",
    "image_three": "https://images.luxuryescapes.com/zvqf36c21l0opjhc4a",
    "vendor_name": "Lohono Stays by Isprava",
    "title": "Luxurious Lonavala Six-Person Villa Stay with Nightly Dinner & High Tea",
    "description": "Escape the city and head to Lohono Wildberry, a heavenly retreat tucked in the hills of the Western Ghats in scenic Lonavala. A collection of just three homely and luxurious villas, Lohono Wildberry is the ideal home-away-from-home escape where you can unwind in the lap of nature and seclusion along with your friends and family. Stay in a three-bedroom villa valid for six people (plus two infants aged four years and under) with daily breakfast, nightly three-course dinner, daily high tea, one welcome bottle of wine to share and complimentary Wi-Fi.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Wadgaon",
    "location_heading": "Lonavala",
    "location_subheading": "Maharashtra",
    "location_description": "Lohono Wildberry",
    "offer_address": "Ekvira Devi Road, Malavali, 410405 Lonavala, India",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 396.0,
    "value": 653.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gVzTAAU",
    "hero_image": "https://images.luxuryescapes.com/1o7yhuqcow2ccpjp8jz",
    "image_two": "https://images.luxuryescapes.com/soy5ztao7hgkdt7nxwi",
    "image_three": "https://images.luxuryescapes.com/1ry70t7pr2ea3q5h8our",
    "vendor_name": "Rhythm Resort Lonavala",
    "title": "Peaceful Lonavala Hill Station Suite Escape with Daily Breakfast, Drinks & Guaranteed Room Upgrade",
    "description": "Rhythm Lonavala is a quiet sanctuary of bliss, serenity and tranquillity hidden away from bustling city life, perfect for a weekend getaway from Pune and Mumbai. Located in the beautiful hill station Lonavala, the resort is an easy drive from Mumbai (approximately two hours) and Pune (approximately 90 minutes). Designed to find the perfect balance between contemporary amenities and mother nature, the resort is a true reflection of harmony.\n\nAn all-suite property with spacious rooms designed with love that overlook a beautiful pool, Rhythm Lonavala will steal your heart. To spoil you rotten, there is a choice of four amazing dining venues onsite, where you will be taken on a gastronomical adventure like never before. A dedicated play area for your precious little ones will keep them entertained throughout your stay. Relax and rejuvenate at the spa, or enjoy special wellness programmes and yoga retreats (extra charges may apply) to help you align your chakras and let go of all your worries.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Lonavala",
    "location_heading": "Lonavala",
    "location_subheading": "Maharashtra",
    "location_description": "Rhythm Lonavala",
    "offer_address": "Bajrang Baug Gardens, On Old Mumbai-Pune Highway, Tungarli, Lonavla, Maharashtra, India 410401",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 223.0,
    "value": 355.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xs4jAAA",
    "hero_image": "https://images.luxuryescapes.com/qo91ehfd4ruxny0l0rfj",
    "image_two": "https://images.luxuryescapes.com/elnnpyuhzdju93oe54n6",
    "image_three": "https://images.luxuryescapes.com/xwgw6utsticuc3z6bie",
    "vendor_name": "Radisson Resort & Spa Lonavala",
    "title": "Grand Opening: Luxe Radisson Stay in Lonavala with Daily Breakfast & Nightly Drinks",
    "description": "Stumble upon peace and serenity at Radisson Resort & Spa Lonavala, a brand-new retreat hidden within one of Maharashtra's most popular hill stations. Away from the hustle and bustle of main Lonavala city, this luxe resort is less than two hours from Mumbai and 1.5 hours from Pune, making it the perfect weekend destination. Scattered across 14,100sqm, the resort offers sweeping views of the surrounding Sahyadri ranges and sits close to Lonavala's major attractions such as Karla Caves, Bhushi Dam, Rajmachi Point and more.\n\nBoasting a beautiful blend of locally inspired Maratha architecture and eco-friendly designs, this retreat lets you experience the calm ambience of Lonavala uninterrupted. Plus, contemporary luxuries such as an outdoor pool, multiple dining options and an indulgent spa make Radisson Resort & Spa Lonavala totally irresistible for holiday seekers.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Lonavala",
    "location_heading": "Lonavala",
    "location_subheading": "India",
    "location_description": "Radisson Resort & Spa Lonavala",
    "offer_address": "Plot No - 19, 21 & 27-29, Gold Valley Sector D, Tungarli, Lonavla, Maharashtra 410401",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 260.0,
    "value": 631.0
  }
]