[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMsIqAAL",
    "hero_image": "https://images.luxuryescapes.com/fh3x9hsf8lctkfy5xc3l",
    "image_two": "https://images.luxuryescapes.com/ptpmcdwd647equa7wo",
    "image_three": "https://images.luxuryescapes.com/ttlgih9pvlww0gf3i20g",
    "vendor_name": "The Godfrey Hollywood",
    "title": "Central Hollywood Glamour with Rooftop Bar, Daily Breakfast & Nightly Drinks",
    "description": "Retro-chic Hollywood glamour and a central location, steps from Sunset Boulevard, await at this Los Angeles city break. A cosmopolitan gem, this thoughtfully designed stay offers an idyllic introduction to the spoils of Tinseltown, putting you within walking distance of iconic sights such as the Hollywood Walk of Fame and the Chinese Theatre.\n\nWhen you aren't admiring the hotel's curated art program, soak up the skyline from a dazzling seventh-floor perch at I|O Rooftop, the hotel's social hub boasting craft cocktails, a swimming pool and live music beneath the historic Hollywood Sign. On ground level, dine on premium fish and meat at the vibrant eatery, About Last Knife, where seasonal Southern Californian cuisine informs a sophisticated all-day menu.\n\nWith waived amenity fees included, you are granted complimentary access to a fully-equipped 24-hour fitness centre and great discounts on some of the must-see local hotspots, including Long Beach Aquarium, Ripley’s Believe It Or Not! museum and Starline Tours, as well as free off-peak entry to the Getty Villa.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "The Godfrey Hotel Hollywood",
    "offer_address": "1400 North Cahuenga Boulevard, Los Angeles, California 90028, United States",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 16,
    "price": 399.0,
    "value": 843.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HtcqrYAB",
    "hero_image": "https://images.luxuryescapes.com/r9cqacp7ad4qjk3zf718",
    "image_two": "https://images.luxuryescapes.com/udvkoz49k17c33lsjax7h",
    "image_three": "https://images.luxuryescapes.com/3mu7gwzpba6ncpkutgct",
    "vendor_name": "Montrose at Beverly Hills",
    "title": "Sophisticated West Hollywood Suites with Daily Breakfast, Daily US$25 Dining Credit & Parking",
    "description": "Rock star vibes meet Beverly Hills glam at this all-suite sanctuary where music legends have kicked back and A-listers call home. With 133 oversized suites, a sun-soaked rooftop pool scene and tennis courts that have seen more celebrity serves than Wimbledon, this place walks the walk. Experience LA’s playground for the rich and famous - tucked away in one of the most glamorous enclaves, down a tree-lined street perfectly poised between Beverly Hills and West Hollywood. \n\nSavour a morning coffee at Montrose Market or enjoy a handcrafted drink at Tonic rooftop bar after a day of exploring. This stylish hideaway is where Hollywood's energy comes alive, whispering exclusivity but shouting luxury.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "West Hollywood",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "Montrose at Beverly Hills",
    "offer_address": "900 Hammond Street, West Hollywood, California 90069, United States",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 469.0,
    "value": 1196.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IepSXAAZ",
    "hero_image": "https://images.luxuryescapes.com/ux4stz9u38xv7evecjx4",
    "image_two": "https://images.luxuryescapes.com/6vmj691mlpsz8sui4tkg",
    "image_three": "https://images.luxuryescapes.com/1bhmgdljrpf0a91gytrx",
    "vendor_name": "CLOSED Mama Shelter LA -",
    "title": "Boutique Hollywood Glamour near Sunset Boulevard with Rooftop Bar & Daily Breakfast",
    "description": "Immerse yourself in the glitz and glamour of Hollywood with a stay at the chic Mama Shelter Los Angeles, a vibrant boutique escape nestled in the heart of Tinseltown. This hip hotel is perfectly situated for exploring the iconic Walk of Fame, the historic Chinese Theatre and the star-studded Hollywood Hills.\n\nAscend to the hotel's rooftop, a buzzing social hub where you can sip on craft cocktails, savour Californian cuisine and soak up panoramic views of the city's twinkling skyline and the Hollywood sign in the distance.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "Mama Shelter Los Angeles Hollywood",
    "offer_address": "6,500 Selma Avenue, Los Angeles, California 90028, United States",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 389.0,
    "value": 603.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IVMYIA4",
    "hero_image": "https://images.luxuryescapes.com/psg81pxny39slf7hnnd",
    "image_two": "https://images.luxuryescapes.com/1a3z6y80wus6auum5eqb",
    "image_three": "https://images.luxuryescapes.com/cpqfy0zilo4m1wy74m2",
    "vendor_name": "Fairmont Century Plaza",
    "title": "Los Angeles Opulence near Beverly Hills with Daily Breakfast & Daily US$50 Dining Credit",
    "description": "Situated in the heart of LA and just minutes from Beverly Hills, this iconic hotel is the epitome of refined glitz and glamour. Since opening its doors in 1966, it has hosted A-list celebrities and U.S. presidents, cementing its status as a symbol of LA sophistication.\n\nDine in elegant surroundings at Lumiere, a chic French brasserie with a California twist, or enjoy handcrafted cocktails at The Bar, with live music and DJ sets setting the mood. Take relaxation to the next level at one of LA’s largest spas, or get pampered at the prestigious Cristophe Salon.\n\nThe striking city skyline is best enjoyed from the rooftop infinity pool, complete with the stylish ¡ESTA! pool bar serving up refreshing tipples, small bites and relaxed vibes. A state-of-the-art fitness centre is on hand with expert-led classes and personal training, while Beverly Hills' boutiques, West Hollywood's nightlife and LA’s cultural landmarks are all within easy reach.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "Fairmont Century Plaza",
    "offer_address": "2025 Avenue of the Stars, Los Angeles, California 90067, United States",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 1059.0,
    "value": 2159.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GxIyzYAF",
    "hero_image": "https://images.luxuryescapes.com/brzhe5d1mle3gsln198",
    "image_two": "https://images.luxuryescapes.com/u96dkariqrkwwim57m9",
    "image_three": "https://images.luxuryescapes.com/pxyfnc92q9bh9w95ksul",
    "vendor_name": "Mondrian Los Angeles",
    "title": "West Hollywood Sunset Boulevard Glamour with Daily Cocktail & Daily US$25 Dining Credit",
    "description": "Experience the glitz and glam of the City of Angels in style at Mondrian Los Angeles, a designer oasis on Sunset Boulevard in the heart of West Hollywood. This modern inner-city hotel is perfect for couples and families. Indulge in Californian-Mexican cuisine at the onsite Casa Madera and top it off with sweeping city views from the rooftop Skybar and pool.\n\nPerfectly positioned, you'll find yourself steps from California’s top attractions. Take a stroll down Sunset Boulevard, indulge in a shopping spree at Sunset Plaza, or spot your favourite celebrities along the Hollywood Walk of Fame. Keep active in the onsite fitness centre or even rejuvenate with a spa service in your own room.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "West Hollywood",
    "location_heading": "Los Angeles",
    "location_subheading": "California, USA",
    "location_description": "Mondrian Los Angeles",
    "offer_address": "8440 W Sunset Boulevard, West Hollywood, California 90069, USA",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 539.0,
    "value": 849.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RASUEQA5",
    "hero_image": "https://images.luxuryescapes.com/wvfvzbyuhosl2ucdpjdy",
    "image_two": "https://images.luxuryescapes.com/kwbsejqvahoq0zwopv2a",
    "image_three": "https://images.luxuryescapes.com/bngu7smjytpr2vnkcqlz",
    "vendor_name": "Montrose at Beverly Hills",
    "title": "Boutique L.A Luxury in Hollywood",
    "description": "Experience LA’s glamorous playground for the rich and famous with a five-night escape at the all-suite Le Montrose Suite Hotel in West Hollywood. Includes daily à la carte breakfasts, an early check-in and a late checkout.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles County",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "Le Montrose Suite Hotel - 2018",
    "offer_address": "900 Hammond St, West Hollywood, CA 90069, USA",
    "percentage_discount": 35.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 1084.0,
    "value": 1657.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EDnvhYAD",
    "hero_image": "https://images.luxuryescapes.com/2y97ijy6k9c6bbaklui",
    "image_two": "https://images.luxuryescapes.com/x9gtn8r6zty9wmgii9jh",
    "image_three": "https://images.luxuryescapes.com/m9ema5cezt0wwo7umq1",
    "vendor_name": "The Delphi Downtown LA",
    "title": "Chic Downtown Los Angeles Escape with Daily Breakfast, Daily Hotel Credit & Guaranteed City Views",
    "description": "Once the headquarters of the esteemed Superior Oil, this chic, revamped sanctuary boasts a prime spot in the heart of downtown Los Angeles, moments from the world-famous Museum of Contemporary Art and the Grammy Museum.\n\nIf you're feeling peckish, turn back the clocks to the 1950s and savour hearty bites at Denae's diner, serving up classic American staples with a twist, and sip on drinks from the Delphi Lounge while listening to live jazz.\n\nTake advantage of the hotel's location and explore the nearby Arts District, home to a plethora of galleries, and check out downtown's trendy boutiques and bars. Plus, for a taste of Hollywood glamour, the historic TCL Chinese Theatre offers a chance to walk in the footsteps of the stars.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "The Delphi Downtown LA",
    "offer_address": "550 Flower Street, Los Angeles, California 90071, United States",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 369.0,
    "value": 795.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IpteRYAR",
    "hero_image": "https://images.luxuryescapes.com/4avqw12g7lsj70h8dmvl",
    "image_two": "https://images.luxuryescapes.com/tyx1gry4fpwedf578dw7",
    "image_three": "https://images.luxuryescapes.com/j0qikmxd6vpvbnav840o",
    "vendor_name": "Dream Hotel Hollywood",
    "title": "Stylish Hollywood Glamour Near Walk of Fame with Rooftop Pool and Daily Breakfast",
    "description": "Experience Hollywood's glitz and glamour with an escape in the heart of Tinseltown. Ideal for first-time travellers, Dream Hollywood is located along the palm-lined streets of Los Angeles, placing you a stone's throw from the famous Hollywood Walk of Fame and the historic TCL Chinese Theatre.\n\nTake in sweeping views of the Hollywood Hills from the city's swishest rooftop pool, and enjoy a convenient grab-and-go breakfast at Turntable Bar to make your mornings effortless.\n\nUse this central retreat as your launchpad to discover the star-studded neighbourhoods of Los Angeles -- Hollywood Boulevard and the boutique of Melrose Avenue are just a short stroll, while the trendy neighbourhoods of Beverley Hills and Santa Monica are a short drive away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "Dream Hollywood, by Hyatt",
    "offer_address": "6417 Selma Avenue, Hollywood, Los Angeles, California 90028, United States",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 459.0,
    "value": 1010.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HnX7IAK",
    "hero_image": "https://images.luxuryescapes.com/1w6bxvjw7zrb15e4b",
    "image_two": "https://images.luxuryescapes.com/dxykh0w8n4c7kl96m33",
    "image_three": "https://images.luxuryescapes.com/1cy04v754y5hrbowwlip",
    "vendor_name": "The Shay - Destination by Hyatt",
    "title": "Central Los Angeles Retro Escape with Daily US$50 Hotel Credit & Rooftop Pool",
    "description": "Experience a chic urban retreat at this Hyatt hotel in sunny Culver City, California. Enjoy a rooftop pool with stunning views of the Hollywood Hills and downtown Los Angeles. The eclectic lobby features cosy fire pits, pop-up shops and vibrant rooftop gatherings. Savour diverse flavours and creative cocktails at The Rooftop, an award-winning restaurant by the Jose Andres Group. Whether you're visiting Hollywood studios or exploring Ivy Station’s tech hub, this hotel is your perfect gateway to the City of Angels.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "The Shay, a Destination by Hyatt Hotel",
    "offer_address": "8801 Washington Boulevard, Culver City, California 90232, United States",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 559.0,
    "value": 1055.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G4vTBAAZ",
    "hero_image": "https://images.luxuryescapes.com/5i2nxbdehiybwt16523i",
    "image_two": "https://images.luxuryescapes.com/flis9d3u6ijvjcs6a0c",
    "image_three": "https://images.luxuryescapes.com/8v55v5nntz1n9rhzr1x",
    "vendor_name": "The Hoxton, Downtown LA",
    "title": "Creative Downtown LA Luxury with Daily Breakfast Packs & Rooftop Pool",
    "description": "Equal parts laid-back Californian beach vibes and classic Hollywood allure, give in to the enchanting charm of Los Angeles with a serene stay at The Hoxton, Downtown LA. This urban retreat, nestled in the vibrant heart of Downtown, serves as a gateway to iconic city landmarks, from the renowned Hollywood Walk of Fame and the historic Grand Central Market to LA's renowned culinary scene. An impressively historic building set along the bustling Broadway, the hotel houses a variety of serene and expertly styled suites, featuring sleek chevron flooring, Mexican-inspired handmade tiles and subtle nods to its East London origins.\n\nUnwind with cocktails at the rooftop bar while taking a dip in the sparkling pool, or savour Peruvian-inspired, shareable dishes against the backdrop of Broadway at Cabra by chef Stephanie Izard. Descend to the vibrant lobby area for delectable comfort food infused with Californian flair at Moonlark's Dinette, providing breakfast, lunch and dinner options from early until late.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "The Hoxton, Downtown LA",
    "offer_address": "1060 S Broadway, Los Angeles CA 90015 USA",
    "percentage_discount": 38.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 719.0,
    "value": 1158.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aiCPFQA2",
    "hero_image": "https://images.luxuryescapes.com/j5qbnsle1xrziw68uu3e",
    "image_two": "https://images.luxuryescapes.com/nw0etrhubtlfszt2e7q4",
    "image_three": "https://images.luxuryescapes.com/fiwgqkyxsda675mghvy7",
    "vendor_name": "Montrose at Beverly Hills",
    "title": "Boutique West Hollywood Luxury with Daily Wine Hour",
    "description": "Experience LA’s playground for the rich and famous staying in the most glamourous of locations-tucked away down a tree-lined street and nestled between Beverly Hills and West Hollywood. Get a taste of high-end Hollywood with a four or six-night escape at the all-suite Montrose West Hollywood with daily continental breakfast, nightly free-flow Vino and Vinyl hour for two and an included amenity fee which gives you access to the 24-hour fitness centre, daily-replenished water bottles and more.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "West Hollywood",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "Montrose West Hollywood - Feb 19",
    "offer_address": "900 Hammond St, West Hollywood, CA 90069, USA",
    "percentage_discount": 54.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 1068.0,
    "value": 2317.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I750IAC",
    "hero_image": "https://images.luxuryescapes.com/8zr68au6eiz86h5akvt",
    "image_two": "https://images.luxuryescapes.com/q1kt8k98w9vyf7n6ljl",
    "image_three": "https://images.luxuryescapes.com/2fczc146ahuk1k9e9b",
    "vendor_name": "The Line Hotel, LA",
    "title": "Trendy Los Angeles Koreatown Urban Escape with Hollywood Hills Views, Daily US$25 Dining Credit & Nightly Cocktails",
    "description": "Experience LA like a local at this urban-chic K-Town stay that’s effortlessly hip and happening. Feel star-struck in a room that feels like a contemporary art gallery, featuring industrial concrete walls covered in modern artwork, quirky furniture and floor-to-ceiling windows showcasing an unmatched spotlight on the Hollywood Sign.\n\nIn a neighbourhood known for its nightlife, The LINE houses two of its most popular hangs - Deco discoteque Kiss Kiss Bang Bang and Break Room 86, home to all things 80s. Venture up to the terrace for fine dining delights at Openaire, dripping in lush plants and boasting a mouth-watering menu from award-winning chef Josiah Citrin. A cool suite of guest activities - including tai chi, drunk astrology and game nights - round out this hotel's truly unique offerings.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "The LINE LA",
    "offer_address": "3515 Wilshire Boulevard, Los Angeles, California 90010, United States",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 359.0,
    "value": 629.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GdsNUAAZ",
    "hero_image": "https://images.luxuryescapes.com/4ep1dxbxi4lycu8zatlt",
    "image_two": "https://images.luxuryescapes.com/svv7o0ml8hqhmxe2eo5",
    "image_three": "https://images.luxuryescapes.com/62qqrcrnuevno3m7lixo",
    "vendor_name": "CLOSED Mama Shelter LA -",
    "title": "Boutique Hollywood Glamour near Sunset Boulevard with Rooftop Bar & Daily Breakfast",
    "description": "Immerse yourself in the glitz and glamour of Hollywood with a stay at the chic Mama Shelter Los Angeles, a vibrant boutique escape nestled in the heart of Tinseltown. This hip hotel is perfectly situated for exploring the iconic Walk of Fame, the historic Chinese Theatre and the star-studded Hollywood Hills. Ascend to the hotel's rooftop, a buzzing social hub where you can sip on craft cocktails, savour Californian cuisine and soak up panoramic views of the city's twinkling skyline and the Hollywood sign in the distance.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "Mama Shelter Los Angeles Hollywood",
    "offer_address": "6,500 Selma Avenue, Los Angeles, California 90028, United States",
    "percentage_discount": 30.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 659.0,
    "value": 939.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IVIvIAO",
    "hero_image": "https://images.luxuryescapes.com/hh9zfr10m8ju2zwhonn",
    "image_two": "https://images.luxuryescapes.com/66pmt8o71zbs80w3l9w",
    "image_three": "https://images.luxuryescapes.com/2adpigic2lvuua0vd0td",
    "vendor_name": "Dream Hotel Hollywood",
    "title": "Hollywood Glamour Near Walk of Fame with Rooftop Pool",
    "description": "Experience Hollywood's glitz and glamour with an escape in the heart of Tinseltown. Ideal for first-time travellers, Dream Hollywood is located along the palm-lined streets of Los Angeles, placing you a stone's throw from the famous Hollywood Walk of Fame and the historic TCL Chinese Theatre.\n\nSoak up sprawling Hollywood Hills views from the city's swankiest rooftop pool, lounge and grill, and experience far-east Asian-inspired cuisine at the multi-level TAO Asian Bistro. Or, take in the movie-worthy setting from the Highlight Room Restaurant, boasting market-fresh cuisine and panoramic views of the city.\n\nUse this central retreat as your launchpad to discover the star-studded neighbourhoods of Los Angeles. Hollywood Boulevard and the boutique of Melrose Avenue are just a short stroll away, and the trendy neighbourhoods of Beverley Hills and Santa Monica are a short drive away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "Dream Hollywood, by Hyatt",
    "offer_address": "6417 Selma Avenue, Hollywood, Los Angeles, California 90028, United States",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 399.0,
    "value": 901.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ESRekYAH",
    "hero_image": "https://images.luxuryescapes.com/eufcpbsl5gh020rncm",
    "image_two": "https://images.luxuryescapes.com/zuw74yofbrdsa3oe6p7fh",
    "image_three": "https://images.luxuryescapes.com/mr5ba5bki9mbdeswv2ob",
    "vendor_name": "The Godfrey Hollywood",
    "title": "Central Hollywood Glamour with Rooftop Bar, Club Access, Daily Buffet Breakfast & Nightly Drinks",
    "description": "Embrace old Hollywood glamour at this Los Angeles design haven, sitting just a block south of Sunset Boulevard. A cosmopolitan gem, this thoughtfully designed stay offers an idyllic introduction to the spoils of Tinseltown, putting you within walking distance of iconic sights such as the Hollywood Walk of Fame and the Chinese Theatre.\n\nWhen you aren't admiring the hotel's curated art program, soak up the skyline from I|O Rooftop, the hotel's social hub boasting craft cocktails, a swimming pool and live music, or dine on premium fish and meat at the vibrant eatery, About Last Knife Restaurant & Bar, found on the ground floor.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "The Godfrey Hotel Hollywood",
    "offer_address": "1400 North Cahuenga Boulevard, Los Angeles, California 90028, United States",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 16,
    "price": 389.0,
    "value": 845.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000RAjNBQA1",
    "hero_image": "https://images.luxuryescapes.com/cracuxfdxpzztlwyp4uw",
    "image_two": "https://images.luxuryescapes.com/sfbhelfs8f0f6i1ic7rm",
    "image_three": "https://images.luxuryescapes.com/fnqfeyimprjinuh8gidl",
    "vendor_name": "The NoMad Hotel Los Angeles",
    "title": "Grand Opening Glamour in the Heart of L.A.",
    "description": "Be one the first guests to stay at the newly opened The NoMad Hotel in Downtown Los Angeles. Think dishes designed by a Michelin-starred chef, mixologist-created cocktails on one of the city’s most fashionable rooftops, classic free-standing bathtubs where you can read your favourite novel, and your morning caffeine fix served in a Venetian-style coffee bar - all within easy reach of everything L.A. has to offer.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "The NoMad Hotel Los Angeles",
    "offer_address": "649 S Olive St, Los Angeles, CA 90014, USA",
    "percentage_discount": 42.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 1004.0,
    "value": 1745.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DJYL4YAP",
    "hero_image": "https://images.luxuryescapes.com/zi82bowhtszytwdmtgk",
    "image_two": "https://images.luxuryescapes.com/4hrvb6sfxm0a1i004wu",
    "image_three": "https://images.luxuryescapes.com/fd8f7x9jqpaxrmvp2ma9",
    "vendor_name": "The Hollywood Roosevelt",
    "title": "Heritage Hollywood Icon on Los Angeles Walk of Fame with Daily Breakfast & Nightly Drinks",
    "description": "Immerse yourself in the glitz and glamour of this iconic Hollywood hotel with a legendary past. Once a bustling hub for Hollywood's elite, including stars like Marilyn Monroe and Charlie Chaplin, and the original site of the Academy Awards, this hotel’s allure has been preserved and enhanced through thoughtful renovations.\n\nEnjoy endless excitement with seven unique onsite restaurants and bars. Start your day like a star at Rosy Cafe, where acai bowls, breakfast burritos and cold-pressed juices await. Recharge at the fitness centre or unwind in a yoga class, then relax by the sparkling pool lined with palm trees and sunloungers, sipping a cocktail from the retro 1960s-inspired Tropicana Bar.\n\nThis refined retreat is the perfect launching pad for exploring Los Angeles' celebrity-filled neighbourhoods. Discover endless adventures - from snapping photos at the Walk of Fame and hiking Runyon Canyon to catching a concert at the Hollywood Bowl or shopping along Melrose Avenue - all just moments away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "California",
    "location_description": "The Hollywood Roosevelt",
    "offer_address": "7000 Hollywood Boulevard, Los Angeles, California 90028, United States",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 489.0,
    "value": 1173.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HiIEIA0",
    "hero_image": "https://images.luxuryescapes.com/xl2vcz3xqlnkfl09nfkn",
    "image_two": "https://images.luxuryescapes.com/fmpfn66mk94hl1dyx5x9",
    "image_three": "https://images.luxuryescapes.com/ryussmcv8kc7xn5q9rho",
    "vendor_name": "Omni Los Angeles at California Plaza",
    "title": "Glamorous Los Angeles Stay Near Universal Studios with Heated Outdoor Pool & Thee Onsite Dining Venues",
    "description": "Experience the vibrancy of Los Angeles with a stay at this modern downtown gem. You'll be perfectly positioned for exploring the city's cultural and culinary delights, with The Museum of Contemporary Art, Walt Disney Concert Hall and Grand Central Market less than a 10-minute walk away.\n\nAfter a day of sightseeing, return to the hotel's two sophisticated restaurants: savour seasonal Californian plates at Noé Restaurant and Bar or enjoy a delicious brunch at Grand Café. For fitness enthusiasts, there's a state-of-the-art gym onsite and a heated lap pool offering panoramic city views.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "Omni Los Angeles Hotel at California Plaza",
    "offer_address": "251 S Olive Street, Los Angeles, California 90012, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 197.0,
    "value": 197.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ewq83AAB",
    "hero_image": "https://images.luxuryescapes.com/2a5li3r20aq10elmhh4a",
    "image_two": "https://images.luxuryescapes.com/yq44r34zpdundvae56eo",
    "image_three": "https://images.luxuryescapes.com/8ww0t2864mra8w3imwr",
    "vendor_name": "Sunset Tower Hollywood",
    "title": "Los Angeles Art Deco Escape on Sunset Strip with Rooftop Pool & Bar",
    "description": "Live the high life in the heart of Tinseltown with a stay at the gorgeous Sunset Tower Hotel in West Hollywood. Standing tall on the iconic Sunset Strip, this Art Deco beauty is celebrated for its heritage charm and modern luxuries. After days spent star-spotting, take yourself to The Tower Bar and Restaurant for an elegant, Old Hollywood-inspired meal and indulge in a poolside cocktail at the rooftop Terrace Bar.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "West Hollywood",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "Sunset Tower Hotel",
    "offer_address": "8358 Sunset Blvd, West Hollywood, CA 90069, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 337.0,
    "value": 337.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ez3JyAAJ",
    "hero_image": "https://images.luxuryescapes.com/oojyp6r89ox7lmy3cx6t",
    "image_two": "https://images.luxuryescapes.com/r51kwkg0shkfpilzvmi",
    "image_three": "https://images.luxuryescapes.com/39rkkqutoch7msi6f7ot",
    "vendor_name": "The Godfrey Hollywood",
    "title": "Glamourous Los Angeles City Break with Rooftop Pool & Bar Overlooking the Hollywood Sign",
    "description": "Discover Tinseltown with a stay at The Godfrey Hotel Hollywood, boasting a trendy rooftop bar and pool overlooking the world-famous Hollywood Sign and minutes from the Sunset Strip. Soak up the glitzy interior designed and curated arts program, as well as a convenient location in the heart of this showbiz-loving city. Fill your days with hiking, shopping, and sightseeing around Los Angeles, and your evenings lounging high above the sparkling lights.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "The Godfrey Hotel Hollywood",
    "offer_address": "1400 North Cahuenga Boulevard, Los Angeles, California 90028, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 126.0,
    "value": 126.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004P5bgAAC",
    "hero_image": "https://images.luxuryescapes.com/lh7eyh595oql7uvjg3de",
    "image_two": "https://images.luxuryescapes.com/l34ps6oyd0e7u98mj13",
    "image_three": "https://images.luxuryescapes.com/1qf131hsmdt0fswnl9r",
    "vendor_name": "Mondrian Los Angeles",
    "title": "West Hollywood Boutique Sunset Strip Glamour with Rooftop Pool & Bar",
    "description": "Experience one of the world's most glamourous cities in style at Mondrian Los Angeles, a designer oasis lighting up Sunset Strip in the heart of West Hollywood. Featuring a collection of sleek rooms and suites with whimsical accents and luxe finishes, this inner-city sanctuary draws socialites to its incredible rooftop pool and indulgent Skybar, which flaunts chill vibes, incredible cuisine and breathtaking Los Angeles views.\n\nFind yourself on the doorstep of California's top attractions; stroll down Sunset Strip and stop for a shopping spree at Sunset Plaza, spot your favourite celebrities along the Hollywood Walk of Fame or catch a 20-minute cab to Universal Studios. Want to hit the beach? Santa Monica Pier and Venice Beach are just a 45-minute drive away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "West Hollywood",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "Mondrian Los Angeles",
    "offer_address": "8440 Sunset Blvd, West Hollywood, CA 90069, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 306.0,
    "value": 306.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Iatl6AAB",
    "hero_image": "https://images.luxuryescapes.com/14dyr9akp8fpvs4ah1bj",
    "image_two": "https://images.luxuryescapes.com/lgvew5evoaool9cx4i",
    "image_three": "https://images.luxuryescapes.com/pqupgoxwzacxgscdmt8i",
    "vendor_name": "Hotel Ziggy",
    "title": "Trendy Los Angeles Stay Along Sunset Strip with Live Music, Pizza Restaurant & Pool",
    "description": "Experience the pulsating energy of L.A.'s famed Sunset Strip with a stay at this hotspot for music lovers. Boasting its own music venue, Backbeat, live performances from emerging and established local artists set the rhythm of your stay. The hotel's poolside scene is equally enticing, with live DJ sets and a buzzing restaurant, B-Side, serving up pizza and pints. For those seeking a workout, the fitness centre is at your disposal, while the Shred Shed awaits when musical creativity strikes.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "West Hollywood",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "Hotel Ziggy Los Angeles",
    "offer_address": "8462 West Sunset Boulevard, West Hollywood, California 90069, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 178.0,
    "value": 178.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IatsRAAR",
    "hero_image": "https://images.luxuryescapes.com/yiaxbqpdyt9l1b5shv8",
    "image_two": "https://images.luxuryescapes.com/2pifn1doecp9b01k5dbc",
    "image_three": "https://images.luxuryescapes.com/p4tam0scdj9j77fbs81",
    "vendor_name": "Le Parc Suites West Hollywood",
    "title": "Trendy West Hollywood Retreat with Rooftop Bar, Pool & Restaurant",
    "description": "Dive headfirst into the glitz and glamour of Hollywood with a stay at this chic urban retreat located in the heart of West Hollywood's design district. Satisfy your palate at the hotel's acclaimed restaurant, Knoll, offering farm-to-table Californian cuisine, or unwind with a refreshing cocktail on the stylish rooftop beside the sparkling pool. \n\nBetween games of tennis or pickleball on the rooftop courts, explore the city's star-studded attractions, dining hot spots and shopping at The Grove with ease, just a short walk or drive away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "West Hollywood",
    "location_heading": "Los Angeles",
    "location_subheading": "USA",
    "location_description": "Le Parc at Melrose",
    "offer_address": "733 North West Knoll Drive, West Hollywood, California 90069, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 198.0,
    "value": 198.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GWVyjYAH",
    "hero_image": "https://images.luxuryescapes.com/6cefd38ksklcwn0sjqog",
    "image_two": "https://images.luxuryescapes.com/i989zkqcjxd08welpgts",
    "image_three": "https://images.luxuryescapes.com/m1c07r8rl0pv43nejo8",
    "vendor_name": "Sofitel Los Angeles at Beverly Hills",
    "title": "Elegant Los Angeles City Break in Beverly Hills with Onsite Spa & Beauty Salon",
    "description": "Experience the allure of the City of Angels from the comfort of this ultra-chic Sofitel stay. Perfectly positioned at the crossroads of Beverly Hills and West Hollywood, Sofitel Los Angeles at Beverly Hills offers easy access to the world-renowned Rodeo Drive and The Grove shopping centre. Savour French-inspired Californian cuisine at the hotel's restaurant, Estérel, or sip on a cocktail at Riviera 31 Lounge Bar.\n\nFor those seeking a wellness experience, the hotel boasts a state-of-the-art fitness centre and the tranquil Vendome Clinique Spa, offering a range of rejuvenating treatments. Art enthusiasts will appreciate the hotel's unique art collection, featuring works from local and international artists. When it's time to cool off, the sparkling pool is the perfect way to escape the Californian heat.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States of America",
    "location_description": "Sofitel Los Angeles at Beverly Hills",
    "offer_address": "8555 Beverly Blvd., Los Angeles 90048, California, United States of America",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 288.0,
    "value": 288.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxZhgAAF",
    "hero_image": "https://images.luxuryescapes.com/lmt2rkdnjllmagku6or",
    "image_two": "https://images.luxuryescapes.com/s0lccg02p2ks3urwxtk",
    "image_three": "https://images.luxuryescapes.com/su8u6pozldv0rfbrbb6f",
    "vendor_name": "Hotel Indigo Los Angeles Downtown",
    "title": "Downtown Los Angeles Glamour near LA Live with Trendy Restaurant, Rooftop Pool & Top-Floor Bar",
    "description": "Capturing the essence of Hollywood's golden-era glamour, Hotel Indigo Los Angeles Downtown, an IHG Hotel is the ultimate boutique-style escape. This stylish hotel is just steps from some of LAs hottest entertainment hubs, including LA Live, the Grammy Museum and the Crypto.com Arena. Savour innovative Californian cuisine at Metropole Bar + Kitchen, soak up panoramic city views and artisanal cocktails at 18 Social or take a refreshing dip in the outdoor pool.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "Hotel Indigo Los Angeles Downtown, an IHG Hotel",
    "offer_address": "899 Francisco Street, Los Angeles, California 90017, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 165.0,
    "value": 165.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcCaAAAV",
    "hero_image": "https://images.luxuryescapes.com/86dusr0gootweaq01ytb",
    "image_two": "https://images.luxuryescapes.com/f1djtxgsyhu9ogmfu91m",
    "image_three": "https://images.luxuryescapes.com/eb59tu1dgj2293gnrnf",
    "vendor_name": "Kimpton Hotel Palomar Los Angeles Beverly Hills",
    "title": "Boutique LA Escape in Sophisticated Beverly Hills",
    "description": "Experience pure LA luxury at the Kimpton Hotel Palomar Beverley Hills, a captivating blend of modern sophistication and timeless elegance. Stylish rooms and suites and personalised service welcome guests home after unforgettable adventures. Dive into the refreshing pool, work up a sweat in the fitness centre or take yourself out for coffee, cocktails and California comfort food at the hotel's dining hotspot, Double Take.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "Kimpton Hotel Palomar Los Angeles Beverly Hills, an IHG Hotel",
    "offer_address": "10740 Wilshire Boulevard, Los Angeles, California 90024, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 200.0,
    "value": 200.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IatwUAAR",
    "hero_image": "https://images.luxuryescapes.com/2gz9hcpe3z0kaefsk6r4",
    "image_two": "https://images.luxuryescapes.com/m2aznb2f4swg0hd59w8",
    "image_three": "https://images.luxuryescapes.com/flc7ybsdy4u0twm3j84b",
    "vendor_name": "Chamberlain West Hollywood",
    "title": "Glamorous West Hollywood Suites & Residences near Sunset Boulevard with Rooftop Pool & Bar",
    "description": "Soak up the glitz and glam of West Hollywood with a luxurious stay in this stylish retreat, nestled in the pulsating heart of Los Angeles' most famous neighbourhood. Enjoy a slice of the high life at the rooftop terrace where you can soak up city views from a private cabana, take a dip in the alluring pool or sip on refreshing tipples from the always-buzzing poolside bar.\n\nReflecting old Hollywood elegance, unwind in tastefully appointed suites and residences or indulge in atmospheric dining at The Fitting Room, offering a chef-driven menu with American, Hispanic and Asian influences. When you're ready to explore, Sunset Strip's vibrant nightlife, Rodeo Drive's world-class shopping and the iconic Hollywood Walk of Fame are just a short stroll away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "West Hollywood",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "Chamberlain West Hollywood",
    "offer_address": "1000 Westmount Drive, West Hollywood, California 90069, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 201.0,
    "value": 201.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQ2ubAAD",
    "hero_image": "https://images.luxuryescapes.com/az1cvm1ckdrcx6mdg72",
    "image_two": "https://images.luxuryescapes.com/28xwi22rookdy1ya9b8",
    "image_three": "https://images.luxuryescapes.com/nfncjseqooqsanicz8u",
    "vendor_name": "Pendry Hotel West Hollywood",
    "title": "Vibrant West Hollywood Beauty with Sunset Strip Views, Rooftop Pool & Bar",
    "description": "Experience spectacular Hollywood glamour and laid-back Californian comfort in the beating heart of LA at Pendry West Hollywood. Set in the Hollywood Hills, this hotel is as vibrant and exciting as the town itself, the historical home of a thriving film, music and art scene. Taking a refreshing approach to luxury, the Pendry invites guests to find rest and rejuvenation in its sleek modern interiors, variety of fine dining and entertainment options, and an impressive rooftop pool and bar.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "West Hollywood",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "Pendry West Hollywood",
    "offer_address": "8430 Sunset Boulevard, West Hollywood, California 90069, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 482.0,
    "value": 482.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdKEhAAN",
    "hero_image": "https://images.luxuryescapes.com/hufls97ypwfk9l55t5ck",
    "image_two": "https://images.luxuryescapes.com/fs70wwly5t36x7t6ta",
    "image_three": "https://images.luxuryescapes.com/yslnagz94y9hr5lttnx",
    "vendor_name": "Kimpton Everly Hotel",
    "title": "Sophisticated Los Angeles Glamour near Hollywood Walk of Fame with Rooftop Pool",
    "description": "New heights of sun-kissed Los Angeles luxury await with a stay at Kimpton Everly Hotel, an IHG Hotel, an establishment blending timeless allure and showstopping views of Hollywood Hills to provide an escape in the heart of it all. After days spent exploring the Hollywood Walk of Fame and nearby Universal Studios, return to market-inspired, oven-fired plates at Jane Q or head to the hotel’s rooftop pool for moments of quiet repose surrounded by the glitz and glam of the city of stars.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "Kimpton Everly Hotel, an IHG Hotel",
    "offer_address": "1800 Argyle Ave, Los Angeles, California, CA 90028, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 231.0,
    "value": 231.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008JBcMAAW",
    "hero_image": "https://images.luxuryescapes.com/semqt8ayb5pz4vngc9",
    "image_two": "https://images.luxuryescapes.com/il0hepqio1oyf5ldgaf",
    "image_three": "https://images.luxuryescapes.com/z5926p4c8880ycqentxv",
    "vendor_name": "Sonesta Los Angeles Airport LAX",
    "title": "Convenient LAX Airport Stay with Four Onsite Restaurants & Complimentary Airport Shuttle",
    "description": "Discover the perfect balance of convenience and comfort at Sonesta Los Angeles Airport LAX, located just minutes from Los Angeles International Airport. This modern and stylish hotel is the perfect stopover for long-haul travellers or those catching late-night or early-morning flights. Enjoy a blissful night's rest in the comfort of your spacious room, before enjoying a dip in the heated swimming pool or tasting your way through Southern California at one of the hotel's four on-site restaurants.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "California",
    "offer_geo_area_level_2": "Los Angeles",
    "location_heading": "Los Angeles",
    "location_subheading": "United States",
    "location_description": "Sonesta Los Angeles Airport LAX",
    "offer_address": "5985 West Century Boulevard, Los Angeles, California 90045, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 113.0,
    "value": 113.0
  }
]