[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JjrF8YAJ",
    "hero_image": "https://images.luxuryescapes.com/r90vplys7h89e8z2hyg",
    "image_two": "https://images.luxuryescapes.com/hsej0vq5cvpz2drcn9f",
    "image_three": "https://images.luxuryescapes.com/xy66v82ov7lw4prryecu",
    "vendor_name": "21c Museum Hotels",
    "title": "Downtown Louisville Art Hotel near Ohio River with Onsite Museum & Top-Ranked Bourbon Bar",
    "description": "Find contemporary art and historic grandeur in the heart of downtown Louisville, where this boutique hotel is housed within a series of 19th-century warehouses. Wander curated galleries featuring rotating exhibitions and interactive installations, or explore the nearby Muhammad Ali Center and the vibrant NuLu district, renowned for independent boutiques and galleries.\n\nDine at Proof on Main, where locally sourced ingredients meet inventive Southern cuisine, or sip Kentucky bourbon in the atmospheric lounge surrounded by original artworks. The hotel’s location places you steps from the Louisville Slugger Museum & Factory and the scenic Waterfront Park along the Ohio River.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Kentucky",
    "offer_geo_area_level_2": "Louisville",
    "location_heading": "Louisville",
    "location_subheading": "United States",
    "location_description": "21c Museum Hotel Louisville",
    "offer_address": "700 West Main Street, Louisville, Kentucky 40202, United States,",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 127.0,
    "value": 127.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HiIFIA0",
    "hero_image": "https://images.luxuryescapes.com/luat14bf6jr3m0hr6cy",
    "image_two": "https://images.luxuryescapes.com/d8tdmc8url3kthd3dimx",
    "image_three": "https://images.luxuryescapes.com/jm4zep0mmixb674rj04",
    "vendor_name": "Omni Louisville Hotel",
    "title": "Contemporary Downtown Louisville Retreat with Rooftop Pool, Steakhouse & Speakeasy-Style Bowling Lounge",
    "description": "Immerse yourself in the Southern charms of Kentucky, famed for its exciting dining scene and excellent bourbon whiskeys, with an elegant stay in the heart of Louisville. Tailored to the history and rhythm of Kentucky's largest city, Omni Louisville Hotel boasts charming rooms and a lavish Mokara Spa & Salon, offering soothing treatments. Spend your days swimming in the heated rooftop pool, lounging in a private cabana and munching on light bites at poolside The Water Company.\n\nFor the gourmands, there is so much on offer - Bob's Steak & Chop House serves Midwestern prime beef, Neighborhood Services Bar + Restaurant doles out good ol' American fare and the secret door access-only Pin+Proof speakeasy serves epic cocktails along with professional bowling lanes. If you wish to explore, the Louisville Slugger Museum & Factory, Muhammad Ali Center and the Kentucky Derby Museum are all close by.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Kentucky",
    "offer_geo_area_level_2": "Louisville",
    "location_heading": "Louisville",
    "location_subheading": "United States",
    "location_description": "Omni Louisville Hotel",
    "offer_address": "400 S 2nd Street, Louisville, Kentucky 40202, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 160.0,
    "value": 160.0
  }
]