[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DjoyrYAB",
    "hero_image": "https://images.luxuryescapes.com/cgacxapjjg5yuotzu9qp",
    "image_two": "https://images.luxuryescapes.com/3o057s8hune70j11wvr",
    "image_three": "https://images.luxuryescapes.com/t72lddti6ll67san1pw",
    "vendor_name": "Rumi on Louth Luxury Eco Resort",
    "title": "Private Louth Island Eco Resort with Daily Breakfast, Daily A$100 Experience Credit & Return Airport Transfers",
    "description": "Indulge in eco-conscious elegance with a stay on South Australia’s most spectacular private island. On Louth Island, a wealth of one-of-a-kind experiences await, including dining at acclaimed, native-focused Sapphire - awarded two Chef's Hats in the Australian Good Food Guide 2025 - and near-exclusive access to Carl Cove, one of South Australia's best beaches.  \n\nThe magic begins before you even arrive: greet the sweeping scenery of Louth Bay with a Mercedes van airport transfer before crossing the sea in an extraordinary Sealegs amphibious vehicle. There's no better way to approach this cutting-edge eco-resort dedicated to revitalising the wild beauty of Louth Island.\n\nBetween kayaking adventures, beach picnics or guided buggy tours, get a taste for the land with flavourful local produce at Samphire. Here, the star is always the vibrant native ingredients - many grown right on the island - from cocktails with coastal daisy syrup and kingfish with spicy beach mustard, to sensational saltbush negroni and beyond.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "",
    "location_heading": "Louth Island",
    "location_subheading": "South Australia",
    "location_description": "Rumi on Louth Luxury Eco Resort",
    "offer_address": "Louth Island, South Australia 5607, Australia",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 729.0,
    "value": 1412.0
  }
]