[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcgMNAAZ",
    "hero_image": "https://images.luxuryescapes.com/6ck7aqfhtyf0o07gn",
    "image_two": "https://images.luxuryescapes.com/lj2l3tb0k1ibo7zdb2o",
    "image_three": "https://images.luxuryescapes.com/kw3fxgty3e3inz4qfxp",
    "vendor_name": "Grecotel La Riviera & Aqua Park",
    "title": "Greece Retreat on the Beaches of Ancient Olympia with Daily Breakfast, Nightly Dinner & Unlimited Waterpark Access",
    "description": "If you’re dreaming of a Greek paradise with golden sands and shimmering iridescent waters, the elegant Grecotel La Riviera & Aqua Park is for you. One of four resorts that comprise the five-star beachfront Riviera Olympia & Aqua Park Grecotel Mega Resort, you're invited to luxuriate in this world-class haven that stretches along the golden beaches of Ancient Olympia bordered by centuries-old forests and myths. Dotted along the coast-hugging grounds are 11 dreamy swimming pools, plus an action-packed aqua park featuring aqua coasters, multiple slides, a children's play area and more. \n\nGourmands will revel in the chance to explore 24 restaurants and bars across the shared resort complex, serving everything from Mediterranean fare to cocktails and tapas. For those who enjoy an active escape, head to the onsite tennis academy and fitness centre or unwind at the rejuvenating spa. For those strong enough to tear themselves away from the resort, be sure to step straight out onto the white-sand beach and soak up the Ionian bliss or cool off in the azure waters.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Western Greece",
    "offer_geo_area_level_2": "Andravida-Kyllini",
    "location_heading": "Loutra Kyllinis",
    "location_subheading": "Greece",
    "location_description": "Grecotel La Riviera & Aqua Park",
    "offer_address": "Riviera Olympia & Aqua Park, GR-27050 Loutra Kyllinis, Peloponnese, Greece",
    "percentage_discount": 58.0,
    "min_duration": 5,
    "max_duration": 28,
    "price": 609.0,
    "value": 1450.0
  }
]