[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CvV5qAAF",
    "hero_image": "https://images.luxuryescapes.com/gmi9dr66hcxr508y0ihd",
    "image_two": "https://images.luxuryescapes.com/il4yy7g5ts7aw3o7wjd",
    "image_three": "https://images.luxuryescapes.com/zqzfjnwjy8hfrhx2agj",
    "vendor_name": "The Grand Villandra Resort",
    "title": "Peaceful North Bali Private Pool Villas with Massages, Daily Dining & Nightly Cocktails",
    "description": "Explore the hidden beauty of Northern Bali with a stay at the boutique Villandra Lovina, a stunning property located on the calm, black-sand Lovina Beach. Soak in the spectacular sun with your own private pool in the leafy gardens of your gorgeous villa, while stunning beachfront views await you at the main pool, where you can take a relaxing dip and listen to the hush of the ocean in your very own pocket of paradise. Head down to the ocean and be awed by the calming turquoise waters, keeping your eye out for thriving marine life, including majestic dolphins and colourful fish. Then, refuel at the onsite restaurant, dining on comfort food classics while taking in views over the Bali Sea.\n\nExperience the delights of North Bali, where you'll rediscover the authentic spirit of the island away from the hustle and bustle of the south as you stroll along rows of nearby beachfront cafes and local seafood restaurants. For a dose of adrenaline, trek to the multiple nearby waterfalls to have a relaxing swim in the sparkling waters below or visit the Banjar Hot Springs for a calming meditation session after a long journey.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Buleleng",
    "location_heading": "Lovina",
    "location_subheading": "Bali",
    "location_description": "The Grand Villandra Resort",
    "offer_address": "Lovina, JL Seririt- Singaraja, Tukadmungga. Kec. Buleleng, Kabupaten Buleleng 81119, Bali, Indonesia",
    "percentage_discount": 41.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 415.0,
    "value": 700.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009CzxMAAS",
    "hero_image": "https://images.luxuryescapes.com/vbcsu2bpwqcgr0gjm7hf",
    "image_two": "https://images.luxuryescapes.com/lh7t5276aea2ld2fq9v4",
    "image_three": "https://images.luxuryescapes.com/s2p6n7f0pq5dvewd49t",
    "vendor_name": "The Grand Villandra Resort",
    "title": "Boutique Bali Private Pool Villas with Sunrise Dolphin Watching Tour, Daily Dining & Nightly Cocktails",
    "description": "Indulge in Bali beachfront luxury with a stay at the boutique Villandra Lovina, a stunning property located on the calm black-sand Lovina Beach. Soak in the spectacular sun with your own private pool in the leafy gardens of your gorgeous villa, while being pampered with a traditional Balinese massage. Be awed at a once-in-a-lifetime opportunity to glimpse majestic dolphins cresting the waves amongst a breathtaking sunrise as you float in the middle of the ocean aboard a traditional boat, before returning to your villa for an authentic Balinese breakfast feast. Stunning beachfront views await you at the main pool, where you can take a relaxing dip and listen to the hush of the ocean in your very own pocket of paradise.\n\nExplore the highlights of North Bali along the serene Lovina Beach, with rows of beachfront cafés and local seafood restaurants nearby. For a dose of adrenaline, trek to the multiple waterfalls nearby to have a relaxing swim in the sparkling waters below or visit the Banjar Hot Springs for a calming meditation session after a long journey. Return to your exclusive villa for a nightly handcrafted cocktail and dazzling sunset vistas.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Buleleng",
    "location_heading": "Lovina",
    "location_subheading": "Bali",
    "location_description": "The Grand Villandra Resort",
    "offer_address": "Lovina, JL Seririt- Singaraja, Tukadmungga. Kec. Buleleng, Kabupaten Buleleng 81119, Bali, Indonesia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 409.0,
    "value": 777.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdjlQAAR",
    "hero_image": "https://images.luxuryescapes.com/831gzfoe1p22x7ougp5z",
    "image_two": "https://images.luxuryescapes.com/cna9v5x4tc053yhvfqn",
    "image_three": "https://images.luxuryescapes.com/zxk1nb8jixa1dyw4bivq",
    "vendor_name": "The Grand Villandra Resort",
    "title": "Boutique North Bali Beachfront Escape with Daily Breakfast, Daily Lunch or Dinner, Cocktails & Dolphin Tour",
    "description": "Find your bliss as you explore the hidden beauty of Northern Bali with a charming stay at this boutique five-star sanctuary, perfectly positioned on the calm, black sands of Lovina Beach. Sink into comfort in the well-appointed rooms or villas, or lounge by the main outdoor pool for a generous serving of stunning beachfront views.\n\nIndulge in culinary delights at The Coconut Resto & Bar, offering homemade cuisine and refreshing cocktails, or enjoy soothing treatments at the Swan Spa. Take advantage of the hotel’s beachfront location and head down to the ocean, where you can keep your eyes peeled for thriving marine life, including playful dolphins and colourful fish.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Buleleng",
    "location_heading": "Lovina",
    "location_subheading": "Bali",
    "location_description": "The Grand Villandra Resort",
    "offer_address": "Lovina, JL Seririt- Singaraja, Tukadmungga. Kec. Buleleng, Kabupaten Buleleng 81119, Bali, Indonesia",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 419.0,
    "value": 794.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000G5LH2AAN",
    "hero_image": "https://images.luxuryescapes.com/b9xc0dyzwxtpfn3htpi",
    "image_two": "https://images.luxuryescapes.com/9pm21wnyvqfg3owhlizw",
    "image_three": "https://images.luxuryescapes.com/7msnhscu8jpw5c091qw",
    "vendor_name": "The Grand Villandra Resort",
    "title": "Peaceful North Bali Private Pool Villas with Daily Breakfast, Nightly Dinner, Cocktails & Dolphin Tour",
    "description": "Explore the hidden beauty of Northern Bali with a stay at the boutique Villandra Lovina, a stunning property located on the calm, black-sand Lovina Beach. Soak up the sunshine by your private pool in the leafy gardens of your gorgeous villa, or lounge by the main pool for a serve of stunning beachfront views. Head down to the ocean and be awed by the calming turquoise waters, keeping your eye out for thriving marine life, including majestic dolphins and colourful fish. Then, refuel at the onsite restaurant, dining on comfort food classics while taking in ocean vistas.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Buleleng",
    "location_heading": "Lovina",
    "location_subheading": "Bali",
    "location_description": "The Grand Villandra Resort",
    "offer_address": "Lovina, JL Seririt- Singaraja, Tukadmungga. Kec. Buleleng, Kabupaten Buleleng 81119, Bali, Indonesia",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 329.0,
    "value": 733.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eLKEiQAO",
    "hero_image": "https://images.luxuryescapes.com/pd9k3sp22psiafkklvs8",
    "image_two": "https://images.luxuryescapes.com/0qdt9ye2dnkkzdpqyndc",
    "image_three": "https://images.luxuryescapes.com/n5phhi9gh8anoj6gnhl",
    "vendor_name": "The Lovina Bali",
    "title": "Bali Hidden Treasure with VIP Dining and Daily Cocktails",
    "description": "Discover Bali’s less-explored side and unearth a hidden treasure in Lovina, renowned for its huge dolphin population and Bali’s best-preserved coral reef. Snuggled between the vivid green Bedugul mountain range and rice paddies on one side and the glittering Bali Sea on the other, The Lovina is the hidden paradise travellers dream of - remote and secluded, yet close to natural wonders and landmark sites. Unwind in your luxe private pool villa with VIP dining - including daily buffet breakfast and afternoon tea, nightly three-course dinner and a daily cocktail each - guaranteed late 1pm checkout and your choice of one-way airport transfer available 24/7.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Buleleng",
    "location_heading": "Lovina",
    "location_subheading": "Northern Bali",
    "location_description": "The Lovina Bali 2020",
    "offer_address": "Jl. Mas Lovina, Kalibukbuk Lovina, Kecamatan Buleleng, Anturan, Kec. Buleleng, Singaraja, Bali 81151, Indonesia",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 371.0,
    "value": 1096.0
  }
]