[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004P2b7AAC",
    "hero_image": "https://images.luxuryescapes.com/knnnzjxymhmebrefd4w",
    "image_two": "https://images.luxuryescapes.com/c0b7fh8h7alp8whf48wf",
    "image_three": "https://images.luxuryescapes.com/jqm47z91kysyc0fw3dj",
    "vendor_name": "Crimson Resort and Spa Mactan",
    "title": "Philippines Luxury Beachfront Escape with Daily Breakfast",
    "description": "**Update 26 July 2024; 9.25AEST**: Meal timings updated.\n\nIndulge in five-star Filipino bliss at Crimson Resort and Spa Mactan, a sprawling six-hectare haven that epitomises luxury living. Perched on the island of Mactan, on the sands of a private beach, this serene resort has everything you need for a relaxing escape from reality. It starts within an hour of landing at Mactan International Airport - the resort is just 20 minutes away.\n\nFind your spot by the oceanfront, three-tiered infinity pool or head straight for the sand, where you can while away the day rotating between sunlounger and sea. Once you’ve worked up a thirst, saunter over to Azure Beach Club for a cocktail and bite to eat or pop by the all-day Saffron Café to taste your way through Filipino favourites. Experience euphoria at the award-winning Aum Spa, where you can unwind in the sauna, steam room and jacuzzi, before letting the expert therapists relieve aching muscles with a traditional massage (charges apply). If travelling with little ones, let their imaginations run wild in the Crimzone Club and pool, leaving you to soak up the sunshine, drink in hand. When the sun sets, leave the kids with the babysitter (charges apply) to enjoy a romantic, Spanish-inspired supper at Enye by Chele Gonzalez.\n\n**Luxury Escapes inclusions (select nights only)**\n\n- Feast on a varied **daily breakfast** at Saffron Café from 6.30am to 10.30am.\n- Start your stay with a **welcome cocktail per adult**\n- Hop between the resort’s six dining and drinking options with a **10% food and drink discount**\n- Relax a little bit more with **20% off spa treatments** throughout your stay\n- Sample the delicious fare of Saffron Café or Enye by Chele Gonzalez with **one lunch or dinner for two** (for stays of 3+ nights)\n- Go back for seconds with an **additional lunch or dinner for two** (two total; for stays of 5+ nights)\n- Please note the buffet dinner is offered at the Saffron Café Friday and Saturday nights only between 6pm and 10pm. Schedule may change depending on occupancy level.\n\n**Pool villa upgrade available:** Upgrade to a Private Pool Villa or Oceanfront Private Pool Villa to enjoy roundtrip airport transfers, a luxe buffet breakfast at Enye by Chele Gonzalez or in-villa, welcome amenities and a daily turndown service.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "Central Visayas",
    "offer_geo_area_level_2": "Lapu-Lapu",
    "location_heading": "Mactan",
    "location_subheading": "Philippines",
    "location_description": "Crimson Resort and Spa Mactan",
    "offer_address": "Seascapes Resort Town, Mactan Island, Lapu Lapu City Cebu 6015 Philippines",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 7,
    "price": 207.0,
    "value": 207.0
  }
]