[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002ISQbIAO",
    "hero_image": "https://images.luxuryescapes.com/u0bq0sjk9luaa7ofaz4",
    "image_two": "https://images.luxuryescapes.com/utoet21f2jy5pnowevn",
    "image_three": "https://images.luxuryescapes.com/dqy1fwykziinf7jsiic",
    "vendor_name": "Quinta da Bela Vista - Madeira",
    "title": "Five-Star Madeira Heritage Estate Near Funchal with Ornamental Gardens, Three Restaurants & Daily Breakfast",
    "description": "Embrace the laidback charms of the 'Atlantic Pearl', Madeira, with an elegant stay at this heritage family abode, perched amid mountains and overlooking azure Funchal Bay. Nestled in the lap of sprawling botanical gardens, the boutique property redefines Portuguese luxury and hospitality.\n\nSpend your days soaking up the tropical sun, swimming in the sparkling outdoor pool, rallying in the onsite tennis court or unwinding in the sumptuous rooms of the manor. Relish Mediterranean delicacies at the colonial-style Quinta da Bela Vista Manor House Restaurant and locally sourced dishes at Avista Navios Restaurant, or sip expertly crafted cocktails at three different bars.\n\nWith convenient weekday transfers available to Funchal city centre, take this opportunity to explore the historic Old Town and experience Madeira's wine cellars. Or, hire the property's yacht for the day and sail from Funchal Marina to spot playful dolphins and whales.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Madeira Region",
    "offer_geo_area_level_2": "Funchal",
    "location_heading": "Madeira",
    "location_subheading": "Portugal",
    "location_description": "Quinta da Bela Vista",
    "offer_address": "Caminho do Avista Navios 4, 9000-129 Funchal, Portugal",
    "percentage_discount": 40.0,
    "min_duration": 4,
    "max_duration": 21,
    "price": 719.0,
    "value": 1195.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005J1scAAC",
    "hero_image": "https://images.luxuryescapes.com/h9zwfx9lo73kx6i4fi62",
    "image_two": "https://images.luxuryescapes.com/8ndap43kib5dir7a5sa",
    "image_three": "https://images.luxuryescapes.com/q7ozqv0tkvh9b2e3z0u",
    "vendor_name": "Royal Savoy",
    "title": "Madeira Five-Star Oceanfront Luxury with Three Swimming Pools & Private Beach",
    "description": "Bursting with striking beauty, rich history and culture, and dramatic landscapes, the tiny volcanic island of Madeira - just off the coast of Portugal - is a destination that begs to be explored; and a luxe, five-star stay at Royal Savoy is the ideal launchpad. Perfectly situated on the main promenade in Funchal, the hotel offers direct ocean access, with the old town just a 20-minute walk away. Also known as the ‘Pearl of the Atlantic’, this island hideaway has something for travellers of all styles. Spend your days exploring the famed black-sand beaches, head to the glass-bottom lookout at Cabo Girão, perched 580m above the ground, or move at a gentler pace and fill your time wine tasting the local drop - Maderia, of course.\n\nWithin this grand property, you'll find beautifully appointed rooms, a well-equipped gym, hairdresser, spa, direct beach access and three outdoor pools, including two gleaming lagoon-style pools - including one with a swim-up bar, serving perfectly mixed classic cocktails. Head to Armada Restaurant for flavoursome fare or Piano Bar for live music and handcrafted drinks.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Madeira Region",
    "offer_geo_area_level_2": "Funchal",
    "location_heading": "Madeira",
    "location_subheading": "Portugal",
    "location_description": "Royal Savoy",
    "offer_address": "R. Carvalho Araùjo nº 7, 9000-022 Funchal, Portugal",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 207.0,
    "value": 207.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005J1mUAAS",
    "hero_image": "https://images.luxuryescapes.com/f4ippfk6noteu729ebax",
    "image_two": "https://images.luxuryescapes.com/yf0gmfbm8zwxonzbrb8t",
    "image_three": "https://images.luxuryescapes.com/jr80aqc57hvh7vc01y8",
    "vendor_name": "Savoy Palace",
    "title": "Five-Star Top-Rated Madeira Island Spa Resort with Five Restaurants",
    "description": "Discover a whole new world of natural beauty and cultural wonder on the gorgeous archipelago of Madeira with a stay at Savoy Palace, part of the exclusive Leading Hotels of the World collection and ranked within the top 10% of properties on Tripadvisor.\n\nTake a short stroll from your opulent hotel to reach the dazzling harbour or venture to the Old Town to unearth cool, contemporary eateries and vibrant nightlife, while making sure to tick Funchal's Art Deco markets and famous botanical gardens from your must-see list. Back at the hotel, no detail has been overlooked. You’ll find a myriad of enticing facilities including an adults-only infinity rooftop pool and Laurea Spa - with a heated indoor swimming pool, sauna, Turkish bath, sensory showers, halo-therapy room and 11 treatment rooms. For the gourmands, Alameda restaurant is perfect for lunchtime bites and Galáxia Skyfood on the 16th floor has views that are just as impressive as the contemporary menu. There are also three other dining options and four bars, or for a quiet moment, head to the cosy library.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Madeira Region",
    "offer_geo_area_level_2": "Funchal",
    "location_heading": "Madeira",
    "location_subheading": "Portugal",
    "location_description": "Savoy Palace",
    "offer_address": "Av. do Infante 25, 9004-542 Funchal Portugal",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 545.0,
    "value": 545.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I2vpAAC",
    "hero_image": "https://images.luxuryescapes.com/ue43xqq3tfamr31mi7vp",
    "image_two": "https://images.luxuryescapes.com/kd3tflyzuqgjxa9oiy7g",
    "image_three": "https://images.luxuryescapes.com/i8bgnzpanbfbtdw1ngyi",
    "vendor_name": "VidaMar Resort Hotel Madeira",
    "title": "Oceanfront Madeira Bliss with Onsite Wellness Spa, Three Saltwater Pools, Six Restaurants & Bars",
    "description": "Ready for a blissful escape where you can relax to the sound of the Atlantic Ocean waves crashing on the beach? Rejuvenate at this five-star retreat on the southern coast of Portugal’s most charming island. Spend days dipping in and out of one of three saltwater pools, eat your weight's worth of delicious cuisine at four onsite restaurants, sip a cocktail while listening to live music at Lisboa Bar or indulge in a luxurious treatment at Thalasso Sea Spa.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Madeira",
    "offer_geo_area_level_2": "Funchal",
    "location_heading": "Madeira",
    "location_subheading": "Portugal",
    "location_description": "VidaMar Resort Hotel Madeira",
    "offer_address": "Estrada Monumental 175-177, Madeira, 9000-100 Funchal, Portugal",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 199.0,
    "value": 199.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005J1u5AAC",
    "hero_image": "https://images.luxuryescapes.com/7ttach93i95pfsq4zluh",
    "image_two": "https://images.luxuryescapes.com/8t8basm0yse0cz37inu6",
    "image_three": "https://images.luxuryescapes.com/eoj0zrl0s2yazj19lg6",
    "vendor_name": "Saccharum Resort",
    "title": "Madeira Oceanfront Luxury near Funchal with Rooftop Infinity Pool",
    "description": "Watch the wonders of Madeira unfurl before you from this cliffside luxury retreat on the Portuguese island’s shimmering southern coast. Come for the unrivalled Portuguese culture and rich iridescent sunsets and stay for the luxe facilities, including a restorative spa, squash court, outdoor swimming pools - including a breathtaking infinity pool - and shuttle bus to and from Funchal. Sharpen your appetite with bold, authentic flavours at Alambique Restaurant. For something more casual, Engenho Restaurant is ideal for a feast overlooking the ocean. In the evening, enjoy a drink at Fly Lounge Bar, Trapiche Bar or Calhau Bar overlooking the sunset, while unforgettable nights are forged at Rhum Bar. A luxuriously serene escape, this private oasis ensures every moment will be one to remember.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Madeira Region",
    "offer_geo_area_level_2": "Calheta",
    "location_heading": "Madeira",
    "location_subheading": "Portugal",
    "location_description": "Saccharum Resort",
    "offer_address": "Rua da Serra D'Água, nº1, 9370-087 Arco da Calheta, Madeira, Portugal",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 240.0,
    "value": 240.0
  }
]