[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008J4a8AAC",
    "hero_image": "https://images.luxuryescapes.com/irj4g5iivsur1t24vm",
    "image_two": "https://images.luxuryescapes.com/19pi9ag7ig6986e8jzznf",
    "image_three": "https://images.luxuryescapes.com/k2tyid7pvjts77j81fbs",
    "vendor_name": "Sealink North Queensland",
    "title": "Magnetic Island: Half-Day Yacht Experience for Two with Secluded Beaches, Ferry Transfers, Seafood Lunch & Drinks",
    "description": "Embark on an unforgettable nautical journey around the mesmerising shores of Magnetic Island with a small group of up to 10 sea-faring friends. Kick back, relax and take in the brilliance of Tropical North Queensland with this breezy escape for the day. Begin your adventure by exploring one of the island's most secluded beaches and diving into the glistening sapphire waters. Get up close and personal with the local wildlife, alongside turtles, reef fish and whales (in season), and more. Feast on a delicious lunch spread of local seafood and antipasto along with highly-revered Tamburlaine Organic Wines and premium local beer.\n\nThe cruise is an experience in itself, but there are plenty of options for fun to be had as well, with stinger suits included should you choose to enter the water or laze in the sun on the giant inflatable mat. If you prefer to stay dry on your day out, you can even choose to try your hand at steering the yacht or learn a little about sailing. Enjoy four leisurely hours cruising the crystal clear waters of Magnetic Island aboard Pilgrim, a luxury 58-foot sailing yacht. It's the perfect boat to enjoy your activities for the day, with the feel of a private charter.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Nelly Bay",
    "location_heading": "Magnetic Island",
    "location_subheading": "Queensland",
    "location_description": "Sealink Queensland",
    "offer_address": "Magnetic Island",
    "percentage_discount": 10.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 334.0,
    "value": 373.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zJEdAAM",
    "hero_image": "https://images.luxuryescapes.com/o82vagd44c5njrvm2mm",
    "image_two": "https://images.luxuryescapes.com/ihdxvminu930q0x7vcr",
    "image_three": "https://images.luxuryescapes.com/uoyctt6mj823t5h8g2a",
    "vendor_name": "Peppers Blue on Blue Resort",
    "title": "Peppers Magnetic Island Indulgence with Daily Breakfast & Welcome Drinks",
    "description": "You don't need to travel far to reach a secluded paradise. Surrounded by natural wonders, unspoiled sandy white beaches and pristine waters brimming with colourful marine life, Peppers Blue on Blue Resort- Magnetic Island is what dreams are made of.\n\nLocated within the Great Barrier Reef World Heritage-listed area and a quick 20-minute ferry ride from Townsville, this perfectly positioned resort invites you to experience Queenland's breathtaking beauty in sheer luxury. Submit to tranquillity at the rejuvenating endota Day Spa, plunge into one of two glittering lagoon swimming pools and feel the warm sea breeze at the alfresco setting at Boardwalk Restaurant & Bar before satiating your appetite with an exceptional menu of fine wine and tropical delights.\n\nMagnetic Island is the crowning jewel of the Coral Sea, with almost 70% of the island cloaked in national park, and endless bays and beaches waiting to be explored. Swing into your escape with a round of golf at the Country Club, trot beside the waves on a horseriding adventure, drop a line into the ocean and catch marlin fresh from the waters or dive straight into them to explore a bounty of shipwrecks and reefs.\n\n**Your handpicked inclusions:**\n\n- Start each day with a delicious à la carte breakfast at Boardwalk Restaurant & Bar\n- Celebrate on arrival with a chilled bottle of sparkling wine to share\n- Cool down from the Queensland heat with a welcome beer, wine or soft drink each\n- Plan adventurous days with complimentary Wi-Fi (500MB per day)\n- Relax with a A$25 spa credit per adult (valid on treatments of A$100 or more)\n- Stay entertained with unlimited in-room movies\n- Receive 20% off SeaLink ferry transfers\n- Treat yourself to a sleep-in thanks to guaranteed late 12pm checkout\n\n**Travelling as a group or with family?** Upgrade to a Two-Bedroom Apartment valid for up to four guests, or a Three-Bedroom Apartment valid for up to six guests.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Nelly Bay",
    "location_heading": "Magnetic Island",
    "location_subheading": "Queensland",
    "location_description": "Peppers Blue on Blue Resort",
    "offer_address": "123 Sooning St, Nelly Bay QLD 4819",
    "percentage_discount": 40.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 447.0,
    "value": 749.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CfkT1YAJ",
    "hero_image": "https://images.luxuryescapes.com/vm37dq3uk70mhatmk9a",
    "image_two": "https://images.luxuryescapes.com/nj44xbr48igugm3xr1vq",
    "image_three": "https://images.luxuryescapes.com/nisk1lkje91ka2euyq9i",
    "vendor_name": "Grand Mercure Apartments Magnetic Island",
    "title": "Magnetic Island Waterfront One- & Two-Bedroom Apartment Escape with One Day Car Hire",
    "description": "The breathtaking landscapes of Tropical North Queensland await you, and a stay on Magnetic Island is the perfect way to immerse yourself. Just 25 minutes from the coast of Townsville, this paradise, affectionately called ‘Maggie,’ is a national park haven where you can spend your days basking in glorious sunshine, exploring mysterious shipwrecks, hopping between 23 vibrant turquoise bays and beaches, snorkelling in the Great Barrier Reef Marine Park, or connecting with abundant wildlife.\n\nConveniently located just 50 meters from the ferry terminal and offering exceptional seaside views, this self-contained resort is the perfect launchpad for tropical adventures, allowing for easy exploration. Take time to splash in the rooftop infinity pool overlooking the Coral Sea, relax by one of the three additional pools on-site, unwind in the spa or enjoy the fitness centre.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Nelly Bay",
    "location_heading": "Magnetic Island",
    "location_subheading": "Queensland",
    "location_description": "Grand Mercure Apartments Magnetic Island",
    "offer_address": "146 Sooning Street, Magnetic Island, Queensland 4819, Australia",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 369.0,
    "value": 731.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UzD9AAK",
    "hero_image": "https://images.luxuryescapes.com/tr79vthwhcp97lrg32",
    "image_two": "https://images.luxuryescapes.com/6nb9xrxnrb9y0dx01m4d",
    "image_three": "https://images.luxuryescapes.com/lcryazm6ckh234bf1ma",
    "vendor_name": "Grand Mercure Apartments Magnetic Island",
    "title": "Magnetic Island Waterfront Apartment Escape with Breakfast Hamper & Welcome Wine",
    "description": "The breathtaking landscapes of Tropical North Queensland are calling for you, and a stay at the Grand Mercure Magnetic Island is the perfect place to immerse yourself. A paradise just 25 minutes off the coast of Townsville, ‘Maggie’ is a national park haven where you can spend your days basking in the glorious sunshine, discovering mysterious shipwrecks, hopping between 23 vibrant turquoise bays and beaches, snorkelling in the Great Barrier Reef Marine Park or revelling in the company of abundant wildlife, including rock wallabies, koalas and more.\n\nPerfectly located just 50 metres from the ferry terminal with exceptional seaside views, this self-contained resort makes for the perfect launchpad for your tropical escapades, allowing you to explore with ease. Take time to splash in the infinity rooftop pool overlooking the Coral Sea or laze by one of the three other pools onsite, relax in the spa make the most of the fitness centre or simply watch the sun drop below the horizon with a cocktail in hand, making it the perfect place to switch into 'holiday mode'.\n\n**Your handpicked inclusions**:\n\n- Celebrate your arrival in paradise with a one-time breakfast hamper filled with delicious treats\n- Start your escape the right way with welcome wine and chocolates in-room on arrival\n- Experience the best of Magnetic Island with generous discounts on local experiences: 50% off your second day of car hire (organised through Grand Mercure), complimentary glass of wine with every main meal at Le Paradis, 10% off with reef tours with PRO DIVE, 10% discount on Aquascene charters and a complimentary coffee upsize when you purchase a coffee at Maggie Lee's café\n- Enjoy more time to snooze with guaranteed late check-out at 12pm\n\n**Travelling with a group or as a family?** Escape with the whole family to the unspoiled shores of Magnetic Island when you upgrade to a Two-Bedroom Apartment, featuring one queen bed and two single beds for up to four guests.\n\n**Ocean-View Upgrades:** Wake up to stunning views when you upgrade to a One-Bedroom or Two-Bedroom Ocean-View Apartment with unparalleled views over the Coral Sea and Magnetic Island.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Nelly Bay",
    "location_heading": "Magnetic Island",
    "location_subheading": "Queensland",
    "location_description": "Grand Mercure Magnetic Island",
    "offer_address": "146 Sooning St, Magnetic Island QLD 4819",
    "percentage_discount": 66.0,
    "min_duration": 4,
    "max_duration": 10,
    "price": 347.0,
    "value": 1035.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgoheQAA",
    "hero_image": "https://images.luxuryescapes.com/zebnqnerffrtg7ikhmjl",
    "image_two": "https://images.luxuryescapes.com/yyb5fehekr4nws9x1bxr",
    "image_three": "https://images.luxuryescapes.com/zsgroucmgi82zzd28xyl",
    "vendor_name": "Grand Mercure Apartments Magnetic Island",
    "title": "Resort-Style Apartment Getaway on Stunning Magnetic Island",
    "description": "Experience tropical paradise at the Grand Mercure Magnetic Island in Northern Queensland, offering 23 beaches and picture-perfect bays. Stay in a convenient, self-contained apartment for four or six nights and enjoy an in-room breakfast hamper, welcome bottle of wine plus chocolates on arrival, discounts on local attractions and a leisurely late 12pm check-out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Townsville City",
    "location_heading": "Magnetic Island",
    "location_subheading": "Queensland",
    "location_description": "Grand Mercure Magnetic Island 2019",
    "offer_address": "146 Sooning St, Magnetic Island QLD 4819",
    "percentage_discount": 65.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 349.0,
    "value": 992.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eN91fQAC",
    "hero_image": "https://images.luxuryescapes.com/ajoi76ya7iylebvv8vk",
    "image_two": "https://images.luxuryescapes.com/74376u00jl6dhgsok39l",
    "image_three": "https://images.luxuryescapes.com/qg90u6kmljmy1uuzihs",
    "vendor_name": "Peppers Blue on Blue Resort",
    "title": "Peppers Indulgence on Magnetic Island with Daily Breakfast and Daily Drinks",
    "description": "Experience the magic of one of North Queensland’s most pristine islands, where lush rainforest meets the Great Barrier Reef with an iconic stay at Peppers Blue on Blue Resort on stunning Magnetic Island. Embrace relaxed island life as you indulge in daily buffet breakfast, a bottle of sparkling wine on arrival, a daily drink per person, A$25 off treatments over A$100 at endota Spa, complimentary in-room movies and Wi-Fi, 15% discount on food at Boardwalk Restaurant & Bar, 20% discount on return ferry transfers and a leisurely late, 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Nelly Bay",
    "location_heading": "Magnetic Island",
    "location_subheading": "Queensland",
    "location_description": "Peppers Blue on Blue Resort",
    "offer_address": "123 Sooning St, Nelly Bay QLD 4819",
    "percentage_discount": 41.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 371.0,
    "value": 626.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZnctzQAB",
    "hero_image": "https://images.luxuryescapes.com/demgreyvfimus6xxweqp",
    "image_two": "https://images.luxuryescapes.com/cb6pjpfabvaieemfkovx",
    "image_three": "https://images.luxuryescapes.com/ktwmwktrrdvxsbbxl2f2",
    "vendor_name": "Peppers Blue on Blue Resort",
    "title": "Peppers Indulgence on Magnetic Island with Daily Breakfast, Bottle of Wine & More",
    "description": "Experience the magic of one of North Queensland’s most pristine islands, where lush rainforest meets the Great Barrier Reef. Discover the natural beauty of Magnetic Island with an iconic stay at Peppers Blue on Blue Resort with daily buffet breakfast, a bottle of wine on arrival, a daily drink per person, an AU $25 spa credit on a treatment over AU$100 at the endota Spa, complimentary in-room movies and 500MB of Wi-Fi, 15% off when dining at Broadwalk Restaurant & Bar, 20% discount on return ferry transfers booked directly with the resort and a leisurely late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Townsville City",
    "location_heading": "Magnetic Island",
    "location_subheading": "Queensland",
    "location_description": "Peppers Blue on Blue Resort - 2019",
    "offer_address": "123 Sooning St, Nelly Bay QLD 4819",
    "percentage_discount": 36.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 381.0,
    "value": 594.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4stzQAB",
    "hero_image": "https://images.luxuryescapes.com/mgkxvefbln62kvafcufx",
    "image_two": "https://images.luxuryescapes.com/kvzcdchh3akma0v1jomc",
    "image_three": "https://images.luxuryescapes.com/pbzgnnbqbztwcdimv5ue",
    "vendor_name": "Grand Mercure Apartments Magnetic Island",
    "title": "Magnetic Island Apartment Stay with Breakfast Hamper & Wine",
    "description": "Experience tropical paradise at the Grand Mercure Magnetic Island in Northern Queensland, offering 23 beaches and picture-perfect bays. Stay in a convenient, self-contained apartment and enjoy the following fantastic inclusions: a breakfast hamper for two, a bottle of wine plus chocolates on arrival, discounts on local attractions and a leisurely late noon check-out.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Townsville City",
    "location_heading": "Magnetic Island",
    "location_subheading": "QLD",
    "location_description": "Grand Mercure Magnetic Island - 2018",
    "offer_address": "146 Sooning St, Magnetic Island QLD 4819",
    "percentage_discount": 64.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 445.0,
    "value": 1247.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LrlGAAS",
    "hero_image": "https://images.luxuryescapes.com/92dzw5zkochmakovti",
    "image_two": "https://images.luxuryescapes.com/nwy75qhhnv6vrwpnpgfo",
    "image_three": "https://images.luxuryescapes.com/vrhjogxbfng5qm3ga3as",
    "vendor_name": "Grand Mercure Apartments Magnetic Island",
    "title": "Stylish Apartment Stay on Queensland's Unspoiled Magnetic Island",
    "description": "Escape to the unspoiled shores of Magnetic Island with a stay at Grand Mercure Magnetic Island, located a 20-minute ferry ride from Townsville. Experience indulgent apartment-style living on the edge of beaches, rainforests and a marine reserve at this Tropical North Queensland retreat, boasting some of the most Instagram-worthy natural wonders in Australia. Enjoy a one-time breakfast hamper, a bottle of Bancroft Wine and chocolates on arrival, discounts on local experiences and a relaxed 12pm checkout.\n\n**Travelling with family?** Up to two children (aged 11 years and under) stay free with all inclusions when you upgrade to the Two-Bedroom Apartment.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Townsville City",
    "location_heading": "Magnetic Island",
    "location_subheading": "Queensland",
    "location_description": "Grand Mercure Magnetic Island - March 2020",
    "offer_address": "146 Sooning St, Magnetic Island QLD 4819",
    "percentage_discount": 67.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 327.0,
    "value": 977.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002GQdWAAW",
    "hero_image": "https://images.luxuryescapes.com/w2otcwvr1qpgxxnlz7q",
    "image_two": "https://images.luxuryescapes.com/qenszhu3zd5kujkb8iy",
    "image_three": "https://images.luxuryescapes.com/m27fhaquhjbbr4z518b",
    "vendor_name": "Grand Mercure Apartments Magnetic Island",
    "title": "Magnetic Island Seaside Apartment with Breakfast Hamper & Welcome Wine",
    "description": "Discover a breathtaking tapestry of sunken coral gardens, mysterious shipwrecks and 23 majestic bays and beaches from Grand Mercure Magnetic Island. An untouched paradise just 20 minutes off the coast of Townsville, ‘Maggie’ is a national park haven where you can spend your days discovering hidden beaches and secret bays, spying rock wallabies playing and snorkelling in the Great Barrier Reef Marine Park.\n\nStay in a self-contained One-Bedroom Apartment and enjoy a one-time breakfast hamper per stay, a welcome bottle of Bancroft wine and chocolates in-room on arrival and guaranteed 12pm late checkout. Plus, you’ll receive discounts on local experiences, including car hire, diving and dining at the likes of Le Paradis and Stuffed on Seafood.\n\n**Travelling with a group or as a family?** Select the Two-Bedroom Apartment, valid for up to four people.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Townsville City",
    "location_heading": "Magnetic Island",
    "location_subheading": "Queensland",
    "location_description": "Grand Mercure Magnetic Island - Oct 2020",
    "offer_address": "146 Sooning St, Magnetic Island QLD 4819",
    "percentage_discount": 66.0,
    "min_duration": 4,
    "max_duration": 8,
    "price": 339.0,
    "value": 1002.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bd2y4AAB",
    "hero_image": "https://images.luxuryescapes.com/cdeal315abt3hqwbtiwg",
    "image_two": "https://images.luxuryescapes.com/vu9rr5v3i9ndegrrvc19i",
    "image_three": "https://images.luxuryescapes.com/xvyfgolvsgngbwdn7f",
    "vendor_name": "Pilgrim Sailing",
    "title": "Magnetic Island Half-Day Luxury Yacht Cruise with Seafood Lunch & Wine",
    "description": "Embark on an unforgettable four-hour journey around the champagne shores of Magnetic Island, aboard a 58-foot luxury yacht (max. 12 guests) - an intimate vessel with the feel of a private charter. Kick back, relax and take in the brilliance of this Tropical North Queensland gem, exploring the island's secluded beaches and diving into the glistening sapphire waters. Get up close and personal with the local wildlife alongside turtles, reef fish and whales (in season). Feast on a delicious lunch spread of local seafood and antipasto, along with highly-revered Tamburlaine Organic Wines and premium local beer.\n\nThe cruise is an experience in itself, but there are plenty of options for fun to be had as well: use of stinger suits is included should you choose to enter the water (in stinger season only), or laze in the sun on the giant inflatable mat. You can even choose to try your hand at steering the yacht or learn a little about sailing.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Nelly Bay",
    "location_heading": "Magnetic Island",
    "location_subheading": "Queensland",
    "location_description": "Pilgrim Sailing - Magnetic Island",
    "offer_address": "123 Sooning St, Nelly Bay QLD 4819",
    "percentage_discount": 8.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 160.0,
    "value": 173.0
  }
]