[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QZ5zAAG",
    "hero_image": "https://images.luxuryescapes.com/x6wz8fv11or458fjqv4m",
    "image_two": "https://images.luxuryescapes.com/ie3i7ya2jhu4bcpgrdec",
    "image_three": "https://images.luxuryescapes.com/x2gd141f6ecvofwwwzpc",
    "vendor_name": "Evershine Resort Mahabaleshwar",
    "title": "Relaxing Mahabaleshwar Resort Stay with Daily Breakfast & Drinks",
    "description": "Set amid eight acres of tranquil greenery and in the shadow of Mahabaleshwar's highest point, Evershine Resort Mahabaleshwar offers a world of luxury and comfort like no other. Less than three hours from Pune and five hours from Mumbai, this stunning retreat is perfect for a weekend escape - and is currently ranked within the region's top properties on Tripadvisor. You'll feel like royalty staying in this beautiful resort, which features architecture inspired by Rajasthan's palaces.\n\nPamper yourself at the multiple dining sites, get your adrenaline pumping with outdoor activities and relieve your stress at the in-house spa. Plus, you'll find all the major attractions of Mahabaleshwar within easy reach, including Arthur's Seat, Mapro Garden and Lingmala Waterfall.\n\n**Your handpicked inclusions:**\n\n- Begin every morning with buffet breakfast at Evershine Café\n- Savour one three-course or buffet dinner for two, once during your stay, at Evershine Café\n- Every evening, enjoy one cocktail, glass of wine or beer per adult at Vibe Bar\n- Make the most of your stay with a 20% discount on drinks and dining\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** Two infants (five and under) stay free in existing bedding with all package inclusions (except alcohol).\n\n**Extended stay bonus:** Stay four nights or longer and enjoy two three-course or buffet dinners for two during your stay.\n\n**RT-PCR Test Required:** All guests travelling to the resort are required to produce a negative RT-PCR or Rapid Antigen Test within 72 hours of the time of check-in (the ICMR number should be displayed on the negative report).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Mahabaleshwar",
    "location_heading": "Mahabaleshwar",
    "location_subheading": "India",
    "location_description": "Evershine Resort Mahabaleshwar",
    "offer_address": "C.T.S No 182, Gautam Rd, Mahabaleshwar, Maharashtra 412806",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 140.0,
    "value": 241.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UbpVAAS",
    "hero_image": "https://images.luxuryescapes.com/ve22lvs4s30bvna6cp5b",
    "image_two": "https://images.luxuryescapes.com/v9j0yn8y9tkhcvc10yfy",
    "image_three": "https://images.luxuryescapes.com/wj2mhnfvlkxljnb0i4",
    "vendor_name": "Shambhalah Mahabaleshwar",
    "title": "Grand Opening: Mahabaleshwar Cliffside Escape with Deluxe Daily Dining",
    "description": "Perched on the edge of a cliff, 1,350 metres above sea level at Maharashtra's tallest hill station, the newly opened Shambhalah Resort - Mahabaleshwar is a sanctuary of serenity offering some of the finest uninterrupted vistas of the Sahyadri Mountain Ranges. Brought to you by the renowned Shambhalah group, this brand-new resort promises a stay that exudes secluded luxury with rustic pavilions, cottages and villas scattered across the cliffside.\n\nLocated just under three hours from Pune Airport and less than a five-hour drive from Mumbai, this hidden retreat will leave you wanting for nothing with world-class facilities, including spa services, nature trails at your doorstep and a rustic alfresco restaurant overlooking the breathtaking forest. Embrace serenity in this undisturbed corner of the world that will also pamper you with contemporary luxuries.\n\n**Your handpicked inclusions**:\n\n- Begin every with daily breakfast at The Restaurant\n- Every night, enjoy a delicious three-course dinner at The Restaurant\n- Spend every evening with a mocktail (one drink per person) at The Restaurant\n- Indulge in deliciousness with a 20% discount on dining and soft drinks throughout your stay\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** One young child (aged six years and under) stays free in existing bedding with all inclusions. \n\n**Exotic Villa Upgrade**: Take your stay to the next level in an Exotic Villa, a sprawling two-bedroom paradise set right on the edge of a cliff, with a private pool and spectacular views of the Sahyadris Mountain Range. Up to four adults and two young children (aged six years and under) can stay in this spacious sanctuary.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Mahabaleshwar",
    "location_heading": "Mahabaleshwar",
    "location_subheading": "India",
    "location_description": "Shambhalah Resort - Mahabaleshwar",
    "offer_address": "Mahabaleshwar Panchgani Main Road Metgutad, Mahabaleshwar, Maharashtra 412806",
    "percentage_discount": 28.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 246.0,
    "value": 342.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Le13AAC",
    "hero_image": "https://images.luxuryescapes.com/flroku4n5ah1sqntfjr",
    "image_two": "https://images.luxuryescapes.com/xdxo1jm6fv6kblv9p1pn",
    "image_three": "https://images.luxuryescapes.com/algx4wtxtxaokkiogh",
    "vendor_name": "Le Meridien Mahabaleshwar",
    "title": "Five-Star Family Escape in the UNESCO World Heritage-Listed Western Ghats",
    "description": "Escape to the UNESCO World Heritage-listed Western Ghats and unwind in five-star style at Le Méridien Mahabaleshwar Resort & Spa. Part of the internationally renowned Marriott collection, this luxury resort is swathed by 27 acres of lush forest and features a beautiful infinity pool. Enjoy a relaxing escape with daily buffet breakfast, a 30-minute spa treatment per adult, per stay, one glass of beer or wine per person, per day and more - plus, two children aged 11 years and under stay free (sharing existing bedding).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Mahabaleshwar",
    "location_heading": "Mahabaleshwar",
    "location_subheading": "India",
    "location_description": "Le Méridien Mahabaleshwar Resort & Spa",
    "offer_address": "211/212, Satara-Medha-Mahabaleshwar Rd, Mahabaleshwar, Maharashtra 412806, India",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 330.0,
    "value": 521.0
  }
]