[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvqvIAAR",
    "hero_image": "https://images.luxuryescapes.com/9sg8fdlpui1lfdv7v8i",
    "image_two": "https://images.luxuryescapes.com/zheo9mom3bm4uglmr2yn",
    "image_three": "https://images.luxuryescapes.com/yp2kizmvssjavuuedlo",
    "vendor_name": "Hotel Honucai - Mallorca",
    "title": "Serene Southern Mallorca Seafront Escape Steps from the Beach with Rooftop Bar & Daily Breakfast",
    "description": "Breathe in the crisp sea air from a sophisticated vantage point with a stay dripping in seafront luxury at Hotel Honucai. Experience all the coastal charm of a bustling fishing port and the convenience of the golden sands of a pristine beach at your doorstep from this impeccably designed retreat. Take a rejuvenating dip in the freshwater pool after days spent bathing in the sea, or find refreshment in the form of a delicious cocktail at the breezy rooftop terrace, The Top. When hunger strikes, indulge in fine Mediterranean cuisine and local wine at Salicornia.\n\nLet all your worries wash away with a dip in the bubbling jacuzzi, reach a new level of relaxation in the sauna or stay energised throughout your stay with a heart pumping session in the fitness centre's cardio machines. Venture out and become immersed in the Mallorcan way of life with a wander through the nearby markets, crystal clear coves and rows of impressive restaurants and bars.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Ses Salines",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Hotel Honucai",
    "offer_address": "Carrer Bonança 1, 07638 Colònia de Sant Jordi, Mallorca, Spain",
    "percentage_discount": 68.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 219.0,
    "value": 683.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FiuxPAAR",
    "hero_image": "https://images.luxuryescapes.com/ph9tc1s42971yzr9olik",
    "image_two": "https://images.luxuryescapes.com/6998pd5e384kphaglxja",
    "image_three": "https://images.luxuryescapes.com/m1lv4dst1sfiak2sx047",
    "vendor_name": "Hilton Mallorca Galatzo",
    "title": "Mallorca Hilton Seaside Luxury with Daily Breakfast",
    "description": "Experience the ultimate Majorcan escape at the Hilton Mallorca Galatzo, a white-washed mirage against the shimmering blue horizon. Look out over the azure Mediterranean Sea and majestic Tramuntana Mountains while you enjoy fresh buffet breakfasts and indulgent dinners at La Cocina, or while experiencing Majorcan fine cuisine at Alma Restaurant & Bar. Spend relaxed summer afternoons under the parasols at Cotton Club, with comfortable sunbeds and seasonal light meals, or cool off with a cocktail as refreshing as the glimmering waters of the Paradis Pool Bar.\n\nThis sun-kissed Spanish paradise claims an incredible location in the Balearic Islands, a perfect base to explore hidden coves, wander charming villages, and discover the vibrant nightlife of the nearby capital, Palma. When you're not out discovering the island's treasures, make the most of the hotel’s well-equipped fitness centre, relaxing spa and enticing tennis courts.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Hilton Mallorca Galatzo",
    "offer_address": "Ctra. Andratx, Km 20, Costa de la Calma 07160, Balearic Islands, Spain",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 649.0,
    "value": 1690.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ew99EAAR",
    "hero_image": "https://images.luxuryescapes.com/nhuk9koigg0gitl576h",
    "image_two": "https://images.luxuryescapes.com/4wvdipr7s8ovf42szxc",
    "image_three": "https://images.luxuryescapes.com/ba32k80kkanh934revo8",
    "vendor_name": "Pure Salt Port Adriano",
    "title": "Mallorca Adults-Only Luxury Hideaway with Daily Breakfast & Nightly Dinner",
    "description": "Be overcome by romance at Pure Salt Port Adriano, an adults-only sanctuary hidden in Mallorca's ultra-exclusive El Toro marina and boasting spellbinding views over the Mediterranean Sea. Step out of the hotel's spectacular, cascading pool onto Mallorca's legendary golden sands, or savour time spent discovering O Spa's cutting-edge facilities, including a Turkish bath, salt cabin and ice fountain. After sun-soaked days, head to Adriana Restaurant for unforgettable Mediterranean fare, backed by a comprehensive wine list and unrivalled views over the bay.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Pure Salt Port Adriano",
    "offer_address": "S. Ponsa 10, El Toro, Calvia, Mallorca 07182, Spain",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 629.0,
    "value": 1977.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lm8AAAQ",
    "hero_image": "https://images.luxuryescapes.com/5rskxifgbe6tgwarx52v",
    "image_two": "https://images.luxuryescapes.com/qy7ceb7mkjcds896luc",
    "image_three": "https://images.luxuryescapes.com/45moni5niqhp9avv3at8",
    "vendor_name": "Mon Port Hotel & Spa",
    "title": "Mallorca Mediterranean Island Escape with Daily Breakfast & Nightly Dinner",
    "description": "Mediterranean dreams come true on the exquisite Spanish island of Mallorca at the laidback Mon Port Hotel & Spa, currently ranked the #1 hotel in Port d'Andratx by Tripadvisor. Warm hospitality and world-class facilities make up this stylish escape: opt for a pampering treatment at the Blue Spa wellness centre where heated whirlpool tubs, sauna, hammam and indoor heated pool offer utter bliss; take a dip in the pool before ordering a beer at the pool bar; and sit down for a romantic dinner for two at the DinnerRoom.\n\nWhen you’re ready to step away from Mon Port’s indulgent facilities, take the short 10-minute walk to the bustling promenade of Port Andratx, home to plenty of shops and high-end restaurants. Thanks to the hotel’s ideal location in the foothills of the Tramuntana Mountains by the sea, there’s plenty of activities for the adventurers. Go hiking, cycling, swimming, scuba diving, and drive 10 minutes to visit the excellent 18-hole course at Golf de Andratx.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Andraitx",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Mon Port Hotel & Spa",
    "offer_address": "Finca La Noria, Carrer Cala d'Egos, 17, 07157 Port d'Andratx, Balearic Islands, Spain",
    "percentage_discount": 55.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 503.0,
    "value": 1110.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J1o0IAC",
    "hero_image": "https://images.luxuryescapes.com/addu59pskg9206cw0it",
    "image_two": "https://images.luxuryescapes.com/qta4t5342etrbm6r2zf",
    "image_three": "https://images.luxuryescapes.com/9chubwj5gq5jayn75g9",
    "vendor_name": "Pure Salt Port Adriano",
    "title": "Mallorca Adults-Only Luxury Hideaway with Daily Breakfast & Nightly Cocktails",
    "description": "Be overcome by romance at Pure Salt Port Adriano, an adults-only sanctuary hidden in Mallorca's ultra-exclusive El Toro marina and boasting spellbinding views over the Mediterranean Sea. Step out of the hotel's spectacular, cascading pool onto Mallorca's legendary golden sands, or savour time spent discovering O Spa's cutting-edge facilities, including a Turkish bath, salt cabin and ice fountain.\n\nFor an added dash of luxury, upgrade to the Swim Up Sea View and enjoy sweeping ocean views and private access to the resort's lagoon-style pool.\n\nWhen it comes time to explore, take the complimentary shuttle to El Toro Beach or the Santa Ponsa Golf Course to enjoy a day on the green. After sun-soaked days of adventure, head to Adriana Restaurant for unforgettable Mediterranean fare, backed by a comprehensive wine list and unrivalled views over the bay.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Pure Salt Port Adriano",
    "offer_address": "S. Ponsa 10, El Toro, Calvia, Mallorca 07182, Spain",
    "percentage_discount": 66.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 679.0,
    "value": 2015.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Gj0M2YAJ",
    "hero_image": "https://images.luxuryescapes.com/ob34diugiuqss2o75d",
    "image_two": "https://images.luxuryescapes.com/nw7lm4ex37ba5sy8okmc",
    "image_three": "https://images.luxuryescapes.com/lqhflfyuc7j2xjyl5f",
    "vendor_name": "Kimpton Aysla Mallorca",
    "title": "Opulent Mallorca Retreat with Daily Breakfast, Free-Flow Wine Hour & One Three-Course Dinner",
    "description": "Dive into a world of luxury on the sun-soaked island of Mallorca with a stay at this lush Spanish sanctuary. Surrounded by native gardens and just a short hop from the capital, Palma, Kimpton Aysla Mallorca is the perfect escape to kick back, relax and live the good life.\n\nBask in the sunshine and take a refreshing plunge in one of the outdoor or indoor swimming pools, or sip on refreshing cocktails at the swanky open-air pool bar, Zayt. Indulge in a feast for the senses at the pan-Asian SABA Restaurant and discover a diverse menu of drinks at SABA Bar & Bodega.\n\nDon’t miss a visit to Maison CODAGE Spa, where treatments range from soothing massages and LED therapy to rejuvenating mud baths.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Kimpton Aysla Mallorca",
    "offer_address": "37 Avinguda del Golf, Santa Ponsa, Mallorca, Balearic Islands 07180, Spain",
    "percentage_discount": 58.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 549.0,
    "value": 1312.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdIB9AAN",
    "hero_image": "https://images.luxuryescapes.com/uq5zxaa7n34scqut5g",
    "image_two": "https://images.luxuryescapes.com/x92v1ty7mmibceuti4xv",
    "image_three": "https://images.luxuryescapes.com/qlhjv4m11hb60to8c17r",
    "vendor_name": "Portella Palma",
    "title": "Grand Opening: Boutique Spain Escape in Mallorca's Historic Centre with Daily Breakfast & Onsite Hammam",
    "description": "Step into a world of Mediterranean charm with a retreat to this recently renovated 17th-century home, nestled in the heart of Palma de Mallorca’s Old Town. With a traditional patio in the heart of the building, a rooftop terrace overlooking the city's cathedral, and a tranquil wellness area, there is a space for everyone to unwind in between exploring the city and all that the isle of Mallorca has to offer. Wander the alluring streets of Palma and explore the city's countless historic sites, including the majestic Palma Cathedral and the Royal Palace of La Almudaina. When you're ready to venture further afield, indulge in the island's natural gems and pristine beaches while you savour the local Meditteranean cuisine.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Palma de Mallorca",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Portella",
    "offer_address": "Carrer de la Portella 9, Palma de Mallorca 07001, Mallorca, Spain",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 659.0,
    "value": 1155.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JFNMLYA5",
    "hero_image": "https://images.luxuryescapes.com/x6nplgbr7meet166drit",
    "image_two": "https://images.luxuryescapes.com/wynagatik91lsbohjhml",
    "image_three": "https://images.luxuryescapes.com/hgfni8vhhtnnyol8s3s",
    "vendor_name": "Blau Colònia Sant Jordi",
    "title": "Dreamy Mallorca Seaside Retreat with Daily Breakfast, Nightly Dinner & Cocktails",
    "description": "Tucked into 80,000 squared metres of sun-soaked Mediterranean beauty, this family-friendly oasis feels more like a sanctuary than a hotel. Just a short stroll or shuttle ride from some of the island's best beaches, it's a place where you can unwind in peace or dive into fun. Seven tennis courts, heated pools and world-class spa facilities create an irresistible playground for making memories.\n\nEvery meal here is something to look forward to. From hearty Mallorcan dishes that taste like tradition to fresh, creative Mediterranean plates, the food is full of personality and passion. Grab a wood-fired pizza by the pool, sip something cold as the sun goes down or linger over dinner at Llevant restaurant.\n\nDays blur into nights of pure enchantment. Whether it's kids splashing around under pirate ships or parents sneaking off to the spa, there's something for everyone. Blaudiland kids’ club keeps little adventurers spellbound, while grown-ups can dip into archery, table tennis or just a good book by the pool. From dawn till dusk, it’s the kind of place that makes ordinary days feel extraordinary.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Ses Salines",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Blau Colonia Sant Jordi",
    "offer_address": "Camí de Sa Síquia 3, Colònia de Sant Jordi, Mallorca 07638, Spain",
    "percentage_discount": 75.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 419.0,
    "value": 1666.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GB6P3YAL",
    "hero_image": "https://images.luxuryescapes.com/s7yccefq1dztu4moa63",
    "image_two": "https://images.luxuryescapes.com/nw6tkd40wq2hb30egc3b",
    "image_three": "https://images.luxuryescapes.com/6xop00xen9srq3szhhk",
    "vendor_name": "Pure Salt Port Adriano",
    "title": "Mallorca Adults-Only Luxury Hideaway with Daily Breakfast & Cocktails",
    "description": "Embrace romance at Pure Salt Port Adriano, an adults-only sanctuary hidden in Mallorca's ultra-exclusive El Toro Marina and boasting spellbinding views over the Mediterranean Sea. Step out of the hotel's spectacular, cascading pool onto Mallorca's legendary golden sands, or savour O Spa's cutting-edge facilities, including a Turkish bath, sauna, salt cabin and ice fountain. For added luxury, upgrade to the Swim Up Sea View and enjoy ocean views and private access to the resort's lagoon-style pool.\n\nWhen it comes time to explore, take the complimentary shuttle to El Toro Beach or the Santa Ponsa Golf Course to enjoy a day on the green. After sun-soaked days of adventure, head to Adriana Restaurant for unforgettable Mediterranean fare, backed by a comprehensive wine list and unrivalled views over the bay.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Pure Salt Port Adriano",
    "offer_address": "S. Ponsa 10, El Toro, Calvia, Mallorca 07182, Spain",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 719.0,
    "value": 2015.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DOYYvYAP",
    "hero_image": "https://images.luxuryescapes.com/0xgczq9chb68auox5etp",
    "image_two": "https://images.luxuryescapes.com/oeo39fortqnvmvjh3jd",
    "image_three": "https://images.luxuryescapes.com/477u59f93g45udn33mhi",
    "vendor_name": "Finca Ca'n Beneït",
    "title": "Mallorca Rural Hideaway with Daily Breakfast, Wine Tasting Experience & EUR60 Hotel Credit",
    "description": "Set in the sunlit foothills of Mallorca's Serra de Tramuntana mountains, this lovingly restored 18th-century estate embraces slow, sustainable tourism. Highlights include a natural, spring-fed pool, 70 hectares of private land with ancient olive groves and citrus orchards, and Mirabona Restaurant, where fresh, organic ingredients and garden-to-table specialties take centre stage.\n\nThe resort offers a selection of extraordinary experiences to elevate your stay (surcharges apply). Master traditional Spanish cuisine with a paella cooking workshop, celebrate special occasions with a magical sunrise hot air balloon ride with private breakfast or spend an unforgettable day sailing the crystal-clear Mediterranean aboard a private vessel.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Selva",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Finca Ca'n Beneït",
    "offer_address": "Camí de Binibona, Caimari, Illes Balears 07314, Spain",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 779.0,
    "value": 1905.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gus8zAAB",
    "hero_image": "https://images.luxuryescapes.com/1z854qeb0gvtvc4z6q",
    "image_two": "https://images.luxuryescapes.com/ttin725ziaztdm3kewh",
    "image_three": "https://images.luxuryescapes.com/8rlccfpj0qzux16duo6p",
    "vendor_name": "Kimpton Aysla Mallorca",
    "title": "Opulent Five-Star Mallorca Retreat with Daily Breakfast, One Three-Course Dinner & Spa Access",
    "description": "Dive into a world of luxury on the sun-soaked island of Mallorca with a stay at this lush sanctuary. Surrounded by native gardens and just a short hop from the capital, Palma, it’s the perfect escape to kick back, relax and live the good life.\n\nBask in the sunshine and take a refreshing plunge in one of the swimming pools, or sip on refreshing cocktails at the swanky open-air pool bar, Zayt. Indulge in a feast for the senses at the pan-Asian Saba Restaurant, or discover a diverse menu of drinks at Saba Bar & Bodega. Don’t miss a visit to Maison CODAGE Spa, where treatments range from soothing massages and LED therapy to rejuvenating mud baths.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Kimpton Aysla Mallorca",
    "offer_address": "37 Avinguda del Golf, Santa Ponsa, Mallorca, Balearic Islands 07180, Spain",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 779.0,
    "value": 2451.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JB8cIAG",
    "hero_image": "https://images.luxuryescapes.com/f1yiaztx6srnrfsu78ik",
    "image_two": "https://images.luxuryescapes.com/jzr60jy7rrfn4hy0blu",
    "image_three": "https://images.luxuryescapes.com/xpe3sx9zulo3pxzurp",
    "vendor_name": "Portella Palma",
    "title": "Spain Boutique Island Escape in Mallorca's Historic Centre with Daily Breakfast & Onsite Hammam",
    "description": "Step into a world of Mediterranean charm in this recently-renovated 17th-century home, nestled in the heart of Palma de Mallorca’s Old Town. With a traditional patio in the heart of the building, a rooftop terrace overlooking the city’s cathedral, and a tranquil wellness area, there is a space for everyone to unwind in between exploring the city and all that the island of Mallorca has to offer.\n\nWander the alluring streets of Palma and explore the Spanish city’s countless historic sites, including the majestic Palma Cathedral and the Royal Palace of La Almudaina. When you’re ready to venture further afield, indulge in the island’s natural gems and pristine beaches while you savour the local Mediterranean cuisine ranging from fresh seafood, delectable tapas and regional delicacies like the coca mallorquina.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Palma de Mallorca",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Portella",
    "offer_address": "Carrer de la Portella 9, Palma de Mallorca 07001, Mallorca, Spain",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 629.0,
    "value": 1140.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004iLp2AAE",
    "hero_image": "https://images.luxuryescapes.com/9ncbwi92bihbiy7oo1l",
    "image_two": "https://images.luxuryescapes.com/l7pscecvv8atcgmkupt",
    "image_three": "https://images.luxuryescapes.com/9hs1dpj2ulb84i9jdrvn",
    "vendor_name": "Punta Negra - H10",
    "title": "Oceanfront Mallorca Boutique Escape with Daily Gourmet Dining",
    "description": "On the shimmering shoreline of Mallorca's Bay of Palma, the boutique H10 Punta Negra will plunge you into Spanish seaside luxury as the tranquil Costa d'en Blanes unfurls before you. A private waterfront haven just 15 minutes' drive from Palma de Mallorca, H10 Punta Negra is ideally located for leaving life's stresses behind as you embrace the serenity of this picturesque part of Spain.\n\nEnjoy direct access to two coves with crystal-clear sparkling waters, perfect for swimming and snorkelling. Come for the visual feast, enviable location, outstanding service and world-class dining onsite, plus a secluded private beach, two pools, and relaxing health and beauty spa.\n\n**Your handpicked inclusions:**\n\n- Wake up to sea views and daily breakfast on the Mediterráneo Chill-Out Terrace or at Panorámico Restaurant\n- Nightly à la carte dinner awaits at the poolside Mediterráneo Restaurant\n- Indulge with a bottle of cava on arrival, so you can toast your escape\n\n**Suite Upgrade:** Enjoy extra space and embrace panoramic garden views when you upgrade to a Ducal Suite, featuring a separate lounge area and generous furnished terrace.\n\n**Book with 100% Confidence:** If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "H10 Punta Negra",
    "offer_address": "Carrer Punta Negra, 12, 07181 Costa d'en Blanes, Illes Balears, Spain",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 575.0,
    "value": 1117.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Dh3fuYAB",
    "hero_image": "https://images.luxuryescapes.com/0w94fhc4a54oy2202jo",
    "image_two": "https://images.luxuryescapes.com/upg0utn59uka128pqgeh",
    "image_three": "https://images.luxuryescapes.com/urysisdo4bug5aa5bcyb",
    "vendor_name": "Finca Ca'n Beneït",
    "title": "Mallorca Rural Hideaway in Tramuntan Mountains with Natural Spring Pool & Spa",
    "description": "Set in the foothills of Mallorca’s Serra de Tramuntana mountains, this lovingly restored 18th-century estate embraces slow, sustainable tourism. Highlights include a natural, spring-fed pool, 70 hectares of private land, and Mirabona Restaurant, where garden-to-table Mediterranean specialities take centre stage in a serene setting.\n\nFor total relaxation, indulge your senses at The Garden Spa, complete with a wooden outdoor pool and sauna, or enjoy outdoor yoga paired with mountain views. A little further afield, take some time to explore the surrounding nature on foot or by bike (charges apply), discover nearby towns and villages or head to the island's pristine coves and beaches.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Selva",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Finca Ca'n Beneït",
    "offer_address": "Camí de Binibona, Caimari, Binibona, Mallorca 07314, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 550.0,
    "value": 550.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FlJx6AAF",
    "hero_image": "https://images.luxuryescapes.com/46swufs40ootrzr2gl",
    "image_two": "https://images.luxuryescapes.com/7sttemuoufuvu5b9blsqh",
    "image_three": "https://images.luxuryescapes.com/6d32fna6xh3ucaz436ka",
    "vendor_name": "Samaritana Suites - Palma",
    "title": "Mallorca Self-Contained Luxury Suites in the Heart of Palma",
    "description": "Live the Mediterranean dream in a self-contained, spacious and stylish space at Samaritana Suites, Mallorca. Situated in the vibrant heart of Palma, just a few minutes from sparkling beaches and waterfront dining, this intimate collection of suites boasts classic elegance and modern comforts. The city's vibrant cultural scene, world-class museums, gourmet dining venues and high-end shopping districts are just a stone's throw away.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Palma de Mallorca",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Samaritana Suites",
    "offer_address": "Carrer del Pes de la Farina, 2, Palma de Mallorca, Islas Baleares 07001, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 169.0,
    "value": 169.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GAhVAAW",
    "hero_image": "https://images.luxuryescapes.com/f5vixn85k6ugo3qjcvp9",
    "image_two": "https://images.luxuryescapes.com/kcbe0835lle9bs7d4a2",
    "image_three": "https://images.luxuryescapes.com/kbzgf40bnv7vj2cy7tbo",
    "vendor_name": "Ocean Drive Port Portals Mallorca",
    "title": "Designer Mallorca Escape near Puerto Portals Harbour",
    "description": "Treat yourself to a stay at one of Mallorca’s finest hotels, Ocean Drive Port Portals. Part of OD Hotels' contemporary Mediterranean brand - which includes Ibiza and Barcelona - the hotel boasts an urban Scandinavian-meets-Mediterranean vibe, perfectly paired with charming modern furnishings and designer décor. Located in a prime position just outside Puerto Portals yacht harbour, this is the perfect launchpad for exploring Portals Nous, with Punta Negra, Costa d'en Blanes and Palma all within a short distance.\n\nAscend to the Sky Bar to drink in breathtaking 360-degree panoramic views of the sea and mountains, indulge in global fare at the restaurant, take a quick dip in the outdoor pool and enjoy complimentary pilates and yoga classes (on select days). With the best of southern Mallorca on your doorstep, you’ll be truly spoilt for choice.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Ocean Drive Port Portals",
    "offer_address": "Av. Tomàs Blanes Tolosa, 4, 07181 Portals Nous, Illes Balears, Spain",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FcEx4AAF",
    "hero_image": "https://images.luxuryescapes.com/hcmhgrhw6cg4l479io8",
    "image_two": "https://images.luxuryescapes.com/5oas2cchfeaaottowgz",
    "image_three": "https://images.luxuryescapes.com/l8q79kqtqm3rjyxrrlp",
    "vendor_name": "Posada Terra Santa - Palma",
    "title": "Mallorca Boutique Retreat with Mediterranean Restaurant & Rooftop Pool",
    "description": "Allow the enchanting allure of Posada Terra Santa to whisk you away from your everyday. This boutique gem, nestled in the heart of Palma de Mallorca, is a 16th-century manor-turned-luxury-hotel that offers sophistication and tranquillity within the city's vibrant cultural scene. Step out to lose yourself in the labyrinthine streets of the Old Town, or wander down to a nearby stretch of pristine coastline for a day by the sea. Savour exquisite Mediterranean cuisine at the hotel's refined restaurant - La Despensa del Barón - or ascend to the rooftop for a swim in the sparkling pool.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Palma de Mallorca",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Posada Terra Santa",
    "offer_address": "Carrer de la Posada de Terra Santa 5, 07001 Palma, Illes Balears, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 242.0,
    "value": 242.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CvKtYAAV",
    "hero_image": "https://images.luxuryescapes.com/5ebg4kilfjv7mfrtn61m",
    "image_two": "https://images.luxuryescapes.com/psq71y9vbkqbzxrel43f",
    "image_three": "https://images.luxuryescapes.com/hn4hbvylly5ykywjdp1j",
    "vendor_name": "Pure Salt Port Adriano",
    "title": "Five-Star Adults Only Hideaway in Exclusive Mediterranean Marina",
    "description": "Be overcome by romance at Pure Salt Port Adriano, hidden in an idyllic Mediterranean marina with pristine coastal views and dripping with decadent, Spanish features. Step out of the cascading pool onto the Mallorca beach, or pass the time at the O Spa with a wellness treatment. Practise your skills with the hotel's golf simulator, and satiate your appetite at restaurant Adriana, where a passionate team serve specialty dishes against an exclusive backdrop.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Pure Salt Port Adriano",
    "offer_address": "S. Ponsa 10, El Toro, Calvia, Mallorca 07182, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 589.0,
    "value": 589.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ExP4HAAV",
    "hero_image": "https://images.luxuryescapes.com/kal2cbz5thqfj5f7gec",
    "image_two": "https://images.luxuryescapes.com/y9m4at7aso6l1g9tv3n",
    "image_three": "https://images.luxuryescapes.com/4eqmxysducv94g1jpyyh9",
    "vendor_name": "Jumeirah Mallorca",
    "title": "Sky-High Mallorca Clifftop Retreat with Three Bars, Two Restaurants & Two Pools",
    "description": "Find a slice of Mallorcan bliss, somewhere between the sky and the sea, with a breathtaking five-star Jumeirah Mallorca retreat. The palatial property peers over the cliff face of the Serra de Tramuntana, providing unbeatable panoramic vistas of the ocean, mountains and port. Be immersed in luxury within softly muted interiors, sip cocktails against picture-perfect backdrops and feel all worries slip away as the apricot sun dips below the horizon. Get a glimpse into the Mallorcan way with laid-back drinks at one of three buzzing bars, a mouthwatering Spanish feast at the delightful Cap Roig Brasserie, a paddle in the picturesque pools, and to top it all off, a reviving treatment at the renowned Talise Spa. Come up for air and stay in the clouds forever.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Soller",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Jumeirah Mallorca",
    "offer_address": "Carrer de Belgica, Port de Soller, Mallorca, Balearic Islands 07108, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 389.0,
    "value": 389.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CP3a1AAD",
    "hero_image": "https://images.luxuryescapes.com/7wcd8h6khcsmh3rptqvl",
    "image_two": "https://images.luxuryescapes.com/g126oi8gd4wp58ihsuq8",
    "image_three": "https://images.luxuryescapes.com/gwxa19826bkw319au3ah",
    "vendor_name": "Kimpton Aysla Mallorca",
    "title": "Mallorca Wellness Escape with High-End Day Spa",
    "description": "Island luxury and fresh sea breezes are what you'll find at Kimpton Aysla Mallorca, an IHG Hotel, a Spanish sanctuary enveloped by lush native gardens just 14 kilometres from Palma. Experience the good life with a refreshing dip in the resort's huge outdoor swimming pool, sip cocktails at the open-air pool bar or indulge in sumptuous pan-Asian cuisine at Saba Restaurant. For ultimate relaxation, Spa by Maison CODAGE offers luxury treatments including massages, LED therapy and mud baths.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Kimpton Aysla Mallorca, an IHG hotel",
    "offer_address": "Avinguda del Golf 37, Santa Ponsa, 07180, Mallorca, Balearic Islands, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 262.0,
    "value": 262.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DIXeNAAX",
    "hero_image": "https://images.luxuryescapes.com/qzohopb807jpvci2knu4",
    "image_two": "https://images.luxuryescapes.com/n3hwcuc3mg5eqf61827u",
    "image_three": "https://images.luxuryescapes.com/ec9mmfcc1hfp0c0dlpc",
    "vendor_name": "The Lodge Mallorca",
    "title": "Luxurious Five-Star Mallorca Countryside Escape with Infinity Pools & Onsite Restaurant",
    "description": "Wander to the flourishing Spanish countryside and stumble upon absolute Mediterranean luxury at The Lodge Mallorca, an enchanting retreat nestled in the heart of the idyllic Balearic Islands. This lavish sanctuary offers a taste of Mallorcan charm, surrounded by the island's breathtaking mountain landscapes and azure waters. Venture out to explore the nearby historic town of Palma, unwind by infinity pools overlooking sun-kissed orchards and dine on authentic flavours at Singular.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Sa Pobla",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "The Lodge Mallorca",
    "offer_address": "Vía de servicio a Pollensa Km1 Salida 37, Ma-13, 07420 Sa Pobla, Balearic Islands, Spain",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CyHbmYAF",
    "hero_image": "https://images.luxuryescapes.com/2pd61hmk4sv0v6qj73z",
    "image_two": "https://images.luxuryescapes.com/pmqlalnqtmqmt781fhb",
    "image_three": "https://images.luxuryescapes.com/tnhoqfw7i9j05cww9r",
    "vendor_name": "Portella Palma",
    "title": "Mallorca Island Elegance in Palma's Historic Centre with Rooftop Terrace",
    "description": "Tucked away in the heart of Palma de Mallorca’s Old Town, this 17th-century home breathes around its authentic inner courtyard. Blending modern elegance with traditional charms, the designer abode boasts a rooftop terrace overlooking the city’s cathedral and a tranquil wellness area, ideal for some relaxation in between exploring.\n\nWander the alluring streets of Palma and explore the Spanish city’s countless historic sites, including the Palma Cathedral and the Royal Palace of La Almudaina. If you wish to venture further, visit the island's pristine beaches and feast on Mediterranean cuisine ranging from fresh seafood, delectable tapas and regional delicacies like the coca Mallorquina.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Palma de Mallorca",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Portella Palma",
    "offer_address": "Calle de la Portella 9, Palma de Mallorca, Mallorca 07001, Spain",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 31,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BeUEMAA3",
    "hero_image": "https://images.luxuryescapes.com/eumtyoesex77ugy9ju",
    "image_two": "https://images.luxuryescapes.com/oxe2f7im9k2ecqvafgmu",
    "image_three": "https://images.luxuryescapes.com/fnw166hjsv3x4qm7q5mq",
    "vendor_name": "Hotel Hospes Maricel & Spa",
    "title": "Mallorca Seaside Island Luxury with Infinity Pool",
    "description": "Since the 1950s, Hospes Maricel & Spa has been at the forefront of luxury hotels on Mallorca, overlooking the sapphire seas of the Mediterranean. Spend balmy Spanish days lounging by the infinity pool with a cocktail in hand, or let the sounds of waves crashing lull you into a meditative state at Bodyna Spa, where massages take place with soothing ocean views. At Maricel Restaurant, exquisite dishes made from fresh local seafood and seasonal produce will delight your tastebuds.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Calvia",
    "location_heading": "Mallorca",
    "location_subheading": "Spain",
    "location_description": "Hospes Maricel & Spa - Mallorca",
    "offer_address": "Ctra. d'Andratx, 11, Illes Balears, Palma, Calvia 07181, Cas Catala - Majorca, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 148.0,
    "value": 148.0
  }
]