[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPw1tQAC",
    "hero_image": "https://images.luxuryescapes.com/iioreupgg1jeziuvtsm5",
    "image_two": "https://images.luxuryescapes.com/sd85zzozasffhy4xzffp",
    "image_three": "https://images.luxuryescapes.com/opntk5t1uc0bltxitbbv",
    "vendor_name": "One&Only Reethi Rah",
    "title": "One&Only Luxury with Speedboat Transfers and Nightly Dining",
    "description": "Indulge in a truly unforgettable escape to the highly exclusive One&Only Reethi Rah resort. Set on a private island in the Maldives, this spacious five-star haven offers a host of exceptional dining destinations, an award-winning spa, 6km of stunning coastline and some of the largest resort villas in the world. Arrive in style with complimentary return boat transfers from Malé Airport to One&Only's private island and enjoy an incredible daily breakfast with extensive buffet and à la carte options, a nightly dinner with choice of à la carte Asian, Italian or French, plus 20% off dives, excursions and indulgent treatments at the One&Only Spa. Travelling with family? Two children aged 11 years and under stay and eat for free, with transfers included.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Reethi Rah",
    "location_heading": "Malé",
    "location_subheading": "Maldives",
    "location_description": "One&Only Reethi Rah 2019",
    "offer_address": "Reethi Rah, North Malé Atoll, Malé 08440, Maldives",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 5632.0,
    "value": 12419.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002ImpNIAS",
    "hero_image": "https://images.luxuryescapes.com/9toeoabgjizcazk930l2",
    "image_two": "https://images.luxuryescapes.com/hc72vai5ginaqx5erimn",
    "image_three": "https://images.luxuryescapes.com/xicamli8aumlcnho1s",
    "vendor_name": "SO/ Maldives",
    "title": "Maldives Bespoke Ultra-Chic Private Pool Beach & Overwater Villas",
    "description": "Savour a generous slice of Maldivian paradise at this boutique retreat set amongst the dazzling azure of the Indian Ocean, boasting an admirable collection of bespoke beachfront and overwater villas. Think private pools, sun decks and easy access to the crystal-clear waters of the lagoon - each villa is avante-garde in design and is accentuated by trademark SO/ details.\n\nEmbrace the island's vibrant spirit at the chic Mediterranean-inspired Lazuli Beach Club as you sip on creative cocktails and listen to live music. If you're feeling peckish, indulge in Pan-Asian delicacies at The Citronelle Club and lip-smacking delights at Hadaba. Perfect for beach lovers, spend your days exploring the colourful underwater world with snorkelling and scuba diving adventures - there is simply so much to experience at this island haven.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Emboodhoo Lagoon",
    "location_heading": "Malé",
    "location_subheading": "Maldives",
    "location_description": "SO/ Maldives",
    "offer_address": "Emboodhoo Lagoon, Kaafu Atoll, Malé 20028, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 746.0,
    "value": 746.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zXGjAAM",
    "hero_image": "https://images.luxuryescapes.com/vtsqs3xgdr2x0m746c5",
    "image_two": "https://images.luxuryescapes.com/7zgiis9hzgrt90yufbts",
    "image_three": "https://images.luxuryescapes.com/uq7mm8xupcwarxgh2qip",
    "vendor_name": "Hotel Jen, Male",
    "title": "JEN Maldives by Shangri-La City Escape within Malé's Vibrant Centre with Infinity Pool & Three Restaurants",
    "description": "The stylish JEN Maldives Malé by Shangri-La can be found in the heart of the Maldives' capital, with Malé's buzzing markets and the city centre right outside. Head to Azur for an unbelievable ocean-facing setting serving up mouthwatering cuisine around the clock, relax with a cocktail in hand by the infinity pool overlooking the dazzling Indian Ocean or hit the 24-hour fitness centre to work up a sweat. If that doesn't take your fancy, head to Aristo Spa for a full menu of treatments to indulge your senses.\n\nIf you can manage to drag yourself away from the comforts of the hotel, you can delve deeper into Maldivian culture with a visit to the colourful mosques, Sultan Park, Tsunami Monument or National Museum. For those continuing their onward journey to one of the pristine islands, the Atoll Transfer terminal is a short stroll from the hotel.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Malé",
    "location_heading": "Malé",
    "location_subheading": "Maldives",
    "location_description": "JEN Maldives Malé by Shangri-La",
    "offer_address": "Ameer Ahmed Magu, Malé 20096, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 274.0,
    "value": 274.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Ed8HAAS",
    "hero_image": "https://images.luxuryescapes.com/iwrzvu3vikgcga0ox1lv",
    "image_two": "https://images.luxuryescapes.com/wfckablegj5i06ak1gva",
    "image_three": "https://images.luxuryescapes.com/ilqf4ugo7k4vnnwmh1g6",
    "vendor_name": "One&Only Reethi Rah",
    "title": "Maldives Five-Star One&Only Private Island Indulgence with Eight Onsite Restaurants",
    "description": "Setting the bar for luxury in the Maldives is the five-star One&Only Reethi Rah, a breathtaking resort located on its own private island, just a 45-minute boat transfer from Malé. Eight incredible restaurants, bars and lounges in unbelievable ocean-facing settings serve up sumptuous cuisine (think Japanese-Peruvian fusion, plant-based innovation, Middle Eastern fare and an exciting poolside bar). An impressive array of facilities including a dive centre, a tennis court, the One&Only Spa and a FIFA-certified football pitch are on hand to ensure an unforgettable experience. Bask on the pristine shores of one of 12 secluded beaches or engage in an abundance of memorable water-based activities including snorkelling with hawksbill turtles.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Reethi Rah",
    "location_heading": "Malé",
    "location_subheading": "Maldives",
    "location_description": "One&Only Reethi Rah",
    "offer_address": "Reethi Rah, North Malé Atoll, Malé 08440, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 8612.0,
    "value": 8612.0
  }
]