[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DIUqaAAH",
    "hero_image": "https://images.luxuryescapes.com/4x3mr9wjhi3mpep0ljqu",
    "image_two": "https://images.luxuryescapes.com/blelewat62tn86fcm2",
    "image_three": "https://images.luxuryescapes.com/z8idyg115h0s28z8vs4n",
    "vendor_name": "Mana Island Resort and Spa",
    "title": "Fiji Family Fun on Mana Island with All-Inclusive Dining, Resort Credit & Two Kids Stay Free",
    "description": "Experience sandy bliss and tropical splendour at the fun-filled Mana Island Resort and Spa - the ultimate beachfront playground on the palm-fringed shores of Fiji's Mamanuca Island. Grand facilities and an exciting array of activities mean no two days are the same. Spend a whole day blissed out on a beach lounger with book and cocktail in hand, then set off kayaking on crystal waters or snorkelling past neon-bright marine life the next.\n\nTwo onsite restaurants offer tantalising local and international fare and themed dinners, while four bars (including a swim-up pool bar) will keep you hydrated throughout your stay. After days of tropical fun, unwind at the Mana Spa with a massage or pedicure. If you'd like to keep the sense of tranquillity flowing, drop the little ones off at the Kids' Club while you unwind poolside at one of the two glittering swimming pools.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Mana Island",
    "location_heading": "Mamanuca Islands",
    "location_subheading": "Fiji",
    "location_description": "Mana Island Resort & Spa Fiji",
    "offer_address": "Mana Island, Mamanuca Islands, Fiji",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1179.0,
    "value": 2358.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2HU1QAN",
    "hero_image": "https://images.luxuryescapes.com/zlpayn94yhimfjkxtxkt",
    "image_two": "https://images.luxuryescapes.com/b4uxl0vjhv3wkml36mzu",
    "image_three": "https://images.luxuryescapes.com/lfauipddmadvfxopgukf",
    "vendor_name": "Serenity Island Resort, Fiji",
    "title": "Serene Island Escape with Daily Breakfast, Massages & Romantic Beachside Dinner",
    "description": "Discover a tropical island paradise nestled in Fiji’s breathtaking Mamanuca Islands at the tranquil Serenity Island Resort. Stay in a traditional Bure only metres from the beach and enjoy daily continental breakfast, private three-course beachside dinner, picnic lunch for two, welcome cocktail for two, two 30-minute massages to share and non-motorised water sports.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "",
    "location_heading": "Mamanuca Islands",
    "location_subheading": "Fiji",
    "location_description": "Serenity Island Resort OLD",
    "offer_address": "PO Box 9994 Nadi Airport Viti, Levu, Levu, 9994, Fiji",
    "percentage_discount": 62.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 494.0,
    "value": 1289.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LqeiAAC",
    "hero_image": "https://images.luxuryescapes.com/m7jznz551plzp7zzhevp",
    "image_two": "https://images.luxuryescapes.com/jt6slszpjny73f3czfiq",
    "image_three": "https://images.luxuryescapes.com/34z7dm1vsi8exi7z1pg",
    "vendor_name": "Serenity Island Resort, Fiji",
    "title": "Fiji Private Island Escape with Romantic Beachside Dining & Massages",
    "description": "Find a lost paradise at Fiji's Serenity Island Resort, a heavenly private island escape where it's all about the sun, sand and the sea. Set against the backdrop of the stunning Pacific Ocean and surrounded by coral reefs filled with the most exotic marine life, including an onsite turtle sanctuary, this untouched hideaway is perfect for families and couples alike. Unwind with daily continental breakfast, two private three-course dinners by the pool or the beach, four 30-minute massages to share, a nightly drink each and complimentary use of non-motorised watersports.\n\n**Travelling with family?** Check out the Family Upgrade, valid for two adults and two children.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Bounty Island",
    "location_heading": "Mamanuca Islands",
    "location_subheading": "Fiji",
    "location_description": "Serenity Island Resort",
    "offer_address": "Serenity Island, Mamanuca Islands, Fiji",
    "percentage_discount": 80.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 613.0,
    "value": 3049.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fj5hyAAB",
    "hero_image": "https://images.luxuryescapes.com/p8g3cmj6qn20ojz79q6l",
    "image_two": "https://images.luxuryescapes.com/p6pttv481mde4vjgc1s",
    "image_three": "https://images.luxuryescapes.com/zhl1p9iv0n9s56c5u4b",
    "vendor_name": "Mana Island Resort and Spa",
    "title": "Fiji Family Fun on Mana Island with All-Inclusive Dining, Daily Drinks & Two Kids Stay Free",
    "description": "Experience the ultimate beachfront playground at Mana Island Resort & Spa, an idyllic tropical sanctuary in Fiji’s breathtaking Mamanuca Islands. Surrounded by turquoise waters, coral reefs and white sandy beaches, Mana Island offers the quintessential, fun-filled tropical island escape. Spend days blissed out on a beach lounger with a book and cocktail in hand, then set off kayaking on crystal waters or snorkelling past neon-bright marine life directly from the beach.\n\nWith all-inclusive dining, Mana’s onsite restaurants and bars offer tantalising local and international cuisine featuring themed dinners and a swim-up pool bar. After days of tropical fun, unwind at the Mana Spa with a massage or pedicure. If you'd like to keep the sense of tranquillity flowing, drop the little ones off at the Kids' Club while you unwind poolside at one of the two glittering swimming pools.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Mana Island",
    "location_heading": "Mamanuca Islands",
    "location_subheading": "Fiji",
    "location_description": "Mana Island Resort & Spa Fiji",
    "offer_address": "Mana Island, Mamanuca Islands, Fiji",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 15,
    "price": 1199.0,
    "value": 2503.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JdizBYAR",
    "hero_image": "https://images.luxuryescapes.com/1nvukoeyf5p87v55k9r9",
    "image_two": "https://images.luxuryescapes.com/0rt2jmcn8liyepjdutj",
    "image_three": "https://images.luxuryescapes.com/b25u1qn6drlgkjrigoj",
    "vendor_name": "Mana Island Resort and Spa",
    "title": "Fiji Family Fun on Mana Island with All-Inclusive Dining, Nightly Drinks & FJ$300 Resort Credit",
    "description": "Experience the ultimate beachfront playground at Mana Island Resort & Spa, an idyllic tropical sanctuary in Fiji’s breathtaking Mamanuca Islands. Surrounded by turquoise waters, coral reefs and white sandy beaches, Mana Island offers the quintessential, fun-filled tropical island escape. Spend days blissed out on a beach lounger with a book and cocktail in hand.\n\nSet off kayaking on crystal-clear waters or snorkel past neon-bright marine life directly from the beach. With all-inclusive dining, Mana’s onsite restaurants and bars offer tantalising local and international cuisine, featuring themed dinners and a swim-up pool bar. Every meal promises to delight and keep your tropical vibes going strong.\n\nAfter days of island adventures, unwind at the Mana Spa with a soothing massage or pedicure. For parents wanting a moment of peace, drop the little ones off at the Kids' Club and relax poolside at one of the two sparkling swimming pools, soaking in the tranquillity and tropical beauty all around.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Mana Island",
    "location_heading": "Mamanuca Islands",
    "location_subheading": "Fiji",
    "location_description": "Mana Island Resort & Spa Fiji",
    "offer_address": "Mana Island, Mamanuca Islands, Fiji",
    "percentage_discount": 44.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 1379.0,
    "value": 2452.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008njj6AAA",
    "hero_image": "https://images.luxuryescapes.com/kmys046arr12x9zxgp",
    "image_two": "https://images.luxuryescapes.com/9g9r1zf8ynu6iw9rvm",
    "image_three": "https://images.luxuryescapes.com/5qglmbztjaedu0ut3ae6",
    "vendor_name": "Mana Island Resort and Spa",
    "title": "Mamanuca Island Blissful Beachfront Hideaway with Swim-Up Pool Bar",
    "description": "**Please Note:** The property is at full capacity and unable to be booked from April-June 2024.\n\nIsland time is all about relaxing and recharging the mind and body, and that's exactly what you can achieve with a stay at Mana Island Resort & Spa. You might recognise the gorgeous Fijian island of Mamanuca from the popular US television show Survivor, but contrary to the nature of the show,  a stay here will be nothing short of extravagant. A variety of land- and water-based activities means no two days are the same. Go kayaking across crystal waters one day, and snorkelling past neon-bright marine life the next.\n\nThe five onsite restaurants offer tantalising local and international fare as well as themed dinners, while four bars (including a swim-up pool bar) will keep you hydrated throughout your stay. After a day of kayaking, feasting and cocktail-drinking, unwind at the Mana Spa with a massage or pedicure. If you'd like to keep the sense of tranquility flowing, drop the little ones off at the kids' club while you unwind poolside at any of the two swimming pools.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Mana Island",
    "location_heading": "Mamanuca Islands",
    "location_subheading": "Fiji",
    "location_description": "Mana Island Resort & Spa Fiji",
    "offer_address": "Mana Island, Mamanuca Islands, Fiji",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 248.0,
    "value": 248.0
  }
]