[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008h3tIAAQ",
    "hero_image": "https://images.luxuryescapes.com/luekh46bie3nwtq4nr78",
    "image_two": "https://images.luxuryescapes.com/nnelxfl8vbgkhuffp6j7",
    "image_three": "https://images.luxuryescapes.com/edup98rreqfzv3u3btjg",
    "vendor_name": "Tadrai Island Resort",
    "title": "Fiji Adults-Only Island Retreat with All-Inclusive Dining, Unlimited Drinks & Daily Massages",
    "description": "Experience utter seclusion and five-star, all-inclusive indulgence in a retreat off-limits to everyone but just eight other guests at the ultra-luxurious Tadrai Island Resort, Fiji. A gem in the ocean amid the world-famous Mamanuca Islands and surrounded by four secluded beaches on Mana Island, this adults-only oasis feels completely remote and yet a cocktail is only the wave of a hand away.\n\nDelivering impeccable luxury amid a breathtaking tropical landscape, this romantic island retreat offers untouched beaches, preserved reefs and just five ultra-luxurious beachfront villas. Gaze at the glistening South Pacific Ocean from your private pool, kayak through kaleidoscopic coral reefs, melt away with treatments at Wai Siliva Alfresco Spa and enjoy unforgettable gourmet experiences like a private sandbar lunch and dinner under the stars.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Mana Island",
    "location_heading": "Mana Island",
    "location_subheading": "Fiji",
    "location_description": "Tadrai Island Resort",
    "offer_address": "Mana Island, Fiji",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 2339.0,
    "value": 4181.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eK4eaQAC",
    "hero_image": "https://images.luxuryescapes.com/onewhheje3asjh884x5g",
    "image_two": "https://images.luxuryescapes.com/jv0kv50u6ewr611pno5g",
    "image_three": "https://images.luxuryescapes.com/hugvmu1jotv3v82oltc",
    "vendor_name": "Tadrai Island Resort",
    "title": "Fiji Adults-Only Island Retreat with All-Inclusive Dining, Unlimited Drinks & Daily Massages",
    "description": "Experience utter seclusion and five star, all-inclusive indulgence in a retreat off-limits to everyone but just eight other guests at the ultra-luxurious Tadrai Island Resort. A gem in the ocean amid the world-famous Mamanuca Islands and surrounded by four secluded beaches on Mana Island, this adults-only oasis feels completely remote and yet a cocktail is only the wave of a hand away.\n\nDelivering impeccable luxury amid a breathtaking tropical landscape, this romantic island retreat offers untouched beaches, preserved reefs and just five ultra-luxurious beachfront villas. Gaze at the glistening South Pacific Ocean from your private pool, kayak through the kaleidoscopic coral reef, melt away with treatments at the Wai Siliva Alfresco Spa and enjoy once-in-a-lifetime gourmet experiences such as a private sandbar lunch and dinner under the stars.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Mana Island",
    "location_heading": "Mana Island",
    "location_subheading": "Fiji",
    "location_description": "Tadrai Island Resort",
    "offer_address": "Mana Island, Fiji",
    "percentage_discount": 43.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 2199.0,
    "value": 3880.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I66uIAC",
    "hero_image": "https://images.luxuryescapes.com/iy9qti2tjgho56yx702n",
    "image_two": "https://images.luxuryescapes.com/n2g40vgq66gqhmj528a",
    "image_three": "https://images.luxuryescapes.com/vtq92vgy20yjyp7xic",
    "vendor_name": "Tadrai Island Resort",
    "title": "Fiji Adults-Only Beachfront Villa Retreat on Mana Island with All-Inclusive Dining, Unlimited Drinks & Daily Massages",
    "description": "Experience all-inclusive indulgence in a haven off-limits to all but eight other guests amid Fiji's world-famous Mamanuca Islands. The ultra-luxurious Tadrai Island Resort is surrounded by four secluded beaches on Mana Island, yet a cocktail is ready to toast your escape at a moment’s notice.\n\nDelivering impeccable luxury amid a breathtaking tropical landscape, this romantic adults-only retreat offers untouched beaches and preserved reefs. Sink into a Fijian fantasy with your daily 30-minute massage, then recline in your private villa, just steps from the dazzling blue waters of the Pacific Ocean.\n\nGaze at the glistening South Pacific Ocean from your private pool, kayak through the kaleidoscopic coral reef, melt away with treatments at the Wai Siliva Alfresco Spa and enjoy once-in-a-lifetime gourmet experiences such as a private sandbar lunch and dinner under the stars.\n\nIn an ocean of world-class islands, Tadrai Island Resort offers superlative service and a sense of serenity that must be experienced to be believed.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Mana Island",
    "location_heading": "Mana Island",
    "location_subheading": "Fiji",
    "location_description": "Tadrai Island Resort",
    "offer_address": "Mana Island, Fiji",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 12,
    "price": 2419.0,
    "value": 4143.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuxAAAAZ",
    "hero_image": "https://images.luxuryescapes.com/vp3me1nqrniikr52log4",
    "image_two": "https://images.luxuryescapes.com/oyvvp6g6emvs061a8dkw",
    "image_three": "https://images.luxuryescapes.com/l0go0er8k3sis3zxh33v",
    "vendor_name": "Tadrai Island Resort",
    "title": "Fiji Adults-Only Beachfront Villa Retreat on Mana Island with All-Inclusive Dining, Unlimited Drinks & Daily Massages",
    "description": "Experience all-inclusive indulgence in a haven off-limits to all but eight other guests amid Fiji's world-famous Mamanuca Islands. The ultra-luxurious Tadrai Island Resort is surrounded by four secluded beaches on Mana Island, yet a cocktail is ready to toast your escape at a moment’s notice. Delivering impeccable luxury amid a breathtaking tropical landscape, this romantic adults-only retreat offers untouched beaches and preserved reefs. Sink into a Fijian fantasy with your daily 30-minute massage, then recline in your private villa, just steps from the dazzling blue waters of the Pacific Ocean.\n\nGaze at the glistening South Pacific Ocean from your private pool, kayak through the kaleidoscopic coral reef, melt away with treatments at the Wai Siliva Alfresco Spa and enjoy once-in-a-lifetime gourmet experiences such as a private sandbar lunch and dinner under the stars. In an ocean of world-class islands, Tadrai Island Resort offers superlative service and a sense of serenity that must be experienced to be believed.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Mana Island",
    "location_heading": "Mana Island",
    "location_subheading": "Fiji",
    "location_description": "Tadrai Island Resort",
    "offer_address": "Mana Island, Fiji",
    "percentage_discount": 49.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 2399.0,
    "value": 4717.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FP9HBYA1",
    "hero_image": "https://images.luxuryescapes.com/1spbahgjgmwgo8w58bz8",
    "image_two": "https://images.luxuryescapes.com/t5m0pqhgwdbyis73jzm",
    "image_three": "https://images.luxuryescapes.com/q5hp3g4q5pinw5plklyc",
    "vendor_name": "Tadrai Island Resort",
    "title": "Fiji Mana Island Adults-Only Beachfront Villas with All-Inclusive Dining & Unlimited Free-Flow Drinks",
    "description": "Experience all-inclusive indulgence in a haven that's open to only 10 guests amid Fiji's world-famous Mamanuca Islands. This ultra-luxurious resort is surrounded by four secluded beaches on Mana Island, yet a cocktail is ready to toast your escape at a moment’s notice.\n\nDelivering impeccable luxury in a breathtaking tropical landscape, this romantic adults-only retreat offers untouched beaches and preserved reefs. Sink into a Fijian fantasy with a couples' massage, then recline in your private villa just steps from dazzling blue waters.\n\nGaze at the glistening South Pacific Ocean from your private pool, kayak through the kaleidoscopic coral reef, melt away with treatments at the Wai Siliva Alfresco Spa and enjoy once-in-a-lifetime gourmet experiences such as a private dinner under the stars. In an ocean of world-class islands, this decadent hideaway offers superlative service and a sense of serenity that must be experienced to be believed.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Mana Island",
    "location_heading": "Mana Island",
    "location_subheading": "Fiji",
    "location_description": "Tadrai Island Resort",
    "offer_address": "Mana Island, Fiji",
    "percentage_discount": 37.0,
    "min_duration": 3,
    "max_duration": 13,
    "price": 2239.0,
    "value": 3576.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008h3t4AAA",
    "hero_image": "https://images.luxuryescapes.com/kauof6vos5coddn85vh7",
    "image_two": "https://images.luxuryescapes.com/e38gk3w4tpu64eci189d",
    "image_three": "https://images.luxuryescapes.com/51rg9ps2fgzziqa7zuq",
    "vendor_name": "Tadrai Island Resort",
    "title": "Fiji Adults-Only Island Retreat with All-Inclusive Dining, Private Picnic & Afternoon Drinks",
    "description": "Experience five-star, all-inclusive indulgence at the ultra-luxurious Tadrai Island Resort. A drop in the ocean amid the world-famous Mamanuca Islands, this adults-only oasis feels completely remote, yet a cocktail is only the wave of a hand away. This romantic island retreat offers untouched beaches and just five perfectly placed beachfront villas. Gaze at the glistening South Pacific Ocean from your private pool, kayak through the kaleidoscopic coral, melt away at the Wai Siliva Alfresco Spa and enjoy gourmet experiences.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Mana Island",
    "location_heading": "Mana Island",
    "location_subheading": "Fiji",
    "location_description": "Tadrai Island Resort",
    "offer_address": "Mana Island, Fiji",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]