[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP6eYAF",
    "hero_image": "https://images.luxuryescapes.com/7ff9lkxzhd2133v66wkf",
    "image_two": "https://images.luxuryescapes.com/4p9zfr1q8efov7p18rm",
    "image_three": "https://images.luxuryescapes.com/n7r6yrik7it1lm6wpscr",
    "vendor_name": "Joy Nostalg Hotel & Suites Manila by AccorHotels",
    "title": "Five-Star City Stay in East Manila with Restaurant, Bar & Pool",
    "description": "Escape to this enchanting five-star oasis in the Philippines, the ultimate city break. With a vast swimming pool and a charming on-site restaurant, it offers every indulgence for a blissful stay. Pasig is a charming blend of urban energy and green spaces, where modern malls, dining spots and serene parks create a perfect escape in the heart of the metro.\n\nSavour an array of international and Asian cuisine at the hotel's sumptuous restaurant The Nostalgia Lounge and enjoy al fresco dining at The Roof, where you can take in breathtaking skyline views. When you're not out exploring, enjoy the comfort of your elegantly appointed room.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "National Capital Region",
    "offer_geo_area_level_2": "Pasig",
    "location_heading": "Manila",
    "location_subheading": "Philippines",
    "location_description": "Joy Nostalg Hotel & Suites Manila",
    "offer_address": "17 ADB Avenue, Topaz Road, Ortigas Centre, Pasig City, Manila 1600, Philippines",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 117.0,
    "value": 117.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2zAIAS",
    "hero_image": "https://images.luxuryescapes.com/kas1rs1xsd6h2ztedtlt",
    "image_two": "https://images.luxuryescapes.com/hwloi9pgiqjsg8jwhj4h",
    "image_three": "https://images.luxuryescapes.com/ifzq0om1en6ozezaey",
    "vendor_name": "Raffles Makati",
    "title": "Raffles Manila Opulence in Makati Financial District with Seven Dining Venues, World-Class Spa & Pool",
    "description": "Experience Manila from the opulence of this glamorous Raffles destination, located in the city's prestigious financial district. Spend your days exploring the cultural treasures of the Ayala Museum or shopping at the Greenbelt Mall, both just a short stroll away. \n\nAt your five-star base, savour exquisite French cuisine at Mireio, indulge in a handcrafted cocktail at Mistral Rooftop Bar and sample world-class cuisine across five more dining venues. For a taste of tranquillity, retreat to the exquisite spa, or take a refreshing dip in the outdoor pool.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "National Capital Region",
    "offer_geo_area_level_2": "Makati",
    "location_heading": "Manila",
    "location_subheading": "Philippines",
    "location_description": "Raffles Makati",
    "offer_address": "1 Raffles Drive Makati Avenue, Makati, Manila, Philippines 1224",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 324.0,
    "value": 324.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQJaEAAX",
    "hero_image": "https://images.luxuryescapes.com/gec7egps7f93095kj3yi",
    "image_two": "https://images.luxuryescapes.com/4u75nacn7o62u6j7as4b",
    "image_three": "https://images.luxuryescapes.com/95ks05q2oh1dwff9nwnl",
    "vendor_name": "Crowne Plaza Manila Galleria",
    "title": "Contemporary Manila Urban Retreat in Heart of Ortigas Center",
    "description": "At the heart of Ortigas Center, Crowne Plaza Manila Galleria, an IHG Hotel, fuses convenient access to dining, entertainment and retail with a sophisticated and spacious stay. Savour a global range of flavours at Seven Corners restaurant or grab a tasty treat from the Agenda cafe. Lunge into your workout at the fitness centre, plunge into the outdoor pool or indulge in retail therapy at the many malls and retail complexes in the region, before setting out to experience the dynamic nightlife of Manila.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "National Capital Region",
    "offer_geo_area_level_2": "Pasig",
    "location_heading": "Manila",
    "location_subheading": "Philippines",
    "location_description": "Crowne Plaza Manila Galleria, an IHG Hotel",
    "offer_address": "Ortigas Ave, Quezon City, 1100, Manila, Philippines",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 74.0,
    "value": 74.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP6cYAF",
    "hero_image": "https://images.luxuryescapes.com/e0xls18w5zx6g11rwwk",
    "image_two": "https://images.luxuryescapes.com/1e6g1tca9700cwvutxdj",
    "image_three": "https://images.luxuryescapes.com/4gddvwipco6cdpilgb3",
    "vendor_name": "Novotel Manila Araneta City",
    "title": "Stylish Manila Retreat in Araneta City with Outdoor Pool & Spa",
    "description": "Immerse yourself in the vibrant energy of the Filipino capital with a stay at Novotel Manila Araneta City. This urban oasis in the city's bustling commercial district offers a seamless blend of modern comfort and local culture. With the Araneta City entertainment hub on your doorstep, discover a world of shopping, dining and entertainment.\n\nIndulge in a gastronomic journey across the hotel's six dining venues, each offering a unique culinary experience. Enjoy a refreshing dip in the outdoor pool, or maintain your fitness routine at the state-of-the-art gym. Venture beyond the hotel to explore the historic Art In Island museum or the lush greenery of the Quezon Memorial Circle.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "National Capital Region",
    "offer_geo_area_level_2": "Quezon City",
    "location_heading": "Manila",
    "location_subheading": "Philippines",
    "location_description": "Novotel Manila Araneta City",
    "offer_address": "General Aguinaldo Avenue, Cubao, Araneta, Manila 0810, Philippines",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 89.0,
    "value": 89.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003yaGEAAY",
    "hero_image": "https://images.luxuryescapes.com/79g9qtchxod05lb3k87e",
    "image_two": "https://images.luxuryescapes.com/zz4ei2k4scp97vis8r",
    "image_three": "https://images.luxuryescapes.com/ltpl2rnygr6ysesa6zn",
    "vendor_name": "Okada Manila",
    "title": "Iconic Manila Five-Star Casino Extravagance with 21 Dining Outlets",
    "description": "There’s opulence, and then there’s Okada Manila: a five-star pleasure playground in the heart of Manila’s Entertainment City. Covering 44 hectares of prime real estate, the sprawling resort known as Manila’s Grand Icon is a one-of-a-kind property, encompassing a luxury hotel, casino, 21 dining outlets, diverse entertainment complex and the largest multicoloured dancing water feature in the world, The Fountain. While there’s plenty to explore within its grounds, Okada Manila is in the centre of the bustling city’s action, just a short distance from famous shopping malls, theatres and stunning Manila Bay.\n\nThe two-winged resort is a masterclass in extravagant design, with marble interiors adorned with precious stones and shades of pink and purple. Spend your days exploring its multitude of dining options, jumping from high-end Japanese to inventive Italian and everything in between. Book the kids in for a day at Play, the immersive learning centre with eight themed ‘neighbourhoods’ designed to attract and amuse, so you can indulge in some pampering at the Retreat Spa, complete with barbershop, beauty salon and swimming pool. No matter the time of day, party people will find their tribe at Cove Manila, an indoor beach and nightclub that holds the title of Southeast Asia’s largest entertainment space - it can host up to 4,500 guests around its butterfly-shaped pool, with a soundtrack courtesy of celebrity DJs.\n\n**Luxury Escapes inclusions (select packages/nights only)**\n\n- Start your stay with a **welcome cocktail**\n- Feast on **daily buffet breakfast**\n- Explore Okada Manila’s 21 dining options with **PHP 1,750 daily food and drink credit per room**\n- Order that extra dish with a **10% discount on food and drinks**\n- Relax during a **30-minute welcome massage**\n- Sample the flavours of Medley’s seven culinary stations with a **buffet lunch** (for stays of 5+ nights)\n- Go back for more with a **second buffet lunch** at Medley (two total; for stays of 7+ nights)\n- Travel in style with **roundtrip airport transfers** (suites only; 2+ nights)\n\n**Travelling with friends or family?** Upgrade to the incredible Manila Bay Suite for four guests.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "National Capital Region",
    "offer_geo_area_level_2": "Parañaque",
    "location_heading": "Manila",
    "location_subheading": "Philippines",
    "location_description": "Okada Manila",
    "offer_address": "New Seaside Dr, Tambo, Parañaque, 1701 Metro Manila, Philippines Philippines",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP6dYAF",
    "hero_image": "https://images.luxuryescapes.com/fzjeq2o6fvlnxb87az9n",
    "image_two": "https://images.luxuryescapes.com/57b2xe893l775x4uow7s",
    "image_three": "https://images.luxuryescapes.com/4emxsb6lwah960gwvoa",
    "vendor_name": "Admiral Hotel Manila - MGallery Collection",
    "title": "Manila Bayside Golden-Age Glamour with Rooftop Infinity Pool & Spa",
    "description": "Offering a captivating journey to Manila's Golden Age, the Admiral Hotel Manila boasts Filipino-Spanish design elements in a boutique setting. Set along Roxas Boulevard with a captivating rooftop infinity pool, two signature dining venues and a luxurious spa, this reimagined hotel is the perfect backdrop for romantic getaways, family vacations and memorable events.\n\nGuests find themselves within easy reach of Manila's cultural delights including Rizal Park, Intramuros, Mall of Asia and the National Museum. Each uniquely themed room invites travellers to experience the dynamic energy of Manila while enjoying the hotel's distinguished design, extraordinary gastronomy and gracious service.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "National Capital Region",
    "offer_geo_area_level_2": "Manila",
    "location_heading": "Manila",
    "location_subheading": "Phillippines",
    "location_description": "Admiral Hotel Manila - MGallery Collection",
    "offer_address": "2138 Roxas Boulevard, Malate, Manila 1004, Philippines",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 102.0,
    "value": 102.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008fWxKAAU",
    "hero_image": "https://images.luxuryescapes.com/fc1cpbcf78fqkoecf73",
    "image_two": "https://images.luxuryescapes.com/97ubvlci8zl7aktizq",
    "image_three": "https://images.luxuryescapes.com/te0k8m60iqo9v99ite",
    "vendor_name": "Discovery Suites Manila",
    "title": "Top-Rated Manila Serviced Apartments within Pasig City",
    "description": "Immerse yourself in the stylish bayside capital of the Philippines from the opulent Discovery Suites Manila. Hidden amid the towering skyscrapers of Ortigas Business District in Pasig City, this collection of serviced apartments  places guests within arms reach of popular eateries, trendy bars and fashionable boutiques. When you're not exploring the city, cool off in the swimming pool or soak in the bubbling jacuzzi. Afterwards, return to your spacious sanctuary, where high-end amenities create a home-away-from-home experience.",
    "offer_country_name": "Philippines",
    "offer_country_code_alpha_2": "PH",
    "offer_geo_area_level_1": "National Capital Region",
    "offer_geo_area_level_2": "Pasig",
    "location_heading": "Manila",
    "location_subheading": "Philippines",
    "location_description": "Discovery Suites, Manila",
    "offer_address": "25 ADB Avenue, Ortigas Center, Pasig City, 1600, Metro Manila, Philippines",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 16,
    "price": 96.0,
    "value": 96.0
  }
]