[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008fkh6AAA",
    "hero_image": "https://images.luxuryescapes.com/vxjtvi9jv95gzzloa",
    "image_two": "https://images.luxuryescapes.com/jjz7ex8g6lspvkc3f9",
    "image_three": "https://images.luxuryescapes.com/26aqbzuudp4oxzksble",
    "vendor_name": "Ultimate Winery Experiences",
    "title": "Margaret River: Private Full-Day Winery Tour for Two with Four-Course Lunch, Tastings & Transfers",
    "description": "Experience the best that the Margaret River wine-producing region has to offer with a private bespoke guided tour, where you'll travel beyond the cellar door with an immersive exploration of two of the region's highly-acclaimed wineries. Begin with a guided walk through Voyager Estate's vineyards, learning about organic farming methods and unique microclimate and maritime influence distinctive of the Voyager Estate style. From here, guests are invited to taste wine straight from the barrel and gain insight into the philosophy that drives the winemaking craft. Next up, you will be guided through a selection of celebrated Margaret River varietals at the Cellar Door. Move into Voyager’s restaurant, TripAdvisor’s top-rated venue for Margaret River, for a four-course lunch created by Head Chef Santiago Fernandez and his team, with each dish inspired by the wines and celebrating pristine local produce.\n\nContinue your exploration of earth and expression at Vasse Felix, the founding winery of the Margaret River Wine Region, with an insightful introduction to the vineyards and wine tasting. Immerse yourself in the unique history and folklore of Vasse Felix, then be enthralled by the finer details of organic viticulture and the land as you explore the region’s original vineyard, planted in 1967. You’ll uncover knowledge of the environmental elements that bring unique characters to the wines, which will reveal layers of sensory delight during your private tasting of the Vasse Felix Wine Collection,  accompanied by a small selection of gourmet bites.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Burnside",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Ultimate Winery Experiences Margaret River",
    "offer_address": "Margaret River",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 436.0,
    "value": 1.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Igh8IAC",
    "hero_image": "https://images.luxuryescapes.com/2prope4rqsux52mwdutt",
    "image_two": "https://images.luxuryescapes.com/tpoh612kovo4axf60bx",
    "image_three": "https://images.luxuryescapes.com/w66vvms0r9f2lv32re8",
    "vendor_name": "Cape Lodge",
    "title": "Tranquil Margaret River Lodge Luxury with Chef-Hatted Restaurant, Daily Breakfast & Nightly Drinks",
    "description": "Fine wine and gourmet gastronomy devotees will fall head over heels for this luxury lodge, a gorgeous rural sojourn in the world-famous Margaret River wine country. This five-star escape is steeped in romance, from the lush garden surroundings to the delicious wine cultivated and poured on-site.\n\nWake to a delicious breakfast, sip on warm tea, sample fine drops and indulge in exquisite dishes at award-winning Cape Lodge Restaurant. Lauded as one of Western Australia’s finest dining destinations, the spectacular site received a Chef’s Hat award in 2024.\n\nOffering intimacy in the sophisticated and private lodgings, the property also boasts the perfect locale for guests to explore the region’s world-renowned wineries, pristine beaches and majestic forests. Sitting on acres of parkland and native bushland, including a shimmering lake and tranquil outdoor pool, Cape Lodge is your gateway to the quintessential Margaret River experience, where modern opulence meets the authentic Australian countryside.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Cape Lodge",
    "offer_address": "3341 Caves Road, Yallingup, Margaret River, Western Australia 6282, Australia",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 579.0,
    "value": 948.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvCYtAAN",
    "hero_image": "https://images.luxuryescapes.com/v5to0atdd0d4gslfppq",
    "image_two": "https://images.luxuryescapes.com/z5tniqqw1j04v5hcbdxo",
    "image_three": "https://images.luxuryescapes.com/ht0aq73tkd8twpscvj",
    "vendor_name": "Margaret River Motel",
    "title": "Relaxing Margaret River Stay near Town Centre with Breakfast Hamper",
    "description": "Nestled in the heart of Western Australia's wine country, Margaret River Motel is your gateway to the region's best vineyards and breathtaking natural beauty. This relaxing motel offers easy access to the nearby beaches and national parks, plus is only a five-minute stroll into the town centre, where cosy cafes and local stores await. When not out tasting the wines of the region, enjoy a refreshing dip in the pool after a friendly round of tennis. For nature lovers, the motel is roughly a 50-minute drive from the stunning Leeuwin-Naturaliste National Park, offering an array of outdoor activities from hiking to bird watching.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Margaret River",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Margaret River Motel",
    "offer_address": "18 Farrelly Street, Margaret River, WA 6285, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 239.0,
    "value": 465.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxqLUQAZ",
    "hero_image": "https://images.luxuryescapes.com/kgmvi8fbgw3njk1johfj",
    "image_two": "https://images.luxuryescapes.com/qrpcihiynmqt4kgpox90",
    "image_three": "https://images.luxuryescapes.com/uh1wrw0nnhwzz1suuika",
    "vendor_name": "Yallingup Forest Resort",
    "title": "Eco-Friendly Chalet Escape in Margaret River",
    "description": "Escape to the Margaret River wine region and immerse yourself in nature at Yallingup Forest Resort. Spend three nights in an eco-friendly chalet surrounded by bushland, beaches, wineries, local wildlife, farmers markets and walking trails with a bottle of wine included.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "WA",
    "location_description": "Yallingup Forest Resort",
    "offer_address": "19/40 Hemsley Rd, Yallingup WA 6282",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 190.0,
    "value": 318.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eKhqgQAC",
    "hero_image": "https://images.luxuryescapes.com/7kled1hqruf5ehaalbz",
    "image_two": "https://images.luxuryescapes.com/g5dse5gu6ltl0shytov",
    "image_three": "https://images.luxuryescapes.com/f4j29onwseuuc96tf0jd",
    "vendor_name": "Regency Beach Club",
    "title": "Luxe Beachside Villa Escape in the Margaret River Wine Region",
    "description": "Discover the beauty and taste the fresh produce of the Margaret River wine region with a luxe villa stay in the striking town of Dunsborough, surrounded by quiet sandy coves, national parks and a plethora of cosy cafés, bakeries and restaurants.\n\nYour package includes two bottles of local wine and a handy cooler bag to keep, A$20 food and drinks credit per person to spend at a local café and a guaranteed 12pm late checkout.\n\nChoose between a one-bedroom villa for couples, a two-bedroom family villa or a four-bedroom group villa for up to 10 people.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Regency Beach Club Dunsborough",
    "offer_address": "77 Gifford Rd, Dunsborough WA 6281",
    "percentage_discount": 21.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 495.0,
    "value": 625.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000WJqMxQAL",
    "hero_image": "https://images.luxuryescapes.com/pq5q6fdayhp4c4yaks3j",
    "image_two": "https://images.luxuryescapes.com/tizbhkzdgx9chmwva5qg",
    "image_three": "https://images.luxuryescapes.com/xxrvlvkmmmmwxazxgofx",
    "vendor_name": "Regency Beach Club",
    "title": "Luxurious Beachfront Family or Group Escape in Margaret River",
    "description": "Discover the beauty and taste the fresh produce of the Margaret River region with a luxe self-contained villa stay in the striking town of Dunsborough - home to quiet sandy coves, surrounding national parks and a plethora of quaint cafes, bakeries and restaurants. Enjoy a three, four or five-night stay at the extra spacious, fit-for-groups villas at the Regency Beach Club Dunsborough and enjoy an in-villa food and wine hamper, AU$30 credit to use at the five-star Unjidup Spa and a guaranteed late midday checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "City of Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Regency Beach Club Dunsborough - 2018",
    "offer_address": "77 Gifford Rd, Dunsborough WA 6281",
    "percentage_discount": 40.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 567.0,
    "value": 946.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004umdLAAQ",
    "hero_image": "https://images.luxuryescapes.com/gtodik4w2hk3jokyq5jd",
    "image_two": "https://images.luxuryescapes.com/itb9k00b10xprileh9n",
    "image_three": "https://images.luxuryescapes.com/s4m4gldnppi1o6ly1654",
    "vendor_name": "Amalfi Resort Busselton",
    "title": "Coastal Self-Contained Villa Escape near Margaret River Wine Region",
    "description": "The sparkling azure waters and colourful coral of Geographe Bay await at Amalfi Resort Busselton - your gateway to Australia's Southwest and the Margaret River region. With a collection of self-contained villas just steps from the sea, this charming resort offers the ultimate laidback coastal escape. Take a dip in the heated outdoor pool and bubbling spa, perfect your serve at the onsite tennis court or take a leisurely stroll through the lavender- and rosemary-scented gardens.\n\nLocated just minutes from the stunning Geographe Bay beachfront, you’re able to explore the wonders of the rugged coastline with the resort’s complimentary bicycle and scooter hire. Visit the iconic Busselton Jetty & Underwater Observatory, discover hidden bays along the shore or simply dive in to cool off after a day of soaking up the rays. With plenty of waterside dining options, you’ll be spoilt for choice when it comes to dining: local seafood options range from classic fish 'n' chips on the sand to indulgent five-course meals and wine with sweeping Indian Ocean views. Day-trip options abound too, with the surf breaks, wineries and whalewatching of Margaret RIver right on your doorstep.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Amalfi Resort Busselton",
    "offer_address": "15 Earnshaw Road, Busselton, WA 6280, Australia",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 237.0,
    "value": 399.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LmGCAA0",
    "hero_image": "https://images.luxuryescapes.com/vb2k2dz7fxfjperayxti",
    "image_two": "https://images.luxuryescapes.com/hswhv2eokqw3omxip816",
    "image_three": "https://images.luxuryescapes.com/fuyx50kx5l72qdg2h7",
    "vendor_name": "Caves House Hotel Yallingup",
    "title": "Heritage-Listed Margaret River Escape with Daily Breakfast",
    "description": "Experience the history and charm of the magnificently restored Caves House Hotel, a heritage building in the heart of the Margaret River wine region, only a stone's throw from the famed Ngilgi Cave, Yallingup Beach and Canal Rocks. Surrounded by astounding natural beauty, this heritage hotel with over 100 years of history offers a charming escape in the quaint town of Yallingup. Stay in a One-Bedroom Apartment with daily buffet breakfast and a complimentary welcome drink included in every package.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Caves House Hotel",
    "offer_address": "18 Yallingup Beach Road, Yallingup 6282, Western Australia",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 209.0,
    "value": 449.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fd8oLAAR",
    "hero_image": "https://images.luxuryescapes.com/hjywp4n4t87c351wlym",
    "image_two": "https://images.luxuryescapes.com/nutlq6esfu53uhipbuf",
    "image_three": "https://images.luxuryescapes.com/0lmgvxso48t3pg32vrfo",
    "vendor_name": "Cape Lodge",
    "title": "Five-Star Tranquil Margaret River Lodge with Daily Breakfast, Nightly Drinks & Chef-Hatted Dinner Upgrade Available",
    "description": "Fine wine and gourmet gastronomy devotees will fall head over heels for Cape Lodge, a gorgeous rural sojourn in the midst of the world-famous Margaret River wine country. This five-star escape is steeped in romance, from the lush garden surroundings to the delicious wine cultivated and poured on-site. Wake to delicious breakfast, sip on warm tea, sample fine drops and indulge in exquisite dishes at the award-winning Cape Lodge Restaurant. Lauded as one of Western Australia’s finest dining destinations, the spectacular site received two Chef Hats in 2022 and was ranked in the top ten restaurants worldwide in the Conde Nast Traveller Gold List.\n\nOffering intimacy in the sophisticated and private lodgings, the property also boasts the perfect locale for guests to explore the region's world-renowned wineries, pristine beaches and majestic forests. Sitting on acres of pristine parkland and native bushland, including its shimmering lake, tranquil outdoor pool and expansive vineyard, Cape Lodge is your gateway to the quintessential Margaret River experience, where modern opulence meets the authentic Australian countryside.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Cape Lodge",
    "offer_address": "3341 Caves Road, Yallingup, Margaret River, Western Australia 6282, Australia",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 569.0,
    "value": 1029.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvaHkAAJ",
    "hero_image": "https://images.luxuryescapes.com/n8010e2hr81r3z8i5aom",
    "image_two": "https://images.luxuryescapes.com/7speank0sblh6x0wei19",
    "image_three": "https://images.luxuryescapes.com/p6514aj9oyd9d2z2hk9",
    "vendor_name": "Cape Lodge",
    "title": "Tranquil Margaret River Lodge Luxury with Chef-Hatted Restaurant, Daily Breakfast & Nightly Drinks",
    "description": "Fine wine and gourmet gastronomy devotees will fall head over heels for Cape Lodge, a gorgeous rural sojourn in the world-famous Margaret River wine country. This five-star escape is steeped in romance, from the lush garden surroundings to the delicious wine cultivated and poured on-site. Wake to delicious breakfast, sip on warm tea, sample fine drops and indulge in exquisite dishes at the award-winning Cape Lodge restaurant. Lauded as one of Western Australia’s finest dining destinations, the spectacular site received two Chef's Hats in 2023.\n\nOffering intimacy in the sophisticated and private lodgings, the property also boasts the perfect locale for guests to explore the region's world-renowned wineries, pristine beaches and majestic forests. Sitting on acres of parkland and native bushland, including a shimmering lake and tranquil outdoor pool, Cape Lodge is your gateway to the quintessential Margaret River experience, where modern opulence meets the authentic Australian countryside.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Cape Lodge",
    "offer_address": "3341 Caves Road, Yallingup, Margaret River, Western Australia 6282, Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 569.0,
    "value": 981.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cswB8QAI",
    "hero_image": "https://images.luxuryescapes.com/b1uztqn7hnvxf9904x26",
    "image_two": "https://images.luxuryescapes.com/py80kttvsbcrwss7ko8n",
    "image_three": "https://images.luxuryescapes.com/lb961ef6oaxo5abgwpd",
    "vendor_name": "Stay Margaret River",
    "title": "Discover one of Australia’s Premier Food & Wine Destinations",
    "description": "Known as one of the premium regions in Australia for award-winning wines and gourmet cuisine, the Margaret River Region attracts lovers of the finer things in life as well as those looking to explore the area’s world-renowned surf beaches, limestone caves and dramatic sea cliffs. Discover it all at Stay Margaret River - just 15 minutes’ walk from Margaret River Town - and enjoy daily breakfast, a glass of wine each, food credit to share, guaranteed late 12pm checkout and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Margaret River",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Stay Margaret River",
    "offer_address": "78 Wallcliffe Rd, Margaret River WA 6285",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 185.0,
    "value": 446.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oepRAAQ",
    "hero_image": "https://images.luxuryescapes.com/rm6aa1je6d50lh6vxzb",
    "image_two": "https://images.luxuryescapes.com/xq9bh93423hwna64l40f",
    "image_three": "https://images.luxuryescapes.com/ngmdmp52j9leornrhgi",
    "vendor_name": "Scenic Helicopters",
    "title": "Margaret River: Half-Day Private Helicopter Winery Tour with Degustation Lunch",
    "description": "Lift off and see one of Western Australia’s most acclaimed regions from above on this one-of-a-kind helicopter winery tour over Margaret River, featuring a degustation lunch and wine tastings (packages for two or three passengers available).\n\nPrepare to have your breath taken away as you ascend from Margaret River Airport and float across the rugged coastline to obtain a fantastic perspective, with the entire Cape becoming visible from above. Each journey will be different from the last, ensuring a truly bespoke experience. Along the way, you'll stop at three wineries, which may include Cape Grace Wines, Xanadu Wines, Voyager Estate and Leeuwin Estate (subject to availability and flight route). This exceptional experience will last approximately six hours. Insightful commentary during your flight is matched with the knowledge of on-ground wine experts and mouth-watering fare, making this a dream for passionate gourmands.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Bramley",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Scenic Helicopters",
    "offer_address": "Margaret River Airport, Bramley, WA 6285",
    "percentage_discount": 6.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 881.0,
    "value": 939.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I6giAAC",
    "hero_image": "https://images.luxuryescapes.com/3c4jkfr3vct3vw8z6s5e",
    "image_two": "https://images.luxuryescapes.com/q1cekuh2bq4k0t36ub",
    "image_three": "https://images.luxuryescapes.com/1390ohm78ee5rfqdsga",
    "vendor_name": "Amalfi Resort Busselton",
    "title": "Award-Winning Coastal Villa Escape near Margaret River Wine Region",
    "description": "The sparkling azure waters and colourful coral of Geographe Bay await at Amalfi Resort Busselton - your gateway to Australia's South West and the Margaret River region. With a collection of self-contained villas just steps from the sea, this charming resort offers the ultimate laidback coastal escape.\n\nIt’s no surprise the resort was a winner in the Tripadvisor Travellers’ Choice Awards 2021, thanks to its combination of self-catering convenience and resort-style facilities. Take a dip in the heated outdoor pool and bubbling spa, try out your serve at the onsite tennis court, take a stroll through the gardens scented with lavender and rosemary, or explore the local area with bicycle and scooter hire available.\n\n**Your handpicked inclusions:**\n\n- Celebrate your escape with a welcome bottle of wine on arrival\n- Dine alfresco with complimentary use of a portable BBQ included at your villa\n- Enjoy a complimentary daily game of tennis with court hire, balls and racquets\n- Make the most of your stay with guaranteed 11.30am late checkout\n\n**Travelling as a group or family?** Upgrade to the Two-Bedroom Villa package for up to four guests.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Amalfi Resort Busselton",
    "offer_address": "15 Earnshaw Road, Busselton, WA 6280, Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 223.0,
    "value": 387.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LkuPAAS",
    "hero_image": "https://images.luxuryescapes.com/enryrdls8a9h3mauzq4kr",
    "image_two": "https://images.luxuryescapes.com/y60hqu7vfsll2vruasxq",
    "image_three": "https://images.luxuryescapes.com/iqidqu8dx7i01yaa98xn",
    "vendor_name": "Olio Bello Lakeside Glamping",
    "title": "Margaret River Olive Farm Glamping Experience with Daily Breakfast Basket",
    "description": "Escape to Margaret River wine country to enjoy farm-fresh produce and gorgeous lake views, glamping in a safari-style bungalow at Olio Bello, a 320-acre olive oil estate and farm. Enjoy a daily breakfast basket of seasonal goodies delivered to your door, A$70 credit to be used at the onsite café and tasting room, a welcome gift of organic olive oil and homemade bread on arrival, plus a relaxing late checkout at 12pm.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Cowaramup",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Olio Bello",
    "offer_address": "Armstrong Rd, Cowaramup WA 6284",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 247.0,
    "value": 397.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pITeAAM",
    "hero_image": "https://images.luxuryescapes.com/1tef82quj998384cl4js",
    "image_two": "https://images.luxuryescapes.com/b9q3vzgk2kls9tx709g",
    "image_three": "https://images.luxuryescapes.com/lsvd6x5wldieizq9ldop",
    "vendor_name": "Karriview Margaret River",
    "title": "Tranquil Margaret River Chalet-Style Stay with Room Upgrade & Welcome Wine",
    "description": "Soak up Margaret River's impressive natural scenery and discover its craft breweries, renowned boutiques and surrounding wineries with a stay at the beautiful Karriview Margaret River, nestled in the delightful Leeuwin-Naturaliste National Park and within a short drive of the pristine beach at Cowaramup Bay (Gracetown). A private haven set in the heart of the Margaret River Wine Region, among 40 acres of natural bush and karri trees, Karriview Margaret River is a charming property that's ideal for leaving the hustle and bustle behind as you embrace the serenity of this picturesque part of the world.\n\nSpend days exploring the lush forests and nearby vineyards, tasting gourmet food or simply relaxing in your chalet-style accommodation. This wine and nature lover's retreat also features a golf driving range, restaurant (open weekends), tennis court, cricket ground and wine tour services (available for a surcharge).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Gracetown",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Karriview Margaret River",
    "offer_address": "40 Forest Rd, Gracetown WA 6284, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 148.0,
    "value": 353.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Hf6sIAC",
    "hero_image": "https://images.luxuryescapes.com/g1nziyepelwnrvz83ca9",
    "image_two": "https://images.luxuryescapes.com/d07tqmqjviwhc0k6kgx",
    "image_three": "https://images.luxuryescapes.com/a44nmx2tsvtm0sfftb64",
    "vendor_name": "Caves House Hotel Yallingup",
    "title": "Heritage-Listed Margaret River Escape with Daily Breakfast & Welcome Drinks",
    "description": "Experience the charm of the Margaret River wine region with a stay in this beautifully-restored heritage building, just a stone's throw from the famed Ngilgi Cave, Yallingup Beach and Canal Rocks. Surrounded by sparkling sandy beaches and dramatic caves and cliffsides, this historic hotel offers an alluring retreat in the quaint town of Yallingup.\n\nWith over 100 years of history as the local watering hole, Caves House Hotel is known for its vibrant music scene, offering regular events and live music shows that draw in both locals and tourists. Soak up the sun and take in the lively atmosphere at the Beer Garden, and indulge in pub-style dining with a seasonal twist before venturing out to explore the local hidden gems.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Caves House Hotel",
    "offer_address": "18 Yallingup Beach Road, Yallingup 6282, Western Australia",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 243.0,
    "value": 462.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JtwnAAC",
    "hero_image": "https://images.luxuryescapes.com/k2x4mzhj1fae5dhc24i",
    "image_two": "https://images.luxuryescapes.com/t0otgdovmvhfpu4iya8",
    "image_three": "https://images.luxuryescapes.com/8itw82laveuz94ldga3j",
    "vendor_name": "Margarets Beach Resort",
    "title": "Self-Contained Margaret River Apartment Stay just 500 Metres from the Beach",
    "description": "Enjoy a serene beachside escape at Margaret River’s closest seaside accommodation, Margarets Beach Resort. Stay in breezy, self-contained apartments positioned only 500 metres from the golden shores of Gnarabup Beach. With the beach practically at your doorstep and so many award-winning wineries and restaurants within close proximity, there's next to no need to venture far. Vasse Felix, this prolific wine region's founding vineyard, is just a 20-minute drive away; to descend into Ngilgi Caves, drive for just double that, or for the Cape to Cape Walk Track, it's just a five-minute drive. For a great happy hour and traditional pub fare, you need only walk to the onsite The Common Bistro, where you can enjoy regular live music performances with a side of ocean views.\n\nAfter a day of exploration, return to the comfort of your self-contained apartment, featuring a full kitchenette with laundry facilities, or wind down with a sunset dip in the ocean or the resort's heated pool. This is the perfect base for beach bums, nature lovers, wine connoisseurs and foodies.\n\n**Your handpicked inclusions:**\n\n- Toast your escape with a welcome bottle of Margaret River wine on arrival\n\n**Travelling with family?** Upgrade to a Two-Bedroom Apartment for up to two adults and two children (17 and under)\n\n**Gourmet Wine & Dine Upgrade:** Upgrade your stay in a Studio Apartment with a gourmet tour through the iconic Margaret River wine region, including roundtrip transfers from your accommodation. First, coffee at Yahava Koffeeworks, before tastings at Vasse Virgin and McHenry Hohnen Vintners. Savour a two-course lunch experience with wine at Flutes Restaurant in Brookland Valley Vineyard, followed by cheese, chocolate and gourmet food tastings to round out the day.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Gnarabup",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Margarets Beach Resort",
    "offer_address": "1 Resort Place Gnarabup Beach Western Australia 6285 Australia",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 185.0,
    "value": 262.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LuVqAAK",
    "hero_image": "https://images.luxuryescapes.com/4991p9rrkhzz3gooig",
    "image_two": "https://images.luxuryescapes.com/r7mh0j1jzrve2v55ep2d",
    "image_three": "https://images.luxuryescapes.com/8de2irl86cq593hp2op",
    "vendor_name": "Stay Margaret River",
    "title": "Margaret River Wine Region Escape with Daily Breakfast",
    "description": "Known as one of Australia's premium regions for award-winning wines and gourmet cuisine, Margaret River attracts lovers of the finer things in life as well as those looking to explore the area’s world-renowned surf beaches, limestone caves and dramatic sea cliffs. \n\nDiscover it all at Stay Margaret River - just a 15-minute walk from Margaret River Town - and enjoy daily breakfast, a glass of wine each and guaranteed 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Margaret River",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Stay Margaret River",
    "offer_address": "78 Wallcliffe Rd, Margaret River WA 6285",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 142.0,
    "value": 355.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000QuMTsQAN",
    "hero_image": "https://images.luxuryescapes.com/di35ldmm6xc3i9sxjtfx",
    "image_two": "https://images.luxuryescapes.com/ygp8xknrsxuubzpktywn",
    "image_three": "https://images.luxuryescapes.com/g6q8saoahkukiqzeus0n",
    "vendor_name": "Olio Bello Lakeside Glamping",
    "title": "Glamping in an Award-Winning Olive Farm in Margaret River",
    "description": "Escape to Margaret River wine country to enjoy farm-fresh produce and gorgeous views, glamping in a lakeside, safari-style bungalow at Olio Bello, a 320-acre olive oil estate and farm. Your escape includes a daily breakfast basket delivered to your bungalow, a AU$65 credit to use at the on-site Olio Bello Café or olive oil tasting room, a welcome gift of homemade bread and the estate’s organic olive oil, and guaranteed late check out until 12pm.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Shire of Augusta-Margaret River",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Olio Bello - 2018",
    "offer_address": "Armstrong Rd, Cowaramup WA 6284",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 4,
    "price": 245.0,
    "value": 414.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aiHQFQA2",
    "hero_image": "https://images.luxuryescapes.com/x0hmgiwheewi4dbmn4vn",
    "image_two": "https://images.luxuryescapes.com/qhr6iqshauosq9ptbygj",
    "image_three": "https://images.luxuryescapes.com/kn4nt8gscfjzq37nb6zl",
    "vendor_name": "Olio Bello Lakeside Glamping",
    "title": "Glamping at an Award-Winning Olive Farm in Margaret River",
    "description": "Escape to Margaret River wine country to enjoy farm-fresh produce and gorgeous lake views, glamping in a safari-style bungalow at Olio Bello, a 320-acre olive oil estate and farm. Enjoy daily breakfast basket of seasonal goodies delivered to your door, as well as a welcome gift of organic olive oil and homemade bread on arrival. Stay fed and full with an AU$70 credit to be used at the on-site café and tasting room before sleeping in for longer with a late check out at 12pm.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Cowaramup",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Olio Bello",
    "offer_address": "Armstrong Rd, Cowaramup WA 6284",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 250.0,
    "value": 410.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlLpAAK",
    "hero_image": "https://images.luxuryescapes.com/lvadly46frclm0fovv4r",
    "image_two": "https://images.luxuryescapes.com/yvybaz1iisop5c228b",
    "image_three": "https://images.luxuryescapes.com/8cuxnwpixuzxtnysr8w",
    "vendor_name": "Pullman Bunker Bay Resort, Margaret River Region",
    "title": "Margaret River Pullman Retreat with Direct Beach Access & Daily Breakfast",
    "description": "Experience the gourmet food and wine, coastal scenery and beachfront views of Western Australia’s famous Margaret River region staying at Pullman Bunker Bay Resort. Relax on the beach, explore stunning limestone cliffs, visit wineries or even try seasonal whale spotting during your escape to this amazing part of Australia. Your package includes daily buffet breakfast, an evening drink per person and a bottle of Margaret River wine.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "City of Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Pullman Bunker Bay Resort June 2020",
    "offer_address": "42 Bunker Bay Rd, Naturaliste WA 6281",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 311.0,
    "value": 835.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GbYPAA0",
    "hero_image": "https://images.luxuryescapes.com/s99lmyywf4tzpnz7gkih",
    "image_two": "https://images.luxuryescapes.com/1gnikt3u3b8soz7jsny",
    "image_three": "https://images.luxuryescapes.com/qk6eeotwgb12ynd3q3o",
    "vendor_name": "Karriview Margaret River",
    "title": "Tranquil Margaret River Chalet-Style Stay with Room Upgrade & Welcome Wine",
    "description": "**New dates added, hurry don't miss out**\n\nNestled near the gorgeous vineyards of Margaret River, in the delightful Leeuwin-Naturaliste National Park and within a short drive of the pristine beach at Cowaramup Bay (Gracetown), Karriview Margaret River offers the very best of world-class vino and breathtaking nature.\n\nGarlanded by lush karri forest, yet just a stone's throw from the ocean, this rustic lodge promises total seclusion and privacy amid nature. There's something for everyone here: chalet-style accommodation, a golf driving range, cosy restaurant, tennis court, cricket ground and, of course, amazing views. When you feel like indulging, Margaret River's renowned cellar doors are just a short drive away, with wine tours readily available (charges apply).\n\n**Your handpicked inclusions:**\n\n- Enjoy an upgrade from a Superior King Lodge Room to a spacious Semi-Detached Chalet\n- Get a taste for Margaret River with a complimentary bottle of local red or white wine on arrival\n\n**Private Balcony Upgrade**: Choose to upgrade and you'll enjoy the privacy of your very own balcony - perfect for a cup of coffee in the morning or glass of local wine in the evening.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Gracetown",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Karriview Margaret River",
    "offer_address": "40 Forest Rd, Gracetown WA 6284, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 153.0,
    "value": 362.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Uy1vAAC",
    "hero_image": "https://images.luxuryescapes.com/muivq4v6gsllehhqes28",
    "image_two": "https://images.luxuryescapes.com/nk9tiwfpb5lk4awq9aj",
    "image_three": "https://images.luxuryescapes.com/1ryqdxppb4tcejf47sj7",
    "vendor_name": "Seashells Yallingup",
    "title": "Tranquil Beachside Studio Stay in the Heart of Margaret River",
    "description": "Surrounded by Leeuwin-Naturaliste National Park and Margaret River’s renowned vineyards and chef-hatted restaurants, Seashells Yallingup beckons. Set within the beautiful gardens of the heritage-listed Caves House Hotel, with Yallingup Beach just a 10-minute stroll through breathtaking gardens, this self-contained escape promises a lush southwest escape.\n\nBeyond the comforts of your studio or self-contained apartment, complete with kitchenette and laundry facilities, the charms of this renowned region await. Descend into crystal-studded caves at Ngilgi Cave, just a short bushwalk from Seashells Yallingup, while away a day at Yallingup Cheese Company or enjoy a soak at Injidup Natural Spa. Balance all of this exploration with a well-deserved drop at the likes of Margaret River’s Leeuwin Estate or Voyager Estate, or simply enjoy the local cuisine on offer in Caves House Hotel’s intimate dining room.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Seashells Yallingup",
    "offer_address": "1 Yallingup Beach Rd, Yallingup WA 6282",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 117.0,
    "value": 117.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IbsKfAAJ",
    "hero_image": "https://images.luxuryescapes.com/683v3y0e8n7uju4wxin",
    "image_two": "https://images.luxuryescapes.com/3wp0aaalrqm2jqi5e4g",
    "image_three": "https://images.luxuryescapes.com/s8a1ven5iayxg50i7ngb",
    "vendor_name": "Pullman Bunker Bay Resort, Margaret River Region",
    "title": "Margaret River Region Pullman Luxury Villas with Direct Beach Access",
    "description": "Experience five-star luxury in Western Australia's Margaret River region - and find yourself perched alongside the pristine sands of the near-private Bunker Bay, with direct beach access. Set among 35 acres of breathtaking native landscapes, indulge in an evening of culinary delight at the Other Side of the Moon Restaurant and Bar, where local and Indigenous flavours perfectly pair with the region's applauded wines. Float away in the heated infinity-edge swimming pool, try your hand at a game of tennis, relax at the world-class day spa or follow salt-licked walking trails along Cape Naturaliste's majestic coastline.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Busselton",
    "location_heading": "Margaret River",
    "location_subheading": "Western Australia",
    "location_description": "Pullman Bunker Bay Resort Margaret River Region",
    "offer_address": "42 Bunker Bay Road, Naturaliste, Western Australia 6281, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 189.0,
    "value": 189.0
  }
]