[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Sen8AAC",
    "hero_image": "https://images.luxuryescapes.com/aynstlen84lgwyuagib",
    "image_two": "https://images.luxuryescapes.com/p1ogutaobvsz264vl8i5",
    "image_three": "https://images.luxuryescapes.com/982r8rrg29r59pzubdcd",
    "vendor_name": "Cloudy Bay Vineyards",
    "title": "Ultra-Exclusive Cloudy Bay Winery Experience with Wine Tasting & Three-Course Private Chef Dinner",
    "description": "For a truly exclusive experience amid the vines, only a stay at one of New Zealand's most celebrated wineries will do. The highly exclusive and luxurious 'The Shack' at Cloudy Bay Vineyard effortlessly fuses world-class food, award-winning wine and architect-designed, self-contained accommodation.\n\nNormally available by invite only, this once-in-a-lifetime stay is the ultimate wine and unwind destination for a romantic sojourn or unforgettable group escape, comfortably sleeping up to eight guests across four rooms in a guesthouse that wouldn't look out of place on Grand Designs - complete with a suspended fireplace with views of Richmond Range. For a gastronomic affair to remember, enjoy a private one-of-a-kind vineyard tour and wine tasting, whip up your own creations in The Shack's state-of-the-art kitchen - where you'll enjoy access to a private wine fridge - and savour an intimate three-course epicurean dining experience with your very own private chef.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Marlborough",
    "offer_geo_area_level_2": "Rapaura",
    "location_heading": "Marlborough",
    "location_subheading": "New Zealand",
    "location_description": "Cloudy Bay 'The Shack'",
    "offer_address": "230 Jacksons Rd, Blenheim 7273, New Zealand",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 3099.0,
    "value": 4709.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zJORAA2",
    "hero_image": "https://images.luxuryescapes.com/lz6rxfohvhjys8f0vejm",
    "image_two": "https://images.luxuryescapes.com/mz045eza9majqaffpttb",
    "image_three": "https://images.luxuryescapes.com/s6kzjhcl2ks6ixzqlpgm",
    "vendor_name": "Cloudy Bay Vineyards",
    "title": "Exclusive Cloudy Bay Winery Stay with Private Chef Dining Experience",
    "description": "Experience unparalleled luxury and exclusivity amid the vines at Cloudy Bay - one of New Zealand’s most celebrated wineries - with a stay at 'The Shack', a highly exclusive and luxurious self-contained guesthouse, usually available by invite only. Treat yourself to an architecturally-designed, award-winning experience in a sought-after location on one of Marlborough's first wineries, where you'll enjoy a stay for up to eight guests with views of the breathtaking Richmond Range and Cloudy Bay vines.\n\nStay in the lap of luxury with daily breakfast provisions and a fully-equipped kitchen stocked with local gourmet products, local beer and a full selection of Cloudy Bay wines. This exclusive stay also includes a one-of-a-kind private Cloudy Bay vineyard tour with wine tasting, and an intimate three-course epicurean dining experience with your very own private chef and matched wines, taken for your choice of lunch or dinner.\n\n**Travelling as a couple, with family or friends?** Simply select the package required according to the number of guests travelling, and you'll enjoy exclusive use of the house with access to one, two, three or four bedrooms accordingly.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Marlborough",
    "offer_geo_area_level_2": "Rapaura",
    "location_heading": "Marlborough",
    "location_subheading": "New Zealand",
    "location_description": "Cloudy Bay 'The Shack'",
    "offer_address": "230 Jacksons Rd, Blenheim 7273, New Zealand",
    "percentage_discount": 31.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 2999.0,
    "value": 4329.0
  }
]