[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib03lYAB",
    "hero_image": "https://images.luxuryescapes.com/86lqgc6lsw2rbudxnmg",
    "image_two": "https://images.luxuryescapes.com/lqkldihxkn6mz0pygqgk",
    "image_three": "https://images.luxuryescapes.com/devjw1rw4hzdvlu2vpk",
    "vendor_name": "Mercure Makkah Aziziah",
    "title": "Saudi Arabia: Serene Mecca Retreat Near Great Mosque with Onsite Restaurant",
    "description": "This welcoming retreat is your sanctuary in the holy city, located moments away from Al Masjid Al Haram. Mercure Makkah Aziziah offers stylish rooms with modern amenities and city views. After a day of spiritual reflection, return to your haven where attentive service meets thoughtful design.\n\nRecharge your spirit and body at the onsite Al Safa Restaurant and savour delicious international and traditional Saudi dishes in a warm, inviting atmosphere. Need to maintain your wellness routine? The state-of-the-art fitness centre has all the equipment you need for an energising workout.",
    "offer_country_name": "Saudi Arabia",
    "offer_country_code_alpha_2": "SA",
    "offer_geo_area_level_1": "Makkah Province",
    "offer_geo_area_level_2": "Mecca",
    "location_heading": "Mecca",
    "location_subheading": "Saudi Arabia",
    "location_description": "Mercure Makkah Aziziah",
    "offer_address": "6541 Kulliyyat Al Banat, Al Jamiah, Mecca 24243, Saudi Arabia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 26.0,
    "value": 26.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib17xYAB",
    "hero_image": "https://images.luxuryescapes.com/ytlcwjut4qegkvzn0v8",
    "image_two": "https://images.luxuryescapes.com/qu1dn6wmpy4cvhjqmcs",
    "image_three": "https://images.luxuryescapes.com/71qg2mfznmglsh90ppc",
    "vendor_name": "Pullman Zamzam Makkah",
    "title": "Elegant Makkah Retreat near Masjid al-Haram and The Kaaba with Onsite Dining & Spa",
    "description": "Embrace the spiritual heart of Saudi Arabia at this luxurious hotel, ideally located in the vibrant centre of Makkah, just steps from the sacred Kaaba within Masjid Al Haram. Enjoy refined dining at Al Zahra Restaurant, serving international, Arabian and Asian cuisine. For a more relaxed atmosphere, the Tea Lounge offers healthy meals, Arabic treats and French pastries - perfect for unwinding. Explore hundreds of shops in the Clock Tower complex or relax at Enaya Elite Spa, offering indulgent beauty and wellness treatments.\n\nBeyond the hotel, discover bustling local markets filled with traditional crafts and aromatic spices, or visit the historic sites of Mina, Muzdalifah and Mount Arafat - key landmarks for the Hajj pilgrimage.",
    "offer_country_name": "Saudi Arabia",
    "offer_country_code_alpha_2": "SA",
    "offer_geo_area_level_1": "Makkah Province",
    "offer_geo_area_level_2": "Mecca",
    "location_heading": "Mecca",
    "location_subheading": "Saudi Arabia",
    "location_description": "Pullman ZamZam Makkah",
    "offer_address": "Abraj Al Bait Complex, King Abdel Aziz Endowment, Mecca 21955, Saudi Arabia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 140.0,
    "value": 140.0
  }
]