[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Jf6g1YAB",
    "hero_image": "https://images.luxuryescapes.com/b4pv70ucvo7i5fz6gx35",
    "image_two": "https://images.luxuryescapes.com/fivwwvloeqpjng32m6zs",
    "image_three": "https://images.luxuryescapes.com/hndkweg3zl8tiu926cj",
    "vendor_name": "Villa Le Blanc Gran Melia",
    "title": "Balearic Islands Opulence: Menorca Beachfront Hideaway with Daily Breakfast & Nightly EUR$50 Credit",
    "description": "Escape to the island of Menorca in the sparkling Mediterranean Sea, where a luxuriously whitewashed, light-flooded and seafront haven awaits. Let relaxation take the lead, whether you're unwinding in your private retreat, lounging on a poolside cabana on the rooftop or swimming in the crystal-clear waters below.\n\nDining here is a gastronomic journey - indulge in Menorcan cuisine and fresh seafood at S'Amarador as the sun melts into the horizon, sample expertly paired wine and cheese at Sao and start your day with breakfast and ocean views at the laid-back Nivi.\n\nMenorca’s first carbon-neutral luxury hotel, this exclusive retreat offers facilities steeped in thoughtful luxury - from direct beach access to the Thai Room Spa & Wellness, where massages and treatments overlook the Mediterranean.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Es Migjorn Gran",
    "location_heading": "Menorca",
    "location_subheading": "Spain",
    "location_description": "Villa Le Blanc Gran Melia",
    "offer_address": "Urbanització Santo Tomàs, 07749 Santo Tomas, Balearic Islands, Spain",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 929.0,
    "value": 1659.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GqSzAAK",
    "hero_image": "https://images.luxuryescapes.com/0sbdgrwg7bjrtjgtoxru",
    "image_two": "https://images.luxuryescapes.com/wud4lxml57h8k6pzhqf",
    "image_three": "https://images.luxuryescapes.com/eaxu5hkpjn1zhwbf3xj",
    "vendor_name": "Menorca Experimental",
    "title": "Boutique Beachside Menorca Retreat Hidden in 19th-Century Finca",
    "description": "Discover your inner artist with a stay at the peachy pink Menorca Experimental, a 19th-century finca turned boutique beachside resort, designed in the style of a secluded artist's retreat. Sitting on 40 acres of biodiverse Spanish land at the southern end of Menorca, this exclusive resort is a coastal oasis surrounded by untouched coves, whitewashed cottages and flourishing pine shrubs. It’s just a five-minute scramble to the nearest pebbly cove, while the sands of the island’s longest beach, Son Bou, require a 10-minute trip in the car.\n\nMenorca Experimental balances solitude and conviviality, with plenty of private corners and expansive shared spaces offering breathtaking views of the surrounding landscapes. Designer Dorothée Meilichzon led the hotel’s transformation, retaining the finca’s original details while adding modern Art Deco-inspired influences, including a party of terracotta, rattan and waxed concrete textures. Perch on a peach lounge by the infinity pool, staying hydrated thanks to the nearby bar, or book into one of the multiple activities on offer - think yoga, pottery, horse riding or drawing classes. However you spend your days, you’ll want to end them at the hotel restaurant, where the emphasis is on seasonal produce from the sea and land - including the hotel’s vegetable garden. Wash everything down with a cocktail crafted by the expert team, like the pomade, a mix of Mahon-distilled gin and lemonade.",
    "offer_country_name": "Spain",
    "offer_country_code_alpha_2": "ES",
    "offer_geo_area_level_1": "Balearic Islands",
    "offer_geo_area_level_2": "Alayor",
    "location_heading": "Menorca",
    "location_subheading": "Spain",
    "location_description": "Menorca Experimental",
    "offer_address": "Batería Militar de Llucalari, Camí de Llucalari, 07730 Alaior, Illes Balears, Spain",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 220.0,
    "value": 220.0
  }
]