[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxpQHQAZ",
    "hero_image": "https://images.luxuryescapes.com/d2gnvly9aoe9u2rd1ah9",
    "image_two": "https://images.luxuryescapes.com/kob9yy67blyqghqynohm",
    "image_three": "https://images.luxuryescapes.com/sldfwbuvcwxratjfbxng",
    "vendor_name": "Grand Forest Metsovo",
    "title": "Five-Star Boutique Glamour in the Greek Mountains",
    "description": "Discover one of Greece’s best-kept secrets as you experience the fresh mountain air, breathtaking panoramic views, gourmet gastronomy and serene tranquillity among the Pindus Mountains at the five-star, all-suite Grand Forest Metsovo - part of the prestigious Small Luxury Hotels of the World group. Includes daily breakfast, nightly three-course dinners, spa discounts, welcome drinks and more.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Epirus",
    "offer_geo_area_level_2": "Metsovo",
    "location_heading": "Metsovo",
    "location_subheading": "Greece",
    "location_description": "Grand Forest Metsovo",
    "offer_address": "Egnatia Motorway, Intersection - 7A to Anilio Metsovo 44200, Epirus, Greece",
    "percentage_discount": 67.0,
    "min_duration": 4,
    "max_duration": 8,
    "price": 446.0,
    "value": 1366.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GIvyAAG",
    "hero_image": "https://images.luxuryescapes.com/3ey7lro0f3vb6yh4woa",
    "image_two": "https://images.luxuryescapes.com/92lnuwa8finzrm3sbv9",
    "image_three": "https://images.luxuryescapes.com/zt0yw5mt581wjzyfifgq",
    "vendor_name": "Grand Forest Metsovo",
    "title": "Secluded Five-Star Greece Mountaintop Suites with Daily Breakfast & Spa Access",
    "description": "Find the true meaning of tranquility in the mountains of northern Greece with a stay at Grand Forest Metsovo. Lying on the slopes of the Pindus mountain range, the secluded retreat seduces with breathtaking panoramas of the surrounding landscapes, the sounds of birdsong and the smells of fresh pine. The stone-paved streets of Metsovo Town are just 15 minutes away by car, while some of Europe’s best hiking trails are found within the Grand Forest.\n\nSuites are designed to take full advantage of the location, with floor-to-ceiling windows and private terraces or balconies as standard. Savour local delicacies with a side of panoramic views at Metsovo 1350m, the hotel’s signature restaurant, or drop into the outdoor infinity pool for a breathtaking look at the surrounding scenery. Experience a new level of calm at Fountus Spa, where ritual massage and facial treatments are based on the aromas and herbs of the Greek islands, or float away for a few hours in the indoor pool or hammam. Outside of the hotel grounds, there’s plenty to explore - just ask the hotel’s Personal Advisors. From horseback riding to historic caves, skiing to stand-up paddleboarding, there’s an activity for every season.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "Epirus",
    "offer_geo_area_level_2": "Metsovo",
    "location_heading": "Metsovo",
    "location_subheading": "Greece",
    "location_description": "Grand Forest Metsovo",
    "offer_address": "Egnatia Motorway, Intersection - 7A to Anilio Metsovo 44200, Epirus, Greece",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  }
]