[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007oskxAAA",
    "hero_image": "https://images.luxuryescapes.com/xbtv4e2zah34b7b0efn",
    "image_two": "https://images.luxuryescapes.com/xzvbgon9bqnaibpzy1",
    "image_three": "https://images.luxuryescapes.com/gsy881jnq95f9wjfhkeq",
    "vendor_name": "Quinta Real Monterrey",
    "title": "Colonial-Style Mexico Suites in the Heart of Monterrey with Onsite Restaurant & Spa",
    "description": "Nestled in the urban haven of San Pedro Garza Garcia, moments from Monterrey’s historic centre, you’ll find the opulent Quinta Real Monterrey, a five-star hotel that flawlessly blends colonial-style architecture with modern facilities to create a charming Mexican retreat. A bustling city nestled amid stunning mountain ranges, Monterrey offers a variety of outdoor adventures alongside must-visit museums, sprawling shopping malls and mouthwatering eateries. The hotel’s central location puts you in easy reach of all the action, a short walk to some of Monterrey’s best sites, including Fundidora Park, the Metropolitan Museum of Monterrey and the Mexican History Museum.\n\nAfter busy days exploring, retreat to your tranquil oasis and make the most of the onsite amenities, including a fitness centre and a glistening indoor pool that shimmers below a beaming skylight. Head to Los Balcones restaurant, where you’ll have your choice of Mexican and international cuisine in a sophisticated setting sure to satisfy any palate or visit the onsite spa and take relaxation to the next level with a rejuvenating treatment.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Nuevo Leon",
    "offer_geo_area_level_2": "San Pedro Garza Garcia",
    "location_heading": "Monterrey",
    "location_subheading": "Mexico",
    "location_description": "Quinta Real Monterrey",
    "offer_address": "Av. Diego Rivera No. 500, Col. Fracc. Valle Oriente, 66260 San Pedro Garza García, Monterrey, Neuvo León, Mexico",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BzatAAC",
    "hero_image": "https://images.luxuryescapes.com/m5wwrz2rb7qogo6g142",
    "image_two": "https://images.luxuryescapes.com/yq4bk3hmof6aa39p535p",
    "image_three": "https://images.luxuryescapes.com/fae5llb4f9t6xvdgut2o",
    "vendor_name": "CAMINO REAL FASHION DRIVE MONTERREY",
    "title": "Stylish Mexico Escape with Rooftop Pool & Direct Access to Monterrey's Fashion Drive Mall",
    "description": "Make your way to Nuevo León and experience a stay at Camino Real Fashion Drive Monterrey. This bustling city nestled amid stunning mountain ranges offers a variety of outdoor adventures alongside must-visit museums, sprawling shopping malls and mouthwatering eateries. This perfectly located hotel puts you within easy reach of all the action, with some of Monterrey’s must-see spots, including Fundidora Park, the Metropolitan Museum of Monterrey and the Mexican History Museum, all within easy reach. Shopping enthusiasts can enjoy direct access to the glamourous Fashion Drive Mall Shopping Centre before retreating to the hotel where modern facilities await. Drop into the fitness centre, laze alongside the shimming rooftop pool, or head to Distrito Regio restaurant, where you’ll sample authentic Mexican cuisine in a sophisticated setting or visit the onsite Blue Bar for a well-deserved cocktail.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Nuevo Leon",
    "offer_geo_area_level_2": "San Pedro Garza Garcia",
    "location_heading": "Monterrey",
    "location_subheading": "Mexico",
    "location_description": "Camino Real Fashion Drive Monterrey",
    "offer_address": "Av Lázaro Cárdenas 1002, Valle Oriente, 66260 San Pedro Garza García, N.L., Mexico",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]