[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FkS46AAF",
    "hero_image": "https://images.luxuryescapes.com/7qcs44peflm9l8kv8er",
    "image_two": "https://images.luxuryescapes.com/jbm50z77eeh0zth65e8",
    "image_three": "https://images.luxuryescapes.com/kigptixt0nu44zyjgwa",
    "vendor_name": "The Oaks Ranch",
    "title": "Grand Reopening: NSW South Coast Boutique Escape with A$50 Dining Credit, Daily Breakfast & Daily Round of Golf",
    "description": "Tucked beneath the towering Deua mountain range and surrounded by swaying gum trees, the Palm Springs-inspired The Oaks Ranch sits pretty on 300 acres of manicured gardens on the South Coast of New South Wales. Following a major renovation, the hotel's design takes cues from Palm Springs' Spanish-style architecture. Picture exposed beams, breezy balconies, private terraces adorned with potted cacti and a dreamy magnesium pool, where you can drink sunset cocktails. Swing into action at the resort's nine-hole golf course (with a daily round plus complimentary golf cart hire included) and refuel at ARLO restaurant, which showcases the best local produce and signature dishes brimming with flavours straight from the Pacific Ocean.\n\nExplore your natural surroundings on one of many walking and hiking trails, kayak the Tomaga River or perch by the pool with a cocktail. If you can tear yourself away from this dreamy retreat, take a day to explore Moruya and Batemans Bay, where local markets, boutique shopping and gourmet delights beckon.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Jeremadra",
    "location_heading": "Mossy Point",
    "location_subheading": "New South Wales",
    "location_description": "The Oaks Ranch",
    "offer_address": "340 Old Mossy Point Rd, Mossy Point NSW 2536, Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 294.0,
    "value": 526.0
  }
]