[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BfusyAAB",
    "hero_image": "https://images.luxuryescapes.com/gs98d8bin5wfupveb7l",
    "image_two": "https://images.luxuryescapes.com/lh72b4y09kfrohsczpv",
    "image_three": "https://images.luxuryescapes.com/1ba4iyb7dxwmpbv1jmg",
    "vendor_name": "Grand View Villa at Mount Martha",
    "title": "Mount Martha Beach House for up to Eight Guests on the Mornington Peninsula",
    "description": "Situated on the charming Mornington Peninsula, Grand View Villa at Mount Martha offers spectacular Port Phillip Bay views from this multi-level house with enough room for up to nine guests. A spacious sanctuary featuring four beautifully decorated bedrooms, a fully equipped kitchen, living and dining spaces and a covered deck with uninterrupted vistas, this recently renovated house is the perfect getaway for families and groups. Take a walk through the gated gardens, laugh late into the evening in the games room or relax undisturbed and enjoy the striking bay views.\n\nWhile the location promises a tranquil stay, the best of the region is still at your fingertips. Breathe in the fresh sea air on your doorstep and cool off with a day on the beach, just a three-minute drive away. Within a 30-minute drive, you’ll also be able to pamper yourself at Victoria's first natural thermal mineral springs and day spa or escape to the hinterland for award-winning wineries and innovative local cuisine at fantastic eateries and local markets.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Mount Martha",
    "location_subheading": "Victoria",
    "location_description": "Grand View Villa at Mount Martha",
    "offer_address": "15 Bradford Road, Mount Martha, Victoria 3934",
    "percentage_discount": 13.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 1115.0,
    "value": 1280.0
  }
]