[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CZBFAA4",
    "hero_image": "https://images.luxuryescapes.com/fso7km484gnhh5kcfh1",
    "image_two": "https://images.luxuryescapes.com/tjz6g0ayyl9yq7r7grh8",
    "image_three": "https://images.luxuryescapes.com/z953oqgbcf58hlqzb9p",
    "vendor_name": "Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection",
    "title": "Five-Star Mount Cook Villa Retreat with Nightly Three-Course Dinner & Lake Pukaki Stargazing",
    "description": "Sitting pretty on the waters of Lake Pukaki - underneath the otherworldly Aoraki Mackenzie International Dark Sky Reserve and surrounded by the majestic Ben Ohau Range - Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection takes you away from it all. Remote, unspoilt and wildly beautiful, the lack of light pollution makes this one of the best spots in the world for stargazing.\n\nOffering one of the most arresting views over Aoraki Mt Cook in all of New Zealand, this serene five-star retreat is designed for serious unwinding. Just three self-contained private villas are scattered across the alpine estate, allowing for a maximum of 12 guests at any one time. Get cosy in a luxury villa with an open fireplace, melt away under the stars in your private lakeside hot tub and let the dedicated onsite chef wine and dine you. Discover unparalleled landscapes at your doorstep - lavender fields are within strolling distance, Tasman Glacier and Lake Tekapo are a 30-minute jaunt away, and you can reach Queenstown in less than three hours.\n\n**Your handpicked inclusions:**\n\n- Craft gourmet breakfasts with daily provisions delivered to your villa\n- Savour nightly three-course dinner, served in your villa or the main lodge\n- Look to the skies in awe with a stargazing experience for two\n- Get hands-on with a one-time private cooking demonstration for two\n- Embark on a delicious culinary adventure with a gourmet picnic for two\n- Arrive to a welcome bottle of local wine in your villa\n- Complimentary use of onsite facilities, including mountain bikes, a tennis court and croquet\n- Start your escape sooner with 1pm early check-in (subject to availability)\n\n**Ultimate Mt Cook villa upgrade available:** Enjoy total seclusion in the cliffside Ashley Mackenzie Villa, complete with Aoraki Mount Cook views, exclusive access to the private Japanese-style Fantail Spa (comprising a sauna, massage room and small gym with whirl tub), with bonus welcome chocolates and a bottle of sparkling wine.\n\n**Travelling with friends or family?** Two-bedroom upgrades for up to four guests are available for both the Moraine Villa and the ultra-luxe Ashley Mackenzie Villa, offering an incredible 160sqm of total space.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Ben Ohau",
    "location_heading": "Mount Cook",
    "location_subheading": "New Zealand",
    "location_description": "Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection",
    "offer_address": "86 Mt Cook Road, Lake Pukaki, South Canterbury 7944, New Zealand",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 1159.0,
    "value": 1903.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HWVPIA4",
    "hero_image": "https://images.luxuryescapes.com/4awoz1eslh3t58ukw71",
    "image_two": "https://images.luxuryescapes.com/vgsqd2o8dtlm7bdbu2m",
    "image_three": "https://images.luxuryescapes.com/4sdlylw622mao135t37",
    "vendor_name": "Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection",
    "title": "New Zealand Boutique Lakeside Luxury Villas with Daily Breakfast, Nightly Gourmet Dinner & NZ$150 Credit",
    "description": "Sitting pretty on the waters of Lake Pukaki - underneath the otherworldly Aoraki Mackenzie International Dark Sky Reserve and surrounded by the majestic Ben Ohau Range - this spectacular five-star retreat takes you away from it all. Remote, unspoilt and wildly beautiful, the lack of light pollution makes this one of the best spots in the world for stargazing.\n\nJust four self-contained private villas are scattered across the alpine estate, allowing for a maximum of 16 guests at any one time. Get cosy in a luxury villa with an open fireplace, melt away under the stars in your private lakeside hot tub and let the dedicated onsite chef wine and dine you.\n\nDiscover unparalleled landscapes at your doorstep - lavender fields are within strolling distance, Tasman Glacier and Lake Tekapo are a 30-minute jaunt away and you can reach Queenstown in less than three hours.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Ben Ohau",
    "location_heading": "Mount Cook",
    "location_subheading": "New Zealand",
    "location_description": "Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection",
    "offer_address": "86 Mt Cook Road, Lake Pukaki, South Canterbury 7944, New Zealand",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 1359.0,
    "value": 2406.0
  }
]