[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQqA8AAL",
    "hero_image": "https://images.luxuryescapes.com/9nuh5fb2dv0ietqqtur",
    "image_two": "https://images.luxuryescapes.com/7883o0uakcbg07ud8t8",
    "image_three": "https://images.luxuryescapes.com/ptswtof2fwroftbcdm7l",
    "vendor_name": "Mt Mulligan Lodge",
    "title": "Luxury Lodge Retreat just 2.5 Hours from Cairns with All-Inclusive Dining, Drinks & Outback Bush Experiences",
    "description": "Embrace the spirit of the outback in style at Mt. Mulligan Lodge, a 69,000-acre working cattle station and proud member of the Luxury Lodges of Australia collection. Set in the shadow of spectacular Mt. Mulligan - known to Indigenous people as Ngarrabullgan - the lodge promises guests laidback five-star luxury amid the untamed natural scenery of North Queensland’s outback. With accommodation for just 28 guests, service is highly personalised, with onsite dining tailored to your schedule and tastes and bespoke bush experiences on offer for those special moments.\n\nWith the imposing ridges of Mt. Mulligan as a backdrop, a site of indigenous significance dating back 37,000 years, this is the ideal location to get away from it all. Slow down the pace, reconnect with nature and truly appreciate the beauty of this enchanting location. Zip across the property in your own personal golf buggy, which will take you to the Sunset Bar in no time to enjoy a glass of premium Australian sparkling wine while the sun sinks below the horizon. Sitting on the water’s edge of a eucalyptus-fringed weir, the lodge's natural timber exterior melts into the environment, with an infinity pool the cherry on top of this indulgent outback stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Thornborough",
    "location_heading": "Mount Mulligan",
    "location_subheading": "Queensland",
    "location_description": "Mt. Mulligan Lodge",
    "offer_address": "Mount Mulligan Road, Mount Mulligan, Queensland 4871, Australia",
    "percentage_discount": 32.0,
    "min_duration": 3,
    "max_duration": 8,
    "price": 2879.0,
    "value": 4224.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fioi9AAB",
    "hero_image": "https://images.luxuryescapes.com/ogs4nhh48l86kvbwdan4",
    "image_two": "https://images.luxuryescapes.com/609019u25r81sdha5yb",
    "image_three": "https://images.luxuryescapes.com/2ayvypfzg9adyysst9b",
    "vendor_name": "Mt Mulligan Lodge",
    "title": "Outback Queensland Bucket-List Lodge Retreat with All-Inclusive Dining, Free-Flow Drinks & Unique Bush Experiences",
    "description": "Embrace the spirit of the outback in style at Mount Mulligan Lodge, a 28,000-hectare working cattle station and proud member of the Luxury Lodges of Australia collection. Set in the shadow of spectacular Mount Mulligan - known to the local Indigenous community as Ngarrabullgan - the lodge promises guests laidback five-star luxury amid the untamed natural scenery of North Queensland’s outback. With accommodation for just 28 guests, service is highly personalised, with onsite dining tailored to your dietary requirements and tastes and signature outback experiences on offer for those special moments.\n\nZip across the property in your personal electric golf buggy to the Sunset Bar, where you can enjoy a glass of premium Australian sparkling wine while admiring the sun sinking below the horizon. Beat the heat with a dip in the infinity pool, grab a kayak or paddleboard and glide on the sparkling weir, or simply relax on your veranda, gazing out to the eucalyptus-fringed weir as you admire how the lodge's natural timber melts into the landscape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Thornborough",
    "location_heading": "Mount Mulligan",
    "location_subheading": "Queensland",
    "location_description": "Mt. Mulligan Lodge",
    "offer_address": "Mount Mulligan Road, Mount Mulligan, Queensland 4871, Australia",
    "percentage_discount": 32.0,
    "min_duration": 3,
    "max_duration": 8,
    "price": 2699.0,
    "value": 3960.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMgXIAA1",
    "hero_image": "https://images.luxuryescapes.com/fy2w4vy10o3f2o28xz6d",
    "image_two": "https://images.luxuryescapes.com/mrovi07t4bq6ndo4nlgx",
    "image_three": "https://images.luxuryescapes.com/hhb7xypzfpdtf5bkm2d",
    "vendor_name": "Mt Mulligan Lodge",
    "title": "Outback Queensland Bucket-List Lodge Retreat with All-Inclusive Dining, Free-Flow Drinks & Unique Bush Experiences",
    "description": "Embrace the spirit of the outback in style at this all-inclusive luxury lodge, nestled on a sprawling 28,000-hectare working cattle station. Set in the shadow of spectacular Mount Mulligan - known to the local Indigenous community as Ngarrabullgan - Mt. Mulligan Lodge promises guests laidback five-star luxury amid the untamed natural scenery of North Queensland’s outback. \n\nA proud member of the Luxury Lodges of Australia collection, the lodge offers accommodation for just 28 guests, with highly personalised service, premium onsite dining tailored to your dietary requirements and tastes and signature outback experiences on offer for those special moments.\n\nZip across the property in your personal electric golf buggy to the Sunset Bar, where you can enjoy a glass of premium Australian sparkling wine while admiring the sun sinking below the horizon. Beat the heat with a dip in the infinity pool, grab a kayak or paddleboard and glide over the sparkling waters of the weir, or simply relax on your veranda, gazing out to the eucalyptus-filled bushland as you admire how the lodge's natural timber melts into the landscape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Thornborough",
    "location_heading": "Mount Mulligan",
    "location_subheading": "Queensland",
    "location_description": "Mt. Mulligan Lodge",
    "offer_address": "Mount Mulligan Road, Mount Mulligan, Queensland 4871, Australia",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 8,
    "price": 1849.0,
    "value": 3202.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LtvCAAS",
    "hero_image": "https://images.luxuryescapes.com/jddodllydivaxty19dr",
    "image_two": "https://images.luxuryescapes.com/hc984ilgw9vj7bgzqmwe",
    "image_three": "https://images.luxuryescapes.com/gotw1fvj68bs7gr8yq",
    "vendor_name": "Mt Mulligan Lodge",
    "title": "Luxury Outback Retreat with All-Inclusive Dining, Drinks & Experiences",
    "description": "Experience Far North Queensland’s newest all-inclusive luxury property, Mt. Mulligan Lodge. Nestled on a 28,000-hectare working cattle station in the shadow of an impressive escarpment, Mt. Mulligan Lodge is the newest member of the Luxury Lodges of Australia collection and promises its 20 indulged guests an unforgettable escape amid the impressive natural scenery of Queensland’s outback.\n\nYour ultra-luxe escape includes all gourmet meals daily (quintessential Australian breakfast, à la carte lunch and lavish nightly dinner), select Australian wines, beers, spirits and soft drinks during your stay and a A$280 lodge credit to spend on premium beverages or exclusive outback experiences. Plus, enjoy inspiring outback experiences such as ATV safaris, guided tours of the goldfields including a sighting of Australia’s oldest gold crusher at Tyrconnell, exploration of the historic Mount Mulligan coal mine and abandoned township, chef-prepared gourmet picnic hampers, wildlife spotting, sunset drinks overlooking the escarpment, Barramundi fishing in the weir, stargazing, nature walks, and unlimited use of paddleboards, kayaks, fishing gear and an electric buggy.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Thornborough",
    "location_heading": "Mount Mulligan",
    "location_subheading": "Queensland",
    "location_description": "Mt. Mulligan Lodge",
    "offer_address": "Mount Mulligan Station, Mount Mulligan QLD 4871",
    "percentage_discount": 39.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 1930.0,
    "value": 3147.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009E7SVAA0",
    "hero_image": "https://images.luxuryescapes.com/jjgfnxydg3y41ni7vgp5",
    "image_two": "https://images.luxuryescapes.com/h6xdcyg9s9o5m9o7t65",
    "image_three": "https://images.luxuryescapes.com/unbvjsg1cai77fmz5c3",
    "vendor_name": "Mt Mulligan Lodge",
    "title": "Ultra-Luxurious Queensland Outback Lodge Serenity with Mt. Mulligan Views",
    "description": "Embrace the spirit of the outback in the shadow of North Queensland's spectacular Mount Mulligan - known to Indigenous people as Ngarrabullgan - at Mt. Mulligan Lodge. Set on a working cattle station spread over 69,000 acres, this stunning boutique lodge offers laidback five-star luxury in an untamed environment. With accommodation for just 28 guests, service is highly personalised, with staff that know you (and your drink order) by name. Zip across the property in your own assigned golf buggy, which will take you to the Sunset Bar in no time to enjoy a glass of sparkling wine while the sun sinks below the horizon. Sitting on the water’s edge of a eucalyptus-fringed weir, the lodge's natural timber exterior melts into the environment, with an infinity pool the cherry on top of this indulgent outback stay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Thornborough",
    "location_heading": "Mount Mulligan",
    "location_subheading": "Queensland",
    "location_description": "Mt. Mulligan Lodge",
    "offer_address": "Mount Mulligan Road, Mount Mulligan, Queensland 4871, Australia",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 29,
    "price": 1972.0,
    "value": 1972.0
  }
]