[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Sx3LAAS",
    "hero_image": "https://images.luxuryescapes.com/7bzqqe2erl1h4ppbojq",
    "image_two": "https://images.luxuryescapes.com/wsq5b49rm5tqp60zfa5",
    "image_three": "https://images.luxuryescapes.com/j2pmzfk6pi9xw4jk3x9",
    "vendor_name": "Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection",
    "title": "Serene Mount Cook Villa Retreat with Private Hot Tub & Nightly Three-Course Dining",
    "description": "Sitting pretty on the waters of Lake Pukaki underneath the otherworldly Aoraki Mackenzie International Dark Sky Reserve and surrounded by the majestic Ben Ohau Range, Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection feels completely away from it all.\n\nOffering one of the most arresting views over Aoraki Mount Cook in all of New Zealand, this serene retreat is designed for serious unwinding with just three self-contained private villas sprawled across the alpine estate and a mere 12 guests at any one time. Get cosy in a luxury villa with an open fireplace, melt away under the stars in your private lakeside hot tub and discover unparalleled landscapes at your doorstep - lavender fields are within strolling distance, Tasman Glacier and Lake Tekapo are a 30-minute jaunt away, and you can reach Queenstown in less than three hours.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Ben Ohau",
    "location_heading": "Mt Cook",
    "location_subheading": "New Zealand",
    "location_description": "Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection - Jan 21",
    "offer_address": "86 Mt Cook Road (SH80), Lake Pukaki, South Canterbury 7944, New Zealand",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 959.0,
    "value": 1544.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002yzKjAAI",
    "hero_image": "https://images.luxuryescapes.com/vlbgk85jup24k9eyqdd",
    "image_two": "https://images.luxuryescapes.com/elmpqk4cn9jerr5a45j8",
    "image_three": "https://images.luxuryescapes.com/1c55epovje6m8yx5u7ic",
    "vendor_name": "Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection",
    "title": "Five-Star Adults-Only Mt Cook Villa Retreat with Nightly Three-Course Dining",
    "description": "Experience majestic mountain views at Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection, offering five-star luxury amid the unparalleled natural splendour of Aoraki/Mt Cook. Nestled between the glittering turquoise waters of Lake Pukaki and the majestic Ben Ohau Range, under the Aoraki Mackenzie International Dark Sky Reserve, this adults-only retreat might just offer the most incredible views of Mt Cook and surrounds.\n\nGet cosy in a luxury villa with open fireplace, a private lakeside hot tub and uninterrupted mountain views. Your stay is made unforgettable with complimentary daily breakfast provisions, a nightly three-course dining experience for two and complimentary use of the onsite facilities, including mountain bikes, a tennis court and croquet.\n\n**Travelling with friends or family?** Upgrade to the Two-Bedroom package for four people.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "",
    "location_heading": "Mt Cook",
    "location_subheading": "New Zealand",
    "location_description": "Mt Cook Lakeside Retreat, High Country Estate & Luxury Villa Collection - June 2020",
    "offer_address": "86 Mt Cook Road (SH80), Lake Pukaki, South Canterbury 7944, New Zealand",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 899.0,
    "value": 1452.0
  }
]