[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pRvMAAU",
    "hero_image": "https://images.luxuryescapes.com/ejbeoo5sdqqgpcq3uok",
    "image_two": "https://images.luxuryescapes.com/chllbdqtcbe3f7xgi",
    "image_three": "https://images.luxuryescapes.com/m9dm1iiwm9up7wj10dvd",
    "vendor_name": "Bridgeport Hotel",
    "title": "Newly Renovated Murray River Suite Escape One Hour from Adelaide with Daily Breakfast",
    "description": "An incredible A$45 million later, the recently redeveloped Bridgeport Hotel is the ideal escape for those seeking a luxurious break in the heart of one of South Australia's most picturesque regions. Treat yourself to a stay in the tranquil Murraylands, where a natural wonderland of wildlife, wine and watersports awaits, just one hour from Adelaide CBD.\n\nBoasting an azure infinity pool framing sweeping vistas, a stylish restaurant showcasing the best in South Australian cuisine and an enviable address on the banks of the Murray River, this beautifully renovated abode is the perfect launchpad for exploring the Murraylands' natural attractions. Paddle a canoe through quiet backwaters, watch African wildlife roam free through the bushland setting of Monarto open-range zoo (just a 15-minute drive away) and venture further afield to lose yourself in the flora and fauna of Ngarkat Conservation Park.\n\nAs dusk approaches, head to the hotel's alfresco terrace and witness the sun slip behind the Murray River or enjoy an evening of cocktails at the Pool Bar. Whether you are seeking a weekend retreat from the bustling city or embarking on an unforgettable South Australia road trip - no visit to this pristine region is complete without a relaxing stay at Bridgeport Hotel.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Murray Bridge",
    "location_heading": "Murray Bridge",
    "location_subheading": "South Australia",
    "location_description": "Bridgeport Hotel",
    "offer_address": "2 Bridge St, Murray Bridge SA 5253",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 188.0,
    "value": 352.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JbK3AAK",
    "hero_image": "https://images.luxuryescapes.com/89d80320phxjswict1qp",
    "image_two": "https://images.luxuryescapes.com/2owwny4uklhanwa6kl7f8",
    "image_three": "https://images.luxuryescapes.com/1j21ihlktaqdscu79g1s",
    "vendor_name": "Bridgeport Hotel",
    "title": "Grand Reopening: Luxe Murraylands Riverfront Escape Just One Hour from Adelaide with Daily Breakfast",
    "description": "An incredible A$45 million later and the newly redeveloped Bridgeport Hotel is reopening its doors to those seeking a luxurious escape in the heart of one of South Australia's most picturesque regions: Murraylands - where a natural wonderland of wildlife, wine and watersports awaits, just one hour from Adelaide CBD.\n\nGlistening with a brand-new infinity pool framing sweeping vistas, a stylish restaurant showcasing the best in South Australian cuisine and an enviable address on the banks of the Murray River, this beautifully reinvigorated abode is the perfect launchpad for exploring the Murraylands' natural attractions. Paddle a canoe through quiet backwaters, watch African wildlife roam free through the bushland setting of Monarto's open-range zoo (just a 15-minute drive away) and venture further afield to lose yourself in the flora and fauna of Ngarkat Conservation Park.\n\nAs dusk approaches, head to the hotel's alfresco terrace and witness the sun slip behind the Murray River or enjoy an evening of cocktails at the Pool Bar. Whether you are seeking a weekend retreat from the bustling city or embarking on an unforgettable South Australia road trip - no visit to this pristine region is complete without a relaxing stay at Bridgeport Hotel.\n\n**Your handpicked inclusions:**\n\n- Begin each day with a delicious South Australian-inspired à la carte breakfast at Rivergum Restaurant\n- Celebrate on arrival with a welcome beer, glass of wine or soft drink at The Lounge\n- Relax until the very last moment with a leisurely 1pm late checkout\n\n**River-View Upgrade:** Treat yourself to sweeping Murray River vistas when you upgrade to the luxe Riverside Suite.\n\n**Longer stay bonus:** Extend your Murray River escape to three or more nights and enjoy A$30 drinks and dining credit per package to enjoy at Rivergum Restaurant. Stay for five nights or more and indulge in a delicious high tea for two with a glass of sparkling wine each at The Lounge.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Murray Bridge",
    "location_heading": "Murray Bridge",
    "location_subheading": "South Australia",
    "location_description": "Bridgeport Hotel",
    "offer_address": "2 Bridge St, Murray Bridge SA 5253",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 188.0,
    "value": 339.0
  }
]