[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000KAvBBYA1",
    "hero_image": "https://images.luxuryescapes.com/5qegdv2ufpqtamgav1e",
    "image_two": "",
    "image_three": "",
    "vendor_name": "Lotte Arai Resort",
    "title": "Lotte Arai Resort Jul 25",
    "description": "x",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Niigata Prefecture",
    "offer_geo_area_level_2": "Myoko",
    "location_heading": "Myoko",
    "location_subheading": "Japan",
    "location_description": "Lotte Arai Resort",
    "offer_address": "1966 Ryozenji, Myoko, Niigata 944-0062, Japan",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 1099.0,
    "value": 2151.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UwdkYQAR",
    "hero_image": "https://images.luxuryescapes.com/w4hbmpmys3lvae9lv3wv",
    "image_two": "https://images.luxuryescapes.com/bodp7ltrhesynlxkn7o6",
    "image_three": "https://images.luxuryescapes.com/fntd6ooohg6qx9tskmzk",
    "vendor_name": "Lotte Arai Resort",
    "title": "Grand Opening: Luxury Ski Resort in Japan",
    "description": "Discover the hottest new ski resort in Japan, the luxurious Lotte Arai Resort in Myoko, only two hours from Tokyo. Arai is blessed with the deepest powder in Japan, with an average of around 18 metres each season; more than the much-frequented Niseko and with less of the queues. Enjoy an unforgettable ski-in, ski-out escape with daily breakfasts, two-day lift passes, access to the resort’s natural hot springs and activity centre with rock climbing and trampolining and more.",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Niigata",
    "offer_geo_area_level_2": "",
    "location_heading": "Myoko",
    "location_subheading": "Japan",
    "location_description": "Lotte Arai Resort OLD",
    "offer_address": "Japan, 〒944-0062 Niigata Prefecture, Myoko, Ryozenji",
    "percentage_discount": 61.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 1033.0,
    "value": 2654.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DKYrAAO",
    "hero_image": "https://images.luxuryescapes.com/gxheolmr2rlo907b74sn",
    "image_two": "https://images.luxuryescapes.com/86tp711x1m5lzv49jh5o",
    "image_three": "https://images.luxuryescapes.com/d6wrhj53f9m9qljw5gm",
    "vendor_name": "Lotte Arai Resort",
    "title": "Award-Winning Luxe Japan Ski Escape near Tokyo with Daily Breakfast, Ski Lift Pass & Onsen Access",
    "description": "Point your ski tips towards Japan and plant your poles at the ultra-luxe Lotte Arai Resort - a ski-in, ski-out winter wonderland that promises delicious cuisine, après-ski onsens and some of the deepest powder in Japan. Tucked away in Myoko, only a two-hour drive from Niigata Airport or just over 90 minutes by bullet train from Tokyo, Arai is blessed with an average snowfall of 15 metres each season; more than the much-frequented Niseko and with fewer crowds.\n\nThis impressive resort is home to a blizzard of top facilities, including Japanese, Italian and western dining, a lounge with a cosy fireplace to relax next to after a day on the slopes, a fun karaoke bar, a serene onsen for languid soaks and a lavish indoor and outdoor swimming pool. Beyond the resort, an abundance of natural beauty awaits in Myoko. Embark on a snowshoe adventure through the Myoko-Togakushi Renzan National Park, trace your way along the frozen edges of Imori Pond, or sample saké at one of the restaurants nearby.",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Niigata Prefecture",
    "offer_geo_area_level_2": "Myoko",
    "location_heading": "Myoko",
    "location_subheading": "Japan",
    "location_description": "Lotte Arai Resort",
    "offer_address": "1966 Ryozenji, Myoko, Niigata 944-0062, Japan",
    "percentage_discount": 42.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 857.0,
    "value": 1487.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4UGtAAN",
    "hero_image": "https://images.luxuryescapes.com/fv6nu3yqa9clzgge214",
    "image_two": "https://images.luxuryescapes.com/7rmvoo3keai7ettnuunt",
    "image_three": "https://images.luxuryescapes.com/6z0du35twdjheivl8b0d",
    "vendor_name": "Lotte Arai Resort",
    "title": "More Rooms Added! Award-Winning Luxe Japan Ski Escape near Tokyo with Daily Breakfast, Ski Lift Pass & Onsen Access",
    "description": "**Our bestselling Japan ski offer is back for a limited time only. Rooms are guaranteed to go fast now that Japan is open!** Point your ski tips and plant your poles at Lotte Arai Resort - a ski-in, ski-out winter wonderland that promises delicious cuisine, après-ski onsens and some of the deepest powder in Japan. Tucked away in Myoko, only a two-hour drive from Niigata Airport or just over 90 minutes by bullet train from Tokyo, Arai is blessed with an average snowfall of 15 metres each season; more than the much-frequented Niseko and with fewer crowds. This impressive resort is home to a blizzard of top facilities, including Japanese, Italian and western dining, a fun karaoke bar, a serene onsen for languid soaks and a lavish indoor and outdoor pool.\n\nBeyond the resort, an abundance of natural beauty awaits in Myoko. Embark on a snowshoe adventure through the Myoko-Togakushi Renzan National Park, trace your way along the frozen edges of Imori Pond, or sample saké at one of the restaurants nearby.",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Niigata Prefecture",
    "offer_geo_area_level_2": "Myoko",
    "location_heading": "Myoko",
    "location_subheading": "Japan",
    "location_description": "Lotte Arai Resort",
    "offer_address": "1966 Ryozenji, Myoko, Niigata 944-0062, Japan",
    "percentage_discount": 46.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 857.0,
    "value": 1595.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004iAmyAAE",
    "hero_image": "https://images.luxuryescapes.com/5ouz0imf49h7863i6z",
    "image_two": "https://images.luxuryescapes.com/mix8gcoqwpod6ctuupq",
    "image_three": "https://images.luxuryescapes.com/s7qj5c2l7sfgw19vflrg",
    "vendor_name": "Lotte Arai Resort",
    "title": "Luxe Japan Ski Escape near Tokyo with Lift Pass, Gourmet Dining & Travel Until 2023",
    "description": "Point your ski tips towards Japan and plant your poles at the ultra-luxe Lotte Arai Resort - a ski-in ski-out winter wonderland that promises delicious cuisine, après-ski onsens and the deepest powder in Japan.\n\nTucked away in Myoko, only a two-hour drive from Niigata Airport or just over 90 minutes by bullet train from Tokyo, Arai is blessed with an average snowfall of 15 metres each season; more than the much-frequented Niseko and with less of the queuing. This impressive resort is home to a blizzard of top facilities, including Japanese, Italian and western dining, a lounge with a cosy fireplace to relax next to after a day on the slopes, a fun karaoke bar, a serene onsen for languid soaks and a lavish indoor and outdoor swimming pool.\n\n**Your handpicked inclusions:**\n\n- Fuel up for ski adventures with daily Japanese à la carte or Western buffet breakfast\n- Make the most of the slopes with a four-day lift pass per person and a 30% ski rental discount\n- Indulge with a one-time dinner at Japanese restaurant Asahi or Western eatery The Plate\n- Warm up with daily access to the resort's natural hot springs - Hoshizora Onsen\n- Soothe your ski muscles with daily access to the resort's leisurely indoor and outdoor pools\n- Enjoy access to the fun-filled Lotte Arai Playground (two hours per day)\n- Convenient complimentary shuttle bus between Jōetsumyōkō Station and the resort\n\n**Travelling with friends or family?** Choose the Superior Family or Deluxe Family Twin Rooms for up to three guests, or the Deluxe Double Twin Room for up to four guests.\n\n**Longer stay bonus:** Choose to stay longer and receive bonus lift passes (five-day lift pass per person for stays of 7+ nights; eight-day lift pass per person and three dinners per person for stays of 10+ nights).\n\n**Travel over two winter seasons**: With travel until 26 April 2023, you have two full winter seasons to choose from.\n\n**100% Refund Guarantee:** Book your escape with peace of mind thanks to our 100% Refund Guarantee, offering flexible date changes or a full refund up until 14 days before check-in. Refund is on accommodation only, excludes flights. See the Fine Print for details.",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Niigata Prefecture",
    "offer_geo_area_level_2": "Myoko",
    "location_heading": "Myoko",
    "location_subheading": "Japan",
    "location_description": "Lotte Arai Resort",
    "offer_address": "1966 Ryozenji, Myoko, Niigata 944-0062, Japan",
    "percentage_discount": 44.0,
    "min_duration": 5,
    "max_duration": 15,
    "price": 959.0,
    "value": 1720.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Edf9sAAB",
    "hero_image": "https://images.luxuryescapes.com/utcmynipesalgnwc56qb",
    "image_two": "https://images.luxuryescapes.com/myukqvyhnsjs0ve65qol",
    "image_three": "https://images.luxuryescapes.com/ivjvzl35k1eallqxvt",
    "vendor_name": "Lotte Arai Resort",
    "title": "Our Best Ever Award-Winning Japan Ski-In Ski-Out Escape with Daily Breakfast, Ski Lift Pass & Onsen Access",
    "description": "Point your ski tips towards Japan and plant your poles at Lotte Arai Resort - a ski-in, ski-out winter wonderland that promises delicious cuisine, apres-ski onsen and some of the deepest powder in the country. Tucked away in Myoko, only a two-hour drive from Niigata Airport or just over 90 minutes by bullet train from Tokyo, Arai is blessed with an average snowfall of 15 metres each season; more than the much-frequented Niseko and with fewer crowds. This impressive resort is home to a blizzard of top facilities, including Japanese, Italian and Western dining, a fun karaoke bar, a serene onsen for languid soaks and lavish indoor and outdoor pools.\n\nBeyond the resort, an abundance of natural beauty awaits in Myoko. Embark on a snowshoe adventure through the Myoko-Togakushi Renzan National Park, trace your way along the frozen edges of Imori Pond, or sample sake at one of the restaurants nearby.",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Niigata Prefecture",
    "offer_geo_area_level_2": "Myoko",
    "location_heading": "Myoko",
    "location_subheading": "Japan",
    "location_description": "Lotte Arai Resort",
    "offer_address": "1966 Ryozenji, Myoko, Niigata 944-0062, Japan",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 899.0,
    "value": 2100.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fl1VsAAJ",
    "hero_image": "https://images.luxuryescapes.com/3w85k2u4oa282pjibgf7",
    "image_two": "https://images.luxuryescapes.com/e639r02yx54owxfadt",
    "image_three": "https://images.luxuryescapes.com/rf35hpn6xst2lfu4c2ua",
    "vendor_name": "Lotte Arai Resort",
    "title": "It's Back: Our Bestselling Japan Ski Escape near Tokyo with Daily Breakfast, Ski Lift Pass & Onsen Access",
    "description": "Point your ski tips towards Japan and plant your poles at Lotte Arai Resort - a ski-in, ski-out winter wonderland that promises delicious cuisine, apres-ski onsens and some of the deepest powder in the country. Tucked away in Myoko, just a two-hour drive from Niigata Airport or 90 minutes by bullet train from Tokyo, this is a hidden gem blessed with an average snowfall of 15 metres each season, more than the much-frequented Niseko. This impressive resort is home to a blizzard of top facilities, including Japanese, Italian and Western dining, a fun karaoke bar, a serene onsen for languid soaks and lavish indoor and outdoor pools.\n\nBeyond the resort, an abundance of natural beauty awaits in Myoko. Embark on a snowshoe adventure through the Myoko-Togakushi Renzan National Park, trace your way along the frozen edges of Imori Pond, or sample sake at one of the restaurants nearby.",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Niigata Prefecture",
    "offer_geo_area_level_2": "Myoko",
    "location_heading": "Myoko",
    "location_subheading": "Japan",
    "location_description": "Lotte Arai Resort",
    "offer_address": "1966 Ryozenji, Myoko, Niigata 944-0062, Japan",
    "percentage_discount": 54.0,
    "min_duration": 5,
    "max_duration": 10,
    "price": 884.0,
    "value": 1936.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IwkMIAS",
    "hero_image": "https://images.luxuryescapes.com/qzp9wxjldkns1v77xrcoj",
    "image_two": "https://images.luxuryescapes.com/5bhzzie2c5hxcbio5zjg",
    "image_three": "https://images.luxuryescapes.com/gk5d7znxmmydip07og2i",
    "vendor_name": "Lotte Arai Resort",
    "title": "Japan Bestseller Is Back: Multi-Award-Winning Ski Escape near Tokyo with Daily Breakfast, Ski Lift Pass & Onsen Access",
    "description": "Point your ski tips towards Japan and plant your poles at this multi-award-winning, ski-in, ski-out winter wonderland that promises delicious cuisine, apres-ski onsens and some of the deepest powder in the country.\n\nTucked away in Myoko, just a two-hour drive from Niigata Airport or two hours by bullet train from Tokyo, this is a hidden gem blessed with an average snowfall of 15 metres each season, more than the much-frequented Niseko.\n\nThis impressive resort is home to a blizzard of top facilities, including Japanese and Western dining, a fun karaoke bar, serene onsen for languid soaks and lavish indoor and outdoor pools.\n\nBeyond the resort, an abundance of natural beauty awaits in Myoko. Embark on a snowshoe adventure through the Myoko-Togakushi Renzan National Park, trace your way along the frozen edges of Imori Pond or sample sake at one of the restaurants nearby.",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Niigata Prefecture",
    "offer_geo_area_level_2": "Myoko",
    "location_heading": "Myoko",
    "location_subheading": "Japan",
    "location_description": "Lotte Arai Resort",
    "offer_address": "1966 Ryozenji, Myoko, Niigata 944-0062, Japan",
    "percentage_discount": 52.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1099.0,
    "value": 2287.0
  }
]