[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VmnRAAS",
    "hero_image": "https://images.luxuryescapes.com/zv02hcruchqptvbm87pd",
    "image_two": "https://images.luxuryescapes.com/tsjf4mcgheuv9lqpsxrt",
    "image_three": "https://images.luxuryescapes.com/n1my2jltytpzi7tuved",
    "vendor_name": "The County Hotel",
    "title": "Charming Hawke's Bay Art Deco Escape with Daily Breakfast & Nightly Drinks",
    "description": "Experience Art Deco architecture and superb local wine with a charming escape to The County Hotel Napier in the stunning Hawke’s Bay region. Become immersed in New Zealand of the 1930s staying at this faithfully refurbished hotel, which was originally built in 1909 and remains one of only two significant buildings to have survived the massive earthquake that shook the city in 1931.\n\nExperience the aristocratic lifestyle as you settle into one of just 18 boutique rooms, dine in the award-winning Wine Street Restaurant, cosy up with a book in the intimate library and toast your heritage escape with a nightcap in the boutique Churchill's Champagne Bar. Once you step outside your hotel, find yourself in the heart of the UNESCO World Heritage-listed Napier Art Deco historic precinct. Hear the whoosh of the ocean - you’re less than a five minutes’ walk to the tree-lined Marine Parade and beach - and discover over 70 exceptional wineries just a short drive away, including New Zealand's oldest winery, Mission Estate Winery.\n\n**Your handpicked inclusions:**\n\n- Each day is a gourmet affair with à la carte breakfast at Wine Street Restaurant\n- Each evening, enjoy a glass of beer or wine at Churchill's Champagne Bar\n- Indulge with NZ$50 dining credit to be used at Wine Street Restaurant\n- Relax until the last moment with guaranteed 11am late checkout\n- Take a part of New Zealand home with you with a gifted twin pack of Hawke’s Bay Wines\n- Exploring is made easy thanks to complimentary onsite self-parking for one vehicle per stay\n\n**Spa Upgrade Available:** Make your stay extra indulgent when you upgrade to a Luxury Superior Spa Room, which features a therapeutic spa bath or bath.\n\n**Suite Upgrade Available**: Take your stay to new heights in a Royal Suite, where you'll be able to enjoy a spa bath, private balcony grand fireplace and dining room with antique furniture. \n\n**This deal has NO peak surcharges:** Travel any time for the same great price.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Hawke's Bay Region",
    "offer_geo_area_level_2": "Napier",
    "location_heading": "Napier",
    "location_subheading": "New Zealand",
    "location_description": "The County Hotel",
    "offer_address": "12 Browning Street, Napier South, Napier 4110, New Zealand",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 249.0,
    "value": 675.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JTgwAAG",
    "hero_image": "https://images.luxuryescapes.com/fwvj9zdi1uqalt100e6a",
    "image_two": "https://images.luxuryescapes.com/mkk3j5b2nfdexflg4ms",
    "image_three": "https://images.luxuryescapes.com/eb0viuz6yvixbw8a8epq",
    "vendor_name": "Swiss-BelHotel Napier",
    "title": "Five-Star Napier Art Deco Boutique Retreat with Daily Breakfast",
    "description": "Five-star luxury meets Art Deco at Swiss-Belboutique Napier, a boutique hotel in the heart of Napier's downtown area. Wander streets that look like they are straight out of a movie set, from the well-preserved 1930s buildings to the old street lamps lining the road. Inside, the hotel also reflects the era through its eclectic interior design.\n\nWhen you’re feeling hungry, head to Saffron Social Kitchen for locally-sourced Kiwi cuisine with a modern twist. At the Lobby Bar, order a classic cocktail and snack before heading out on the town. When you want to work up a sweat, the state-of-the-art fitness centre has everything you need to kick those health goals. Swiss-Belboutique Napier is an easy five-minute stroll to Marine Parade, home to the Sunken Gardens and National Aquarium of New Zealand. The hotel is also just a 20-minute drive to some of the Hawke's Bay region's best vineyards including Black Barn, Elephant Hill, and Craggy Range. A little further is the breathtaking Te Mata Peak, where you can watch a fiery sunset from the summit.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Hawke's Bay Region",
    "offer_geo_area_level_2": "Napier",
    "location_heading": "Napier",
    "location_subheading": "New Zealand",
    "location_description": "Swiss-Belboutique Napier",
    "offer_address": "36 Munroe Street, Napier South, Napier 4110, New Zealand",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 255.0,
    "value": 578.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zMogAAE",
    "hero_image": "https://images.luxuryescapes.com/qxljiqw7iiwsoywl7j5",
    "image_two": "https://images.luxuryescapes.com/ybvd66wohddsyjibalj",
    "image_three": "https://images.luxuryescapes.com/f6qyiad8imywolojvk1",
    "vendor_name": "Art Deco Masonic Hotel",
    "title": "Art Deco Napier Waterfront Hotel with Daily Breakfast & Dining Credit",
    "description": "Discover Napier's beautifully preserved 1930s architecture, thriving food scene, walking trails, and Maori culture from your stylish city launchpad at Art Deco Masonic Hotel, ranked in the top 1% of properties worldwide on Tripadvisor, and one of the top 25 hotels in the South Pacific.\n\nJust steps from the main shopping strip, this boutique sanctuary is the perfect launchpad for discovering the wonders of New Zealand's art deco capital, local museums, tasting your way through the town's flourishing culinary scene, or visiting the many nearby vineyards. This stylish retreat is also home to the contemporary Emporium Eatery & Bar, serving seasonal dishes utilising fresh, local ingredients, and the Emporium Lounge, an enchanting place of elegance and grace. With genuine hospitality, attentive service, luxurious rooms, and one-of-a-kind suites that exude comfort - this is the place you need to be in Napier.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Hawke's Bay Region",
    "offer_geo_area_level_2": "Napier",
    "location_heading": "Napier",
    "location_subheading": "New Zealand",
    "location_description": "Art Deco Masonic Hotel",
    "offer_address": "2 Tennyson Street, Napier South, Napier 4110, New Zealand",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 239.0,
    "value": 385.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000ZnlbjQAB",
    "hero_image": "https://images.luxuryescapes.com/qeoswbewiwfk4sksk0lq",
    "image_two": "https://images.luxuryescapes.com/adtfiqbrvjdj1qubu6tx",
    "image_three": "https://images.luxuryescapes.com/aqy88zwnlfitl6lmodgp",
    "vendor_name": "Ormlie Lodge (permanently closed)",
    "title": "Heritage Elegance in New Zealand's Wine Country",
    "description": "Indulge in an intimate boutique escape in the heart of New Zealand’s world-renowned Hawke’s Bay wine region with a stay at the heritage Ormlie Lodge. Included in this peaceful getaway is daily breakfast, a bottle of wine on arrival, NZ$50 food and beverage credit and a guaranteed late midday check-out.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Hawke's Bay Region",
    "offer_geo_area_level_2": "Waiohiki",
    "location_heading": "Napier",
    "location_subheading": "New Zealand",
    "location_description": "Ormlie Lodge",
    "offer_address": "17 Omarunui Rd, Taradale, Napier 4183, New Zealand",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 226.0,
    "value": 444.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IasEBAAZ",
    "hero_image": "https://images.luxuryescapes.com/ylzv1613tsjecvs8o7vjq",
    "image_two": "https://images.luxuryescapes.com/fjliwua7ch131h6zrij",
    "image_three": "https://images.luxuryescapes.com/lb0n4dsz1akdz6yxtj",
    "vendor_name": "The County Hotel",
    "title": "Charming Hawke's Bay Art Deco Escape with Daily Breakfast, Dining Credit & Nightly Drinks",
    "description": "Experience Art Deco architecture and superb local wine with a enchanting escape to this boutique jewel in the stunning Hawke’s Bay region. Become immersed in New Zealand of the 1930s with a stay at this faithfully refurbished hotel, which was originally built in 1909 and remains one of only two significant buildings to have survived the massive 1931 earthquake. Dine in the award-winning Wine Street Restaurant, cosy up with a book in the intimate library and toast your heritage escape with a nightcap in the boutique Churchills Lounge Bar & Restaurant. Once you step outside your hotel, find yourself in the heart of the UNESCO World Heritage-listed Napier Art Deco historic precinct.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Hawke's Bay Region",
    "offer_geo_area_level_2": "Napier",
    "location_heading": "Napier",
    "location_subheading": "New Zealand",
    "location_description": "The County Hotel",
    "offer_address": "12 Browning Street, Napier South, Napier 4110, New Zealand",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 281.0,
    "value": 580.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pTVpAAM",
    "hero_image": "https://images.luxuryescapes.com/1hyibleda9e6cxpxd0c",
    "image_two": "https://images.luxuryescapes.com/r0fk6xrqqe018tc8mpbl",
    "image_three": "https://images.luxuryescapes.com/7wxl8px1i1rooiux3ad",
    "vendor_name": "The County Hotel",
    "title": "Picturesque North Island Heritage Escape",
    "description": "Get your fix of Art Deco charm in Napier's premier hotel. This idyllic refuge dating back to 1909, originally built for Hawke's Bay County Council, has now been faithfully refurbished to combine the appeal of its heritage architecture with the ease and convenience of modern luxury. The hotel boasts not one but two fine-dining restaurants - taste the South Pacific at the elegant Wine Street restaurant or try a huge selection of the best wines and champagnes from the region and the world at Churchill’s Champagne & Snug Bar.\n\nIf you can tear yourself away from the hotel, you'll find yourself in the centre of Napier, considered the ‘Art Deco Capital of the South Pacific’. After taking in the town's architecture, make the most of your superb location -  explore the nearby beaches and wineries for which Hawke's Bay is renowned, or admire the rugged landscapes of Cape Kidnappers.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Hawke's Bay Region",
    "offer_geo_area_level_2": "Napier",
    "location_heading": "Napier",
    "location_subheading": "New Zealand",
    "location_description": "The County Hotel",
    "offer_address": "12 Browning Street, Napier South, Napier 4110, New Zealand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008fSFZAA2",
    "hero_image": "https://images.luxuryescapes.com/i80qqyq5d1i0s2u2gt8",
    "image_two": "https://images.luxuryescapes.com/hiz4kjl8qs8nmjtmf3du",
    "image_three": "https://images.luxuryescapes.com/0ii2h617tw0xgz293d",
    "vendor_name": "The County Hotel",
    "title": "Heritage Napier Escape in New Zealand's Art Deco Capital",
    "description": "Get your fix of Art Deco charm in Napier's premier hotel. This idyllic refuge dating back to 1909, originally built for the Hawke's Bay County Council, has now been faithfully refurbished to combine the appeal of its heritage architecture with the ease and convenience of modern luxury. The hotel boasts not one but two fine-dining restaurants - taste the South Pacific at the elegant Wine Street restaurant or try a huge selection of the best wines and champagnes from the region and the world at Churchill’s Champagne & Snug Bar.\n\nIf you can tear yourself away from the hotel, you'll find yourself in the centre of Napier, considered the ‘Art Deco Capital of the South Pacific’. After taking in the town's architecture, make the most of your superb location -  explore the nearby beaches and wineries for which Hawke's Bay is renowned, or admire the rugged landscapes of Cape Kidnappers.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Hawke's Bay Region",
    "offer_geo_area_level_2": "Napier",
    "location_heading": "Napier",
    "location_subheading": "New Zealand",
    "location_description": "The County Hotel",
    "offer_address": "12 Browning Street, Napier South, Napier 4110, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 90.0,
    "value": 90.0
  }
]