[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EXz6HYAT",
    "hero_image": "https://images.luxuryescapes.com/2fhr8awsahd0sfmnediv",
    "image_two": "https://images.luxuryescapes.com/s6zq2jyuhscfb4ylis3w",
    "image_three": "https://images.luxuryescapes.com/xa9tr4ltxhl6yp0dre49",
    "vendor_name": "Hyatt House Naples 5th Avenue",
    "title": "Modern Naples Retreat on the Gordon River with Daily Breakfast",
    "description": "Nestled along the scenic Gordon River, this downtown retreat seamlessly blends riverfront tranquillity with urban convenience. Just steps from vibrant 5th Avenue South, you'll be at the heart of Naples' renowned dining, shopping and cultural scene - while still enjoying a peaceful tropical escape. Set sail from the nearby marina, or simply unwind with breathtaking waterfront views right outside your door. \n\nStroll to the historic Naples Pier for a mesmerizing sunset, savour the catch of the day at Tin City Waterfront Shops or immerse yourself in the city's dynamic art scene at The Baker Museum. Back at the hotel, take a refreshing dip in the expansive outdoor pool or sip a handcrafted cocktail while indulging in coastal-inspired cuisine at Latitude 26.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Florida",
    "offer_geo_area_level_2": "Naples",
    "location_heading": "Naples",
    "location_subheading": "United States",
    "location_description": "Hyatt House Naples 5th Avenue",
    "offer_address": "5th Avenue South, Naples, Florida 34102, United States",
    "percentage_discount": 68.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 299.0,
    "value": 948.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I5lvAAC",
    "hero_image": "https://images.luxuryescapes.com/llu04x0q1g38n9uia2ab",
    "image_two": "https://images.luxuryescapes.com/nb9imek0y5se9k0spa3n",
    "image_three": "https://images.luxuryescapes.com/fv8tvgeaxd7nitundiw8",
    "vendor_name": "Unahotel Napoli",
    "title": "Boutique Design Escape in the Heart of Naples with Rooftop Bar Overlooking Mount Vesuvius",
    "description": "The soul-stirring beauty and elegant architecture of Naples are yours to explore from the stylish UNAHOTELS Napoli. Housed in a perfectly restored historic building with sweeping views over some of Italy’s oldest streets and frescoes, the hotel pays tribute to the legacy of the structure's storied past through its traditional design. Each of its picturesque rooms exudes Neapolitan grandeur and contemporary charm, complemented by artistic murals in tuff stone and marble-floored ensuites.\n\nNestled in the Porto neighbourhood, home to the University of Naples and Palazzo della Borsa, UNAHOTELS Napoli offers an ideal mix of polished elegance and modern comforts, while maintaining traditional Italian hospitality and authentic Neapolitan style. Guests can enjoy 'squisito servizio Italiano' (exquisite Italian service) at the refined rooftop Vesuvio Roof Bar & Restaurant, tempting guests with sweeping views across Naples to Mount Vesuvius, home-cooked dishes and an expansive wine list. Once you've had your fill, hit the city streets and visit nearby iconic sites such as Porta Nolana, Basilica della Santissima Annunziata Maggiore and Santa Maria Egiziaca a Forcella, or hop on a train at Piazza Garibaldi to explore further afield.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Campania",
    "offer_geo_area_level_2": "Naples",
    "location_heading": "Naples",
    "location_subheading": "Italy",
    "location_description": "UNAHOTELS Napoli",
    "offer_address": "10, P.za Giuseppe Garibaldi, 9, 80142 Napoli NA, Italy",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 132.0,
    "value": 132.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI6EoAAL",
    "hero_image": "https://images.luxuryescapes.com/uut3r8fizec7u2gjjoi",
    "image_two": "https://images.luxuryescapes.com/gaq5a6ddu81lpiz41p6",
    "image_three": "https://images.luxuryescapes.com/q5v53ueevdub69gv4ul",
    "vendor_name": "Holiday Inn Naples",
    "title": "Modern Naples Escape Near City Centre and Airport",
    "description": "Escape to the elegantly chaotic Italian harbour city with a stay at Holiday Inn Naples, an IHG Hotel - perfectly situated in the Centro Direzionale business district, in easy reach of the most spectacular monuments. Wander the streets lined with medieval castles, awe-inspiring churches, bustling pizza restaurants claiming to be the best in the country, and designer clothing stores. Closer to home, unwind in style on the open-air patio of onsite Bistrot Napoli restaurant.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Campania",
    "offer_geo_area_level_2": "Naples",
    "location_heading": "Naples",
    "location_subheading": "Italy",
    "location_description": "Holiday Inn Naples, an IHG Hotel",
    "offer_address": "Via Domenico Aulisio, Naples, 80143, Italy",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 84.0,
    "value": 84.0
  }
]