[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HkBhIAK",
    "hero_image": "https://images.luxuryescapes.com/1xubkskrlob5k70xzz3j",
    "image_two": "https://images.luxuryescapes.com/hnjju9vqotgwe7yta2",
    "image_three": "https://images.luxuryescapes.com/mtdcgum84v4nlnjmsv",
    "vendor_name": "The Joseph, a Luxury Collection Hotel, Nashville",
    "title": "Stylish Award-Winning Downtown Nashville Luxury Collection Art Hotel with Rooftop Pool & Daily Dining Credit",
    "description": "Soaring 21 stories above Music City, Nashville’s only Forbes Star Award-winning hotel radiates sophistication. This Luxury Collection gem in the heart of downtown is adorned with handcrafted details, a curated collection of 1,000 rare artworks, and elegant nods to the city’s musical roots.\n\nCulinary excellence takes centre stage at Yolan, serving refined Italian fare. The property also features three alluring cocktail bars, including the uber-chic rooftop, Denim, and intimate speakeasy, Four Walls. When not eating, drinking or exploring, ascend to the top floor for a serene rooftop pool and the refuge of Rose, the luxurious on-site spa featuring an extensive range of spa and salon services.\n\nPerfectly positioned in the fashionable SoBro neighbourhood, the hotel places you just blocks from Nashville’s top cultural attractions. You're mere steps from the Country Music Hall of Fame and Schermerhorn Symphony Centre, plus acclaimed Tennessee dining spots and the iconic live music scene of Broadway.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Tennessee",
    "offer_geo_area_level_2": "Nashville",
    "location_heading": "Nashville",
    "location_subheading": "United States of America",
    "location_description": "The Joseph, a Luxury Collection Hotel, Nashville",
    "offer_address": "401 Korean Veterans Boulevard, Nashville, Tennessee 37203, United States of America",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 519.0,
    "value": 1370.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IRYkIAO",
    "hero_image": "https://images.luxuryescapes.com/02man87huz1qsznrppi",
    "image_two": "https://images.luxuryescapes.com/rzqs68hjacmdkrym8b3",
    "image_three": "https://images.luxuryescapes.com/2s8jxayf8fk4ihpmzpcr",
    "vendor_name": "Dream Hotel Nashville",
    "title": "Downtown Nashville Art Deco Stay on Printers Alley with Daily Dining Credit & Six Onsite Restaurants & Bars",
    "description": "Discover the heart of Music City from this iconic Art Deco hotel, just moments from Nashville's historic nightlife district. Indulge in the hotel’s unique amenities, including an experiential nightclub, a lively speakeasy, a stylish cocktail bar and a popular taco shop. Every detail of this stay is crafted to immerse guests in Nashville's rich culture and creative spirit, making it an ideal base for exploring top attractions like the Country Music Hall of Fame, the Frist Art Museum and the vibrant Bridgestone Arena.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Tennessee",
    "offer_geo_area_level_2": "Nashville",
    "location_heading": "Nashville",
    "location_subheading": "United States",
    "location_description": "Dream Nashville",
    "offer_address": "210 4th Avenue North, Nashville, Tennessee 37219, United States",
    "percentage_discount": 66.0,
    "min_duration": 2,
    "max_duration": 16,
    "price": 499.0,
    "value": 1486.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LoEOAA0",
    "hero_image": "https://images.luxuryescapes.com/cpjvqze6o7gvnccuxt7o",
    "image_two": "https://images.luxuryescapes.com/ktnxm9tg3c3177iott0d",
    "image_three": "https://images.luxuryescapes.com/7ft3ysvhnqq4p713qt5",
    "vendor_name": "Thompson Nashville",
    "title": "Luxury Downtown Nashville Stay with Valet Parking & Daily Breakfast",
    "description": "Discover America's iconic Deep South, from the Country Music Hall of Fame to the infamous Honky Tonk Row, with an unforgettable stay at the Thompson Nashville. Embrace this place of pilgrimage and learn of its spirit and character, before sampling some true Southern delicacies. Staying in an upgraded City View room in the heart of Tennessee, you'll enjoy daily à la carte breakfast, complimentary valet parking and a convenient 11am checkout, allowing you to make the most of your final morning.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Tennessee",
    "offer_geo_area_level_2": "Nashville",
    "location_heading": "Nashville",
    "location_subheading": "United States",
    "location_description": "Thompson Nashville",
    "offer_address": "401 11th Ave S, Nashville, TN 37203",
    "percentage_discount": 39.0,
    "min_duration": 3,
    "max_duration": 3,
    "price": 877.0,
    "value": 1443.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcrSQAAZ",
    "hero_image": "https://images.luxuryescapes.com/v8rj1cttzo5y76p3ugjy",
    "image_two": "https://images.luxuryescapes.com/llgtbjxdxhrfz4xcznp",
    "image_three": "https://images.luxuryescapes.com/rbla65y09jwl1vhs5xj",
    "vendor_name": "The Joseph, a Luxury Collection Hotel, Nashville",
    "title": "Downtown Nashville Luxury Collection Art Hotel with Daily Cocktails & Dining Credit",
    "description": "Dazzling 21 floors above Music City is Nashville's only Forbes Star Award-winning hotel. Flourishing with artisan touches, this Luxury Collection hotel in the heart of downtown boasts a 1,000-strong rare art collection and chic homages to the city's musical history. Dining is championed by James Beard Award-winning and Michelin-alum chef, Tony Mantuano, who leads the kitchen at Yolan with a signature Italian menu. Plus, three enticing cocktail bars and an executive pastry chef-led cafe await onsite. \n\nFor moments of relaxation, saunter to the top floor for a rooftop pool escape and a luxurious, full-service spa with steam rooms and a relaxation lounge. Ideally located in trendy SoBro, this escape places you within a few blocks of the city's renowned entertainment and attractions. Be just steps from the Country Music Hall of Fame and Schermerhorn Symphony Center, as well as Tennessean restaurants and the legendary live music venues of Broadway.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Tennessee",
    "offer_geo_area_level_2": "Nashville",
    "location_heading": "Nashville",
    "location_subheading": "United States of America",
    "location_description": "The Joseph, a Luxury Collection Hotel, Nashville",
    "offer_address": "401 Korean Veterans Boulevard, Nashville, Tennessee 37203, United States of America",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 16,
    "price": 759.0,
    "value": 1580.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdKEOAA3",
    "hero_image": "https://images.luxuryescapes.com/8uw6d93ll4out33agoc",
    "image_two": "https://images.luxuryescapes.com/lk5tmr7dow310egyjtv",
    "image_three": "https://images.luxuryescapes.com/r4im2vjcbmuppxyrccwf",
    "vendor_name": "Kimpton Aertson Hotel",
    "title": "Vibrant Nashville Vacation with Modern American Brasserie & Rooftop Pool",
    "description": "The Kimpton Aertson Hotel, an IHG Hotel, nestled in Nashville's iconic Music Row, offers a luxurious and contemporary escape. Enjoy a splash in the rooftop pool or head to the onsite modern American brasserie, Henley, for seasonal hand-crafted cocktails and inventive plates showcasing local produce. You'll be ideally located to explore the best of Nashville with renowned music studios, honky-tonks and live music venues right outside your door.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Tennessee",
    "offer_geo_area_level_2": "Nashville",
    "location_heading": "Nashville",
    "location_subheading": "United States",
    "location_description": "Kimpton Aertson Hotel, an IHG Hotel",
    "offer_address": "2021 Broadway, Nashville, Tennessee 37203, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 165.0,
    "value": 165.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zQRzAAM",
    "hero_image": "https://images.luxuryescapes.com/rn86ffdiellq3tlpc536",
    "image_two": "https://images.luxuryescapes.com/l2urj81v5fgruw98p6l",
    "image_three": "https://images.luxuryescapes.com/w5frmwzw3o95frctd1w3",
    "vendor_name": "Fairlane Hotel Nashville",
    "title": "Award-Winning Retro Escape in the Heart of Nashville with Rooftop Bar",
    "description": "Discover the sharp style of Music City with a stay at Fairlane Hotel, a luxurious mid-century escape in the heart of Nashville’s arts and business precinct. Perched just a few blocks from bustling Broadway and lively Printers Alley, this boutique bolthole is perfectly placed for days spent exploring, while remaining a hip oasis of calm. All major landmarks are within walking distance, but should you wish to venture further afield - East Nashville or Music Row perhaps? - you're just a short taxi ride away.\n\nOccupying a former bank headquarters, complete with original terrazzo floors, travertine columns, wood panelling and brass details, Fairlane Hotel pays homage to the '60s and '70s with exceptional attention to detail. Take in the view from your room or venture to the fourth-floor Ellington’s rooftop restaurant and bar to devour nostalgic classics alongside curated cocktails on the wraparound terrace. Come morning, dash down to Bagelshop for a morning brew and bagel, or get the heart racing another way, with a session in the well-equipped fitness centre. Honoured in the Tripadvisor Traveller's Choice, Best of the Best 2021 hall of fame, Fairlane Hotel is ranked among the top 25 hotels in the USA on the review site, and the top 1% worldwide.\n\n**Luxury Escapes inclusions (select packages):**\n\n- Toast to Nashville with a **bottle of wine on arrival**\n- Enjoy an **upgrade to the next available room category** (subject to availability, for stays of 3+ nights)\n\n**Travelling with family?** Opt for the Double Standard package for up to four guests.\n\n**Tripadvisor Traveller's Choice, Best of the Best 2021** Top 25 Hotels - United States",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Tennessee",
    "offer_geo_area_level_2": "Nashville",
    "location_heading": "Nashville",
    "location_subheading": "USA",
    "location_description": "Fairlane Hotel",
    "offer_address": "401 Union Street Nashville TN 37219",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 22,
    "price": 155.0,
    "value": 155.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HiHwIAK",
    "hero_image": "https://images.luxuryescapes.com/p0kco9qq972o88c710s8",
    "image_two": "https://images.luxuryescapes.com/e9mqygfffbrigdoemf7",
    "image_three": "https://images.luxuryescapes.com/qbvoss82wlzyqw1o1rkk",
    "vendor_name": "Omni Nashville Hotel",
    "title": "Luxury Downtown Nashville Stay with Four Onsite Restaurants & Rooftop Pool",
    "description": "Dance along to the tune of the Music City with a glorious stay at this glamorous haven, perfectly positioned in the heart of downtown Nashville. Boasting an ideal location, the hotel provides easy access to the famed Country Music Hall of Fame and Museum and the vibrant Broadway strip. Satisfy your culinary cravings at Kitchen Notes, offering traditional Southern dishes, or indulge in a handcrafted cocktail at Barlines. For a touch of relaxation, the Mokara Spa awaits, offering a range of rejuvenating treatments.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Tennessee",
    "offer_geo_area_level_2": "Nashville",
    "location_heading": "Nashville",
    "location_subheading": "United States",
    "location_description": "Omni Nashville Hotel",
    "offer_address": "250 Rep. John Lewis Way S, Nashville, Tennessee 37203, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 310.0,
    "value": 310.0
  }
]