[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JMvoIAG",
    "hero_image": "https://images.luxuryescapes.com/u7ihocsrqh4tn52fjlap",
    "image_two": "https://images.luxuryescapes.com/si4zw13jdofglpdmw1tp",
    "image_three": "https://images.luxuryescapes.com/gbcxnjwfrs2kdsobiesv",
    "vendor_name": "Natai Beach Resort",
    "title": "Oceanfront Oasis North of Phuket with Pristine Private Beach, Daily Breakfast, Nightly Dinner & Nightly Free-Flow Cocktail Hour",
    "description": "Secluded golden sands, a dazzling lagoon pool and the eternally shimmering blues of the Andaman Sea beyond: discover Thailand as it once was at this exceptional resort, perfectly positioned just 30 minutes north of Phuket Airport.\n\nNatai Beach Resort delivers the dream and more: with massages included, the tranquil Khao Spa stands ready to rejuvenate, relax and renew you. One of the region’s finest sheltered beaches is just steps away. Laze the afternoon away by the resort’s Pool Bar or on a seaside hammock and return for dinner at Natai Restaurant, greeted warmly by the resort’s excellent staff and the spectacular setting of the sun.\n\nWith one child included in all package types, this is the perfect family-friendly escape. Natai Beach Resort also serves as a base for exploring the Surin and Similan archipelagos, with both offering countless spellbinding moments both above and below the waves. Phuket’s majestic Big Buddha, laidback markets and Patong’s bustling nightlife are all within a 90-minute drive.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Thung",
    "location_heading": "Natai",
    "location_subheading": "Thailand",
    "location_description": "Natai Beach Resort",
    "offer_address": "55 Khok Kloi, Takua Thung District, Phang-nga 82140, Thailand",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 619.0,
    "value": 2553.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EwVObAAN",
    "hero_image": "https://images.luxuryescapes.com/4kkjyn1ylmw5dbpxe19e",
    "image_two": "https://images.luxuryescapes.com/kt0bhhtf1bpl3fcvtzyf",
    "image_three": "https://images.luxuryescapes.com/rr9y6w6j6nz1ddbp1ebd",
    "vendor_name": "Natai Beach Resort",
    "title": "Oceanfront Oasis North of Phuket with Pristine Private Beach, Daily Breakfast, Nightly Dinner & Nightly Free-Flow Cocktail Hour",
    "description": "Secluded golden sands, dazzling lagoon pools and the eternally shimmering blues of the Andaman Sea beyond: discover Thailand as it once was at this exceptional five-star resort, perfectly positioned just 30 minutes north of Phuket Airport. Natai Beach Resort delivers the dream and more: with massages included, the tranquil Khao Spa stands ready to rejuvenate, relax and renew and one of the region’s finest sheltered beaches is only ever just a short wander away. Laze the afternoon away by the resort’s Pool Bar or on a seaside hammock and return for dinner at Natai Restaurant, greeted warmly by the resort’s excellent staff and the spectacular setting of the sun.\n\nWith one child included in all package types, this is the perfect family-friendly escape. Natai Beach Resort also serves as the perfect base for exploring the Surin and Similan archipelagos, with both offering countless spellbinding moments both above and below the waves. Phuket’s majestic Big Buddha, laidback markets and Patong’s bustling nightlife are all within a 90-minute drive.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phang Nga Province",
    "offer_geo_area_level_2": "Takua Thung",
    "location_heading": "Natai",
    "location_subheading": "Thailand",
    "location_description": "Natai Beach Resort",
    "offer_address": "55 Khok Kloi, Takua Thung District, Phang-nga 82140, Thailand",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 599.0,
    "value": 2488.0
  }
]