[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HiIMIA0",
    "hero_image": "https://images.luxuryescapes.com/ptsg8mvoz92gmkei5st",
    "image_two": "https://images.luxuryescapes.com/9lao3genuiir1f7pypmj",
    "image_three": "https://images.luxuryescapes.com/jjkn4zpzsdtfiryjz8vo",
    "vendor_name": "Omni Mount Washington Resort",
    "title": "New England Mount Washington Ski Resort Escape with Two Pools & Six Dining Venues",
    "description": "Soak up the alpine beauty of New England's Mount Washington from this tranquil resort, perfectly placed on the slopes of scenic Bretton Woods - New Hampshire's largest ski area. The region, renowned for its hiking and cycling trails, snowy thrills, quaint cafes, and forested landscape, is on your doorstep and just waiting to be explored.\n\nSpend your days on the slopes and for the perfect apres-ski vibes, absorb the legendary village buzz. Unwind in style in the well-appointed rooms imbued with thoughtful amenities, relax your muscles in the heated saltwater pool and savour a sumptuous meal at the Main Dining Room, offering farm-to-table New England cuisine, or sip a drink at The Cave, a Prohibition-era speakeasy.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New Hampshire",
    "offer_geo_area_level_2": "Bretton Woods",
    "location_heading": "New Hampshire",
    "location_subheading": "United States",
    "location_description": "Omni Mount Washington Resort",
    "offer_address": "310 Mount Washington Hotel Rd, Bretton Woods, New Hampshire, United States, 03575",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 225.0,
    "value": 225.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FoW8CAAV",
    "hero_image": "https://images.luxuryescapes.com/z3qz8bm878q8e6b87z3w",
    "image_two": "https://images.luxuryescapes.com/1lzwev2m4u8a5tuaffot",
    "image_three": "https://images.luxuryescapes.com/hlrabgx2aj0juzpghfl",
    "vendor_name": "Inn & Grand at Bedford Village",
    "title": "Charming New Hampshire Stay in Historic Farm House with Pool, Five Restaurants & Day Spa",
    "description": "Leave the city behind and wander to a place where the grass is green and the wine is flowing, with a luxurious stay at The Bedford Village Inn and Grand Boutique Hotel, just an hour from Boston. Spanning a stunning 10-acre Southern New Hampshire estate, a multi-million-dollar restoration transformed this 1800s farmstead into the relaxing country-chic haven it is today. Each of the property’s five acclaimed dining destinations champions New England produce in a relaxed environment. Find your place in history while enjoying a glass of regional wine in the Tavern, or relaxing in your sumptuous suite, surrounded by lush woodlands.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New Hampshire",
    "offer_geo_area_level_2": "Bedford",
    "location_heading": "New Hampshire",
    "location_subheading": "United States",
    "location_description": "The Grand at the Bedford Village Inn",
    "offer_address": "12 Olde Bedford Way, Bedford, New Hampshire 03110, United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]