[
  {
    "link": "https://luxuryescapes.com/offer/0062800000Oesx8AAB",
    "hero_image": "https://images.luxuryescapes.com/gov8jvj3vmarilrrrtwu",
    "image_two": "https://images.luxuryescapes.com/lc2wgbwiowzaxzruejp3",
    "image_three": "https://images.luxuryescapes.com/gqywjxs4sxcd4i0ihczv",
    "vendor_name": "Omni Berkshire Place",
    "title": "Urban Escape in the Heart of Manhattan",
    "description": "Wake up above Manhattan’s pulsing Madison Avenue and experience the vibrancy of the liveliest city in the world with a luxury stay in the heart of New York City’s Midtown-a stone’s throw from the city’s best attractions. Only a few minutes’ walk from the luxury boutiques of Fifth Avenue, the famous Rockefeller Plaza, the stunning Central Park, Times Square and so much more, you’ll spend three nights in a spacious Deluxe Room with daily American breakfast, discovering all that New York has to offer.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Omni Berkshire Place",
    "offer_address": "21 E 52nd St, New York, NY 10022, USA",
    "percentage_discount": 24.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 784.0,
    "value": 1038.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Ht4wIAC",
    "hero_image": "https://images.luxuryescapes.com/mwh0i2uczmx8mjxz63g7",
    "image_two": "https://images.luxuryescapes.com/ekc1kriqxfv94fx4i0x",
    "image_three": "https://images.luxuryescapes.com/lv98fh8lo8nwxx7l9vyb",
    "vendor_name": "70 Park Avenue New York",
    "title": "Chic New York Escape in the Heart of Manhattan with Welcome Bottle of Wine & Starbucks Gift Card",
    "description": "Set on a serene tree-lined stretch of Park Avenue, this perfectly appointed hotel is the ultimate boutique escape from the usually bustling Midtown area.\n\nMost of the best attractions, including shopping and dining, are within steps of your hotel lobby. Nearby, you can visit the Empire State Building, Grand Central Station, Times Square, the Broadway Theatre District, Bryant Park, Central Park and Rockefeller Center.\n\nTruly experience what it’s like to live in the city that never sleeps by hopping from one Michelin-starred restaurant to the next before lining up for the latest Broadway show and catching the subway home. After running around the city, seeing the sights and feasting on world-class cuisines, return to this sophisticated hotel to unwind.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "70 Park Avenue Hotel",
    "offer_address": "70 Park Avenue, New York City, New York 10016, USA",
    "percentage_discount": 55.0,
    "min_duration": 4,
    "max_duration": 26,
    "price": 869.0,
    "value": 1943.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Dk2AdYAJ",
    "hero_image": "https://images.luxuryescapes.com/7h76baam2czeot9npcuu",
    "image_two": "https://images.luxuryescapes.com/c319ysjpqcq8bgb3oquo",
    "image_three": "https://images.luxuryescapes.com/2douy2i8e1i5kp9v33",
    "vendor_name": "Le Meridien New York Central Park",
    "title": "Stylish Manhattan City Break near Central Park with Daily US$40 Food & Drink Credit",
    "description": "Experience the magic of Midtown Manhattan at this ultra-swanky hotel on the doorstep of Central Park. From this unbeatable location, iconic landmarks like Times Square, Rockefeller Center, the Museum of Modern Art and Columbus Circle will be your neighbours during your stay.\n\nAfter days discovering The Big Apple, savour seasonal dishes with American flare at Le Jardin while looking through the floor-to-ceiling windows above Manhattan’s streets. When the sun falls, head up to the rooftop bar for exclusive events and city skyline views plucked from a movie.\n\nEvery detail is finely curated to echo New York’s urban sophistication, with leather, marble and timber touches in each room. Consider Le Méridien New York, Central Park your luxe launchpad for exploring The City That Never Sleeps.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Le Méridien New York, Central Park",
    "offer_address": "120 West 57th Street, New York, New York 10019, United States",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1879.0,
    "value": 4735.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Hd4UIAS",
    "hero_image": "https://images.luxuryescapes.com/5ucd7vilgqeg1bv1a4s7",
    "image_two": "https://images.luxuryescapes.com/anh4m6zeboc52c6cge38",
    "image_three": "https://images.luxuryescapes.com/d8hcyoqy1pgpsaouvukj",
    "vendor_name": "The Knickerbocker New York",
    "title": "Legendary New York Luxury Retreat in Times Square with Rooftop Bar & Guaranteed Deluxe Room Upgrade",
    "description": "Timeless sophistication and style meet with the boundless energy of Times Square at this five-star Manhattan treasure, placing you just moments from Broadway and Bryant Park, Radio City Music Hall, the Rockefeller Center and more. Originally constructed in 1906, this landmark building has played host to legendary figures over the years - including The Great Gatsby author F. Scott Fitzgerald, who met his wife Zelda at the hotel.\n\nEach of the 330 guestrooms hidden behind the hotel’s grand 16-story Beaux Arts-style facade exudes a quiet calm. Bespoke furnishings, richly textured fabrics, oak wood finishes, plush bedding, state-of-the-art technologies and Diptyque bath amenities create a tranquil haven away from the high-octane energy of bustling New York below.\n\nLegend has it the Knickerbocker created the first ever 'dry martini' and celebrates this history in its Martini Masterclass series. Guests can expect this and other impeccable offerings, like panoramic views from St. Cloud rooftop bar, a 24-hour fitness centre with a yoga and Pilates zone and the newest steakhouse from the award-winning Charlie Palmer family.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "The Knickerbocker New York",
    "offer_address": "6 Times Square, New York, New York 10036, United States",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 929.0,
    "value": 2597.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdPPqAAN",
    "hero_image": "https://images.luxuryescapes.com/n0gi166k1scxg293x6w",
    "image_two": "https://images.luxuryescapes.com/gn57f1crzwsqdbjlif9s",
    "image_three": "https://images.luxuryescapes.com/p961kp414sti30gx5ei",
    "vendor_name": "Romer Hells Kitchen",
    "title": "Sophisticated New York City Stay One Block from Broadway with Piano Bar & Hell’s Kitchen Neighborhood Café",
    "description": "Quintessential New York sophistication is what to expect with a stay in this hotel just west of Broadway, nestled in the heart of one of the city's most dynamic neighbourhoods, where culinary delights, Broadway theatres and the sparkling lights of Times Square collide.\n\nDine at the hotel's signature restaurant, offering an innovative menu inspired by the local food scene, or retreat to your room, styled to encapsulate the essence of New York sophistication. Begin the day with a stroll through SoHo's streets, exploring its high-end boutiques and trendy cafes. Head over to Tribeca for a blend of historic architecture and modern art galleries, and take to the skies at the Empire State Building for breathtaking views from the observation deck.\n\nFor a culinary adventure, savour diverse dining options, from upscale restaurants to cozy bistros. In the evening, enjoy a Broadway show in the nearby Theatre District, brimming with life.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Romer Hell's Kitchen",
    "offer_address": "851 8th Avenue, New York, New York 10019, United States",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 609.0,
    "value": 1891.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LgtXAAS",
    "hero_image": "https://images.luxuryescapes.com/c8vj4dyyf9f06r4p3s8n",
    "image_two": "https://images.luxuryescapes.com/o7va87pxlgkdtc482sdw",
    "image_three": "https://images.luxuryescapes.com/nboe7s54gcbbb4iutali",
    "vendor_name": "Minthouse at 70 Pine",
    "title": "New York Art Deco Elegance near Wall Street",
    "description": "Discover 1930s grandeur and elegance in the architectural darling of New York City at the glamorous Lyric™ at 70 Pine New York. Elegantly refurbished, this stylish hotel pays homage to its 1932 roots in the Cities Service Building - once the third-tallest building in the world - and is only a short walk from Wall Street, the Statue of Liberty Viewpoint and the Brooklyn Bridge. Enjoy a guaranteed upgrade to a premium Studio Plus Room, US$30 food and drinks credit to use at the onsite City Acres Market deli, guaranteed 2:30pm late checkout, a welcome gift of chocolate, chips, a Lyric™ fabric tote bag and bottled water, plus amenities including daily gym access and Wi-Fi.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Lyric™ at 70 Pine New York",
    "offer_address": "70 Pine St, New York, NY 10005, United States",
    "percentage_discount": 68.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 299.0,
    "value": 941.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DHbLOAA1",
    "hero_image": "https://images.luxuryescapes.com/qi2vca4s6h2tjo4vvk",
    "image_two": "https://images.luxuryescapes.com/6r83u9fqir568dlvtzz",
    "image_three": "https://images.luxuryescapes.com/ktd6vjqn7htr9pzt39xq",
    "vendor_name": "Thompson Central Park New York",
    "title": "New York City Five-Star Central Park Retreat with Residence Lounge Access & Waived Destination Fees",
    "description": "Classic mid-century splendour in the heart of Manhattan awaits with a five-star stay at Thompson Central Park New York, a vivid slice of sophisticated Americana boasting unmatched views over the world’s most spectacular stretch of urban green. There's simply no better location - iconic sights Carnegie Hall, the Museum of Modern Art and the Rockefeller Centre are all just a short hop away, and midtown’s legendary fine dining and bar scene promises epicurean adventures beyond compare. After days spent cosying up to the Statue of Liberty or walking Central Park’s elm-lined paths, return to Parker’s for barrel-aged manhattans and live jazz, or seek out the secretive Burger Joint for a taste of one of New York’s most acclaimed sandwiches.\n\nEmbrace Thompson Central Park New York’s unique spirit of off-beat luxury as you explore its dazzling range of top-shelf facilities - audiophiles especially will love the unique soundscapes on offer in the hotel's exclusive Victrola vinyl listening room. Each spacious high-floor suite boasts cool colourways, bebop-inspired decor and a dazzling collection of luxe amenities for a truly sophisticated city retreat - the perfect launchpad to the city that never sleeps.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Thompson Central Park New York",
    "offer_address": "119 West 56th Street, New York, New York 10019, United States",
    "percentage_discount": 38.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 2479.0,
    "value": 4018.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cpXD5QAM",
    "hero_image": "https://images.luxuryescapes.com/fitljwrk4g57xwuvi3ad",
    "image_two": "https://images.luxuryescapes.com/14fuu3hqiltmp65rnsrb",
    "image_three": "https://images.luxuryescapes.com/snl19n45lp01lghaep3cj",
    "vendor_name": "Hyatt Grand Central New York",
    "title": "Experience Elevated Luxury in Midtown Manhattan",
    "description": "Treat yourself to famed luxury above Manhattan's bustling avenues and watch the vibrant streets of the world’s liveliest city with a luxury stay in the heart of New York City’s Midtown-a stone’s throw from the city's best attractions and Time Square. Only a few minutes’ walk from the luxury boutiques of Fifth Avenue, luxe apartment blocks of Park Avenue, stunning Central Park, unique ceiling mural of Grand Central Terminal and so much more; you’ll enjoy a seven or nine-night stay with daily food & beverage credits to share, an audio tour of Grand Central Terminal, a VIP Passport to Macy's New York, discounts on city sightseeing experiences and more as you discover the incredible art, culture and gastronomy that New York has to offer. Plus, buy now and travel until March 2021!",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Hyatt Grand Central New York",
    "offer_address": "109 East 42nd Street, New York, New York 10017, United States",
    "percentage_discount": 56.0,
    "min_duration": 7,
    "max_duration": 9,
    "price": 1117.0,
    "value": 2541.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ELAE1YAP",
    "hero_image": "https://images.luxuryescapes.com/ghrxzgwh3f9z46jackrb",
    "image_two": "https://images.luxuryescapes.com/99v5th0jaduuediu00m",
    "image_three": "https://images.luxuryescapes.com/qvq4eixbx4dayxxtonp",
    "vendor_name": "Dream Downtown New York",
    "title": "Lower Manhattan Elegance with Daily Breakfast Credit & Nightly Cocktails",
    "description": "New York City dreams come to life with an elegant stay in downtown Manhattan. A modernist masterpiece, Dream Downtown, by Hyatt makes an unforgettable first impression with its striking stainless steel façade punctuated by distinctive porthole windows - a creative nod to the building’s former life as the National Maritime Union headquarters.\n\nBoasting a glamorous Beach Club with a heated glass-bottom pool (open during summer months), a rooftop bar with skyline views and an elegant cocktail bar, embrace the vibrancy of the city that never sleeps. The onsite restaurant Philippe Downtown serves standout Chinese cuisine like crispy Peking duck, Beijing chicken and lobster fried rice.\n\nAt the crossroads of New York City’s most iconic neighbourhoods, Chelsea and the Meatpacking District, endless adventure awaits.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Dream Downtown, by Hyatt",
    "offer_address": "355 West 16th Street, New York City, New York 10011, United States",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 19,
    "price": 879.0,
    "value": 2389.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C2I6ZAAV",
    "hero_image": "https://images.luxuryescapes.com/x9g86mi5tiubc1en0d3d",
    "image_two": "https://images.luxuryescapes.com/kpcctzdmfqv8pis1jzmv",
    "image_three": "https://images.luxuryescapes.com/us899bd86tj8z04x27t",
    "vendor_name": "70 Park Avenue New York",
    "title": "Chic New York Escape in the Heart of Manhattan with City Views & Starbucks Gift Card",
    "description": "New York, New York! The land of the free, the inspired and the utterly stylish - stay among it all in true Manhattan fashion at the chic Iberostar 70 Park Avenue. Nestled along the iconic Park Avenue, famous for its prestigious, notable and affluent reputation among New Yorkers, and easily within walking distance to the city’s most notorious landmarks - including Central Park, the Empire State Building and Madison Square Garden - you will not find a more perfectly located hotel. Live out your New York dreams as you join the hustle and bustle of this thriving metropolis, ducking into Starbucks for a Grande Caramel Frappuccino, grabbing a bagel to go and rubbing shoulders with the fashionistas at Saks Fifth Avenue and Bloomingdale’s.\n\nTruly experience what it’s like to live in the city that never sleeps by hopping from one Michelin-starred restaurant to the next before lining up for the latest Broadway show and catching the subway home. After running around the city, seeing the sights and feasting on world-class cuisines, return to this sophisticated hotel to unwind in bed or enjoy a soak in the deep bathtub, or take advantage of your free time to keep up with your fitnes routine at the well-appointed onsite gymnasium.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Iberostar 70 Park Avenue",
    "offer_address": "70 Park Avenue, New York, New York 10016, United States",
    "percentage_discount": 42.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 1061.0,
    "value": 1824.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HanIBYAZ",
    "hero_image": "https://images.luxuryescapes.com/jpwe2sohv854ex3fzu5",
    "image_two": "https://images.luxuryescapes.com/6f41pjpgzsza0f088ryn",
    "image_three": "https://images.luxuryescapes.com/qks1ay73o2nl99wob2a",
    "vendor_name": "Innside by Melia New York",
    "title": "New York Glamour: Manhattan Escape near Empire State Building & Madison Square Garden with City Views",
    "description": "INNSiDE New York NoMad is where bold design meets big-city buzz and NYC culture meets comfort. Sleek interiors meet warm hospitality in this architectural marvel on West 27th Street - expect larger-than-life windows, smart tech touches and laid-back vibes in the heart of Manhattan. Here, every stay becomes a story worth telling.\n\nFuel up at The Wilson restaurant, or cool off in the Rose Garden Patio, where craft cocktails compete with panoramic views for your attention. Sweat it out in the state-of-the-art fitness centre overlooking downtown Manhattan before unwinding in rooms that redefine urban comfort.\n\nStep outside and find yourself smack bang in the NoMad district. Madison Square Park, the Empire State Building and Fifth Avenue shopping are all just a New York minute away. Surrounded by trendy eateries, hidden speakeasies and cultural landmarks, you're positioned to discover the authentic Big Apple that even locals rave about.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "INNSiDE New York NoMad",
    "offer_address": "132 West 27th Street, New York 10001, United States",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 1029.0,
    "value": 2794.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VDbwAAG",
    "hero_image": "https://images.luxuryescapes.com/7a4xb0t6mzuh5docm25",
    "image_two": "https://images.luxuryescapes.com/yco7oiipwu500vhk33e",
    "image_three": "https://images.luxuryescapes.com/ha2jbshv2rg5rg071yiu",
    "vendor_name": "NH Collection New York Madison Avenue",
    "title": "Midtown New York Heritage Stay Steps from Empire State Building",
    "description": "The glittering lights and buzzing streets of the city that never sleeps are yours to explore from NH Collection New York Madison Avenue. Boasting an unbeatable location in the heart of Midtown Manhattan, this elegant hotel is the ultimate base from which to discover the world-famous sights of the Big Apple - with the Empire State Building, Grand Central Station and Times Square all within walking distance.\n\nSituated in a 100-year-old heritage building that has been freshly renovated, the hotel is an effortless mix of historic charm and contemporary comfort, with stylish interiors inspired by Madison Avenue’s golden age of advertising. Return after busy days exploring to warm and inviting rooms complete with Nespresso coffee machines, rest your feet with a handcrafted cocktail in hand at the bar, read a book beside the fireplace or unwind with a gourmet tea amid the dark wood of the elegant Suite & Tea.\n\n**Your handpicked inclusions:**\n\n- Prepare for busy days in the city with daily grab’n’go breakfast\n- Be welcomed to the city in style with a complimentary drink each on arrival\n- Make the most of your stay with late 3pm checkout (subject to availability)\n\n**Want to make your stay extra special?** Upgrade to a room with city skyline views or a spacious Junior Suite.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "NH Collection New York Madison Avenue",
    "offer_address": "22 E 38th Street, New York, New York 10016, United States",
    "percentage_discount": 16.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 620.0,
    "value": 735.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ERDqkYAH",
    "hero_image": "https://images.luxuryescapes.com/p6qpfgddgf1diya0p8",
    "image_two": "https://images.luxuryescapes.com/ic4l8qgnskl05nj8dtmb",
    "image_three": "https://images.luxuryescapes.com/5u4ay9mtkg6p282lsmwrq",
    "vendor_name": "Hilton New York Times Square",
    "title": "Contemporary NYC Times Square Escape with Daily Breakfast & Nightly Cocktails",
    "description": "Experience the vibrant pulse of the Big Apple with a stay at this newly renovated hotel, perfectly positioned in the heart of the city's most famous district. This property recently completed a US$20 million renovation, featuring a redesigned lobby, 15th-floor Sky Lobby and three new dining outlets.\n\nFrom this central location, you're just a short stroll from Broadway's glittering theatres, dazzling lights of Times Square and world-renowned shopping of Fifth Avenue. Venture beyond the hotel to discover Central Park's verdant oasis, the towering Empire State Building and Rockefeller Center, and inspiring exhibits of The Museum of Modern Art (MoMA), all within easy reach.\n\nFor a taste of local culture, explore the eclectic eateries and boutiques of nearby Hell's Kitchen. After a day of urban exploration, retreat to the hotel's chic elevated skyline view 42nd And Sky,  where you can sip on expertly crafted cocktails while taking in mesmerising cityscape views.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Hilton New York Times Square",
    "offer_address": "234 West 42nd Street, New York, New York 10036, United States",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 1689.0,
    "value": 3361.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcdFoAAJ",
    "hero_image": "https://images.luxuryescapes.com/rqu8zunndeplbvysdz8o",
    "image_two": "https://images.luxuryescapes.com/ikboswbwbdnmyewmt4pc",
    "image_three": "https://images.luxuryescapes.com/8shgegb26lq13o4irzl",
    "vendor_name": "Arthouse Hotel New York City",
    "title": "Boutique New York City Upper West Side Stay near Central Park with Trendy Bar & Daily Breakfast",
    "description": "Live like a New York local with a stay at this charming retreat, located in the heart of the Upper West Side. Just minutes from the iconic Central Park and set in a cosy neighbourhood, Arthouse Hotel New York City is ideal for those looking to wander the city by foot, broaden their knowledge of Manhattan, and feel at home in the city that never sleeps.\n\nWhen you're not out exploring the city's famous foodie scene, from gourmet food trucks to Michelin-starred restaurants, return to the welcome arms of Arthouse’s own dining spots. Try a tipple at the Prohibition-inspired Arthouse Bar, where local talent frequently take the stage. Taste vibrant Northern Italian and freshly baked pizza at Serafina Upper West and savour inventive Chinese and super-charged dim sum at Redfarm.\n\nGrab a fresh pastry and coffee from the hotel's in-house French-inspired bakery, Patis Bakery, before exploring the Big Apple. A stay here means you'll be within walking distance to a variety of the city's most loved attractions, encompassing everything from Lincoln Square to Harlem Market.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Arthouse Hotel New York City",
    "offer_address": "2178 Broadway, New York, New York 10024, United States",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 679.0,
    "value": 1165.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gh6uZAAR",
    "hero_image": "https://images.luxuryescapes.com/6ht3jrvd95gbjf6vbl8s",
    "image_two": "https://images.luxuryescapes.com/e8s8ajvwxn9hwh8iabo",
    "image_three": "https://images.luxuryescapes.com/vcwksuzmlrvchjj507u5",
    "vendor_name": "Thompson Central Park New York",
    "title": "New York City Sky-High Central Park Retreat with Daily Breakfast & Lounge Access",
    "description": "Classic mid-century splendour in the heart of Manhattan awaits with a five-star stay at Thompson Central Park New York, a vivid slice of sophisticated Americana boasting unmatched views over the world’s most spectacular stretch of urban green. There's simply no better location -  the iconic sights of the Museum of Modern Art and the Rockefeller Centre are all just a short hop away, and midtown’s legendary fine dining and bar scene promises epicurean adventures beyond compare. After days spent cosying up to the Statue of Liberty or walking Central Park’s elm-lined paths, return to Parker’s for barrel-aged manhattans and live jazz, or seek out the secretive Burger Joint for a taste of one of New York’s most acclaimed sandwiches.\n\nEmbrace Thompson Central Park New York’s unique spirit of off-beat luxury as you explore its dazzling range of top-shelf facilities - audiophiles especially will love the unique soundscapes on offer in the hotel's exclusive Victrola vinyl listening room. Each spacious high-floor suite boasts cool colourways, bebop-inspired decor and a dazzling collection of luxe amenities for a truly sophisticated city retreat - the perfect launchpad to the city that never sleeps.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Thompson Central Park New York",
    "offer_address": "119 West 56th Street, New York, New York 10019, United States",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 1533.0,
    "value": 2823.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IiS5IAK",
    "hero_image": "https://images.luxuryescapes.com/063zeat9odshykhmakb",
    "image_two": "https://images.luxuryescapes.com/k2xtgrutp4a2ozvxjwl",
    "image_three": "https://images.luxuryescapes.com/8qkvth795m85ltoqsgz5",
    "vendor_name": "NoMo Soho Hotel New York",
    "title": "Boutique New York City Glamour in Soho with Rooftop Terrace",
    "description": "Embrace the glitz and glam of the Big Apple from this boutique retreat, perfectly channelling the aura of vintage nostalgia and cutting-edge modernity in vibrant SoHo.\n\nEnveloped by the creative culture of Crosby Street, this upscale hotel boasts a prime location in one of New York City’s most thriving, artistic neighbourhoods, renowned for fashionable boutiques, art galleries, high-end restaurants and modern aesthetics.\n\nWind down with refreshing drinks at the Rose Garden, tuck into a spread of globally-influenced seasonal New American fare at NoMo Kitchen or work up a sweat at the exceptional fitness centre.\n\nLater, step out to explore the nearby boutiques, take a short stroll along cobblestone streets to Chinatown to sample the best dim sums, roam around Little Italy relishing epic cannolis and shop till you drop at Canal Street.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "NoMo Soho Hotel New York",
    "offer_address": "9 Crosby Street, New York, New York 10013, United States",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 669.0,
    "value": 1550.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lr2dAAC",
    "hero_image": "https://images.luxuryescapes.com/0u6q2omocupafqdf252",
    "image_two": "https://images.luxuryescapes.com/uv7a47748v1kg7ng660l",
    "image_three": "https://images.luxuryescapes.com/8i0hv7tha8g03uv1w9aa",
    "vendor_name": "James Nomad",
    "title": "Boutique New York City Escape with Daily Breakfast & Cocktails",
    "description": "Treat yourself to an exciting escape above Manhattan's bustling avenues at The James New York - NoMad, an ultra-cool boutique hotel concealed in the wrapper of a beautiful Beaux-Arts structure in the heart of Midtown Manhattan. This urban retreat will take you minutes from New York's best attractions: feel the pulse of the world’s liveliest city as you discover Times Square, the boutiques of Fifth Avenue, the luxe apartment blocks of Park Avenue, stunning Central Park and so much more.\n\nYour city escape includes daily continental breakfast, a nightly cocktail per person, a daily amenity fee (including a welcome wellness kit, unlimited nationwide calls, Wi-Fi and a US$10 daily minibar credit) and a leisurely late 2pm checkout.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "The James New York - NoMad",
    "offer_address": "22 E 29th St, New York, NY 10016, United States",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 368.0,
    "value": 937.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002JNY1IAO",
    "hero_image": "https://images.luxuryescapes.com/uzerf6e5luf62aa12og",
    "image_two": "https://images.luxuryescapes.com/shwsnvpa4515j8nzojw",
    "image_three": "https://images.luxuryescapes.com/ssitpeztvbs1w258941s",
    "vendor_name": "Arthouse Hotel New York City",
    "title": "Manhattan Upper West Side Boutique Stay near Central Park with Vibrant Onsite Bar & Daily Breakfast",
    "description": "Live like a true New Yorker with a stay at this charming retreat, located in the heart of the Upper West Side. Just minutes from Central Park and set in a cosy neighbourhood, Arthouse Hotel New York City is ideal for those looking to wander the city by foot, broaden their knowledge of Manhattan and feel at home in the city that never sleeps.\n\nWhen you're not out exploring the city's famous foodie scene, from gourmet food trucks to Michelin-starred restaurants, return to the welcome arms of Arthouse’s own in-house dining. Try a tipple at the Prohibition-inspired Arthouse Bar, taste vibrant Northern Italian dishes and freshly baked pizza at Serafina Upper West and savour inventive Chinese and super-charged dim sum at Redfarm.\n\nGrab a fresh pastry and coffee from the French-inspired Patis Bakery before exploring the Big Apple. A stay at Arthouse means you'll be within walking distance of a variety of New York's most loved attractions, from Lincoln Square to Harlem Market.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Arthouse Hotel New York City",
    "offer_address": "2178 Broadway, New York, New York 10024, United States",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 689.0,
    "value": 1299.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Gyz4DYAR",
    "hero_image": "https://images.luxuryescapes.com/e9wpsmlkq5hvbjbwoxjf",
    "image_two": "https://images.luxuryescapes.com/5qv62jf6cnywfbyf3uc7",
    "image_three": "https://images.luxuryescapes.com/yvp321pfwztnfrzpt2tll",
    "vendor_name": "Walker Hotel Tribeca",
    "title": "New York Tribeca City Break with Daily Breakfast, Nightly Cocktails & US$100 Dining Credit",
    "description": "Step into the vibrant energy of New York City at this chic hotel - once a ribbon factory, now a beautifully reimagined urban retreat. The space blends industrial heritage with contemporary sophistication, featuring curated interiors, warm tones and thoughtful design details that nod to its storied past.\n\nPerfectly positioned in the heart of Tribeca, the hotel is surrounded by the neighbourhood's renowned art galleries, boutique shops and celebrated dining spots. It's also just a short walk from the eclectic streets of Soho, the historic charm of the West Village and the dynamic pulse of the Financial District.\n\nStart your day with a freshly brewed coffee from Blue Bottle, savour vibrant Mediterranean flavours at the acclaimed Mostrador, sip handcrafted cocktails with sweeping skyline views at The Flower Shop Rooftop or wind down to live music in the moody, intimate setting of Saint Tuesday. After a day of exploration, retreat to your room with plush comforts and cityscape views.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Walker Hotel Tribeca",
    "offer_address": "77 Walker Street, New York City, New York 10013, United States",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 19,
    "price": 839.0,
    "value": 1594.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GfydJAAR",
    "hero_image": "https://images.luxuryescapes.com/whwogpcufhbqyf759nnq",
    "image_two": "https://images.luxuryescapes.com/vivys9gv9embcjw7wfr9",
    "image_three": "https://images.luxuryescapes.com/xsn00bv5tcmz899eddq",
    "vendor_name": "Hyatt Grand Central New York",
    "title": "Sophisticated Midtown Manhattan Hyatt Escape with Daily Buffet Breakfast",
    "description": "Elevate your New York experience with a stay in this modern sanctuary of luxury ensconced within a romantic stone-columned façade in the pulsating heart of Midtown.  Simply step out of the door to soak in the ambience of this storied city, with innovative restaurants, under-the-radar galleries and vibrant marketplaces on your doorstep. \n\nOnly a few minutes' walk from the luxury boutiques of Fifth Avenue, stunning Central Park, and the unique ceiling mural of Grand Central Station, the hotel's premier location positions you to explore with ease. Between adventures, rejuvenate body and mind at the 24-hour fitness centre, refuel at the onsite New York Central Restaurant & Bar or grab a bite on the go at The Market. \n\nNew York may be the City That Never Sleeps, but these gracious guestrooms guarantee a restful slumber. Sink into cloud-like bedding in your generously sized room, a tranquil retreat from the lively streets, and people-watch through your light-flooded picture windows.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Hyatt Grand Central New York",
    "offer_address": "109 East 42nd Street, New York, New York 10017, United States",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 599.0,
    "value": 1673.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I8HVIA0",
    "hero_image": "https://images.luxuryescapes.com/857pvtxkgd3o2qb2inx6",
    "image_two": "https://images.luxuryescapes.com/9ilc609txk65ohty3qfc",
    "image_three": "https://images.luxuryescapes.com/4gkb94l0qztlpg69vz9",
    "vendor_name": "M Social Hotel Times Square New York",
    "title": "Contemporary New York Escape near Broadway with Nightly Cocktails & Late Checkout",
    "description": "Find yourself in the buzzing heart of the Big Apple with a chic stay at this urban sanctuary encased by the dazzling lights and vibrant spirit of Times Square.\n\nTake advantage of your hotel's prime location in central Manhattan and immerse yourself in New York's electric atmosphere, Broadway's glittering theatres, the lush greenery of Central Park and the high-end boutiques of Fifth Avenue, all mere moments from the property. You really can't be better located to take advantage of everything New York has to offer.\n\nAfter taking in the eclectic charms of the city that never sleeps, unwind in your well-appointed room and tuck into world cuisine delicacies at the signature Beast & Butterflies restaurant while sipping on epic cocktails, all paired with spectacular city views.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "M Social Hotel New York Times Square",
    "offer_address": "226 W 52nd Street, New York 10019, United States",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 579.0,
    "value": 1213.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J4P1IAK",
    "hero_image": "https://images.luxuryescapes.com/h3li6d0rin1hh9tbgff",
    "image_two": "https://images.luxuryescapes.com/66213mgvlqjqjn11ahza",
    "image_three": "https://images.luxuryescapes.com/t9d2u2fklld8c4xdficb",
    "vendor_name": "NH Collection New York Madison Avenue",
    "title": "Midtown Manhattan Stay Minutes from Empire State Building & Times Square with Daily Breakfast",
    "description": "The glittering lights and concrete jungle of the city that never sleeps are all yours to explore from this elegant hotel. With the Empire State Building, Grand Central Station and Times Square all within walking distance, this is the ultimate launch pad for discovering the Big Apple.\n\nSituated in a beautifully restored century-old heritage building, NH Collection New York Madison Avenue is an effortless mix of old-world charm and contemporary comfort. After a day wandering through Central Park, hailing yellow cabs or shopping on Fifth Avenue, return to the hotel’s onsite Italian restaurant, Serafina, for signature woodfired pizza.\n\nLater, savour a nightcap at the ultra-swanky MAD Bar & Lounge or read a book by the fireplace before retreating to your private oasis.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "NH Collection New York Madison Avenue",
    "offer_address": "22 E 38th Street, New York, New York 10016, United States",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 759.0,
    "value": 1420.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J1BYIA0",
    "hero_image": "https://images.luxuryescapes.com/3u8u3hgmyr5z5fpuomkp",
    "image_two": "https://images.luxuryescapes.com/98atoe8su7ugxlyad0g",
    "image_three": "https://images.luxuryescapes.com/zsue9a6s8fi2yfq1xrq",
    "vendor_name": "Walker Hotel Tribeca",
    "title": "New York City Stay in Trendy Tribeca with Daily Breakfast, US$100 Dining Credit & Nightly Cocktails",
    "description": "Step into the vibrant energy of New York City at this chic hotel, once a ribbon factory now transformed with a contemporary twist. Drawing inspiration from the distinctive character of Tribeca and the golden age of New York, the hotel buzzes with a lively atmosphere and offers a diverse range of dining experiences.\n\nSavour Mediterranean cuisine at Mostrador, kick-start your day with a Blue Bottle coffee and wind down at the stylish Saint Tuesday bar, where live music and expertly mixed cocktails create the ideal ambience.\n\nConveniently located near Tribeca's famed art galleries, boutiques and world-class restaurants, as well as cultural landmarks like Little Italy and Chinatown, this hotel provides an authentic slice of New York life. After a day of exploration, retreat to your cozy, timeless room to recharge for your next urban adventure.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Walker Hotel Tribeca",
    "offer_address": "77 Walker Street, New York City, New York 10013, United States",
    "percentage_discount": 71.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 549.0,
    "value": 1904.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IFbGIAW",
    "hero_image": "https://images.luxuryescapes.com/yp23sitzvov0a3lf22s",
    "image_two": "https://images.luxuryescapes.com/btv6iush78a3uulxe4wl",
    "image_three": "https://images.luxuryescapes.com/dney98s3hyeu0re0bjp",
    "vendor_name": "Hilton Garden Inn New York/Central Park South-Midtown West",
    "title": "Stylish New York City Stay near Central Park with Nightly Drinks & US$50 Dining Credit",
    "description": "Fall for Manhattan’s magic with a sophisticated stay at the heart of the Big Apple. Expect top-tier service in an unbeatable location, within walking distance from beloved sights like Central Park, Times Square and the Rockefeller Center.\n\nAfter days spent sightseeing or seeking retail therapy, savour in-room snacks as you watch the city skyline twinkle from the comfort of your elegant room. Take advantage of the Empire Steak House's flavourful fare, serving prime-cut steaks and seafood in true New York style. Boasting a 24-hour fitness centre and unparalleled city views, this is more than just a place to rest - it’s your gateway to the city that never sleeps.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Hilton Garden Inn New York/Central Park South-Midtown West",
    "offer_address": "237 West 54th Street, New York 10019, United States",
    "percentage_discount": 69.0,
    "min_duration": 5,
    "max_duration": 19,
    "price": 739.0,
    "value": 2379.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgI0XQAU",
    "hero_image": "https://images.luxuryescapes.com/j279ouvebprqicnxyr95",
    "image_two": "https://images.luxuryescapes.com/f5w8cmbqq2d36r34sm",
    "image_three": "https://images.luxuryescapes.com/7bkw2t71d98you2rjj8",
    "vendor_name": "The Beekman, A Thompson Hotel",
    "title": "Old-World Glamour & Modern Luxury: Stay at New York’s Number-One Hotel",
    "description": "Discover the glamorous hotel Condé Nast Traveler crowned Best Hotel in New York City for 2019’s Gold List with a stay at The Beekman, A Thompson Hotel. This fabulous property was one of Manhattan’s first skyscrapers and hosted the New York premiere of Shakespeare’s Hamlet. Your stay includes entry for two to The Beekman’s Alley Cat Amateur Theatre, a chic cellar cocktail lounge that hosts live acts and DJ sets. It also includes breakfast on three mornings of your stay at the hotel's signature restaurant, Temple Court, one cocktail per person at Alley Cat and the resort fee which includes benefits such as the hotel's acclaimed Les Clefs d’Or Concierge Service and a luxury courtesy car.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "The Beekman, A Thompson Hotel",
    "offer_address": "123 Nassau St, New York, NY 10038, United States",
    "percentage_discount": 67.0,
    "min_duration": 5,
    "max_duration": 5,
    "price": 1547.0,
    "value": 4627.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dbetrQAA",
    "hero_image": "https://images.luxuryescapes.com/t5ecb2x1tiz1lb8o6sm",
    "image_two": "https://images.luxuryescapes.com/93meif5tbht5sp79l3lj",
    "image_three": "https://images.luxuryescapes.com/dfrfjasozhgess84mm6",
    "vendor_name": "Hotel Park Ave New York",
    "title": "Sophisticated Midtown Manhattan Stay close to the Empire State Building",
    "description": "A fusion of exclusivity and contemporary style, the fashionably bold Mondrian Park Avenue is the perfect choice for those seeking a central oasis amid the bright lights of New York. Located a two-minute walk from the iconic Empire State and Flatiron buildings, the hotel sits at the core of midtown Manhattan and makes it easy to take a bite out of the Big Apple. Witness sweeping skyline vistas from the rooftop lounge, indulge your senses at the award-winning Mediterranean restaurant - Cleo - or simply relax in one of the beautifully designed guest rooms after a day spent exploring.\n\nWith a complimentary upgrade to a plush Deluxe King Room, daily continental breakfast and late checkout until 2pm included, you’re guaranteed some extra sleep in the city that never does.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Mondrian Park Avenue Feb 20",
    "offer_address": "444 Park Ave S, New York, NY 10016, USA",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 311.0,
    "value": 839.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fn9yTAAR",
    "hero_image": "https://images.luxuryescapes.com/1cl6sacfgiumgcag8zj",
    "image_two": "https://images.luxuryescapes.com/tbtyhjo60qpb1csg6gfp",
    "image_three": "https://images.luxuryescapes.com/h5oevxbnlna7ps7canbp",
    "vendor_name": "Park Hyatt New York",
    "title": "Five-Star Hyatt Luxury in the Heart of New York City Only Minutes from Central Park with Daily Breakfast",
    "description": "Experience the epitome of Manhattan sophistication with a stay at Park Hyatt New York, a beacon of contemporary five-star luxury in the heart of the city. This sleek skyscraper retreat is just steps from Central Park, offering unrivalled views of the city skyline. Dine at the upscale Living Room Restaurant & Bar and savour innovative dishes crafted from top-quality ingredients, or sip on expertly mixed cocktails at the chic bar. Look your best with a blow wave from Rossano Ferretti Hair Spa and venture out to explore Fifth Avenue's high-end boutiques, visit the nearby Museum of Modern Art or catch a Broadway show. At the end of the day, retreat to the tranquil Spa Nalai for a rejuvenating treatment or take a dip in the indoor pool, surrounded by floor-to-ceiling windows with breathtaking city views.\n\nManhattan is the ideal location to discover the best of New York City, surrounded by some of the most iconic and recognised landmarks and buildings in the world. Foodies can flock to the city and instantly fall in love with the array of fine-dining restaurants, enjoy a slice of authentic New York pizza, or hunt down the perfect breakfast bagel.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Park Hyatt New York",
    "offer_address": "153 West 57th Street, New York, New York 10019, United States",
    "percentage_discount": 41.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 2199.0,
    "value": 3710.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdHHVAA3",
    "hero_image": "https://images.luxuryescapes.com/xx2hthwvny66vnjv43f",
    "image_two": "https://images.luxuryescapes.com/psvoa8nxagjwuv4yo9gv",
    "image_three": "https://images.luxuryescapes.com/hufnfhdp52a7dwgtzz",
    "vendor_name": "Kimpton Theta",
    "title": "Grand Opening: New York City Midtown Manhattan Glamour Minutes from Times Square & Central Park",
    "description": "For a taste of the glamour in the Big Apple, this sophisticated stay places you right in the centre of Manhattan's magic. Discover the high-energy pulse of Times Square, the grandeur of Broadway and the culinary delights of Hell's Kitchen only steps from your front door. Grab a morning coffee and croissant at Café Otto before making your way out to explore the city of all cities.\n\nWith Central Park, Rockefeller Center and plenty of subway stations within walking distance, this dreamy city stay is the perfect starting point for your next New York adventure. This mid-century-styled boutique oasis offers thoughtfully designed rooms and spaces to relax and unwind adjacent to the endless energy of the city that never sleeps.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Kimpton Theta, an IHG Hotel",
    "offer_address": "790 8th Avenue, New York, New York 10019, United States",
    "percentage_discount": 69.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1029.0,
    "value": 3307.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPEg3AAH",
    "hero_image": "https://images.luxuryescapes.com/do0867aegqwn6qb8csq",
    "image_two": "https://images.luxuryescapes.com/yxcnp5c76mskll2umop",
    "image_three": "https://images.luxuryescapes.com/idpeb6tsfg57d2487iq",
    "vendor_name": "Hyatt Grand Central New York",
    "title": "Sophisticated Midtown Manhattan Escape with Room Upgrade, Waived Resort Fee & Daily Breakfast",
    "description": "Treat yourself to an elevated stay high above Manhattan with a sojourn at the Hyatt Grand Central New York. Behind the romantic stone columns of its facade, you'll find the sleek lines of this modern temple to luxury, which boasts a prime position in the heart of Midtown. Simply step out of the door to soak in the ambience of this storied city, with innovative restaurants, under-the-radar galleries and vibrant marketplaces on your doorstep. Only a few minutes' walk from the luxury boutiques of Fifth Avenue, stunning Central Park, and the unique ceiling mural of Grand Central Station, the hotel's premier location positions you to explore with ease.\n\nNew York may be the City That Never Sleeps, but these gracious guestrooms guarantee a restful slumber. Sink into cloud-like bedding in your generously sized room, a tranquil retreat from the lively streets, and indulge with an in-room massage or people-watch through your light-flooded picture windows. Between adventures, rejuvenate body and mind at the 24-hour fitness centre, refuel at the New York Central restaurant or grab a bite on the go at Market cafe.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Hyatt Grand Central New York",
    "offer_address": "109 East 42nd Street, New York, New York 10017, United States",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 679.0,
    "value": 1450.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CvNUbAAN",
    "hero_image": "https://images.luxuryescapes.com/qr5nzha81e7xy2p5nmnk",
    "image_two": "https://images.luxuryescapes.com/c43vi2bnhuwf7pql4fls",
    "image_three": "https://images.luxuryescapes.com/dvzhymf36fuvemmbq91",
    "vendor_name": "Westhouse Hotel New York",
    "title": "Opulent Midtown Manhattan Retreat with Daily Buffet Breakfast & Waived Resident Fee",
    "description": "Step into the glory of the 1920s with a sumptuous stay at WestHouse New York, a member of the prestigious Small Luxury Hotels of the World, and feel the infectious energy of Midtown Manhattan from your central city escape. Before sundown, head to the Terrace to admire the sunset on the skyline and Hudson River before you uncover New York’s magic for yourself. Known as the crossroads of the world, Midtown is where pictures of the city come alive - people jostle about, Art Deco skyscrapers rise from the ground, and each block offers an enticing invitation to explore.\n\nFuel up for the day as you feast on an indulgently delicious buffet breakfast at the Terrace, drop into the fitness centre and enjoy the use of the Peleton bikes, or hop on a bike and explore the city on two wheels to marvel at Central Park or Times Square.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "WestHouse New York",
    "offer_address": "201 West 55th Street, New York, NY, 10019",
    "percentage_discount": 0.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 1151.0,
    "value": 1.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I76XIAS",
    "hero_image": "https://images.luxuryescapes.com/syxojg90fsgoev8boh37",
    "image_two": "https://images.luxuryescapes.com/un0lb088cf7zvsd4b9",
    "image_three": "https://images.luxuryescapes.com/yvs0m5fcossc1uqqetdj",
    "vendor_name": "Margaritaville Times Square",
    "title": "Midtown Manhattan Island-Inspired Escape with Times Square's Only Rooftop Pool",
    "description": "Experience the magic of New York City from the heart of the Times Square entertainment district with an escape to the island-inspired Margaritaville Resort. After a day exploring the city's countless attractions, including glittering Broadway theatres, the Empire State Building and Central Park, return to the hotel's LandShark Bar & Grill or the tiki bar for a taste of the tropics. Need to cool off? Enjoy a swim in the only rooftop pool in Times Square.\n\nWith its breezy beach-style design and laidback atmosphere, a stay in Margaritaville invites you to set your watch to island time, offering a serene retreat amid the energy of the city that never sleeps. With a year-round heated pool, the vibrant flavors of the Caribbean at onsite signature restaurants and bars and a beachwear boutique and fitness centre, this is your passport to paradise, right in the heart of the city.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Margaritaville Resort Times Square",
    "offer_address": "560 7th Avenue, New York, New York 10018, United States",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 1199.0,
    "value": 2987.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C3VnsAAF",
    "hero_image": "https://images.luxuryescapes.com/pn7e8qt86pcwmyh2q9uh",
    "image_two": "https://images.luxuryescapes.com/2m1bzuueeelj6g5cyvt3",
    "image_three": "https://images.luxuryescapes.com/1jjywsl06hsosk9vppg",
    "vendor_name": "Gild Hall New York",
    "title": "Downtown New York Boutique Luxury with Room Upgrade, Welcome Wine & Daily Breakfast",
    "description": "The glittering lights, neon streets and old-world charm of the city that never sleeps are yours to explore from Gild Hall, a Thompson Hotel. Discover the seemingly endless sights of New York City from this elegant Financial District hotel, which boasts an unbeatable location with the One World Trade Center, Statue of Liberty launch point and Brooklyn Bridge all within walking distance. From this central point, you will be able to explore New York like a true local and get anywhere in the city in under 30 minutes.\n\nFeel the pulse of the world’s liveliest city from this stylish urban retreat. Relax in your generously-sized room, be awed by the collection of Slim Aarons' socialite and celebrity portraits in the hotel's stately lobby, refuel at the sumptuous Tuscan-inspired restaurant and toast to nights in the world's greatest city at the sultry La Soffitta wine bar.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Gild Hall, a Thompson Hotel",
    "offer_address": "15 Gold St New York NY 10038 United States",
    "percentage_discount": 54.0,
    "min_duration": 4,
    "max_duration": 25,
    "price": 1013.0,
    "value": 2211.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dcf8DQAQ",
    "hero_image": "https://images.luxuryescapes.com/glyuzsjhomvg8hp0val",
    "image_two": "https://images.luxuryescapes.com/xk41dpcogdvhp1lctdzr",
    "image_three": "https://images.luxuryescapes.com/eqp2jh8wjdpgdv421jhf",
    "vendor_name": "Mr C Seaport New York",
    "title": "New York Italian-Style Glamour with Daily Breakfast",
    "description": "New York, New York: one of the most exciting cities in the world is on your doorstep at Mr. C Seaport, part of the Leading Hotels of the World collection. This exceptionally stylish boutique hotel is fabulously located Downtown with New York City skyline views, just a short walk from the Statue of Liberty Viewpoint, the Brooklyn Bridge and Wall Street. Enjoy daily breakfast and convenient late checkout at 2pm so you can make the most of your final day in the city.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Mr C. Seaport",
    "offer_address": "33 Peck Slip, New York, NY 10038, United States",
    "percentage_discount": 71.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 371.0,
    "value": 1279.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R9IOcQAN",
    "hero_image": "https://images.luxuryescapes.com/sztjhx8pmlszz3oileuc",
    "image_two": "https://images.luxuryescapes.com/erkqa1q94ylnwqun7iqa",
    "image_three": "https://images.luxuryescapes.com/fuygaxe4wotd1ywjosc5",
    "vendor_name": "Hotel Park Ave New York",
    "title": "Brand new luxury in the heart of Manhattan",
    "description": "Discover the bright lights and famous sights of New York City when you stay at the brand-new Mondrian Park Avenue. Stay five nights and be close to iconic landmarks including Madison Square Park and the Empire State Building, plus receive daily breakfast and a welcome amenity on arrival for two adults.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York County",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Mondrian Park Avenue New York 2019",
    "offer_address": "444 Park Ave S, New York, NY 10016, USA",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 980.0,
    "value": 2182.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GLMgAAO",
    "hero_image": "https://images.luxuryescapes.com/ujh6ydkhaeyo0oskb0er",
    "image_two": "https://images.luxuryescapes.com/1xzhwyjqs56h7lc5rd3",
    "image_three": "https://images.luxuryescapes.com/2pq11fknlga7rgk0qpw7",
    "vendor_name": "Boro Hotel New York",
    "title": "Contemporary New York Escape with Spectacular Manhattan Views",
    "description": "Wake up to sweeping views over New York's iconic skyline with a stay at the ultra-modern Boro Hotel New York, set in the heart of trendy Long Island City, in the lively borough of Queens. Live like a local in one of NYC’s most diverse boroughs, teeming with incredible bars and restaurants, at this industrial-chic hotel. Explore the bustling streets of the city that never sleeps, then retreat to your urban oasis, complete with a striking rooftop bar offering negronis on tap and seasonal cocktails.\n\nA city that’s brimming with cafés, bars that spill out onto the streets, hidden speakeasies, under-the-radar art galleries, and vibrant marketplaces at any given time of the year, the sights of New York City are near never-ending - and you will be perfectly located to make the most of them all. Surrounded by trendy bars and restaurants, and just a short metro ride from New York’s top attractions - world-famous Manhattan is just a 20-minute cab ride away, or a quick 15-minute subway ride (two stops) - Boro Hotel New York is a minimalist retreat offering a collection of beautifully styled rooms with high ceilings, hardwood floors and huge floor-to-ceiling windows with incredible views over the city’s skyline. When you’re not exploring the buzzing dining scene of the Big Apple, the hotel’s restaurant, Beebe's, will satisfy your hunger with authentic NYC pies, pasta and pizza, all accompanied by local beers and handcrafted cocktails.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "Long Island City",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Boro Hotel New York",
    "offer_address": "38-28 27th St, Long Island City, NY 11101, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 125.0,
    "value": 125.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005IwjAAAS",
    "hero_image": "https://images.luxuryescapes.com/18zoth3l97m2dj4na3b",
    "image_two": "https://images.luxuryescapes.com/xknhc9kk58ntv0u3i6j",
    "image_three": "https://images.luxuryescapes.com/n1vta7j6jiaa8z7ya65k",
    "vendor_name": "The Knickerbocker New York",
    "title": "Five-Star New York Sophistication Overlooking Times Square",
    "description": "Timeless sophistication and style meet with the boundless energy of Times Square at The Knickerbocker - a five-star Manhattan treasure that places you just moments from Broadway and Bryant Park, Radio City Music Hall, the Rockefeller Center and more. Originally constructed in 1906, this landmark building has played host to legendary figures over the years - including The Great Gatsby author F. Scott Fitzgerald, who met his wife Zelda at the hotel.\n\nEach of the 330 guestrooms hidden behind the hotel’s grand 16-story beaux arts-style façade exudes a quiet calm. There are bespoke furnishings, richly textured fabrics, oak wood finishes, plush bedding, state-of-the-art technologies and Diptyque bath amenities to create a tranquil haven away from the high-octane energy of bustling New York below. Expect impeccable service, a rooftop bar with panoramic city views, a 24-hour fitness centre with a dedicated yoga and pilates zone, and unforgettable culinary experiences, including Charlie Palmer at The Knick",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "The Knickerbocker New York",
    "offer_address": "6 Times Square, New York, New York 10036, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 214.0,
    "value": 214.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt7RAAR",
    "hero_image": "https://images.luxuryescapes.com/nnez7sts069f60lzzx4",
    "image_two": "https://images.luxuryescapes.com/896ko5mdhp9uz4smelo9",
    "image_three": "https://images.luxuryescapes.com/qwvo1ij2mm2jdk1svxy8",
    "vendor_name": "Intercontinental Hotel New York Times Square",
    "title": "Tranquil Midtown Manhattan Stay near Times Square with Onsite Cocktail Bar",
    "description": "Experience the pulsating heart of the Big Apple with a stay at the InterContinental New York Times Square, an IHG Hotel. Located in the city's Midtown theatre district, this hotel places you at the epicentre of world-class Broadway shows, gourmet dining and high-end shopping. Savour gastronomic delights and craft cocktails at Stinger Cocktail Bar and Kitchen, or venture out to explore the city's iconic landmarks, including Central Park and the Empire State Building just moments away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "InterContinental New York Times Square, an IHG Hotel",
    "offer_address": "300 West 44th Street, New York, New York 10036, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 252.0,
    "value": 252.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CaI7AAK",
    "hero_image": "https://images.luxuryescapes.com/47ka6ggi98wx0fjlsnrm",
    "image_two": "https://images.luxuryescapes.com/sdchw4wz6bjad4mhuncke",
    "image_three": "https://images.luxuryescapes.com/djgh5jsh4hxd661rapid",
    "vendor_name": "Gansevoort Meatpacking",
    "title": "New York City Meatpacking District Escape with Rooftop Pool & Bar",
    "description": "Located in NYC’s culture-rich Meatpacking District, the iconic Gansevoort Meatpacking NYC embodies the neighborhood’s industrial history and buzzing energy. With the completion of a top-to-bottom renovation, the hotel boasts brand-new rooms, multi-bedroom suites, and an exclusive Poliform Penthouse duplex. The newly-transformed rooftop bar and restaurant serve up cocktails and light bites alongside breathtaking Manhattan skyline panoramas, guaranteeing an unforgettable culinary adventure. Dine at the ground-floor Omakase sushi restaurant, Saishin, and feast on innovative Japanese cuisine during your stay. Later, ascend to the rooftop, where the year-round heated swimming pool and terrace is the perfect spot to take a dip while admiring the cityscape. Sweat it out at the state-of-the-art fitness centre, where you'll find a MIRROR workout companion, boxing equipment and Peloton bikes.\n\nThe fresh produce and local art at the famous Chelsea Market are just a three-minute walk from the hotel, as are the glorious views from The High Line, where you can experience art, design and nature in one breathtaking location. You're never too far from your next great bite or tipple, with more restaurants and bars than you can count within walking distance from the hotel.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Gansevoort Meatpacking NYC",
    "offer_address": "18 Ninth Avenue, New York, NY 10014, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 383.0,
    "value": 383.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009F86cAAC",
    "hero_image": "https://images.luxuryescapes.com/q4w84z9thp63d9nwle2w",
    "image_two": "https://images.luxuryescapes.com/2wtwd5cr5rkv6kx24qo",
    "image_three": "https://images.luxuryescapes.com/m2fg8iyro8vwb0bgl71o",
    "vendor_name": "The Standard, East Village",
    "title": "Ultra-Cool New York East Village Escape",
    "description": "Bohemian, boutique and utterly unique, The Standard, East Village, draws on New York’s vibrant creative culture to create a cosy urban hideaway backed by astonishing Manhattan views. Feast your eyes on one-of-a-kind murals splashed across the hotel walls, then head to the buzzing Café Standard or retreat to The Garden for light bites and cocktails. For some downtown ambience, pull up a chair at the ultra-cool and inclusive NO BAR before seeking out the district’s must-see sights.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "The Standard, East Village",
    "offer_address": "25 Cooper Sq, New York, NY 10003, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 298.0,
    "value": 298.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxZkBAAV",
    "hero_image": "https://images.luxuryescapes.com/38s42u8i9kbgtfww6q6d",
    "image_two": "https://images.luxuryescapes.com/3gab3tctaajbp4e0mvs",
    "image_three": "https://images.luxuryescapes.com/zujhlhwjsdqafqjmbj",
    "vendor_name": "Hotel Indigo NYC Financial District",
    "title": "Chic NYC Escape in Iconic Financial District with Pub-Style Restaurant",
    "description": "Embrace the excitement of New York's buzzing financial hub with a stay at Hotel Indigo NYC Financial District, an IHG Hotel. This chic retreat places you within a short stroll of Wall Street, vibrant neighbourhoods like Tribeca and Lower Manhattan, and just a ferry ride from the Statue of Liberty. When you're not out sipping cosmopolitans and sampling local delicacies, enjoy delicious New York-style pub food at the hotel's American restaurant, Half Moon.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Hotel Indigo NYC Financial District, an IHG Hotel",
    "offer_address": "50 Trinity Place, New York, New York 10006, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 111.0,
    "value": 111.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BdkT8AAJ",
    "hero_image": "https://images.luxuryescapes.com/pcdlcids7ghcv4onfmap",
    "image_two": "https://images.luxuryescapes.com/tgvfkhenlqfn6ute03",
    "image_three": "https://images.luxuryescapes.com/s8hxy1ldjqaqbyba6no",
    "vendor_name": "Mandarin Oriental New York",
    "title": "Sky-High New York City Five-Star Stay on the Edge of Central Park",
    "description": "Stay in the greenest corner of New York City's urban jungle at the Mandarin Oriental, New York, a five-star haven on the fringes of Central Park. Perched above Manhattan on floors 35-54, this centrally located hotel wows with spectacular views of the skyline, Hudson River or Central Park, no matter which room is yours to call home. Only steps from the Big Apple's most iconic attractions, including Broadway, Times Square and Fifth Avenue, this hotel also delivers boutique shopping and high-end restaurants to your doorstep. During your stay, stop for sophisticated cocktails and breathtaking Manhattan views at the sky-high MO Lounge, before retreating to the spa for a dip in the 75-foot lap pool, a relaxing treatment or a session in the amethyst crystal steam room.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Mandarin Oriental, New York",
    "offer_address": "80 Columbus Circle at 60th Street, New York, New York 10023, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 881.0,
    "value": 881.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005IlGHAA0",
    "hero_image": "https://images.luxuryescapes.com/97o521vz6o2ivrgk2fg",
    "image_two": "https://images.luxuryescapes.com/u7cdosrwph33f7jmpptt",
    "image_three": "https://images.luxuryescapes.com/uibtuqt9b86gf7s4i2",
    "vendor_name": "Staypineapple, An Artful Hotel, New York",
    "title": "Boutique New York Luxury in the Heart of Midtown Manhattan",
    "description": "Discover the bright lights, bustling avenues and famed streets of New York City from the heart of Midtown Manhattan at Staypineapple, an Artful Hotel. This art-inspired abode is located moments from iconic landmarks including Central Park, the Empire State Building and Times Square. In a city that’s brimming with cafés, bars that spill out onto the streets, hidden speakeasies, under-the-radar art galleries and vibrant marketplaces at any given time of year, the sights of New York are near never-ending. Hop on one of Staypineapple's complimentary beach cruisers and explore on two wheels, or take a three-minute stroll to the subway and travel through New York like a local.\n\nFall in love with the hotel's unique approach to art and design, from the beautifully abstract pieces and tiling to Staypineapple’s signature yellow pineapple that adorns the rooms and lobby. Offering an effortless combination of Midtown Manhattan sophistication, gracious service, a spectacular location and pet-friendly accommodation, Staypineapple, an Artful Hotel ensures an effortless New York experience.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Staypineapple, An Artful Hotel, Midtown New York",
    "offer_address": "337 W 36th St, New York, NY 10018, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 155.0,
    "value": 155.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt7TAAR",
    "hero_image": "https://images.luxuryescapes.com/9r0rtgxu1cunz927qea",
    "image_two": "https://images.luxuryescapes.com/j2cmiyvqr8l96fxki7ec",
    "image_three": "https://images.luxuryescapes.com/82lof6f6cvlqfyozmrd",
    "vendor_name": "Intercontinental Barclay",
    "title": "Historic Midtown Manhattan Glamour near Park Avenue with 1920s-Style Bar & Restaurant",
    "description": "Where modern luxury and old world glamour converge, experience the beauty of the Big Apple with a stay at the prestigious InterContinental New York Barclay, an IHG Hotel. Located in the beating heart of Midtown Manhattan, this historic hotel, originally opened in 1926, is just steps from Park Avenue, Times Square, Central Park and the luxury boutiques of Fifth Avenue. Between city adventures, retreat to the 1920-style Parlour for a classic cocktail, or to dine on delectable cuisine.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "InterContinental New York Barclay, an IHG Hotel",
    "offer_address": "111 East 48th Street, New York, New York 10017, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 269.0,
    "value": 269.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxZiUAAV",
    "hero_image": "https://images.luxuryescapes.com/rl69a6wujqirm17wph9",
    "image_two": "https://images.luxuryescapes.com/v1zc38for6tummo4r5gf",
    "image_three": "https://images.luxuryescapes.com/0qomfyg35uako4048j18",
    "vendor_name": "Hotel Indigo Lower East Side New York",
    "title": "Urban-Chic New York Stay in Lower East Side with Rooftop Pool & Bar",
    "description": "Experience the vibrant energy of the Big Apple with a stay at Hotel Indigo Lower East Side, New York, an IHG Hotel. Perfectly positioned in the city's most artistic district, this luxe, urban-chic retreat is your gateway to the galleries, boutiques and eateries of the Lower East Side. Venture out to explore the nearby Tenement Museum or bustling Essex Market or take in the city skyline from the hotel's rooftop bar Mr. Purple. Later, sip cocktails while listening to a live DJ at The Club.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Hotel Indigo Lower East Side, New York, an IHG Hotel",
    "offer_address": "171 Ludlow Street, New York, New York, 10002, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 169.0,
    "value": 169.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003Gh5XAAS",
    "hero_image": "https://images.luxuryescapes.com/dxarwriisq7mf2koi5m",
    "image_two": "https://images.luxuryescapes.com/wls3bbecicpez1b938",
    "image_three": "https://images.luxuryescapes.com/vqy1peq4l6mboxczegw",
    "vendor_name": "Mr C Seaport New York",
    "title": "New York Italian-Style Glamour within Manhattan's Iconic Seaport District",
    "description": "New York, New York: one of the most exciting cities in the world is on your doorstep at Mr. C Seaport, a Leading Hotels of the World oasis, part of the iconic Cipriani collection whose brand of Italian luxury is sought-after worldwide. This exceptionally stylish boutique hotel is fabulously located in Downtown Manhattan's renowned Seaport District with New York City skyline views, just a short walk from the Statue of Liberty Viewpoint, the Brooklyn Bridge and Wall Street. There's no need to venture out to find your next great meal when there's a high-end restaurant right in the heart of the hotel. Rustic Italian cuisine is on the menu at Bellini, while the grand Bellini Bar is all gilded edges and velvet upholstery: the perfect spot to sip on an expertly crafted Italian cocktail (don't miss a chance to try a Bellini, invented by the legendary Mr Cipriani himself).",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Mr. C Seaport",
    "offer_address": "33 Peck Slip, New York City, New York 10038 United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 33,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxYXMAA3",
    "hero_image": "https://images.luxuryescapes.com/w4edhixezmhoajq1jpru",
    "image_two": "https://images.luxuryescapes.com/or6ijul9xgcd2hqp32r6",
    "image_three": "https://images.luxuryescapes.com/a003yntwoasm16dxi1f6",
    "vendor_name": "voco Times Square South",
    "title": "Tranquil New York City Stay in Times Square with Onsite Greenhouse, Library & Restaurant",
    "description": "Take a bite of the Big Apple with a stay in one of the city's most iconic areas at voco Times Square South New York, an IHG Hotel. Discover the allure of Manhattan by exploring the endless city streets lined with designer stores, Michelin-starred restaurants, and the Broadway Theatre district. Located on the southern side of Times Square, everything is easily within walking distance or a quick subway ride. Enjoy classic American-style dining at The Finches Den, featuring a chic patio area.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "voco Times Square South New York, an IHG Hotel",
    "offer_address": "343 West 36th Street, New York, New York 10018, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 164.0,
    "value": 164.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcjXXAAZ",
    "hero_image": "https://images.luxuryescapes.com/x0y6nyy99xv57d1gen16",
    "image_two": "https://images.luxuryescapes.com/3oomnviqzcm7t6xa8y0e",
    "image_three": "https://images.luxuryescapes.com/3z6auijo39h9kzuhg39",
    "vendor_name": "Kimpton Eventi",
    "title": "Sparkling Central New York Stay on Sixth Avenue with Three Restaurants, Stylish Rooftop & Gym",
    "description": "Take a bite of the Big Apple with a luxurious stay at Kimpton Hotel Eventi, an IHG Hote. Beyond the uber-comfortable suites and convenient Chelsea location, the stylish hotel is also home to a wide variety of dining venues, from the Italian-inspired L’Amico to cocktail bar, The Vine. Explore the city that never sleeps with ease by taking advantage of  the hotel’s complimentary push bikes or relax while taking in sparkling city views on the breezy rooftop.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Kimpton Hotel Eventi, an IHG Hotel",
    "offer_address": "851 Avenue of the Americas, New York, NY 10001, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 240.0,
    "value": 240.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lmOhAAI",
    "hero_image": "https://images.luxuryescapes.com/z4cb12rk1sy2jwfhrv8",
    "image_two": "https://images.luxuryescapes.com/ypq07j08djegajip882",
    "image_three": "https://images.luxuryescapes.com/tysigpqyfug7yahj82o",
    "vendor_name": "Royalton Park Avenue",
    "title": "Cosmopolitan Manhattan Escape near Empire State Building with Rooftop Pool",
    "description": "Enviably located in Manhattan's central NoMad neighbourhood, Royalton Park Avenue is a luxurious city launchpad, defined by its elegant aesthetic. Towering above Park Avenue the hotel shares its address with high-end fashion stores, world-class restaurants, theatres, galleries and more. Enjoy happy hour at the Rooftop Restaurant & Lounge, and plunge into the glittering rooftop pool, then settle in for an indulgent dining affair at Ivy Room, where evocative cocktails and piano melodies await.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Royalton Park Avenue",
    "offer_address": "420 Park Avenue South, New York 10016, NY, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 222.0,
    "value": 222.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxYXEAA3",
    "hero_image": "https://images.luxuryescapes.com/hlgilwaaqgmjiif5ii8o",
    "image_two": "https://images.luxuryescapes.com/3d5qd4j8nk89m75bqa14",
    "image_three": "https://images.luxuryescapes.com/14wbzo6grrbnsvkdetv",
    "vendor_name": "Crowne Plaza Hy36 Midtown Manhattan",
    "title": "Modern Midtown Manhattan Escape near Madison Square Garden & Empire State Building",
    "description": "Experience the vibrancy of New York City with a stay at Crowne Plaza HY36 Midtown Manhattan, an IHG Hotel. This contemporary haven is ideally positioned in close proximity to Madison Square Garden, and other iconic landmarks such as the Empire State Building, Times Square and Broadway's dazzling theatres. After a day of exploring, indulge in a scrumptious burger at the onsite Burgerology Midtown.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Crowne Plaza HY36 Midtown Manhattan, an IHG Hotel",
    "offer_address": "320 West 36th Street, New York, New York 10018, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 230.0,
    "value": 230.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxZjcAAF",
    "hero_image": "https://images.luxuryescapes.com/24euojnwsqnotqcb7ta",
    "image_two": "https://images.luxuryescapes.com/7sskwg3o29ci707twv55",
    "image_three": "https://images.luxuryescapes.com/wtezmqh97tkisbz6a2ua",
    "vendor_name": "Hotel Indigo NYC Downtown Wall Street",
    "title": "Sophisticated New York City Wall Street Stay with Rooftop Bar & Upscale Bistro",
    "description": "Tucked between skyscrapers in the bustling Financial District, find Hotel Indigo NYC Downtown - Wall Street, an IHG Hotel. Located next to the square where the New York Stock Exchange was founded and just minutes from The Battery and the Brooklyn Bridge, find yourself perfectly placed to experience all the thrills of Lower Manhattan. After strolling the banks of the East River, return for a cocktail at Highwater Rooftop Bar and grab a bite to eat Buttonwood Cafe.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Hotel Indigo NYC Downtown - Wall Street, an IHG Hotel",
    "offer_address": "120 Water Street, New York, New York, United States, 10005",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 165.0,
    "value": 165.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003qCqoAAE",
    "hero_image": "https://images.luxuryescapes.com/b3u3zmgn2rv00lyxspk9",
    "image_two": "https://images.luxuryescapes.com/5jolh6rk7b76o9dubkfo",
    "image_three": "https://images.luxuryescapes.com/0nnpbueq42ovbs48qctnn",
    "vendor_name": "Walker Hotel Greenwich Village",
    "title": "Timeless Art Deco Charm in Greenwich Village with High-End Dining",
    "description": "Journey to New York City's bohemian heart with a stay at Walker Hotel Greenwich Village. This Art Deco gem in the heart of historic Greenwich Village retains its heritage charm and is just a stone's throw from Washington Square Park. Savour the flavours of the city at the hotel's Society Cafe, a market-to-table eatery sourcing ingredients from the nearby Union Square Greenmarket, or venture out to explore the vibrant jazz and arts scene of this culturally rich neighbourhood.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Walker Hotel Greenwich Village",
    "offer_address": "52 West 13th Street, New York, New York 10011, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 244.0,
    "value": 244.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ECh2wAAD",
    "hero_image": "https://images.luxuryescapes.com/4elm1zhlrmb0e26g6vw5",
    "image_two": "https://images.luxuryescapes.com/9moqo6496koh6f4n03i",
    "image_three": "https://images.luxuryescapes.com/jx07zk081acy17a6x1h",
    "vendor_name": "5th and 55th Residence Club at St Regis",
    "title": "Five-Star Manhattan Residence in Iconic St. Regis Hotel with Butler Service",
    "description": "Discover the heights of luxury in one of New York’s most legendary locations with an exclusive stay at 5th & 55th Residence Club, positioned within beloved heritage icon The St. Regis New York. Just moments away from Central Park, each residence blends Manhattan’s unique magic with peerless sophistication, backed by round-the-clock butler service and impeccable facilities. After days spent exploring the city that never sleeps, enjoy elevated American meals beneath the frescoed ceilings and sparkling chandeliers of Astor Court, or head to the renowned King Cole Bar - birthplace of the Bloody Mary - for signature sips while marveling at its renowned Maxfield Parrish mural.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "5th & 55th Residence Club",
    "offer_address": "8th & 9th Floors, 2 E 55th Street, Manhattan, New York, NY 10022, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1023.0,
    "value": 1023.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GRcOBYA1",
    "hero_image": "https://images.luxuryescapes.com/skl7qlth6cvqaikbag6h",
    "image_two": "https://images.luxuryescapes.com/dm1vi85pqpwahnmoaw19",
    "image_three": "https://images.luxuryescapes.com/084weo8grw2hfjm7wcp",
    "vendor_name": "The Plaza New York",
    "title": "World-Class New York Heritage Stay Overlooking Central Park with Two Onsite Restaurants",
    "description": "Synonymous with timeless elegance and award-winning luxury, this lavish hotel is one of the most prestigious in the world. For more than a century, this world-class retreat has defined style with its grand marble lobby, iced crystal chandeliers and gleaming gilded accents.  \n\nDining here is a royal affair, with the palatial Palm Court serving afternoon tea and delicate bites, while the refined Champagne Bar beckons guests to come and sample the world's finest wines, champagne and caviar. Enjoy a rejeventing treatment at the Gerlain Spa or visit one of the many opulent stores that call this hotel home.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "The Plaza - A Fairmont Managed Hotel",
    "offer_address": "768 Fifth Avenue, New York City, New York 10019, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 879.0,
    "value": 879.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcvLfAAJ",
    "hero_image": "https://images.luxuryescapes.com/qvb66obpiqfwmocz0si5",
    "image_two": "https://images.luxuryescapes.com/91bpa0o5xa9i01bth3e",
    "image_three": "https://images.luxuryescapes.com/xyd6dpcvvyln3w2vrid",
    "vendor_name": "Pendry Manhattan West",
    "title": "Five-Star West Manhattan Stay with Five Onsite Restaurants & Bars",
    "description": "Indulge in Manhattan’s glittering elegance with a sophisticated stay at the Pendry Manhattan West. Settle into sumptuous velvet-lined booths at Zou Zou's, bask in the intimate grandeur of Bar Pendry, or take in the glamour of three other elevated bars and eateries. Let breathtaking views of the West Side skyline beckon you to explore the city's iconic landmarks, such as Times Square and the Empire State Building, just minutes away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Pendry Manhattan West",
    "offer_address": "438 W 33rd Street, New York, NY 10001, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 690.0,
    "value": 690.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003IFPgAAO",
    "hero_image": "https://images.luxuryescapes.com/7f8u1mbzzus689cn3wyi",
    "image_two": "https://images.luxuryescapes.com/r7om1d4x0hbjdi0cr7eb",
    "image_three": "https://images.luxuryescapes.com/c6y6vvedthm46cub6cyi",
    "vendor_name": "James Nomad",
    "title": "Boutique Escape in New York's Ultra-Cool NoMad District",
    "description": "Treat yourself to an exciting escape above Manhattan's bustling avenues at The James New York - NoMad, an ultra-cool boutique hotel concealed in the wrapper of a beautiful Beaux-Arts structure in the heart of Midtown Manhattan.\n\nCentrally located among the trendy bars, lounges and restaurants of the eclectic NoMad neighbourhood (also known as Madison Square North), The James New York - NoMad sits minutes from New York’s best attractions. Feel the pulse of the world’s liveliest city as you discover Times Square, the boutiques of Fifth Avenue, the luxe apartment blocks of Park Avenue, stunning Central Park and so much more. Then return to this boutique hotel, where a world of cosy lounges, an upscale restaurant, midcentury-inspired cocktail lounge and state-of-the-art gym await.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "The James New York - NoMad",
    "offer_address": "22 E 29th St, New York, NY 10016, United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DJ2fvAAD",
    "hero_image": "https://images.luxuryescapes.com/5dntimuwjfmykyjeowd",
    "image_two": "https://images.luxuryescapes.com/x66dh11kwi8jykcdyuho",
    "image_three": "https://images.luxuryescapes.com/v4clvucww36ixh82t0k3",
    "vendor_name": "The Dominick New York City",
    "title": "Ultra-Chic Five-Star New York City Escape with Manhattan Views, Rooftop Terrace & Michelin-Starred Restaurant",
    "description": "Experience the height of luxury in the heart of SoHo at The Dominick Hotel, a designer New York City escape offering unrivalled views of the Manhattan skyline. Discover the city's vibrant art scene, chic boutiques and world-class dining, found within a 26-block radius. After a day of exploration, retreat to the Michelin-starred Vestry for a culinary journey, or unwind with a cocktail at Mezzanine. Forget you’re in the centre of it all with an indulgent treatment at Sisley Spa NYC, or watch the world go by from sky high at Terrace on 7.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "The Dominick New York",
    "offer_address": "246 Spring Street, New York, NY 10013, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 482.0,
    "value": 482.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxYXDAA3",
    "hero_image": "https://images.luxuryescapes.com/6girtlmxj5nodxq5gr4e",
    "image_two": "https://images.luxuryescapes.com/wuac6iezrmncgsk5448o",
    "image_three": "https://images.luxuryescapes.com/685ru66jam5nq59p7lh5",
    "vendor_name": "Crowne Plaza Times Square Manhattan Ny",
    "title": "Central New York City Escape Overlooking Times Square",
    "description": "Experience the Big Apple in all its glory with a stay at Crowne Plaza Times Square Manhattan, an IHG Hotel, perfectly positioned in the heart of the Broadway district. Spend your days exploring the abundance of iconic landmarks nearby including Central Park, the Empire State Building, the Statue of Liberty and Fifth Avenue. Later, retreat to Broadway 49 restaurant for an upscale diner meal, or grab a classic New York-style bagel at the Grind’n Co Coffee shop on the ground floor.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Crown Plaza Times Square Manhattan, an IHG Hotel",
    "offer_address": "1605 Broadway, New York, New York 10019, United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004P5xEAAS",
    "hero_image": "https://images.luxuryescapes.com/plfphbvlszd3dzw0xml",
    "image_two": "https://images.luxuryescapes.com/wg8iahg9m3gb6i8x46o",
    "image_three": "https://images.luxuryescapes.com/jo9j5twnqcc8ujvm0444",
    "vendor_name": "NoMo Soho Hotel New York",
    "title": "Artsy New York Escape in the Heart of Vibrant SoHo",
    "description": "Discover one of Manhattan’s most stylish neighbourhoods with a stay in the heart of New York at NoMo SoHo. Tucked away in one of SoHo's renowned cobblestone streets, this stylish property is an artsy urban retreat near the area's very best cultural experiences. With a name that stands for 'nostalgic and modern', the hotel perfectly encapsulates SoHo’s essence in its modern rooms and quirky spaces. The vine-covered entrance will draw you down a rabbit hole of contemporary art installations, bright colours and vintage furniture, while the rooftop boasts some of the best views over Manhattan’s glittering skyline. The jewel in the hotel’s crown? NoMo Kitchen, the hotel’s ultra-cool restaurant, beautifully decorated with sparkling chandeliers and art installations, and a firm celebrity favourite.\n\nOutside the hotel, the bustling streets of New York await. You'll be perfectly placed to explore the city's neighbourhoods, from Midtown to the Upper East Side, and surrounded by some of the best restaurants - Balthazar, Blue Ribbon Brasserie and Shuka to name a few - not to mention a myriad of galleries, independent shops, boutiques and SoHo’s elegant cast-iron architecture.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "NoMo SoHo",
    "offer_address": "9 Crosby St, New York, NY 10013 New York NY 10013 United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 22,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GUQyLYAX",
    "hero_image": "https://images.luxuryescapes.com/xxypagn59upr62yi4ukl",
    "image_two": "https://images.luxuryescapes.com/6nn9vi38dbw9prxzgp66",
    "image_three": "https://images.luxuryescapes.com/f3rrqkn0ddex8lgseeqt",
    "vendor_name": "Sofitel New York",
    "title": "Iconic Midtown Manhattan Sofitel Grandeur near Times Square and Fifth Avenue with Art-Deco Restaurant",
    "description": "Stay in the beating heart of New York's concrete jungle at this serene French-inspired escape, located a stone's throw from Times Square. Immerse yourself in the best of the iconic city, with the Empire State Building, Bryant Park and Broadway all within a 10-minute walk, and a plethora of restaurants and bars right outside your door.\n\nWhen you don't feel like venturing far for your next meal, the hotel's French-inspired Gaby Brasserie is your go-to for French delicacies, while streetside people-watching and handcrafted cocktails are on the menu at Mademoiselle Gaby. If walking the streets of NYC isn't enough to get the heart racing, the onsite fitness centre's modern facilities will do the trick.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Sofitel New York",
    "offer_address": "45 West 44th Street, New York City, New York 10036, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 218.0,
    "value": 218.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GumFkAAJ",
    "hero_image": "https://images.luxuryescapes.com/boyrgtzpmonh6mfbdn3a",
    "image_two": "https://images.luxuryescapes.com/ekgscd5wrczw19qei",
    "image_three": "https://images.luxuryescapes.com/r5p2b3619mfhwnfj09zq",
    "vendor_name": "The Langham New York",
    "title": "Langham Midtown Manhattan Luxury near Iconic Empire State Building",
    "description": "Experience the elegance of the Big Apple at The Langham New York, a five-star sanctuary of city luxury, nestled in the heart of Manhattan. Luxuriate in the lavishly designed rooms offering breathtaking skyline views, sample the cuisine at Ai Fiori or sip on epic cocktails at the Bar Fiori. Perfectly positioned near the iconic Empire State Building, discover culinary delights, high-end boutiques at Fifth Avenue and see the dazzling lights of Times Square, just moments away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "The Langham, New York",
    "offer_address": "400 Fifth Avenue, New York, New York 10018, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 611.0,
    "value": 611.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002Hc7kIAC",
    "hero_image": "https://images.luxuryescapes.com/1bkpgbc1b3tf8ktufjsb",
    "image_two": "https://images.luxuryescapes.com/orhduc53v8p09wdpz0r",
    "image_three": "https://images.luxuryescapes.com/yl93y2krzbtuwymyc19j",
    "vendor_name": "NoMo Soho Hotel New York",
    "title": "New York SoHo-Inspired Sophistication Steps from Canal Street with High-End Restaurant & Garden Terrace",
    "description": "At the intersection between stunning heritage architecture and cutting-edge trends, this vibrant SoHo stay perfectly encapsultes the energy of New York. Centrally positioned in this thriving neighbourhood renowned for its fashionable boutiques, art galleries, and trendy eateries, enjoy cocktails in the Rose Garden or seasonal New American fare at Nomo Kitchen between pavement adventures.\n\nStart each day with an energising coffee and light bite at the Cafe before heading out for the day, taking a leisurely stroll to nearby Chinatown for authentic dim sum or Little Italy for a taste of the Mediterranean. Just a short drive away, explore some of the city's most iconic sites.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "NoMo SoHo",
    "offer_address": "9 Crosby Street, New York 10013, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 242.0,
    "value": 242.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DVVYAA4",
    "hero_image": "https://images.luxuryescapes.com/gmj647ygnlbkqb48ym4",
    "image_two": "https://images.luxuryescapes.com/cbx1ct0ffe4w6hovutl5",
    "image_three": "https://images.luxuryescapes.com/2kinre6nhn0hpa401b",
    "vendor_name": "The Standard, High Line",
    "title": "New York Boutique Glamour in the Meatpacking District",
    "description": "There’s nothing standard about an escape to New York’s The Standard, High Line - this unforgettable hotel sits at the apex of cool, high above the eponymous public park. Each room dazzles with floor-to-ceiling windows gazing across the shimmering cityscape and the mighty Hudson River. A slew of superb onsite restaurants and bars - including modern brasserie The Standard Grill, rooftop discothèque Le Bain and the open-air The Standard Biergarten - stand electric at the centre of the Meatpacking District’s roaring nightlife scene. A revelation unlike anywhere else in New York, The Standard, High Line routinely hosts a whirlwind schedule of the city's coolest events and sits only a short walk from the restaurants, bars and boutique shopping streets of West Village and Chelsea.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "The Standard, High Line",
    "offer_address": "848 Washington Street, New York, New York 10014, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 272.0,
    "value": 272.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMfKWAA1",
    "hero_image": "https://images.luxuryescapes.com/8cwi862rba3fcr99syt",
    "image_two": "https://images.luxuryescapes.com/2hsucwywvoffjoetbhm",
    "image_three": "https://images.luxuryescapes.com/s1a25k8f05nagbyogqz",
    "vendor_name": "New York Hilton Midtown",
    "title": "Stylish Manhattan Hilton Escape Opposite Museum of Modern Art with Onsite Bar, Restaurant & Lounge",
    "description": "The creative pulse of Manhattan awaits with a stay at this perfectly positioned Hilton haven bordering New York City's theatre district. Steps from the Museum of Modern Art, this stylish city stay is a short walk from the city's most exciting attractions from Central Park, Times Square and the glittering shops of Fifth Avenue. After a day of exploring, retreat to the sophisticated Bridges Bar for a classic Manhattan cocktail, or refuel with American-style dishes at Herb N' Kitchen.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "New York Hilton Midtown",
    "offer_address": "1335 6th Avenue, New York, New York 10019, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 610.0,
    "value": 610.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JRhmPAAT",
    "hero_image": "https://images.luxuryescapes.com/22rxh5oc59ea23zdyyi",
    "image_two": "https://images.luxuryescapes.com/48qtuk2nvjipu5oglcoh",
    "image_three": "https://images.luxuryescapes.com/idn1jh57z4v5brkqns",
    "vendor_name": "Omni Berkshire Place",
    "title": "Classic Midtown Manhattan Luxury Near Fifth Avenue with Onsite Bar Overlooking 52nd Street",
    "description": "Embrace New York elegance with a luxurious stay at one of the city's landmark hotels steeped in a century of history. The hotel's enviable location places you steps away from the renowned Fifth Avenue shopping district, the dazzling lights of Broadway, and the verdant tranquillity of Central Park. Delight in a fresh breakfast at Berk's Bar, and return after days spent exploring the iconic concrete jungle for a drink in the bar's plush interiors.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Omni Berkshire Place",
    "offer_address": "21 East 52nd Street at Madison Avenue, New York, New York 10022, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 259.0,
    "value": 259.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003qGLtAAM",
    "hero_image": "https://images.luxuryescapes.com/r3yjxa2w4pztn61eofhu",
    "image_two": "https://images.luxuryescapes.com/bhfixdldk5i2ou0hztxo",
    "image_three": "https://images.luxuryescapes.com/pu36ttccucyb9ba4x21n",
    "vendor_name": "Walker Hotel Tribeca",
    "title": "Trendy New York City Stay in Heart of Manhattan's Tribeca",
    "description": "Experience the pulsating energy of New York City with a stay at Walker Hotel Tribeca, a former ribbon factory given a new lease on life as a luxury hotel. An eclectic mix of restaurants and bars look after your drinking and dining needs at every time of day - satisfy your palate at Mediterreanean restaurant, Mostrador; sip cocktails at The Flower Shop Rooftop, listen to live music at Saint Tuesday, or jump-start your morning with a coffee at Blue Bottle. Situated within walking distance of Little Italy, Chinatown and SoHo, you'll be living like a local in no time.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "Walker Hotel Tribeca",
    "offer_address": "77 Walker St, New York, NY 10013, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 198.0,
    "value": 198.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004LSCkAAO",
    "hero_image": "https://images.luxuryescapes.com/5nucmz39g9jeb6qqsifjt",
    "image_two": "https://images.luxuryescapes.com/7nymvhsn7bz4vkkclt8v",
    "image_three": "https://images.luxuryescapes.com/nlavjj54htuhsyyecwqe",
    "vendor_name": "Hotel Park Ave New York",
    "title": "Sophisticated Midtown Manhattan Stay Moments from the Empire State Building",
    "description": "Join the New York elite with a luxurious stay at one of Manhattan's most striking abodes - Mondrian Park Avenue, ranked within the top 10% of properties on Tripadvisor. Fusing the eclectic style of the NoMad neighbourhood with a contemporary twist, this fashionably bold hotel makes a statement across the New York skyline - the perfect choice for those seeking a central oasis amid the bright lights of the big city.\n\nPerfectly positioned only moments from the iconic Empire State and Flatiron buildings, the hotel's enviable location at the core of midtown Manhattan makes it easy to take a bite out of the Big Apple. Witness sweeping skyline vistas from the rooftop lounge or simply relax in one of the beautifully designed guest rooms complete with custom plush king bed and bespoke furnishings, and enjoy a restful night in the city that never sleeps.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Mondrian Park Avenue New York",
    "offer_address": "444 Park Ave S, New York City, NY 10016-7321",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 31,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GfSEQAA3",
    "hero_image": "https://images.luxuryescapes.com/xr3x94wv5iu4pdzvyn8o",
    "image_two": "https://images.luxuryescapes.com/pkzp4rawlkppvg0v4oho",
    "image_three": "https://images.luxuryescapes.com/detwe3dr7cxldnt81pkw",
    "vendor_name": "Collective Governors Island",
    "title": "Tranquil Governors Island Glamping Retreat with Sunset Terrace with Statue of Liberty Views",
    "description": "Indulge in a luxurious urban retreat at the Collective Governors Island boasting unspoiled New York City skyline and harbour views. A short ferry ride from the concrete jungle, immerse yourself in a tranquil glamping experience as you unwind in the sustainably designed accommodations. Slow down with morning yoga, explore with bike rides, indulge in farm-to-table delights or head to the terrace to toast to the sunset with cocktails and iconic Statue of Liberty views, for an unforgettable escape.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Collective Governors Island",
    "offer_address": "825 Gresham Road, Governors Island, New York 10004, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 218.0,
    "value": 218.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009F7ulAAC",
    "hero_image": "https://images.luxuryescapes.com/ifksm88qjzdc9vq92bmj",
    "image_two": "https://images.luxuryescapes.com/58hk20pnqmiyw6ehcnh",
    "image_three": "https://images.luxuryescapes.com/zz2jtc04tgj5nzoskio",
    "vendor_name": "The Plaza New York",
    "title": "World-Class The Plaza New York Heritage Stay Overlooking Central Park",
    "description": "The Plaza in New York City, synonymous with timeless elegance and award-winning luxury, is one of the most prestigious and iconic hotels in the world and ranked in the top ten best hotels in New York City by Travel + Leisure's 2022 World's Best Awards. Dining is a royal affair, with the palatial Palm Court serving afternoon tea and delicate bites while the refined Champagne Bar beckons guests to come and sample the world's finest wines, champagne and caviar while overlooking the famous Pulitzer Fountain. For more than a century, this world-class chateau has defined elegance, from its historic Beaux-Arts façade to the grand marble lobby, iced crystal chandeliers and gleaming gilded accents. A stay here places you in a stellar Manhattan location along the southern edge of Central Park, on Fifth Avenue and on the brink of the Upper East Side.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "The Plaza",
    "offer_address": "Fifth Avenue at Central Park South, New York, NY 10019, United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GPsnYAAT",
    "hero_image": "https://images.luxuryescapes.com/felhq1uwoks0zv5wbb0b",
    "image_two": "https://images.luxuryescapes.com/418zgmtpwmxr9dwfu2do",
    "image_three": "https://images.luxuryescapes.com/u7dz73bllcfe4fyydig",
    "vendor_name": "The Lexington Hotel, Autograph Collection",
    "title": "Jazz Age-Inspired Midtown Manhattan Escape near Grand Central Station & the Rockefeller Center",
    "description": "Experience the grandeur of New York City with a glamorous stay at The Lexington Hotel, Autograph Collection. Perfectly positioned just a two-minute stroll from the iconic Grand Central Station, this hotel serves as an ideal launchpad to explore the Big Apple's endless attractions. From Rockefeller Center and the dazzling lights of Times Square to the world-class shopping on Fifth Avenue, and the culinary delights of nearby bistros and gourmet restaurants, the city's best is at your doorstep.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "The Lexington Hotel, Autograph Collection",
    "offer_address": "511 Lexington Avenue at 48th Street, New York, NY 10017, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 34,
    "price": 486.0,
    "value": 486.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMQP1AAP",
    "hero_image": "https://images.luxuryescapes.com/wwly86c44mcsgm0n4vn9",
    "image_two": "https://images.luxuryescapes.com/8qfnzgknouvddttl47e",
    "image_three": "https://images.luxuryescapes.com/sy54dcp1ypsfywqa17ce",
    "vendor_name": "Lotte New York Palace",
    "title": "Iconic Midtown Manhattan Opulence near Times Square with Onsite Dining & Tranquil Spa",
    "description": "Soak up the glitz and glamour of the Big Apple with a stay at this historic five-star hotel, boasting a coveted location on Madison Avenue, in the heart of Midtown Manhattan. Indulge in a lavish breakfast at the Villard Restaurant, sip on hand-crafted cocktails at Trouble's Trust or pamper yourself at the award-winning iLa Only Spa. For this wishing to explore the city, Times Square and Central Park and the boutiques of Madison Avenue are just moments away.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Lotte New York Palace",
    "offer_address": "455 Madison Avenue at 50th Street, New York, NY 10022, USA",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 32,
    "price": 1180.0,
    "value": 1180.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ExupTAAR",
    "hero_image": "https://images.luxuryescapes.com/7dtmou5me4qno9l1zlf",
    "image_two": "https://images.luxuryescapes.com/8rpmtr00y6ej5moh0vs",
    "image_three": "https://images.luxuryescapes.com/qom2qyecm9km574rrhul",
    "vendor_name": "Shelburne NYC",
    "title": "Stylish New York City Break in Midtown Manhattan",
    "description": "Stay on the east side of Manhattan's Midtown district, where sophistication meets contemporary style, at The Shelburne Sonesta New York. A New York City sanctuary, the very best of the Big Apple is on your doorstep - spend days shopping on Fifth Avenue, dining at Michelin-starred restaurants, or exploring the art galleries of Chelsea. After days of exploring, retreat to your hotel and make use of the state-of-the-art fitness centre before relaxing in your spacious guest room or apartment.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "The Shelburne Sonesta New York",
    "offer_address": "303 Lexington Avenue at 37th Street New York, NY 10016, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 140.0,
    "value": 140.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt7uAAB",
    "hero_image": "https://images.luxuryescapes.com/gpmn2mdk1h6m79xs2u8",
    "image_two": "https://images.luxuryescapes.com/5r6boj4xfof0wcrl19md",
    "image_three": "https://images.luxuryescapes.com/1u2mqqtb8kgl529ee4js",
    "vendor_name": "voco The Frankin Hotel New York",
    "title": "New York City Upper East Side 19th Century Brownstone Retreat Minutes from Central Park",
    "description": "Experience the timeless allure of New York City at voco The Franklin New York, an IHG Hotel, a beautifully restored 1800s brownstone nestled in the tranquil Upper East Side. Just steps from the verdant expanse of Central Park and the prestigious 5th Avenue, this charming retreat is your gateway to Manhattan's iconic landmarks. Spend your days exploring iconic landmarks, from the Empire State Building to Times Square, before returning to the hotel to revel in its historic charm and modern glamour.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "United States",
    "location_description": "voco The Franklin New York, an IHG Hotel",
    "offer_address": "164 East 87 Street, New York, New York 10128, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 229.0,
    "value": 229.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070vPpAAI",
    "hero_image": "https://images.luxuryescapes.com/wmv37nd5olswwa2ewg0p",
    "image_two": "https://images.luxuryescapes.com/ln68rxroesbio2o7fpzk",
    "image_three": "https://images.luxuryescapes.com/xgwunjpfe6jcz7ud3cgb",
    "vendor_name": "ModernHaus Soho",
    "title": "New York Sky-High SoHo Retreat with Rooftop Pool",
    "description": "Embrace the vibrant city buzz of New York with an ultra-stylish stay at ModernHaus SoHo, where the guest experience radiates the same edgy, cool vibes of the surrounding neighbourhood. With a stellar location for exploring Downtown, the ModernHaus SoHo places you right where you need to be: within striking distance of the city’s best dining, high-end shopping and cultural icons.\n\nInside this sleek retreat, you will find a museum-worthy collection of artworks from local and international talent, distributed throughout shared spaces and guest rooms. Enjoy a range of onsite restaurants and bars, including elegant dining at Veranda, all-day eatery Jumpin Jacks and rooftop bar Jimmy. Arguably one of the biggest drawcards of this metropolitan crash pad is the sprawling outdoor space, covering 11,000 square feet and offering an immediate reprieve from the busy streets that frame the hotel. There’s also an Instagram-worthy rooftop pool (seasonal), so you can swim at skyscraper level while soaking up views of the Hudson, a 17th-floor fitness centre with a Peloton bike and TechnoGym equipment, and a 24/7 concierge service to cater to your every whim.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "ModernHaus Soho",
    "offer_address": "27 Grand St, New York, NY 10013, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 22,
    "price": 348.0,
    "value": 348.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008mXEbAAM",
    "hero_image": "https://images.luxuryescapes.com/tkzi6yqrmb1in9wwauu8",
    "image_two": "https://images.luxuryescapes.com/uai8umakse961mvose",
    "image_three": "https://images.luxuryescapes.com/9rflghorydkxx5u8llgs",
    "vendor_name": "Hard Rock Hotel New York",
    "title": "Brand-New Hard Rock New York City Stay near Times Square with Rooftop Bar",
    "description": "Rock out at the brand-new Hard Rock Hotel New York, the hottest new property to take the spotlight in Midtown Manhattan. Sandwiched between the Theatre District and Radio City Music Hall, this vibrant hotel places you within close proximity of some of the world's hottest theatre performances, local live music gigs and iconic city sights. In true Hard Rock style, the hotel is a treasure trove of rare music memorabilia and original artwork that pays homage to New York City's underground music industry. Listen to incredible beats while drinking in cocktails and incredible views of Times Square at RT60 Rooftop Bar and Lounge, opt for upscale dining at NYY Steak, or savour farm-fresh seasonal cuisine in a music-inspired setting at Sessions. Other incredible facilities include Body Rock® fitness, two entertainment venues and an onsite Rock Shop® boutique.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "New York",
    "offer_geo_area_level_2": "New York",
    "location_heading": "New York",
    "location_subheading": "USA",
    "location_description": "Hard Rock Hotel New York",
    "offer_address": "159 West 48th Street New York City, New York 10036 United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 238.0,
    "value": 238.0
  }
]