[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GhBxAAK",
    "hero_image": "https://images.luxuryescapes.com/y20adnwhwp05kscync6j",
    "image_two": "https://images.luxuryescapes.com/z0koe7sshbvu843kvujn",
    "image_three": "https://images.luxuryescapes.com/vghe75c4wjb229mxdthd",
    "vendor_name": "Les Manoirs des Portes de Deauville",
    "title": "Peaceful Normandy Countryside Retreat with Daily Breakfast",
    "description": "Discover rural French bliss at the stylish Les Manoirs des Portes de Deauville, a breath of fresh air in the Normandy countryside. Set back from the buzzing seaside resort town of Deauville, this charming hotel ensures a peaceful retreat. Spend days walking across Normandy’s pebbly beaches, admiring the Art Deco and Belle Époque architecture throughout Deauville, visiting quaint villages and getting a taste for the region by sampling local camembert and cider.\n\nTroubles melt away the moment you step foot on the property’s beautifully manicured grounds, where the centuries-old manor house and private cottages are set among the apple trees. Don’t let the heritage exterior fool you - interiors are refreshingly contemporary, with an eclectic mix of furniture, chic modern bathrooms and unique artwork scattered throughout. A grand lounge area features plush velvet armchairs and a roaring fireplace, perfect for a cosy night with a glass of calvador. On sunny days, take a dip in the outdoor heated swimming pool or completely relax in the sauna.\n\n**Luxury Escapes inclusions:**\n\n- Start each morning with a delicious **daily cooked or continental breakfast**\n- Celebrate your escape with a **welcome drink on arrival**\n- Be welcomed with **a bottle of regional cider** waiting in your room on arrival\n- Relax right up until the last moment with **guaranteed 2pm late checkout** (excludes Saturday checkouts)\n\n**Want to make your stay extra special?** Upgrade to a Private Cottage, set slightly apart from the rest of the hotel, where you can enjoy more room, a cosy lounge and an outdoor dining area all to yourself.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Normandy",
    "offer_geo_area_level_2": "Canapville",
    "location_heading": "Normandy",
    "location_subheading": "France",
    "location_description": "Les Manoirs des Portes de Deauville",
    "offer_address": "30 D677, 14800 Canapville, France",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004i7RVAAY",
    "hero_image": "https://images.luxuryescapes.com/qqlz29ubdow3vzhz73of",
    "image_two": "https://images.luxuryescapes.com/d9gszgsbzodhq03uf4l",
    "image_three": "https://images.luxuryescapes.com/qypkqlnrgxu7rbmsarr5",
    "vendor_name": "Château d'Audrieu",
    "title": "Normandy Five-Star Heritage Grandeur by Relais & Châteaux",
    "description": "Leave it all behind for the glorious French countryside, staying in palatial luxury at Château d’Audrieu - part of the prestigious Relais & Châteaux collection. A jewel at the heart of Normandy, this grand five-star hotel is just a 30-minute drive from the seaside and D-Day beaches, and 20 minutes from Bayeux, home of the legendary Bayeux tapestry.\n\nNestled within 25 acres of parkland, this spectacular historic chateau, which dates back to 1715, invites you to step back in time to the French Regency era. Fine gastronomy is served beneath glittering chandeliers and luxurious treatments are delivered at the Spa by Sothys. The splendour doesn’t stop in the gilt-trimmed halls: a stroll through the grounds unveils a heated swimming pool at the edge of the forest and a collection of beautifully manicured gardens, including a French formal garden, rose garden and vegetable garden. There is no finer place to immerse yourself in the famous French joie de vivre.",
    "offer_country_name": "France",
    "offer_country_code_alpha_2": "FR",
    "offer_geo_area_level_1": "Normandy",
    "offer_geo_area_level_2": "Audrieu",
    "location_heading": "Normandy",
    "location_subheading": "France",
    "location_description": "Château d'Audrieu",
    "offer_address": "Château d'Audrieu, 14250 Audrieu, France",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 316.0,
    "value": 316.0
  }
]