[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002ItUnIAK",
    "hero_image": "https://images.luxuryescapes.com/x58v9agr7t67hpe67p1o",
    "image_two": "https://images.luxuryescapes.com/0zgea5qxx9uqq87zu13m",
    "image_three": "https://images.luxuryescapes.com/q25v1pp3i6ltr20q7zo",
    "vendor_name": "Majestic M Suites",
    "title": "Glamorous North Adelaide Self-Contained Suites with Barossa Valley Wine Tasting Upgrades Available",
    "description": "Escape to South Australia’s enchanting capital with a sophisticated stay in charming North Adelaide, just minutes from the city’s CBD. Nestled amid lush parks and tree-lined streets, and separated from the bustling centre by the scenic River Torrens, this retreat offers the perfect blend of urban convenience and serene living.\n\nEach of the 91 suites, inspired by the historical charm of the city’s northern fringe, features elegant furnishings, a private balcony or terrace, a fully-equipped kitchen and spacious lounge and dining areas - ensuring a restful and revitalising stay. Shared amenities include a fitness centre, outdoor courtyard, BBQ area and secure parking, putting all you need at your fingertips.\n\nExplore the beautiful Botanic Gardens, savour the vibrant restaurant and bar scene or embark on a wine-tasting journey through nearby vineyards and wineries. Keep an eye out for exciting events happening throughout the city, offering something for every traveller to enjoy.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "North Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Majestic M Suites",
    "offer_address": "202 Tynte Street, North Adelaide, South Australia 5006, Australia",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 249.0,
    "value": 542.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HPZ9AAO",
    "hero_image": "https://images.luxuryescapes.com/ezas82xmf6rh3e71icr",
    "image_two": "https://images.luxuryescapes.com/wlla28kyanfcapbwf5t",
    "image_three": "https://images.luxuryescapes.com/itj6qiftt7ao3w7wb488",
    "vendor_name": "Majestic M Suites",
    "title": "Grand Opening: Glamorous Adelaide All-Suite Stay with Penfolds Winery Tour & Grange Tasting",
    "description": "An escape to South Australia’s beguiling capital beckons with a sophisticated stay at the newly-opened Majestic M Suites, nestled in the picturesque and cosmopolitan area of North Adelaide, just mere moments from the CBD. Drawing inspiration from the historical elements of the city’s northern fringe, each of the 91 suites boasts beautiful interior furnishings, a private balcony or terrace, fully-equipped kitchen and lounge and dining areas to ensure a restful and rejuvenating stay, with shared facilities including a gym, outdoor courtyard and BBQ function area and secure undercover parking.\n\nSurrounded by parks and tree-lined streets, separated from the city by the meandering River Torrens, this brand-new hotel provides the ultimate cosmopolitan lifestyle. Once you have settled into your tranquil space, Adelaide’s multitude of cultural, art and dining experiences await. Keep an eye out for any upcoming events or immersive festivals found across the city, take in the beauty of the Botanic Gardens, spend the night indulging your tastebuds at the many thriving restaurants and bars, weave your way through narrow laneways and unearth hidden gems or hop between the many wineries on the city’s edge and beyond.\n\n**Your handpicked inclusions:**\n\n- Start your escape with an indulgent box of Koko Black praline chocolates on arrival\n- Enjoy an ultimate Penfolds Estate tour and luxury tasting experience, including one vintage of Grange\n- Spend more time exploring with included secure parking for one vehicle per stay\n\n**Travelling as a group or family?** Upgrade to a two-bedroom suite for up to four guests and enjoy ample space to move or simply relax and unwind.\n\n**Superior Upgrades Available:** Upgrade to a Superior One-Bedroom Suite or Superior Two-Bedroom Suite and savour the tastes of Italy with a four-course banquet with an included cocktail each at L'italy. Your delicious meal includes a choice of antipasti, pasta, mains with sides and desserts which are all designed to be shared.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Adelaide",
    "location_heading": "North Adelaide",
    "location_subheading": "South Australia",
    "location_description": "Majestic M Suites",
    "offer_address": "202 Tynte Street, North Adelaide, South Australia 5006, Australia",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 15,
    "price": 223.0,
    "value": 622.0
  }
]