[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I0jWIAS",
    "hero_image": "https://images.luxuryescapes.com/j6k47is86rzhiu1znroc",
    "image_two": "https://images.luxuryescapes.com/y96jysbyposi3cenx4cnd",
    "image_three": "https://images.luxuryescapes.com/x6iyjeidblntke0v8yjnj",
    "vendor_name": "The Bath Hotel Lynmouth",
    "title": "Charming North Devon Coastal Heritage Escape with Daily Breakfast & Two-Course Dinner",
    "description": "Standing as a charming example of Victorian elegance, this retreat is steeped in history and is housed in a meticulously preserved building dating back to the 1880s. Step back in time and enjoy the unique heritage of these beautifully appointed rooms with classic period features and modern comforts.\n\nThe Bath Hotel is nestled along the North Devon Coast and offers immense coastal views and easy access to the scenic village of Lynmouth, often referred to as \"Little Switzerland\" due to its alpine appearance and picturesque scenery.\n\nAn ideal base for adventure lovers and nature enthusiasts, the hotel is perfectly situated to explore the dramatic landscapes of Exmoor National Park. Its proximity to the harbour offers a charming maritime touch, making it a great spot to experience the quintessential English coast while enjoying the tranquillity of village life.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Lynmouth",
    "location_heading": "North Devon",
    "location_subheading": "United Kingdom",
    "location_description": "The Bath Hotel Lynmouth",
    "offer_address": "Lynmouth Street, Lynmouth, North Devon, EX35 6EL, United Kingdom",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 279.0,
    "value": 582.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DBtGDYA1",
    "hero_image": "https://images.luxuryescapes.com/atzbifen621ax8gc6gl",
    "image_two": "https://images.luxuryescapes.com/eh9yj5rz6smzvatwbdd",
    "image_three": "https://images.luxuryescapes.com/n1nii4lzdpkvffxwpsu8",
    "vendor_name": "The Bath Hotel Lynmouth",
    "title": "Charming North Devon Coastal Heritage Escape with Daily Breakfast & Two-Course Dinner",
    "description": "Standing as a charming example of Victorian elegance, this English retreat is steeped in history, housed in a meticulously preserved building dating back to the 1880s. Step back in time and enjoy the unique heritage of the beautifully appointed rooms, with classic period features and modern comforts. Nestled along the North Devon coast in the southwest of England, The Bath Hotel Lynmouth offers stunning coastal views and easy access to the scenic village of Lynmouth, often referred to as 'Little Switzerland' due to its alpine appearance and picturesque scenery.\n\nAn ideal base for adventure lovers and nature enthusiasts, the hotel is perfectly situated to explore the dramatic landscapes of Exmoor National Park. After a day exploring, return to the conveniently located spot for an hand-pulled ale and pub grub at The Ancient Mariner, or a delicious seasonal meal at the onsite restaurant.",
    "offer_country_name": "United Kingdom",
    "offer_country_code_alpha_2": "GB",
    "offer_geo_area_level_1": "England",
    "offer_geo_area_level_2": "Lynmouth",
    "location_heading": "North Devon",
    "location_subheading": "United Kingdom",
    "location_description": "The Bath Hotel Lynmouth",
    "offer_address": "Lynmouth Street, Lynmouth, North Devon, EX35 6EL, United Kingdom",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 23,
    "price": 239.0,
    "value": 619.0
  }
]