[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xfaGAAQ",
    "hero_image": "https://images.luxuryescapes.com/8u809leyp4s5auuwcspg",
    "image_two": "https://images.luxuryescapes.com/t1itun1hbhz1ajdw03rf",
    "image_three": "https://images.luxuryescapes.com/khko8puc6ap4vwnf67ea",
    "vendor_name": "The Potting Shed",
    "title": "New Zealand: Secluded Northland Private Cabin Escape with Three-Course Dinner",
    "description": "An intimate escape from everyday life beckons at The Potting Shed, a secret slice of contemporary luxury in Northland, New Zealand. Enjoy exclusive use of this stunning private cabin for two, surrounded by native bush, farmland and seaside villages, and a short walk from the beautiful Langs Beach. Ideally nestled on the 45-hectare Andersons Cove private farm, The Potting Shed sits within easy reach of local walking tracks, golf courses and fishing spots.\n\nJust 50 minutes' drive from Whangārei and two hours from Auckland, The Potting Shed prides itself on creating a peaceful, homely environment for couples. The property and its stunning garden are reserved just for you: spend days relaxing amid the luscious citrus grove and fruit orchard, cosying up by the fireplace or taking a soak in the outdoor hot tub.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Northland",
    "offer_geo_area_level_2": "Langs Beach",
    "location_heading": "Northland",
    "location_subheading": "New Zealand",
    "location_description": "The Potting Shed",
    "offer_address": "101 Bream Tail Road, Langs Beach 0582, New Zealand",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 12,
    "price": 2169.0,
    "value": 3257.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvIJqAAN",
    "hero_image": "https://images.luxuryescapes.com/3njlqebz49kl33u8xj5",
    "image_two": "https://images.luxuryescapes.com/ykb8cqqc8mude15eilot",
    "image_three": "https://images.luxuryescapes.com/8ns4py5ebpjd8apmpvh",
    "vendor_name": "Clifftops Lodge",
    "title": "Boutique Langs Beach Cottage Escape near Bream Bay with Private Cedar Hot Tub",
    "description": "Find yourself in the rugged beauty of New Zealand’s North Island in a luxury cottage perched high above Bream Bay, boasting a clifftop safari-style lodge and charming garden cottage. The lodge sits on the edge of a dramatic cliffside with a lavish outdoor lounge area, while the cottage is deep within the manicured grounds, both featuring a romantic cedar hot tub. Cosy up in front of the gas fireplace, sip on local wine and prepare a gourmet meal in the kitchen.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Northland",
    "offer_geo_area_level_2": "Langs Beach",
    "location_heading": "Northland",
    "location_subheading": "New Zealand",
    "location_description": "Andersons Cove",
    "offer_address": "101 Bream Tail Road, Langs Beach, Northland, 0582, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1835.0,
    "value": 1835.0
  }
]