[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000C7lw9YAB",
    "hero_image": "https://images.luxuryescapes.com/99ntswyj7d132zpw91l",
    "image_two": "https://images.luxuryescapes.com/s3k9hpv07bvzt2euf1f",
    "image_three": "https://images.luxuryescapes.com/vhdchmq37kzixb6u67wl",
    "vendor_name": "Bon Park Hotel at VidantaWorld",
    "title": "Grand Opening: Mexico Family-Friendly Resort in Riviera Nayarit with Daily Breakfast, Resort Credit & Return Airport Transfers",
    "description": "Be one of the first to experience the brand-new BON Park Hotel, Nuevo Vallarta's latest resort treasure. This hotspot is where luxury collides with pure fun. Picture yourself lounging in sleek accommodations with views so stunning, you'll think you're dreaming.\n\nBON Luxury Theme Park is right next door for adventure seekers, while Spatium and Brio Spa offer next-level relaxation. Guests can take a dip in one of the many outdoor pools, tee off at one of three golf courses, hit the tennis court or indulge in the many restaurants and bars onsite.\n\nStroll along the Malecón boardwalk for local art and ocean views, or relax on sun-kissed beaches with Banderas Bay as your backdrop. Whether you're diving into watersports or enjoying the natural beauty, BON Park Hotel sets the stage for your Mexican adventure.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Nayarit",
    "offer_geo_area_level_2": "Nuevo Vallarta",
    "location_heading": "Nuevo Vallarta",
    "location_subheading": "Mexico",
    "location_description": "BON Park Hotel",
    "offer_address": "Paseo de Las Moras, Nuevo Vallarta, Nayarit 63735, Mexico",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 3149.0,
    "value": 5587.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP9mYAF",
    "hero_image": "https://images.luxuryescapes.com/usg61bll28lbufat4r7c",
    "image_two": "https://images.luxuryescapes.com/9xgzr4iter2sea226rp",
    "image_three": "https://images.luxuryescapes.com/qwv8q0evfssxumza9owk",
    "vendor_name": "Marival Distinct All-Inclusive Future Handwritten Collection",
    "title": "Mexico Nuevo Vallarta Beachfront Resort with Onsite Dining, Five Pools & Spa",
    "description": "Welcome to Marival Distinct Residences & Spa, the vacation jackpot where luxury living meets beachside bliss. Chow down at Omaggio Restaurant when you're feeling fancy, or grab ocean-view bites at Mozzamare Restaurant. Fancy a drink? Take your pick from the cool vibes at Lemmon Grass poolside to breathtaking sunset cocktails at Insú Sky Bar.\n\nSplash around in five jaw-dropping pools, or treat yourself to some pampering at Mélange World Spa. The little ones can run wild at the Kids' Club while teens can hang out in their own sweet spot. Squeeze in a workout at the top-notch fitness centre or kick back with a cold one at Brunello Bar. Nestled in the streets of Nuevo Nayarit, just steps from the ocean, Marival Distinct Residences & Spa - Handwritten Collection is a haven of relaxation.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Nayarit",
    "offer_geo_area_level_2": "Nuevo Vallarta",
    "location_heading": "Nuevo Vallarta",
    "location_subheading": "Mexico",
    "location_description": "Marival Distinct Residences & Spa - Handwritten Collection",
    "offer_address": "Paseo de los Cocoteros Lote 53, Villa 8, Nuevo Vallarta 63735, Mexico",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 468.0,
    "value": 468.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DJFDZYA5",
    "hero_image": "https://images.luxuryescapes.com/h1z4z01lrg5bt7atzbf",
    "image_two": "https://images.luxuryescapes.com/07h76ebhcm2prwqvt9q",
    "image_three": "https://images.luxuryescapes.com/8myaicagbvtm62sr44wr",
    "vendor_name": "Villa del Palmar Flamingos",
    "title": "Five-Star Beachfront Mexico All-Suite Retreat near Puerto Vallarta with 10 Restaurants & Bars",
    "description": "Indulge in the serene elegance of this five-star retreat, nestled on the shimmering shores of Mexico's Riviera Nayarit. This beachfront haven offers a unique blend of modern luxury and authentic Mexican charm, with spacious suites, a world-class spa, a stunning multi-level pool and 10 restaurants and bars.\n\nStep outside the resort and you'll find yourself in the heart of Nuevo Vallarta, a vibrant town known for its beautiful marina, boutique shopping, and golf courses. Take a leisurely stroll along the palm-lined promenade, or explore the town's bustling farmers' markets.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Nayarit",
    "offer_geo_area_level_2": "Nuevo Vallarta",
    "location_heading": "Nuevo Vallarta",
    "location_subheading": "Mexico",
    "location_description": "Villa del Palmar Flamingos",
    "offer_address": "Paseo de los Cocoteros 750, Flamingos, 63732 Bucerías, Nay., Mexico",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 139.0,
    "value": 139.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DkWTgYAN",
    "hero_image": "https://images.luxuryescapes.com/llvan5dafh8sxozcqwl9",
    "image_two": "https://images.luxuryescapes.com/5tjl3uhcwgpweia42pyv",
    "image_three": "https://images.luxuryescapes.com/su7jwjer3210znsmw6g",
    "vendor_name": "Villa La Estancia Beach Resort & Spa Riviera Nayarit",
    "title": "Mexican Riviera Oceanfront Hacienda-Style Escape with Eight Restaurants",
    "description": "Perched on the golden shores of Flamingos Beach, perfectly situated between the vibrant Puerto Vallarta and the serene Riviera Nayarit, this resort offers an unparalleled Mexican Riviera experience. With a warm, inviting ambience and sophisticated amenities, it’s the ideal escape for relaxation and adventure.\n\nLounge by the sparkling pool or stroll just a few steps to the gentle waves. Savour local and international flavours at the resort’s eight onsite restaurants and bars, indulge in soothing spa treatments and unwind in timeless hacienda-style accommodations. Beyond the resort, endless activities beckon - from horseback riding expeditions to thrilling marine adventures, all within easy reach.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Nayarit",
    "offer_geo_area_level_2": "Nuevo Vallarta",
    "location_heading": "Nuevo Vallarta",
    "location_subheading": "Mexico",
    "location_description": "Villa La Estancia Beach Resort & Spa Riviera Nayarit",
    "offer_address": "Paseo Cocoteros 750 Sur, Nuevo Vallarta, NAY 63732, Mexico",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 203.0,
    "value": 203.0
  }
]