[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Ef8KAAS",
    "hero_image": "https://images.luxuryescapes.com/t6txjem8clrdgzb9df1q",
    "image_two": "https://images.luxuryescapes.com/3e1rmu7v30bfxc4do08",
    "image_three": "https://images.luxuryescapes.com/xzebf3gtyn7ltjry1pmq",
    "vendor_name": "Pen-y-bryn Lodge",
    "title": "South Island Heritage Escape near Bushy Beach with Evening Drinks",
    "description": "Discover the natural beauty of Oamaru and New Zealand’s Waitaki District with a stay at Pen-y-bryn Lodge, located just a five-minute drive from Bushy Beach Scenic Reserve. This historic hotel’s excellent location makes it easy to view the endangered yellow-eyed penguin colony at Bushy Beach and places other major attractions such as Oamaru Public Gardens, Forrester Gallery and Waitaki Museum at your fingertips.\n\nYour stay includes daily breakfast, complimentary beer, wine and house drinks served by your hosts in the heritage drawing room every night and late 1pm checkout.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Otago",
    "offer_geo_area_level_2": "",
    "location_heading": "Oamaru",
    "location_subheading": "New Zealand",
    "location_description": "Pen-y-bryn Lodge 2018",
    "offer_address": "41 Towey St , Holmes Hill Oamaru OTA 9401 New Zealand",
    "percentage_discount": 45.0,
    "min_duration": 1,
    "max_duration": 5,
    "price": 249.0,
    "value": 449.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070v3YAAQ",
    "hero_image": "https://images.luxuryescapes.com/99hhko517v4qha23klc",
    "image_two": "https://images.luxuryescapes.com/syu2gma97jpkhayseewo",
    "image_three": "https://images.luxuryescapes.com/3us1ko9zyee75k8bvlgts",
    "vendor_name": "Casa Nova House",
    "title": "South Island: Newly Opened Oamaru Heritage-Listed Escape with NZ$100 Dining Credit & Daily Breakfast",
    "description": "Among the Victorian streetscapes and scenic views of New Zealand’s Oamaru, you’ll find Casa Nova House, a heritage-listed estate first built in 1861, now offering a relaxing, food-focused escape. Recently renovated and opened to the public in March 2021, Casa Nova House offers a luxury bed and breakfast experience complete with dining opportunities any foodie is sure to love. Wallpapered rooms with plush couches in bright colours evoke a Victorian feel, while the modern amenities and lush greenery surrounding the limestone mansion will have you wishing for a longer stay.\n\nBeyond daily gourmet breakfast in the elegant Burns Sitting Room, you can enjoy the culinary delights of Restaurant 1861, located just below your accommodation. There, tapas-style dishes inspired by cultures across the globe are given the Kiwi treatment, creating a flavour-filled menu bursting with unique eats. Once you’ve eaten your fill, take advantage of your half-day e-bike hire and cycle through the nearby bike paths, taking in views of the ocean and mountains along the way.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Otago",
    "offer_geo_area_level_2": "Oamaru",
    "location_heading": "Oamaru",
    "location_subheading": "New Zealand",
    "location_description": "Casa Nova House",
    "offer_address": "1 Alt Street, Oamaru North, Oamaru 9400, New Zealand",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 499.0,
    "value": 901.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LfNZAA0",
    "hero_image": "https://images.luxuryescapes.com/k3qpkid99ce95xlo9co",
    "image_two": "https://images.luxuryescapes.com/sykmumgwtld4dgvpexk",
    "image_three": "https://images.luxuryescapes.com/3wjk1s9s603y8un35go",
    "vendor_name": "Pen-y-bryn Lodge",
    "title": "Historic Oamaru Escape Just Five Minutes’ Drive from Bushy Beach Scenic Reserve",
    "description": "Discover the natural beauty of Oamaru and New Zealand’s Waitaki District with a stay at Pen-y-bryn Lodge, located just a five-minute drive from Bushy Beach Scenic Reserve. The historic hotel’s excellent location makes it easy to view the endangered yellow-eyed penguin colony at Bushy Beach and places other major attractions such as Oamaru Botanic Gardens, Forrester Art Gallery and North Otago Museum at your fingertips. Your stay includes daily breakfast, a cheese platter and wine for two plus a leisurely 1pm checkout.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Otago",
    "offer_geo_area_level_2": "Oamaru",
    "location_heading": "Oamaru",
    "location_subheading": "New Zealand",
    "location_description": "Pen-y-bryn Lodge",
    "offer_address": "41 Towey St, Holmes Hill, Oamaru 9401, New Zealand",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 495.0,
    "value": 795.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007ocUnAAI",
    "hero_image": "https://images.luxuryescapes.com/ic8qb21wjorkqryrqoa",
    "image_two": "https://images.luxuryescapes.com/vdkwjep1mjg2mbwn66ps",
    "image_three": "https://images.luxuryescapes.com/2f8aanlybn8ejcedmjy6",
    "vendor_name": "Pen-y-bryn Lodge",
    "title": "South Island Hilltop Heritage Lodge Retreat",
    "description": "Discover the natural beauty of North Otago on New Zealand’s South Island with a stay at Pen-y-bryn Lodge, ranked within the top 10% of properties on Tripadvisor. The former 19th-century Victorian mansion, awarded Category One historic status by Heritage New Zealand, is poised on Oamaru’s South Hill with the Pacific Ocean on one side and jaw-dropping mountains on the other.\n\nEach of the five guest rooms is individually decorated with striking antiques and charming furnishings to ensure an enchanting stay. During the day, visit the endangered, yellow-eyed penguin colony at Bushy Beach, just a five-minute drive away. For art enthusiasts, take the short stroll to Steampunk HQ, a gallery filled with sci-fi and steam-powered technology-inspired pieces, The Forrester Gallery and Waitaki Museum showcasing artefacts from the earliest days of Māori settlement. To get a dose of nature, Oamaru Public Gardens, one of the country's oldest public gardens are also within walking distance. Back at the hotel, admire the lush gardens, or head to the dining room for a taste of the region's amazing and abundant produce.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Otago",
    "offer_geo_area_level_2": "Oamaru",
    "location_heading": "Oamaru",
    "location_subheading": "New Zealand",
    "location_description": "Pen-y-bryn Lodge",
    "offer_address": "41 Towey St, Holmes Hill, Oamaru 9401, New Zealand",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 15,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008JBjDAAW",
    "hero_image": "https://images.luxuryescapes.com/gxd39ylirjlb3q597yk",
    "image_two": "https://images.luxuryescapes.com/b2bvm0re9i5sfjd8oio",
    "image_three": "https://images.luxuryescapes.com/sxhcpqxatyszuworxbei",
    "vendor_name": "Casa Nova House",
    "title": "Heritage-Listed South Island Oamaru Escape with Sea Views",
    "description": "Step into the idyllic town of Oamaru, Waitaki, and experience a historic stay with a modern twist at the lavishly restored Casa Nova House, first built in 1861. Brimming with personality and dazzling coastal views, Casa Nova House is an essential stop for those seeking a memorable stay. Relax in style at one of three vibrant guest rooms; each one proudly enhanced with eye-catching wallpaper by famed British graphic artist Emma J Shipley. At the end of each day, drop into the the nearby heritage bar and eatery The Criterion Hotel - perfect for savouring modern kiwi dishes with a twist.\n\nStep outside this glorious history-filled abode and delight in a visit to the Oamaru Blue Penguin Colony, hike your way to the perfect picnic spot at Kakanui Range or shake things up with a trip to the unpredictable and intriguing Steampunk HQ museum. If you're looking for the perfect meeting of the old-fashioned and the picturesque, this is it.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Otago",
    "offer_geo_area_level_2": "Oamaru",
    "location_heading": "Oamaru",
    "location_subheading": "New Zealand",
    "location_description": "Casa Nova House",
    "offer_address": "1 Alt Street, Oamaru North, Oamaru 9400, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 268.0,
    "value": 268.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006BtMnAAK",
    "hero_image": "https://images.luxuryescapes.com/j59rlqk56pt8sqhfjoqf",
    "image_two": "https://images.luxuryescapes.com/yuhncm53fgqa23yjeb3s",
    "image_three": "https://images.luxuryescapes.com/6vvhdn2a7sbgkt55r2ud",
    "vendor_name": "Pen-y-bryn Lodge",
    "title": "South Island Hilltop Heritage Lodge Retreat in North Otago",
    "description": "Discover the natural beauty of North Otago in New Zealand’s South Island with a stay at Pen-y-bryn Lodge, ranked within the top 10% of properties on Tripadvisor. Immerse yourself in the region’s fascinating history at this former Victorian mansion, which dates back to 1889. Poised on Oamaru’s South Hill, overlooking the Pacific on one side and jaw-droppingly beautiful mountains on the other, the house has been awarded historic status.\n\nIn keeping with the lodge's past, each of the five guest rooms is individually decorated with striking antiques and charming furnishings to ensure an enchanting stay. During the day, visit the endangered, yellow-eyed penguin colony at Bushy Beach, just a five-minute drive away. Don’t miss a visit to Steampunk HQ, a quirky gallery filled with sci-fi and steam-powered technology-inspired pieces and visit Oamaru Public Gardens - among the country’s oldest gardens. The Forrester Gallery and Waitaki Museum are also worth a visit, showcasing artefacts dating to the earliest days of Māori settlement. At the end of each day, head to the hotel's dining room for a taste of the Waitaki region's amazing and abundant produce.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Otago",
    "offer_geo_area_level_2": "Oamaru",
    "location_heading": "Oamaru",
    "location_subheading": "New Zealand",
    "location_description": "Pen-y-bryn Lodge",
    "offer_address": "41 Towey St, Holmes Hill, Oamaru 9401, New Zealand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 22,
    "price": 379.0,
    "value": 379.0
  }
]