[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UmOvAAK",
    "hero_image": "https://images.luxuryescapes.com/w48tgucj6o3qqwln4t4",
    "image_two": "https://images.luxuryescapes.com/85vd5y2hx1p0fd75f7",
    "image_three": "https://images.luxuryescapes.com/v2gsong5i581lmqr1fn",
    "vendor_name": "Mia Beach Abode",
    "title": "Coastal Villa Escape near Byron Bay for up to 8 Guests with Sparkling Wine & Gourmet Hamper",
    "description": "Escape to the glorious shores of northern New South Wales with a boutique stay at Mia Beach Abode - a beautifully designed four-bedroom villa for up to eight guests, offering direct access to one of the region's best beaches. Blessed with a spectacular location in the quiet coastal town of Ocean Shores, Mia Beach Abode calls for a sun-kissed escape with family and friends.\n\nYou'll love every detail of this peaceful coastal retreat: the modern design, the sprawling living and dining areas, and the perfectly manicured gardens, leading directly to South Golden Beach. This architectural gem also places you just 30 minutes north of Byron Bay and a 30-minute drive from Gold Coast Airport - making it the ideal base to discover the region. Whether you head north or south from your boutique home, you’ll find plenty of spectacular beaches, charming coastal towns and lush national parks to explore. When you’re ready to relax, retreat to your beachside haven, a stunning space complete with a private outdoor area with firepit.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Ocean Shores",
    "location_heading": "Ocean Shores",
    "location_subheading": "New South Wales",
    "location_description": "Mia Beach Abode",
    "offer_address": "16 Mia Crt, Ocean Shores NSW 2482",
    "percentage_discount": 20.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 1535.0,
    "value": 1920.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003fUgyAAE",
    "hero_image": "https://images.luxuryescapes.com/01phi1ybflxyz9itorq",
    "image_two": "https://images.luxuryescapes.com/3cxmb51eshfqktgm3vxa",
    "image_three": "https://images.luxuryescapes.com/77w8em2jie40p9qmnnod",
    "vendor_name": "Mia Beach Abode",
    "title": "Beachside Villa Escape Near Byron Bay for up to 8 Guests with Sparkling Wine & Gourmet Hamper",
    "description": "Escape to the glorious shores of Northern New South Wales with a luxurious stay at Mia Beach Abode - a beautifully designed four-bedroom villa sleeping up to eight guests, ideally located just a stone’s throw from one of the best beaches in the region.\n\nThis architectural gem boasts an enviable location in NSW's sunny South Golden Beach, and places you just 30 minutes north of Byron Bay and a 30-minute drive from Gold Coast Airport - making it the ideal base to discover the region. Whether you head north or south from your boutique home, you’ll find plenty of spectacular beaches, blissful coastal towns and lush national parks to explore.\n\nWhen you’re ready to unwind, retreat to your beachside haven, a stunning space complete with a private outdoor area with a fire pit to make the most of the weather, as well as direct access to the beach via a path through the private gardens.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Ocean Shores",
    "location_heading": "Ocean Shores",
    "location_subheading": "New South Wales",
    "location_description": "Mia Beach Abode",
    "offer_address": "16 Mia Crt, Ocean Shores NSW 2482",
    "percentage_discount": 28.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 1439.0,
    "value": 2001.0
  }
]