[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQPfnAAH",
    "hero_image": "https://images.luxuryescapes.com/ilqblqrsldxasoq9ktmr",
    "image_two": "https://images.luxuryescapes.com/9bdy6tbsvpy57hch83y",
    "image_three": "https://images.luxuryescapes.com/gljxevhksqwxvo64vu2h",
    "vendor_name": "WelcomHeritage Ramgarh",
    "title": "Panchkula Royal Palace Escape with Daily Breakfast & Dining Discount",
    "description": "At WelcomHeritage Ramgarh, a royal palace-hotel in Haryana's Panchkula city, travel back in time to the 17th century. This regal retreat is about 40 minutes from Chandigarh International Airport (IXC) and a four-hour trip from Delhi. It has been renovated into a modern retreat while keeping the grandeur of its former self. The rich Rajputana-style architecture of this palace-hotel that's portrayed in its interior with some gorgeous mirror artwork, colorful motifs, precious paintings and metal handiwork will never cease to amaze you. A beautiful blend of old-world charm and contemporary ITC hospitality, WelcomHeritage Ramgarh is an easy weekend escape from Delhi/Gurgaon and Chandigarh.\n\nRelax in one of the many beautifully redesigned rooms that retain the charm of the bygone royal era while pampering you with contemporary comforts. Diwan Khana, an all-day dining restaurant, provides you with a Rajputana-style setting and flavours from Punjab and Haryana through inventive combinations introduced by the in-house master chefs. When staying at WelcomHeritage Ramgarh, you can keep occupied with garden walks, uncommon dining experiences, yoga to reenergise you, and other enjoyable activities. Reserve this retreat for a regal vacation.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Haryana",
    "offer_geo_area_level_2": "Panchkula",
    "location_heading": "Panchkula",
    "location_subheading": "India",
    "location_description": "WelcomHeritage Ramgarh",
    "offer_address": "The Quila, Ramgarh, NH 73, Near Sector 28, Panchkula, Haryana 134118, India",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 105.0,
    "value": 162.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI5z4AAD",
    "hero_image": "https://images.luxuryescapes.com/zpmwwiihqkypbfw1pj29",
    "image_two": "https://images.luxuryescapes.com/fh0zljhrzf1vxfc2hsa8",
    "image_three": "https://images.luxuryescapes.com/bbcd5dw4bj2e9cse0c1s",
    "vendor_name": "Holiday Inn Chandigarh Panchkula",
    "title": "Modern Punjab Escape near Morni Hills with Indoor & Outdoor Pools",
    "description": "Discover a stylish and comfortable stay at the Holiday Inn Chandigarh Panchkula, an IHG Hotel - perfect for tourists looking for adventure or business travellers in need of a restful stay.  Boasting a convenient central location, the hotel is just a short drive from a range of natural beauties like the Rose Garden and Morni Hills. After days spent exploring the area, find rejuvenation in the sparkling outdoor or indoor pools and indulge in the delicious traditional cuisine served at Cafe G.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Haryana",
    "offer_geo_area_level_2": "Panchkula",
    "location_heading": "Panchkula",
    "location_subheading": "India",
    "location_description": "Holiday Inn Chandigarh Panchkula, an IHG Hotel",
    "offer_address": "City Centre, Sector 3, Panchkula, Haryana, India 134109",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 91.0,
    "value": 91.0
  }
]