[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuyREAAZ",
    "hero_image": "https://images.luxuryescapes.com/whl1hk4o85v2arzbprm9",
    "image_two": "https://images.luxuryescapes.com/sh70sm6wfnzits4see7",
    "image_three": "https://images.luxuryescapes.com/1k2u84pxwuqgc4fx00hr",
    "vendor_name": "Azia Resort & Spa",
    "title": "Cyprus: Five-Star Paphos Escape with Daily Breakfast, Nightly Dinner & Sea-View Room Upgrade",
    "description": "Barefoot Mediterranean luxury is best experienced at Azia Resort & Spa Paphos - a five-star, eco-friendly sanctuary set against verdant greenery and breathtaking sea vistas and sunsets. Just a short drive from the UNESCO-listed Paphos Archaeological Park, this luxurious resort is the perfect base for exploring Cyprus' rich history. Indulge in a culinary journey at six exquisite onsite dining venues, offering everything from traditional Cypriot fare to Japanese teppanyaki, sourced fresh from the resort's plantation. Delight in an afternoon refreshment at one of many bars, including Yialos Pool Bar, which serves a selection of tropical cocktails, then unwind at Asphodel Spa with an authentic steam bath or jet massage.\n\nKeep the little ones entertained in the Kids' Club, check out the activities schedule and choose to enjoy a game of tennis or a selection of watersports. Explore the vibrant island with a scenic hike along the Aphrodite Trail and savour a traditional meze platter at a local taverna in the charming Paphos Old Town. In the evening, return to catch live music at The Stage or Cava Bar.",
    "offer_country_name": "Cyprus",
    "offer_country_code_alpha_2": "CY",
    "offer_geo_area_level_1": "Paphos District",
    "offer_geo_area_level_2": "Paphos",
    "location_heading": "Paphos",
    "location_subheading": "Cyprus",
    "location_description": "Azia Resort & Spa Paphos",
    "offer_address": "Chlorakas Avenue 131, Chlorakas 8220, Paphos, Cyprus",
    "percentage_discount": 75.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 779.0,
    "value": 3150.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxDbeAAF",
    "hero_image": "https://images.luxuryescapes.com/cxmcin4o1r570hy4lg",
    "image_two": "https://images.luxuryescapes.com/gfak8xbxb3ruqem4n7dl",
    "image_three": "https://images.luxuryescapes.com/8l291v8g67d240q01l59",
    "vendor_name": "Azia Resort & Spa",
    "title": "Cyprus: Paphos Barefoot Beachside Glamour with Daily Breakfast & Nightly Dinner",
    "description": "Soak up the Mediterranean charms of Cyprus with a luxurious stay at this five-star, eco-friendly sanctuary perched along the west coast of Paphos. A short drive from the UNESCO-listed Paphos Archaeological Park, the resort is the perfect base for exploring Cyprus' rich history. Embark on a culinary journey at six exquisite onsite dining venues, offering everything from traditional Cypriot fare to Japanese teppanyaki. Delight in an afternoon refreshment at one of many bars, including Yialos Pool Bar, which serves a selection of tropical cocktails, then unwind at Asphodel Spa with an authentic steam bath or jet massage.\n\nKeep the little ones entertained in the Kids' Club, or get the whole family involved in a game of tennis or watersports. Explore the vibrant island with a scenic hike along the Aphrodite Trail and savour a traditional mezze platter at a local taverna in the charming Paphos Old Town. In the evening, return to catch live music at The Stage or Cava Bar.",
    "offer_country_name": "Cyprus",
    "offer_country_code_alpha_2": "CY",
    "offer_geo_area_level_1": "Paphos District",
    "offer_geo_area_level_2": "Paphos",
    "location_heading": "Paphos",
    "location_subheading": "Cyprus",
    "location_description": "Azia Resort & Spa Paphos",
    "offer_address": "Chlorakas Avenue 131, Chlorakas 8220, Paphos, Cyprus",
    "percentage_discount": 71.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 919.0,
    "value": 3150.0
  }
]