[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005Jn3MAAS",
    "hero_image": "https://images.luxuryescapes.com/lptzxt2nkuhec3kdg9",
    "image_two": "https://images.luxuryescapes.com/vyaw1e38dgsnkzk1cbbo",
    "image_three": "https://images.luxuryescapes.com/my8h6o1tccckzs89w1",
    "vendor_name": "The Cove Atlantis Paradise Island Bahamas",
    "title": "Bahamas The Cove Oasis with Two Private Beaches & Dolphin Cay Habitat",
    "description": "Atlantis is real and it’s hidden in the Bahamas - find it with an otherworldly stay at The Cove Atlantis Paradise Island Bahamas. Here, the palm-studded entryway and two pristine private beaches set the tone of utter luxury and relaxation.\n\nThis secluded retreat - just 10 minutes over Paradise Island bridge and a two-minute shuttle ride from Atlantis’ six other resorts, home to the 141-acre Aquaventure water park, Ruins Lagoon marine exhibit and Dolphin Cay habitat - offers luxury redefined by award-winning interior designer Jeffrey Beers. Let the sun wash over you in the exclusive, adults-only pool flanked by 20 cabanas and find unparalleled tranquillity with private beach access. Take your pick of four restaurants (of the 21 total across all of Atlantis’ resorts) - including Mosaic, with live cooking stations, and Fish by José Andrés. Let your hair down with 18 holes of breathtaking oceanfront golf and access to two exquisite pools at The Cove and 11 pools total across all of Atlantis' resorts.",
    "offer_country_name": "Bahamas",
    "offer_country_code_alpha_2": "BS",
    "offer_geo_area_level_1": "New Providence",
    "offer_geo_area_level_2": "Paradise Island",
    "location_heading": "Paradise Island",
    "location_subheading": "The Bahamas",
    "location_description": "The Cove Atlantis Paradise Island Bahamas",
    "offer_address": "1 Casino Drive, Paradise Island",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1209.0,
    "value": 1209.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005Jn3gAAC",
    "hero_image": "https://images.luxuryescapes.com/a490n4uwlr0tqrnxnt",
    "image_two": "https://images.luxuryescapes.com/l31qobqy6meknlfpq3ulr",
    "image_three": "https://images.luxuryescapes.com/g07vocs1c98ox5npkdde",
    "vendor_name": "The Reef at Atlantis Paradise Island",
    "title": "Self-Contained The Reef at Atlantis Hideaway in The Bahamas with Private Beach",
    "description": "Tucked away on its very own stretch of pristine, white-sand beach opposite Nassau Harbour on the breathtakingly secluded Paradise Island, The Reef at Atlantis Paradise Island invites you to unplug completely - or plug into all that Atlantis has to offer.\n\nSurrounded by Atlantis’ six other resorts - each just a two-minute shuttle ride from one another - The Reef can be your self-contained sanctuary or your launchpad to the wonders of this perfect drop in the Caribbean Ocean. Choose a residential studio, a suite or a penthouse complete with laundry facilities and kitchenette, then find your ideal version of Atlantis. The foodies can savour coastal cuisine at Paranza or Mosaic's live cooking stations, while water-lovers can plunge into the Baths Colonnade’s pool framed by 2.5 acres of deck or the 2.7-million gallon Ruins Lagoon. Stretch out on Cove and Paradise beaches, then venture to Sip Sip by Chef Julie Lightbourn for a handcrafted cocktail.",
    "offer_country_name": "Bahamas",
    "offer_country_code_alpha_2": "BS",
    "offer_geo_area_level_1": "New Providence",
    "offer_geo_area_level_2": "Paradise Island",
    "location_heading": "Paradise Island",
    "location_subheading": "The Bahamas",
    "location_description": "The Reef at Atlantis Paradise Island",
    "offer_address": "1 Casino Drive, Paradise Island",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 406.0,
    "value": 406.0
  }
]