[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000ET5p4YAD",
    "hero_image": "https://images.luxuryescapes.com/0h110zd3d2svr1ij6p",
    "image_two": "https://images.luxuryescapes.com/xozz2on8foey9qxjy5",
    "image_three": "https://images.luxuryescapes.com/u3p0hoety9jt1c01uf",
    "vendor_name": "La Miniera Pool Villas Pattaya",
    "title": "Thailand Pattaya Family-Friendly Private Pool Villas with Daily Dining & Free-Flow Cocktail Hour",
    "description": "Treat yourself to a tropical Thailand escape at this serene five-star oasis tucked away in the vibrant city of Pattaya. Villas nestled in lush gardens and graced by a tranquil pool, this enchanting retreat - handpicked as one of the Small Luxury Hotels of the World - invites you to unwind in a sanctuary designed for relaxation and indulgence.\n\nSavour a unique culinary experience at Zaffiro Restaurant, where Modern Asian dishes are given a French twist, or enjoy a refreshing cocktail at the stylish Topazio Italiano Gelato Bar. Kids can relish endless fun at the Alessandrite Waterpark, while adults can relax and sip drinks at the swim-up bar, soaking up the sun.\n\nA short drive from the golden shores of Pattaya Beach and the breathtaking Sanctuary of Truth, La Miniera seamlessly blends tranquility with adventure. Whether you're seeking an intimate escape or a vibrant holiday, this resort has you covered.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "La Miniera Pool Villas Pattaya",
    "offer_address": "666 1 Pattaya City, Bang Lamung District, Chon Buri 20150, Thailand",
    "percentage_discount": 62.0,
    "min_duration": 4,
    "max_duration": 24,
    "price": 769.0,
    "value": 2045.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdM5dAAF",
    "hero_image": "https://images.luxuryescapes.com/ke6ra2luesjupu76uy4p",
    "image_two": "https://images.luxuryescapes.com/hkz49ovz9s86n7yy7uq",
    "image_three": "https://images.luxuryescapes.com/tjx2hqkop6sia3ddyc2",
    "vendor_name": "Dusit Thani Pattaya",
    "title": "Pattaya Beachfront Elegance with Daily Breakfast, Nightly Cocktails & One Lunch or Dinner",
    "description": "Authentic Thai hospitality and cosmopolitan opulence converge at this beachside resort in serene Pattaya. Delight in quiet moments by the pool with a fresh juice in hand or savour a fragrant array of seafood, premium meats, and Asian delicacies at The Bay, all while overlooking the glistening Gulf of Thailand. Dining experiences also include an all-day eatery, a gourmet bakery and an elegant Lobby Lounge with nightly live music. \n\nFor those seeking rejuvenation, the resort's extensive wellness programs are at your fingertips - find balance during a tai chi class, build emotional resilience, be revived with a glow-enhancing facial at Devarana Wellness or make connections during local experiences in Pattaya.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Dusit Thani Pattaya",
    "offer_address": "240/2 Pattaya Beach Road, Pattaya City, Chonburi 20150, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 589.0,
    "value": 1571.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gt73AAA",
    "hero_image": "https://images.luxuryescapes.com/v1l6luv5pp1ze82dzrb",
    "image_two": "https://images.luxuryescapes.com/ecel8nnooobap3wyvjkl",
    "image_three": "https://images.luxuryescapes.com/is8o6e4egqcu29agibim",
    "vendor_name": "Veranda Resort Pattaya Na Jomtien - MGallery",
    "title": "Five-Star Pattaya Beachfront Retreat with Daily Breakfast & Daily Lunch or Dinner",
    "description": "Make those tropical dreams come true with an escape to Veranda Resort Pattaya Na Jomtien - MGallery, a luxurious five-star property located just steps from the glistening ocean. Discover the meaning of true relaxation at this discreet sanctuary with four exquisite bars and restaurants, one sparkling infinity pool and a relaxing beach lawn space where you can hang out with a cocktail in hand.\n\nTake lazy strolls along Pattaya Beach, then soak up the sunshine as you lounge by the pool overlooking the ocean. When you can draw yourself away, visit the nearby Pattaya Floating Markets before exploring the main street and town. Whether you roam the neighbourhood on a leisurely bike ride or make waves on a jet ski, this glamorous resort is the perfect place to base all your Pattaya adventures.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Veranda Resort Pattaya Na Jomtien - MGallery",
    "offer_address": "211 Moo 1, Sattahip, Amphoe Bang Lamung, Chon Buri 20250, Thailand",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 602.0,
    "value": 1385.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zHqhAAE",
    "hero_image": "https://images.luxuryescapes.com/luvvfhqknlrfmcd1dblk",
    "image_two": "https://images.luxuryescapes.com/huj8m16diz93f9bx32ip",
    "image_three": "https://images.luxuryescapes.com/fq7yrlrp8asuk2dazqkg",
    "vendor_name": "Pullman Pattaya Hotel G",
    "title": "Pattaya Beachfront Pullman Escape with Daily Breakfast & Daily Resort Credit",
    "description": "Treat yourself to a sun-kissed escape at the five-star Pullman Pattaya Hotel G - a beachfront oasis surrounded by tropical gardens, just 1.5 hours' drive from Bangkok. Expect signature Pullman service, spectacular views from every angle and direct access to a pristine private beach - complete with glamorous beach bar.\n\nYour tropical escape includes daily breakfast at The Beach Club, daily THB500 resort credit per room to spend on food, drinks, spa treatments or anything you like across the resort, one-time complimentary non-alcoholic drinks from the minibar and more.\n\n**Club upgrades available:** Want to escape like a VIP? Stay in an Executive Club Room or in a Lanai Pool Access Room and enjoy access to the Executive Club Lounge and all its benefits. Indulge with daily breakfast in the privacy of the lounge, refreshments and afternoon snacks, and sunset cocktails served every night from 5.30pm to 6.30pm.\n\n**Travelling with family?** Two children (aged 11 years and under) stay free with breakfast included when sharing existing bedding (see Fine Print for details).",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Pullman Pattaya Hotel G",
    "offer_address": "Beach 445 Na Kluea 18, Pattaya City, Bang Lamung District, 20150, Thailand",
    "percentage_discount": 68.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 139.0,
    "value": 430.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009FKj7AAG",
    "hero_image": "https://images.luxuryescapes.com/ii08av6yzopi66dk5qkn",
    "image_two": "https://images.luxuryescapes.com/ka93u6mjxj466xywc0bv",
    "image_three": "https://images.luxuryescapes.com/kiyy4hro4kwh0uaymwb",
    "vendor_name": "Dusit Thani Pattaya",
    "title": "Pattaya Five-Star Beachfront Bliss with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Escape in five-star style to the sweeping northern shore of Pattaya, one of Thailand’s most iconic bays, staying at Dusit Thani Pattaya - winner of a Tripadvisor Travellers' Choice Award 2022. Embraced by lush tropical gardens, this elegant resort boasts spectacular views of the surrounding ocean and access to Pattaya’s gloriously balmy waters in a blissfully serene spot, tucked away just a 10-minute drive from the attractions of one of Thailand’s most vibrantly cosmopolitan cities. Dine across three exceptional restaurants, laze by the shimmering pool with a cocktail in-hand, or indulge with a trip to the onsite Devarana Spa.\n\nWhen you’re ready to explore Pattaya’s many delights, you’ll have the perfect base. Take a swing at any of the dozen world-class golf courses within an hour of the hotel, swim with sea turtles or feast at any of the city’s extraordinary street markets, where fresh seafood can be found in abundance.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Dusit Thani Pattaya",
    "offer_address": "240/2 Pattaya Beach Road, Pattaya City, Chonburi 20150, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 827.0,
    "value": 2229.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Il5Q5YAJ",
    "hero_image": "https://images.luxuryescapes.com/0b2ts9ou9s1h9wrmuzp",
    "image_two": "https://images.luxuryescapes.com/lgqad0g2fo3kljenabn",
    "image_three": "https://images.luxuryescapes.com/9l4y9u9bpkopmklu7efg",
    "vendor_name": "Melia Pattaya",
    "title": "Grand Opening: Thailand Beachfront Oasis with Daily Breakfast & Nightly Cocktails",
    "description": "Welcome to a newly opened five-star sanctuary that commands expansive views of the Gulf of Thailand, just 90 minutes from Bangkok. Here, thoughtful architecture celebrates local culture while establishing an exclusive retreat that captures Eastern Thailand's vibrant spirit. With a sparkling outdoor pool, pool bar and separate kids' pool, this is the ultimate place to escape it all.\n\nIndulge in a treatment at YHI Spa, savour Peking Duck from an authentic Chinese oven at Yitong Chinese Restaurant & Sky Bar, or enjoy fresh sushi and sashimi at DEN. The kids will love exploring the kids' club while the big kids take advantage of this beachfront location at the opulent LAY Beach Club. At the end of the day, venture up to Sky Bar for sunset ocean views that will take your breath away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Meliá Pattaya Hotel",
    "offer_address": "370 Moo 9, Nongprue, Pattaya, Banglamung, Chonburi 20150, Thailand",
    "percentage_discount": 76.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 389.0,
    "value": 1655.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EDMrFAAX",
    "hero_image": "https://images.luxuryescapes.com/1idewz71nm277d2jm3bl",
    "image_two": "https://images.luxuryescapes.com/kvkp3yv56fhz30f9fvzd",
    "image_three": "https://images.luxuryescapes.com/n6hlh8na94kl6g7damr",
    "vendor_name": "Cape Dara Pattaya Resort",
    "title": "Five-Star Thailand Beachfront Opulence with Outdoor Infinity Pool & Daily Breakfast",
    "description": "Wake up to unbroken views of the turquoise Gulf of Thailand at Cape Dara Resort Pattaya, an ultra-modern private escape on its very own palm-lined beachfront two hours south of Bangkok. Sip on poolside tipples while diving into the outdoor infinity pool, melt into plush daybeds under the warm sun and refresh with icy libations from the Sphere nitrogen bar. Immerse yourself in the flavours of Asia at the two opulent restaurants and when you are ready to leave the world behind, rejuvenate your mind and body with a tranquil spa treatment, set against the panoramic backdrop of the ocean.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Cape Dara Resort Pattaya",
    "offer_address": "256 Dara Beach, Soi 20, Pattaya-Naklua Road, Pattaya 20150, Thailand",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 609.0,
    "value": 1374.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DfhO7YAJ",
    "hero_image": "https://images.luxuryescapes.com/ody8kpq7i6r2agkqnl4",
    "image_two": "https://images.luxuryescapes.com/giun3y7xgashlvs5osv",
    "image_three": "https://images.luxuryescapes.com/fpxindoguetuxa43rqs",
    "vendor_name": "Dusit Thani Pattaya",
    "title": "Beachfront Pattaya Five-Star Elegance with Daily Breakfast, Nightly Cocktails & Daily Lunch or Dinner",
    "description": "Authentic Thai hospitality and cosmopolitan opulence converge at this beachside resort in serene Pattaya.\n\nDelight in quiet moments by the pool with a fresh juice in hand, or savour a fragrant array of seafood, premium meats and Asian delicacies at The Bay, all while overlooking the glistening Gulf of Thailand. Dining experiences also include an all-day eatery, a gourmet bakery and an elegant Lobby Lounge with nightly live music.\n\nFor those seeking rejuvenation, the resort’s extensive wellness programs are at your fingertips - find balance during a tai chi class, be revived with a glow-enhancing facial at Devarana Wellness or make connections during local experiences in Pattaya. Beyond the hotel, the vibrant Pattaya Night Bazaar and the enchanting Sanctuary of Truth await exploration.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Dusit Thani Pattaya",
    "offer_address": "240/2 Pattaya Beach Road, Pattaya City, Chonburi 20150, Thailand",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 25,
    "price": 569.0,
    "value": 1528.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FnkjpAAB",
    "hero_image": "https://images.luxuryescapes.com/bsrju8i2rj9wmuy4wa25",
    "image_two": "https://images.luxuryescapes.com/9j8zz2rtsrqtlyxo0wp",
    "image_three": "https://images.luxuryescapes.com/bt212f16ck9x6ua8b0j",
    "vendor_name": "Cape Dara Pattaya Resort",
    "title": "Five-Star Thailand Beachfront Opulence with Outdoor Infinity Pool, Club Lounge Access & Daily Breakfast",
    "description": "Wake up to unbroken views of the turquoise Gulf of Thailand at Cape Dara Resort Pattaya, an ultra-modern private escape on its very own palm-lined beachfront just two hours south of Bangkok. Dive into the shimmering outdoor infinity pool, lounge in the warm sun on plush daybeds and refresh with icy libations from the Sphere bar. Immerse yourself in the flavours of Asia at the two opulent restaurants, and when you're ready to leave the world behind, rejuvenate your mind and body with a tranquil spa treatment, set against the panoramic ocean backdrop.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Cape Dara Resort Pattaya",
    "offer_address": "256 Dara Beach, Soi 20, Pattaya-Naklua Road, Pattaya 20150, Thailand",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 17,
    "price": 579.0,
    "value": 1401.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DbFQPYA3",
    "hero_image": "https://images.luxuryescapes.com/ht3hdof4kb7sr9ixh2sq",
    "image_two": "https://images.luxuryescapes.com/7ajz6km2tv56ddp91vd",
    "image_three": "https://images.luxuryescapes.com/d1b1jlry1ilyeiowttg",
    "vendor_name": "Mövenpick Siam Hotel Na Jomtien Pattaya",
    "title": "Thailand Oceanfront Bliss 90 Minutes from Bangkok with Daily Breakfast & Club Lounge Access",
    "description": "Discover paradise in the heart of the Gulf of Thailand at the family-friendly Mövenpick Siam Na Jomtien Pattaya, where every moment feels like a dream come true. This gem sits just 90 minutes from Bangkok on a pristine stretch of beach, far enough from Pattaya's buzz to feel exclusive, yet close enough for adventure.\n\nPrepare for top-notch facilities that will make for an unforgettable family vacation. Lounge by the impressive lagoon pool or treat yourself to a blissful massage at Let's Relax Spa. Food lovers are in for a treat - from succulent steaks at T55 New York Grill to live cooking and signature dishes at Twist, every meal here is a celebration.\n\nWake up to phenomenal ocean views and enjoy slow morning walks along Jomtien Beach - the sunrise here is nothing short of magic. Everything you need for a relaxing beachfront retreat or a fun family getaway is within reach.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Sattahip",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Mövenpick Siam Na Jomtien Pattaya",
    "offer_address": "55 Moo 2, Sukhumvit Road, Jomtien, Pattaya 20250, Thailand",
    "percentage_discount": 70.0,
    "min_duration": 4,
    "max_duration": 27,
    "price": 539.0,
    "value": 1783.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Guz4kAAB",
    "hero_image": "https://images.luxuryescapes.com/s0yom3ckrf26vj3xvib5",
    "image_two": "https://images.luxuryescapes.com/fcj5r284k46f48th3jq",
    "image_three": "https://images.luxuryescapes.com/eqb3j6aa7fs9q92vtq",
    "vendor_name": "Sea Sand Sun Resort & Villas",
    "title": "Beachfront Pattaya Escape with Daily Massages, Daily Breakfast, Nightly Cocktails & Lunch or Dinner",
    "description": "Escape to the tranquil shores of this idyllic retreat, nestled in the southern Thai region of Pattaya. Reflecting the essence of nature with its design inspired by the sea, sand and sun, this meticulously crafted resort offers a secluded haven. Discover a secluded beach, verdant tropical landscapes and shaded pathways adorned with ancient trees. Whether you're lounging on the pristine shores of Bang Saray Beach or enjoying the panoramic views from the shimmering infinity pool, relaxation is inevitable. Embark on adventures with complimentary kayaks or hop on the convenient shuttle service to explore Pattaya City. Savour culinary delights at the gorgeous Horizon Sea View Restaurant, or pamper yourself with a rejuvenating massage at Sea Sand Sun Spa.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Sattahip",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Sea Sand Sun Resort and Villas",
    "offer_address": "78/4 M.8 Sukhumvit K.M.163, Na Jomtien, Sattahip, Chonburi Jomtien Beach, Pattaya, Thailand",
    "percentage_discount": 53.0,
    "min_duration": 1,
    "max_duration": 20,
    "price": 519.0,
    "value": 1103.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EeJkKAAV",
    "hero_image": "https://images.luxuryescapes.com/cokeyyuot3o06i6z2i9",
    "image_two": "https://images.luxuryescapes.com/2r1c0lzhmcig0bh4z9f",
    "image_three": "https://images.luxuryescapes.com/pee38soqjc3oeexl50oq",
    "vendor_name": "Sea Sand Sun Resort & Villas",
    "title": "Relaxing Pattaya Beachfront Break with Thai Massages, Daily Breakfast & Cocktails",
    "description": "Experience a relaxing beachfront break at Sea Sand Sun Resort and Villas, an idyllic retreat tucked away in the south of Pattaya. With a design inspired by the elements - sea, sand and sun - the well-manicured resort boasts a private beach, lush tropical gardens and mature tree-lined walkways. Spend your days lazing on the golden sands of Bang Saray Beach or by the glittering infinity pool with a cocktail in hand. If you're looking to explore further afield, take advantage of the resort's complimentary kayaks or jump on the shuttle service to nearby Pattaya City. Return to the resort for a meal at the newly renovated open-air Horizon Sea View Restaurant or indulge in a traditional Thai massage at Sea Sand Sun Spa.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Sattahip",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Sea Sand Sun Resort and Villas",
    "offer_address": "78/4 M.8 Sukhumvit K.M.163, Na Jomtien, Sattahip, Chonburi Jomtien Beach, Pattaya, Thailand",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 779.0,
    "value": 1826.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4OOLAA3",
    "hero_image": "https://images.luxuryescapes.com/q75d049uihp6vq76j1b",
    "image_two": "https://images.luxuryescapes.com/yji8hsuv5b98q9azh7",
    "image_three": "https://images.luxuryescapes.com/n931rzpkacbva3c3558l",
    "vendor_name": "Best Western Premier Bayphere Pattaya",
    "title": "Five-Star Pattaya Beachfront Escape with Daily Breakfast & Nightly Cocktails",
    "description": "Embrace sun-kissed tranquility at BWP Bayphere Pattaya, a five-star haven nestled on the shores of Na Jom Tien. This tropical resort is the perfect hideaway where you can relax, soak up some sun and recharge, all in a natural and peaceful environment complemented by warm and friendly Thai hospitality. Discover the meaning of true relaxation at this sanctuary with four exquisite bars and restaurants, one sparkling infinity pool and stunning sea views from the many viewing decks where you can hang out with a cocktail in hand.\n\nWhen you can draw yourself away, visit the nearby Pattaya Floating Market or take lazy strolls along Pattaya Beach before exploring the nearby main street and town. Whether you roam the neighbourhood by foot or make waves on a jet ski, this stylish resort is the perfect place to base all your Pattaya adventures.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Sattahip",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "BWP Bayphere Pattaya",
    "offer_address": "Na Chom Thian 18 Alley, Na Chom Thian Sattahip District Chon Buri 20250 Thailand",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 18,
    "price": 220.0,
    "value": 401.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pC5UAAU",
    "hero_image": "https://images.luxuryescapes.com/d5dfp30mw8nacc5qr6jm",
    "image_two": "https://images.luxuryescapes.com/k1cn4izj67rpobl0g4mm",
    "image_three": "https://images.luxuryescapes.com/9hdip6brk935bpu412",
    "vendor_name": "Cross Pattaya Pratamnak",
    "title": "Thailand Five-Star Pattaya Beachside Luxury",
    "description": "Experience the pinnacle of secluded romance at Cross Pattaya Pratamnak. This five-star sanctuary is ideally located in the high-end Pratamnak area of Pattaya, a popular beach resort on the Gulf of Thailand, just a two-hour drive from Bangkok. With just 78 remarkable rooms and superb suites offering delightful interiors and modern facilities, this colonial-style hideaway promises an escape that celebrates relaxation, comfort, and exquisite design.\n\nMake the most of the hotel’s luxurious amenities, which include an expansive saltwater outdoor pool surrounded by oversized sunbeds, cabanas and sofas, a full-service spa, and a fully equipped fitness and wellness centre. S E A S A L T restaurant will inspire you to rise early for a delightful bistro-style spread, while BITE BOX offers baked goods, cold-pressed juices, and artisanal ice teas. Or head to The Beach House, an effortlessly cool beachfront bar and restaurant, and the new Pattaya hotspot for casual luxury and delicious cuisine.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Cross Pattaya Pratamnak",
    "offer_address": "286, 4 M.12 Kasetsin, Pattaya City, Bang Lamung District, Chon Buri 20150, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 108.0,
    "value": 108.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nLbwAAE",
    "hero_image": "https://images.luxuryescapes.com/tnyhkls0f7r3frli6b2",
    "image_two": "https://images.luxuryescapes.com/tcvke78y46vc8djf2mi",
    "image_three": "https://images.luxuryescapes.com/tqrmap1i74pyytwkd37p",
    "vendor_name": "Royal Wing Suites & Spa",
    "title": "Pattaya Oceanfront Jacuzzi Suite Luxury with Private Beach",
    "description": "Experience flawless five-star luxury at Royal Wing Suites & Spa, a serene slice of perfection in Pattaya, Thailand’s vibrant wonderland. Officially opened by the King of Thailand and boasting panoramic views of the dazzling, deep-blue Gulf of Thailand, the resort offers opulence fit for a monarch. Be enchanted by the resort’s palm-fringed oceanfront pool, exquisite restaurants, pristine private beach and rejuvenating onsite spa. At the end of each day, your accommodation awaits to envelop you in jacuzzi suite luxury.\n\nWhen you’re ready to explore, Pattaya offers a wealth of options. Take a ferry to the magazine-perfect Koh Larn island for a tropical adventure you’ll never forget, or make the trek to the impressively intricate Sanctuary of Truth, carved in the image of hundreds of traditional deities. Those looking to dip a toe into Thailand's dazzling nightlife will be enthralled by the city's endless bars, pubs and eateries.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Royal Wing Suites & Spa Pattaya",
    "offer_address": "353 Phra Tamnak, Muang Pattaya, Bang Lamung District, Chon Buri 20150, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 761.0,
    "value": 761.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IlwPIAS",
    "hero_image": "https://images.luxuryescapes.com/tzcf6ro7mt64idubg8",
    "image_two": "https://images.luxuryescapes.com/qizntcylqg532d1p872",
    "image_three": "https://images.luxuryescapes.com/0pl2n873xjd5gxpo7siy",
    "vendor_name": "Pullman Pattaya Hotel G",
    "title": "Pullman Seaside Luxury in Pattaya with Direct Beach Access & Onsite Spa",
    "description": "Get up close to the vibrant energy of Thailand's Pattaya City with a luxurious stay at this beachfront Pullman wonder. Resting on the stunning Wong Amat Beach, this stylish retreat offers direct beach access and a swanky Beach Club Bar & Restaurant, serving up exotic drinks and par excellence international cuisine with a local twist.\n\nAn outdoor pool, Thai-therapy-inspired Aisawan Spa and beautiful sea views are a promise well-kept at this tropical paradise. Within close proximity, you'll find the bustling Walking Street, boasting street food stalls and bustling boutiques, while the nearby Sanctuary of Truth offers an insight into local culture.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Pullman Pattaya Hotel G",
    "offer_address": "445/3 Moo 5, Wong Amart Beach, Pattaya, Naklua Road Soi 16, Chonburi 20150, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 74.0,
    "value": 74.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP0FYAV",
    "hero_image": "https://images.luxuryescapes.com/vol7pqci7ea71swugmn",
    "image_two": "https://images.luxuryescapes.com/r1l439auxghpla7gi4",
    "image_three": "https://images.luxuryescapes.com/ptwvgurqj3ccw6h73ki",
    "vendor_name": "Mercure Pattaya Ocean Resort",
    "title": "Thailand Coastal Cool near Pattaya Beach with Two Bars, Outdoor Pool & Kids' Water Park",
    "description": "Nestled along Thailand's thriving eastern seaboard, this hotel places you exactly where you want to be. You're a quick walk from the bars and restaurants of Beach Road, and a short drive from the Sanctuary of Truth, a breathtaking masterpiece celebrating Thai art and spirituality. Plus, the views over the Gulf of Thailand will take your breath away.\n\nThe real showstopper is the water park - kids love it. When you're not splashing around or tackling the rock climbing wall, there's a rooftop pool that's perfect for sundowners. Molten restaurant serves up mouthwatering Thai food, and you have a choice of two bars with a wide selection of drinks and tasty light bites.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Mercure Pattaya Ocean Resort",
    "offer_address": "463/100 Moo 9, Pattaya Second Road, Nhongprue Banglamung, Pattaya 20150, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 55.0,
    "value": 55.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HicEPYAZ",
    "hero_image": "https://images.luxuryescapes.com/55dxriyj3nd485cf9m2q",
    "image_two": "https://images.luxuryescapes.com/gmmpdmptcyhwe3e545w1",
    "image_three": "https://images.luxuryescapes.com/1eul4bcbvjy40fnfmaod",
    "vendor_name": "Andaz Pattaya Jomtien Beach",
    "title": "Family-Friendly Pattaya Beachfront Oasis with Spa, Onsen, Pools & Onsite Dining",
    "description": "Nestled between the trees, this charming coastal Thailand resort is a peaceful sanctuary a short drive from scenic attractions and hotspots in Pattaya. Andaz Pattaya Jomtien Beach is an oceanfront oasis amid a tropical landscape, with spacious rooms and suites perfect for unwinding.\n\nEnjoy spectacular seaside dining in the heart of the resort, ranging from freshly baked pizzas at La Cucina to the finest cuts of meat at Village Butcher. Alternatively, sit by the beach at the signature Fish Club for delicious seafood delights. Take a refreshing dip in the water court pool, the beachfront infinity pool or take the kids to the lagoon pool and let them immerse themselves in fun at Sanuk Sanuk Kids' Club next door. When it's time to truly unwind - relax at the spa, onsen and steam room.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Sattahip",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Andaz Pattaya Jomtien Beach",
    "offer_address": "345, Moo 3, Na Jomtien Sub-District, Sattahip, Pattaya, Chon Buri 20250, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 247.0,
    "value": 247.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Bdt7DAAR",
    "hero_image": "https://images.luxuryescapes.com/z23l8kecxcmji28q6b6g",
    "image_two": "https://images.luxuryescapes.com/xgb47plxfu401mlgs7u",
    "image_three": "https://images.luxuryescapes.com/gv3s9f3bvm6xwrdg59sk",
    "vendor_name": "InterContinental Pattaya Resort",
    "title": "Five-Star Sun-Kissed Bangkok Oasis in the Heart of Pattaya",
    "description": "Treat yourself to a tranquil stay at the luxury InterContinental Pattaya Resort, an IHG Hotel - a beachfront oasis just a 90-minute drive from Bangkok. With spacious guestrooms and suites offering traditional Thai style and modern facilities, this five-star hideaway promises an escape that celebrates relaxation, comfort and exquisite design. Make the most of the three luxurious lagoon-style pools, the Amburaya Spa, the Planet Trekkers Programme for kids and top-class dining venues, bars and lounges.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "InterContinental Pattaya Resort, an IHG Hotel",
    "offer_address": "437 Phra Tamnak Road, Chonburi, Pattaya, 20150, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 136.0,
    "value": 136.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI6D5AAL",
    "hero_image": "https://images.luxuryescapes.com/rfrtnapr4i1tauk78g7j",
    "image_two": "https://images.luxuryescapes.com/g6h08ehxktr6r6exvka",
    "image_three": "https://images.luxuryescapes.com/pdsx1tb2tlior1tuvygxa",
    "vendor_name": "Holiday Inn Express Pattaya Central",
    "title": "Centrally Located Thailand Escape with Rooftop Pool",
    "description": "Discover the coastal allure of Pattaya’s crescent-shaped bay and vibrant nightlife with a stay at Holiday Inn Express Pattaya Central, an IHG Hotel. Pattaya is a city with a reputation for sun-loving tourism and lively nightlife - enjoy ice-cold beers and endless sandy beaches filled with laid-back travellers. Explore the local culture, try the food and wander along the beaches before returning to this centrally located retreat to enjoy a cocktail beside the rooftop swimming pool.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Holiday Inn Express Pattaya Central, an IHG Hotel",
    "offer_address": "293/16 Moo 10, Nongprue, Pattaya 20150, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 39.0,
    "value": 39.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009C79oAAC",
    "hero_image": "https://images.luxuryescapes.com/avp6pw3smhoog6pt79",
    "image_two": "https://images.luxuryescapes.com/10ivqhjk5b7hlm1zwsvr",
    "image_three": "https://images.luxuryescapes.com/hb35scrsamym0om6b16",
    "vendor_name": "Avani Pattaya Resort & Spa",
    "title": "Pattaya Five-Star Beachside Retreat Just 90 Minutes from Bangkok",
    "description": "Immerse yourself in tropical tranquility at Avani Pattaya Resort, a surf and sand sanctuary on Thailand's golden east coast, just 90 minutes from bustling Bangkok. Experience luxurious treatments at AvaniSpa, indulge in a variety of cuisines at the many onsite restaurants or sink your toes into the white sands of the nearby beach. Be spoiled for choice with a range of shopping and entertainment options from modern malls to bustling markets, build up an appetite in an authentic cooking class or cool off with a plunge into the sapphire sea.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Avani Pattaya Resort",
    "offer_address": "218/2-4 Moo 10, Beach Road, Pattaya 20260, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 113.0,
    "value": 113.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP0LYAV",
    "hero_image": "https://images.luxuryescapes.com/dc6aenlcjp1bs9kfj8l",
    "image_two": "https://images.luxuryescapes.com/yjfh6j5m8hgxhxv60cw",
    "image_three": "https://images.luxuryescapes.com/puoks4wwbhtpzxvfpixc",
    "vendor_name": "Veranda Resort Pattaya - MGallery Collection",
    "title": "Beachfront Pattaya Resort with Rooftop Bar and Outdoor Pool",
    "description": "​Discover the best of Pattaya with a stay at this oceanfront oasis, directly positioned on Na Jomtien Beach's spectacular sands. After days spent enjoying the city's many historic and cultural charms, retreat to The Jetty rooftop bar for cocktails and sweeping sea views, savour authentic Thai cuisine at The Deck or laze by the resort's magnificent resort pool.\n\nPattaya's bustling Floating Market is a riverside attraction filled with local eateries and unique boutiques, located just a 10-minute drive from the resort. Travel 20 minutes to explore Nong Nooch Botanical Garden's themed landscapes or Khao Chi Chan's impressive Buddha engravings, an enduring symbol of Thailand's cultural and religious history.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Veranda Resort Pattaya - MGallery Collection",
    "offer_address": "211 Moo 1, Na Jomtien, Muang Pattaya, Sattahip, Chon Buri 20250, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 109.0,
    "value": 109.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HF19AAG",
    "hero_image": "https://images.luxuryescapes.com/oau0yll9jm6s92lkpdf",
    "image_two": "https://images.luxuryescapes.com/lk9scoxz295ljjj4cub4",
    "image_three": "https://images.luxuryescapes.com/ir3d5lvb2n3b4i0xj8n",
    "vendor_name": "Cross Pattaya Oceanphere",
    "title": "Five-Star Boutique Pattaya Thai Villas with Private Pool",
    "description": "Transport yourself to a state of total bliss with a luxurious stay at the five-star Cross Pattaya Oceanphere - a serene tropical hideaway just steps away from the Gulf of Thailand’s emerald waters and historic pirate enclave of Bang Saray beach. Contemporary elegance and thoughtful design are evident throughout the 59 boutique villas dotted across the resort, with each boasting a private pool, fully equipped kitchen and an outdoor terrace; allowing you to relax and unwind in unparalleled seclusion.\n\nDive into the elevated, third-floor infinity pool to take in sweeping views of the surrounding mountains and glimmering ocean, savour fresh Thai seafood and Mediterranean flavours at Ocean Bistro, sip cocktails prepared by a master mixologist at Chili Blue Pool Bar and perhaps soothe your senses with a calming treatment at Xperience X2 Spa. Hidden in the coastal paradise of Pattaya, just two hours from Bangkok, this tranquil retreat invites you to escape the city buzz and unwind at your own pace. Roll out a towel on Bang Saray beach with complimentary shuttle bus transfers (as per hotel's schedule), glide through the nearby Pattaya Floating Market, traverse rainforest canopy walks and beyond.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Sattahip",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Cross Pattaya Oceanphere",
    "offer_address": "95 Moo.2 Bangsaray Satthaip Chonburi 20250 THAILAND",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 159.0,
    "value": 159.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003I7Z0AAK",
    "hero_image": "https://images.luxuryescapes.com/m5yka2koto1l5xa21q86",
    "image_two": "https://images.luxuryescapes.com/qrpd83ar7abs1pus0vu",
    "image_three": "https://images.luxuryescapes.com/bk6szmbryl1d7bvu7908",
    "vendor_name": "Mason Pattaya",
    "title": "Opulent Designer Thai Pool Villa Escape with Daily Breakfast",
    "description": "Leave the world behind for an ultra-luxe Thai villa escape at MASON, Pattaya, a romantic five-star retreat nestled by the golden sands of Na Jomtien. This charming town on the coast of Thailand lies just 3km south of Pattaya and a two-hour drive from bustling Bangkok. Here, days can be spent lazing on the seemingly endless stretch of beach, getting a dose of culture at Buddha Mountain in Pattaya, home to the largest engraved image of Buddha in the world, or exploring the stunning Wat Phra Yai Temple across the water.\n\nYou may never want to venture far from your stunning designer resort, built in 2019 and a relative newcomer to the area. MASON, Pattaya's iconic Sky Pool beckons for a sunset dip, while the spa offers holistic treatments and the onsite bars and restaurants are always happy to whip up a delicious meal or handcrafted cocktail. Your private villa is the cherry on top, with an ultra-modern glass design, private saltwater pool, jacuzzi and luxe bathroom with oversized bathtub.\n\n**Luxury Escapes inclusions (select nights)**\n\n- Wake up to **daily breakfast** at Zila Street Bistro & Bar, serving fresh, locally sourced ingredients with panoramic views of Pattaya Bay\n- Relax with **one 30-minute massage per adult** at the spa (for stays of 2+ nights)\n- Head to the Beachside Bar for **one daily cocktail, beer or smoothie per adult** (for stays of 3+ nights)\n- Choose between a Thai or Western **three-course set-menu dinner** at Zila Street Bistro & Bar (for stays of 3+ nights)\n- Splash out on additional drinks, dining or spa treatments with **THB2,000 resort credit per package** (for stays of 5+ nights)\n\n**Looking for added luxury?** Upgrade to a beautiful beachfront villa and wake to the sound of the ocean.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Sattahip",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "MASON, Pattaya",
    "offer_address": "285 Moo 3, Sukhumvit Road, Na Jomtien, Sattahip, Chonburi 20250 Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 11,
    "price": 321.0,
    "value": 321.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DGdQJAA1",
    "hero_image": "https://images.luxuryescapes.com/ndz1nuuruio2ervaj4hf",
    "image_two": "https://images.luxuryescapes.com/zpzxrxwf4iswnwr3t0k",
    "image_three": "https://images.luxuryescapes.com/pv6k8espsonjdbwl8hs",
    "vendor_name": "Holiday Inn Pattaya",
    "title": "Thailand Beachfront Paradise Overlooking Pattaya Beach",
    "description": "Dive into bliss when you visit the tropical Holiday Inn Pattaya, an IHG Hotel, nestled on one of Thailand's most popular beaches, Pattaya Beach. Spend the day creating fun memories, swimming in the beachfront infinity pool, or treating yourself to the calming sanctuary that is the hotel's onsite Tea Tree Spa. When night falls, explore the various cuisines of the onsite restaurants, or venture out to the bars lining the picturesque coastline.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Pattaya",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Holiday Inn Pattaya, an IHG Hotel",
    "offer_address": "463/68, 463/99 Moo 9 Pattaya Sai 1 Road, Nongprue Banglamung, Pattaya Chonburi 20150, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 95.0,
    "value": 95.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnGgCYAV",
    "hero_image": "https://images.luxuryescapes.com/mjxr97h9ea8lg6ki1uep",
    "image_two": "https://images.luxuryescapes.com/3zgn73y70q64nitqfy3",
    "image_three": "https://images.luxuryescapes.com/4gfxj2fumsyij1t8vncc",
    "vendor_name": "Movenpick Siam Hotel Na Jomtien Pattaya",
    "title": "Thailand Coastal Glamour in Pattaya with Sparkling Lagoon Pool & Direct Beach Access",
    "description": "Ascend to unparalleled luxury at Mövenpick’s skyline icon, offering breathtaking views over Na Jomtien Beach. Boasting four restaurants and bars, a serene day spa, a state-of-the-art fitness centre, direct beach access and a sprawling pool reminiscence of a lagoon, this is the very definition of five-star hospitality.\n\nLet time fade away as you surrender to the crystal-clear waters of Pattaya, or dive into a world of adventure with the plethora of water sports offered in the area. If you’d rather stay put, sip on a signature cocktail at the hotel’s swim-up bar while watching the sunset or feast on prime cuts of dry-aged beef at T55 New York Grill Room.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Chonburi Province",
    "offer_geo_area_level_2": "Sattahip",
    "location_heading": "Pattaya",
    "location_subheading": "Thailand",
    "location_description": "Mövenpick Siam Na Jomtien Pattaya",
    "offer_address": "55 Moo 2 Sukhumvit Road Na, Jomtien, Pattaya 20250, Thailand",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 121.0,
    "value": 121.0
  }
]