[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DHeGlAAL",
    "hero_image": "https://images.luxuryescapes.com/3pyncik2pln1d9jng1k",
    "image_two": "https://images.luxuryescapes.com/u6z4puhsnbv682t5i0js",
    "image_three": "https://images.luxuryescapes.com/c24qe5na1syx5kcb273o",
    "vendor_name": "Ampersand Estates",
    "title": "Elegant Pemberton Winery Stay for up to Four with Welcome Drinks Package",
    "description": "Slip away to Ampersand Estates, a breathtaking reimagining of the area's oldest winery, Donnelly River Wines, including three luxury residences and a unique gin and vodka lounge. Revel in lush gardens and vineyards surrounding the exquisite accommodations, all designed with a minimalistic palette and rustic touches to create a homely yet sophisticated feel. The onsite distillery creates unique artisanal vodkas and gins, infused with fresh seasonal ingredients and rainwater from the Southern Forests. Wine lovers will delight in the estate's light, signature vintages - a true representation of the Pemberton region’s beauty and terroir.\n\nAfter soaking in the fresh air, explore the best of Western Australia's hidden gems, all easily accessible from the property. Walk along the banks of the Donnelly River and enjoy a picnic or wander the many walking trails scattered throughout the nearby Easter National Park. In the opposite direction, discover enchanting Beedelup Falls before returning to your self-contained cottage for a cosy night in.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Peerabeelup",
    "location_heading": "Pemberton",
    "location_subheading": "Western Australia",
    "location_description": "Ampersand Estates",
    "offer_address": "9883 Vasse Highway Peerabeelup WA 6260 Australia",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 629.0,
    "value": 1121.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C2ulqAAB",
    "hero_image": "https://images.luxuryescapes.com/g69bvwsgiit39ujg0x7z",
    "image_two": "https://images.luxuryescapes.com/8c7bk98hab4zqoox0q9i",
    "image_three": "https://images.luxuryescapes.com/rf5fk6p95tg3atjowlne",
    "vendor_name": "Ampersand Estates",
    "title": "Grand Opening: Elegant Pemberton Winery Estate Stay for up to Four with Guided Wine & Spirit Tasting",
    "description": "Welcome to Ampersand Estates, a breathtaking reimagining of the original Donnelly River Wines - the area's oldest winery - to include three luxury residences and a unique gin and vodka lounge. Revel in lush gardens and vineyards surrounding the exquisite accommodations, all designed with a minimalistic palette and rustic touches to create a homely yet sophisticated feel. Taking inspiration from the fresh smell of rain, the onsite distillery creates unique artisanal vodkas and gins infused with the Southern Forests’ rainfall and fresh seasonal ingredients. For the wine-lovers, feel free to sample a collection of their light, signature wines - a true representation of the Pemberton region’s beauty and terroir.\n\nAfter soaking in the fresh air, explore the best of Western's Australia hidden gems, all easily accessible from the estate. Walk along the banks of the Donnelly River and enjoy a picnic or wander the many hikes and walking trials scattered throughout the nearby Easter National Park. In the opposite direction, discover the enchanting Beedelup Falls before returning to your self-contained cottage for a cosy night in.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Peerabeelup",
    "location_heading": "Pemberton",
    "location_subheading": "Western Australia",
    "location_description": "Ampersand Estates",
    "offer_address": "9883 Vasse Highway Peerabeelup WA 6260 Australia",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 937.0,
    "value": 1337.0
  }
]