[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ic5TEAAZ",
    "hero_image": "https://images.luxuryescapes.com/6cpp9l4vu60o90lyrtb9",
    "image_two": "https://images.luxuryescapes.com/bcwbatz2s4otm18mm4",
    "image_three": "https://images.luxuryescapes.com/wa3frrpt27jovb2wj4xi",
    "vendor_name": "Aruna Estate",
    "title": "NSW Southern Highlands Boutique Off-Grid Cabins & Villas with Gourmet Hamper + Welcome Drinks",
    "description": "The Southern Highlands are calling: get off the grid and discover a new frontier of eco-luxury at this design-led hideaway, set among one of New South Wales’s most spectacular slices of bushland, just 90 minutes from Sydney. With direct access to the Penrose State Forest’s wildflower- and eucalyptus-filled trails, ARUNA Estate promises world-class walkabouts in abundance, and a shimmering infinity pool offers the perfect reason to return. Cabins are light-filled and pared-back, featuring an outdoor fire-powered bathtub - your invitation to savour an evening under the stars - or upgrade to the villa for a designer-led stay with more space to breathe and extraordinary views over the valley and the forest beyond.\n\nWith free access to ARUNA Estate’s 'guest' vegetable gardens - plus a welcome produce pack jam-packed with bottles from local winery Cherry Tree Hill, canned Curatif cocktails, gourmet meats, breads, cheeses, bacon, olives and more - you’ll never have to leave. Kick back and surrender to serenity - life doesn’t get much better than this.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Penrose",
    "location_heading": "Penrose",
    "location_subheading": "New South Wales",
    "location_description": "ARUNA Estate",
    "offer_address": "200 Kareela Road, Penrose, New South Wales 2579, Australia",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 317.0,
    "value": 486.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IVizIAG",
    "hero_image": "https://images.luxuryescapes.com/tesb9f49okr4nmcymm16",
    "image_two": "https://images.luxuryescapes.com/dfxh9vk5hroih3n6z5o",
    "image_three": "https://images.luxuryescapes.com/4rcbl5lz8986i8a5jbj",
    "vendor_name": "Aruna Estate",
    "title": "NSW Southern Highlands Boutique Off-Grid Cabins",
    "description": "The Southern Highlands are calling: get off the grid and discover a new frontier of eco-luxury at this design-led hideaway, set among one of New South Wales’ most spectacular slices of bushland, just 90 minutes from Sydney. With direct access to the Penrose State Forest’s wildflower- and eucalyptus-filled trails, ARUNA Estate promises world-class walkabouts, and a shimmering infinity pool offers the perfect reason to return.\n\nCabins are light-filled and pared-back, featuring an outdoor fire-powered bathtub - your invitation to savour an evening under the stars - or upgrade to the villa for a designer-led stay with more space to breathe and extraordinary views over the valley and the forest beyond.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Penrose",
    "location_heading": "Penrose",
    "location_subheading": "New South Wales",
    "location_description": "ARUNA Estate",
    "offer_address": "200 Kareela Road, Penrose, New South Wales 2579, Australia",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 31,
    "price": 439.0,
    "value": 439.0
  }
]