[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009C7DbAAK",
    "hero_image": "https://images.luxuryescapes.com/5haebvsm5cl2op500itr",
    "image_two": "https://images.luxuryescapes.com/17xidko2tkbp2o491s4s",
    "image_three": "https://images.luxuryescapes.com/8gx3amgfco8sc4o6ffh",
    "vendor_name": "Anantara Mui Ne Resort",
    "title": "Anantara Beachside Escape Near Vietnam's Mui Ne Sand Dunes",
    "description": "Between famous red and white sand dunes overlooking the shining waters of the South China Sea lies Anantara Mui Ne Resort, a boutique haven of beachfront seclusion just four hours from Ho Chi Minh City. After sun-soaked days exploring Cham ruins, wandering the resort’s sprawling tropical gardens or savouring some of Asia's best kitesurfing, return to authentic lagoonside bites at L’Anmien or fine wines and Asian-inspired tapas at The Wine Room.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Thuan Province",
    "offer_geo_area_level_2": "Phan Thiet",
    "location_heading": "Phan Thiet",
    "location_subheading": "Vietnam",
    "location_description": "Anantara Mui Ne Resort",
    "offer_address": "Mui Ne Beach, 12A Nguyen Dinh Chieu Street, Ham Tien Ward, Phan Thiet City, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 162.0,
    "value": 162.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000EBqEZYA1",
    "hero_image": "https://images.luxuryescapes.com/hpkn0z3igvxa3amwbxnr",
    "image_two": "https://images.luxuryescapes.com/b93ckt4cfg6odzcpgfmf",
    "image_three": "https://images.luxuryescapes.com/xt2wb9o3hamg5s16k83g",
    "vendor_name": "The Anam Mui Ne",
    "title": "Vietnamese Old-World Charm with Direct Beach Access to the East Sea’s Turquoise Waters",
    "description": "Discover a charming haven set between the East Sea’s turquoise waters and Mui Ne’s golden dunes. A luxury beachfront resort nestled in lush foliage, relaxation will wash over you in one of two palm-fringed infinity pools, overlooking the ocean mere steps away.\n\nSeek serenity at the resort’s onsite spa, a tranquil sanctuary where Asian healing traditions interweave into holistic wellness journeys. Wine and dine at three exquisite restaurants and bars or immerse yourself in traditional Vietnamese cuisine in a step-by-step cooking class.\n\nThough it’s tempting to stay at the resort, Mui Ne’s Fairy Stream - a mesmerizing wonderland of natural waters and rock formations - is well worth the adventure. Take day trips to the famous White and Red Sand Dunes that are perfect for an exciting adventure. When night falls, don’t miss the sunset at the historic Mui Ne Fishing Village.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Thuan Province",
    "offer_geo_area_level_2": "Phan Thiet",
    "location_heading": "Phan Thiet",
    "location_subheading": "Vietnam",
    "location_description": "The Anam Mui Ne",
    "offer_address": "18 Nguyễn Đình Chiểu, Phường Hàm Tiến, Thành phố Phan Thiết, Bình Thuận 77000, Vietnam",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 169.0,
    "value": 169.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib17dYAB",
    "hero_image": "https://images.luxuryescapes.com/s38ltljrq4orwse3l4l8",
    "image_two": "https://images.luxuryescapes.com/z88lw63isbfx3gvulorb",
    "image_three": "https://images.luxuryescapes.com/k7715k7b99mqd0bu7gac",
    "vendor_name": "Movenpick Resort Phan Thiet",
    "title": "Family-Friendly Beachfront Resort with Four Dining Outlets, Spa & Pool",
    "description": "Step into a world of coastal adventure at this five-star Caribbean-themed escape 2.5 hours from Ho Chi Minh City. Nestled on Tien Thanh beach, savour ocean views and luxurious comforts designed for families, friends and fun-seekers alike. Savour global delights at Black Pearl Restaurant & Bar and authentic local flavours at Bounty Restaurant & Bar, and don’t miss Chocolate Hour.\n\nExplore attractions including NovaDreams Adventure World, Po Shanu Cham Towers, and the iconic Mui Ne sand dunes. After a day of exploration, retreat to the tranquillity of the resort's spa for a rejuvenating treatment. Whether you're chasing treasure or serenity, this is your perfect home away from home-where vibrant culture meets Caribbean charm for an unforgettable getaway.",
    "offer_country_name": "Vietnam",
    "offer_country_code_alpha_2": "VN",
    "offer_geo_area_level_1": "Binh Thuan Province",
    "offer_geo_area_level_2": "Phan Thiet",
    "location_heading": "Phan Thiet",
    "location_subheading": "Vietnam",
    "location_description": "Mövenpick Resort Phan Thiet",
    "offer_address": "Hon Gio - Thuan Quy Street Tien Hoa Hamlet Tien Thanh Commune Binh Thuan, Phan Thiet, Vietnam, 77100",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 31,
    "price": null,
    "value": null
  }
]