[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GgswOAAR",
    "hero_image": "https://images.luxuryescapes.com/17zlwnq5thxnc94vnc9",
    "image_two": "https://images.luxuryescapes.com/3znb0q41flhzra1vtgmc",
    "image_three": "https://images.luxuryescapes.com/10s1touu4ty79ds7lve",
    "vendor_name": "Duchessa Margherita",
    "title": "Historic Piedmont Escape in the Heart of Italy’s Wine Country with Daily Breakfast & Wine Tasting",
    "description": "Discover the rolling hills of the Langhe wine region and live like a royal with a romantic escape to this 19th-century historic house in the heart of Piedmont. With traditional furnishings and historic antiques, the luxurious charm and splendour of the hotel will take you back in time to the mid-19th century, when the house was built to honour Margherita of Savoy, the hotel's namesake. An epicurean’s paradise, the Duchessa Margherita offers a wine-tasting service, an Italian tearoom and an honesty bar to tickle the tastebuds, as well as wellness treatments and a jacuzzi and infrared sauna for ultimate relaxation. When you're not luxuriating in all the hotel has to offer, you're in the perfect place to get lost in the gastronomy and unspoilt nature of rural Italy.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Piedmont",
    "offer_geo_area_level_2": "Vicoforte",
    "location_heading": "Piedmont",
    "location_subheading": "Italy",
    "location_description": "Duchessa Margherita",
    "offer_address": "Via San Rocco 29, Vicoforte 12080, Italy",
    "percentage_discount": 47.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 479.0,
    "value": 898.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000D751tYAB",
    "hero_image": "https://images.luxuryescapes.com/to3ezc0raylz6h9vuk2i",
    "image_two": "https://images.luxuryescapes.com/vwehcmxz7w41zp92dpb",
    "image_three": "https://images.luxuryescapes.com/rzilinqddep920o4fda",
    "vendor_name": "Duchessa Margherita",
    "title": "Historic Piedmont Escape in the Heart of Italy’s Wine Country with Daily Breakfast & Welcome Wine",
    "description": "Discover the rolling hills of the Langhe wine region and live like a royal with a romantic escape to this 19th-century historic house in the heart of Piedmont. With traditional furnishings and historic antiques, the luxurious charm and splendour of the hotel will take you back in time to the mid-19th century, when the house was built to honour Margherita of Savoy, the hotel's namesake.\n\nAn epicurean’s paradise, the Duchessa Margherita offers a wine-tasting service, an Italian tearoom and an honesty bar to tickle the tastebuds, as well as massages, a jacuzzi and an infrared sauna for ultimate relaxation. When you're not luxuriating in all the hotel has to offer, you're in the perfect place to get lost in the gastronomy and unspoilt nature of rural Italy.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Piedmont",
    "offer_geo_area_level_2": "Vicoforte",
    "location_heading": "Piedmont",
    "location_subheading": "Italy",
    "location_description": "Duchessa Margherita",
    "offer_address": "Via San Rocco 29, Vicoforte 12080, Italy",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 359.0,
    "value": 638.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070poSAAQ",
    "hero_image": "https://images.luxuryescapes.com/haq0zod0im2mh3bpay9",
    "image_two": "https://images.luxuryescapes.com/p2zg4zo3rivnjrc2uxym",
    "image_three": "https://images.luxuryescapes.com/lkhuppi0zeset7jt785v",
    "vendor_name": "Duchessa Margherita",
    "title": "Historic Vicoforte Escape in the Heart of Italy’s Wine Country with Daily Breakfast & Wine Tasting",
    "description": "Uncover a world of ancient aristocrats, proud palazzi and tantalising treats at the historic Duchessa Margherita, an epicurean’s paradise nestled within the rambling emerald hills of Vicoforte, Italy. Located in the breathtaking Langhe region - world-famous for truffles, cheese and wine - this boutique hideaway in resplendent Piedmont is the ideal launchpad for an unforgettably Italian gourmet adventure. Built in the mid-19th century to honour Margherita of Savoy, each of the mansion’s rooms is lovingly restored, dedicated to a member of the royal house and filled with priceless antiques, romantic touches and endless surprises. \n\nThe hotel offers guests a dedicated onsite wellness spa, jacuzzi, infrared sauna, wine tasting service, an Italian tearoom serving a selection of traditional pastries and Pasqualini infusions and an honesty bar service with a wide selection of liquors and wine. When you’re ready to get lost among the endless tastes and tranquillity of peaceful Italy, you’ll have the perfect base. The stunningly frescoed Santuario di Vicoforte is only 50 metres away, and you’ll only be a five-minute drive from the picturesque town of Mondovì. The region also offers great skiing in winter, Unesco Heritage listed landscapes and many of the finest restaurants in the country. With an included regional three-course dinner for two at Parlapà and a wine tasting experience at the Cascina Monsignore cellars, you’re guaranteed a staggeringly delicious Italian escape.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Piedmont",
    "offer_geo_area_level_2": "Vicoforte",
    "location_heading": "Piedmont",
    "location_subheading": "Italy",
    "location_description": "Duchessa Margherita",
    "offer_address": "Via San Rocco 29, Vicoforte 12080, Italy",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 428.0,
    "value": 1225.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EcleaAAB",
    "hero_image": "https://images.luxuryescapes.com/h6myfs331apj1i27i",
    "image_two": "https://images.luxuryescapes.com/0j0fzh6moy8ngt94mduns",
    "image_three": "https://images.luxuryescapes.com/qsq6atnufi5ztt812ru",
    "vendor_name": "Duchessa Margherita",
    "title": "Historic Vicoforte Escape in the Heart of Italy’s Wine Country with Daily Breakfast, Gourmet Dining & Wine Tasting",
    "description": "Uncover a world of ancient aristocrats, proud palazzi and tantalising treats at the historic Duchessa Margherita, an epicurean’s paradise nestled within the rambling emerald hills of Vicoforte, Italy. Located in the breathtaking Langhe region - world-famous for truffles, cheese and wine - this boutique hideaway in resplendent Piedmont is the ideal launchpad for an unforgettably Italian gourmet adventure. Built in the mid-19th century to honour Margherita of Savoy, each of the mansion’s rooms are lovingly restored, dedicated to a member of the royal house and filled with priceless antiques, romantic touches and endless surprises. When you’re ready to get lost among the endless tastes and tranquillity of peaceful Italy, you’ll have the perfect base - the stunningly frescoed Santuario di Vicoforte is 50 metres away, and you’ll only be a five-minute drive from the picturesque town of Mondovì.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Piedmont",
    "offer_geo_area_level_2": "Vicoforte",
    "location_heading": "Piedmont",
    "location_subheading": "Italy",
    "location_description": "Duchessa Margherita",
    "offer_address": "Via San Rocco 29, Vicoforte 12080, Italy",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 500.0,
    "value": 898.0
  }
]