[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DJ5KdAAL",
    "hero_image": "https://images.luxuryescapes.com/7mwosln9x8paks4iye",
    "image_two": "https://images.luxuryescapes.com/6ew0756aofov1al14rn",
    "image_three": "https://images.luxuryescapes.com/kpfj49rihenr6w3mvlp",
    "vendor_name": "Lexis Hibiscus Port Dickson",
    "title": "Malaysian Five-Star Overwater Resort with Nine Bars & Restaurants",
    "description": "Experience five-star living in the Malaysian tropics at Lexis Hibiscus Port Dickson, a coastal paradise made for the whole family to enjoy. This resort, renowned for its iconic hibiscus design, offers an unparalleled waterfront experience with private pool villas poised over the azure sea. Indulge in a gastronomic journey at the hotel's nine exquisite dining venues, drop the little ones at Kidz World before heading to LexSpa for some 'me' time - Port Dickson is yours to explore.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Negeri Sembilan",
    "offer_geo_area_level_2": "Port Dickson",
    "location_heading": "Port Dickson",
    "location_subheading": "Malaysia",
    "location_description": "Lexis Hibiscus Port Dickson",
    "offer_address": "12th Mile, Jalan Pantai, 71250 Port Dickson, Negeri Sembilan, Malaysia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004US5DAAW",
    "hero_image": "https://images.luxuryescapes.com/qpp7gdxer84959rsruv",
    "image_two": "https://images.luxuryescapes.com/ktx17yg2ft985w08bfk",
    "image_three": "https://images.luxuryescapes.com/r2szzyo2dk66ah4gx3",
    "vendor_name": "Lexis Hibiscus Port Dickson",
    "title": "Malaysia Five-Star Oceanfront Pool Villas in Port Dickson",
    "description": "Live it up in Malaysia with a five-star stay at Lexis Hibiscus Port Dickson, offering a dose of tropical bliss. Tucked away in the Negeri Sembilan region, just a 90-minute drive from Kuala Lumpur, this unique resort sprawls across the sparkling sea in the formation of a hibiscus flower, with pool villas offering breathtaking views across the Strait of Malacca and vibrant landscape.\n\nWhatever your travel style is, the resort's exceptional facilities have all bases covered. Sing your heart out at Starz Karaoke, splash until the sun goes down at Water JPark, capture the fun at the Photo Booth, then drop the little ones at Kidz World and head for a treatment at LexSpa. Embark on a culinary journey at a diverse selection of restaurants, including UMI Japanese Restaurant and Yuan Chinese Cuisine, then toast your escape with a perfectly shaken cocktail at Lighthouse Bar. After a day filled with a myriad of activities and adventures, plunge into your villa's private pool and feel immediately refreshed for the evening ahead.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Negeri Sembilan",
    "offer_geo_area_level_2": "Port Dickson",
    "location_heading": "Port Dickson",
    "location_subheading": "Malaysia",
    "location_description": "Lexis Hibiscus Port Dickson",
    "offer_address": "12th Mile, Jalan Pantai, 71250 Port Dickson, Negeri Sembilan, Malaysia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]