[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3XM3QAN",
    "hero_image": "https://images.luxuryescapes.com/p0uxxjzqy7lmigibcwtu",
    "image_two": "https://images.luxuryescapes.com/pacciw7dttcsssyr3we5",
    "image_three": "https://images.luxuryescapes.com/mzytcfzgcv33pnp9jpev",
    "vendor_name": "Ribeira Collection Hotel",
    "title": "Stay in a Newly-Renovated Historic Hotel in Beautiful Rural Portugal",
    "description": "If you like your holidays off the beaten track to get a true taste of local life, you’ll love this blissful riverside getaway just an hour from the city of Porto in sun-kissed northern Portugal. Check in to the newly-opened Ribeira Collection Hotel - five minutes from the charming historic Arcos de Valdevez with its ancient churches, stately homes and pretty riverfront - and enjoy daily continental buffet breakfast, a complimentary welcome drink each on arrival, a welcome fruit basket, complimentary use of kayaks on the River Vez and complimentary Wi-Fi.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Viana do Castelo District",
    "offer_geo_area_level_2": "Arcos de Valdevez",
    "location_heading": "Portugal",
    "location_subheading": "Europe",
    "location_description": "Ribeira Collection Hotel - Oct 18",
    "offer_address": "R. dos Milagres, 4970-592 Arcos de Valdevez, Portugal",
    "percentage_discount": 67.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 276.0,
    "value": 840.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005K98AAAS",
    "hero_image": "https://images.luxuryescapes.com/rolfaad58y71iwhnvhn",
    "image_two": "https://images.luxuryescapes.com/cv63g5m8vc4xinnsj2hm",
    "image_three": "https://images.luxuryescapes.com/yutxnea1uligivb1wer",
    "vendor_name": "EPIC SANA Lisboa Hotel",
    "title": "Five-Star Upscale Lisbon Luxury with Rooftop Infinity Pool",
    "description": "In the heart of the historic city of Lisbon lies the EPIC SANA Lisboa Hotel, a five-star hotel perfectly positioned for exploration of the city’s greatest sights. From iconic shopping districts to cultural venues and historic cafés, the different neighbourhoods of the eclectic city come together to create a wondrous European experience. After days spent exploring the cobblestoned lanes and steep hills of the Portuguese capital, be pampered in the tranquil Sayanna Wellness & Spa with personalised treatments, swim in the luxurious rooftop infinity pool, or indulge in a refined culinary experience at the sophisticated Flor-de-Lis restaurant. Just don't forget to venture up to UpScale Bar, where handcrafted cocktails and spectacular sunsets go hand in hand.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Lisbon District",
    "offer_geo_area_level_2": "Lisbon",
    "location_heading": "Portugal",
    "location_subheading": "Lisbon",
    "location_description": "EPIC SANA Lisboa Hotel",
    "offer_address": "Av. Engenheiro Duarte Pacheco 15 1070-100 Lisboa, Portugal",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 21,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JMKqAAO",
    "hero_image": "https://images.luxuryescapes.com/rhnt5w9wxvygaqu50itd",
    "image_two": "https://images.luxuryescapes.com/ulrdtxl87bm3qzmwabpr",
    "image_three": "https://images.luxuryescapes.com/s2y62rzljmpyo30t7rvr",
    "vendor_name": "Pestana Churchill Bay",
    "title": "Award-Winning Waterfront Boutique Escape in Madeira with Rooftop Pool",
    "description": "Immerse yourself in history and heritage of Madeira with an escape to Pestana Churchill Bay, the first hotel in the fishing town of Câmara de Lobos. Listed as a TripAdvisor Traveller’s Choice Best of the Best in 2021, placing it in the top 1% of properties worldwide, the unique hotel pays homage to one of the bay's most famous visitors, Winston Churchill, with inspirational quotes and framed memorabilia dotted across the two buildings it inhabits.\n\nSitting opposite a black pebble beach and just 15 minutes drive from Madeira’s capital, Funchal, it’s perfectly placed for island exploring. Split across the former Council Chambers and fish market buildings on the seafront, Pestana Churchill Bay takes full advantage of its sensational setting - spend hours sauntering between the panoramic rooftop pool and sauna before sampling local delicacies at the bay-facing Pier One Restaurant. Don’t forget to order a tipple or two - Câmara de Lobos is the island’s main wine-producing area, so trying the local drops are practically compulsory.",
    "offer_country_name": "Portugal",
    "offer_country_code_alpha_2": "PT",
    "offer_geo_area_level_1": "Madeira Region",
    "offer_geo_area_level_2": "Camara de Lobos",
    "location_heading": "Portugal",
    "location_subheading": "Câmara de Lobos",
    "location_description": "Pestana Churchill Bay",
    "offer_address": "R. Nossa Sra. da Conceição 17, 9300-113 Câmara de Lobos Madeira Portugal",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 21,
    "price": 120.0,
    "value": 120.0
  }
]