[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007pCooAAE",
    "hero_image": "https://images.luxuryescapes.com/gasffdkevx3q6291bs6i",
    "image_two": "https://images.luxuryescapes.com/60a4hkv6na8ananj3a3m",
    "image_three": "https://images.luxuryescapes.com/n9yrfqc55a31nft68cdm",
    "vendor_name": "QUINTA REAL PUEBLA",
    "title": "16th-Century Mexico Luxury in the Heart of Puebla",
    "description": "Step back in time to an era of refinement at Quinta Real Puebla, a 16th-century historic hotel in the heart of the UNESCO World Heritage-listed Puebla. Surrounded by well-preserved churches, a stunning cathedral and fascinating museums, this is the perfect base for exploring Mexico's cultural and historical centre. Admire the hotel's extraordinary architecture: the stones and archways, fountains and courtyards are simply magnificent. The restaurant, housed in the main courtyard, serves traditional Mexican dishes as well as an international menu to satisfy the most demanding of tastebuds, while the Mezcaleria Novicias Bar is the perfect place to while away an evening with high-quality tequila, cocktails, wine and beer.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Puebla",
    "offer_geo_area_level_2": "Puebla",
    "location_heading": "Puebla",
    "location_subheading": "Mexico",
    "location_description": "Quinta Real Puebla",
    "offer_address": "Avenida 7 Poniente No.105, Centro Histórico, 72000 Puebla, Mexico",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DUdwAAG",
    "hero_image": "https://images.luxuryescapes.com/5xpt75o0yht7luco80zi",
    "image_two": "https://images.luxuryescapes.com/b1wkdfm1quzbn5mpg76h",
    "image_three": "https://images.luxuryescapes.com/6nrh0vydcblt0uiepwwb",
    "vendor_name": "Cartesiano",
    "title": "Adults-Only Mexico Boutique Health Retreat with 45 Wellness Experiences",
    "description": "Embark on a wellness journey unlike any other at the opulent Cartesiano, one of Mexico's most luxurious holistic retreats. Where accommodation meets purpose and luxury meets well-being, the resort is an oasis for those looking for a rejuvenating makeover. THE7SPA, with its perfectly-curated therapies and treatments, takes you on a healing journey, letting you bid adieu to all your troubles and awake balanced, revived and refreshed. The personally designed wellness services on offer, from rhythm alignment and body purification to conscious breathing and sound therapy, allow you to tailor your wellness retreat to your specific needs. The restaurants, Comedor 360 and Salón Mezcalli - where skillful chefs prepare conscious nutrition - will also surprise you daily with fresh, healthful fare bursting with flavour.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Puebla",
    "offer_geo_area_level_2": "Puebla",
    "location_heading": "Puebla",
    "location_subheading": "Mexico",
    "location_description": "Cartesiano",
    "offer_address": "Calle 3 Ote. 610, Centro histórico de Puebla, 72000 Puebla, Pue., Mexico",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GPx77AAD",
    "hero_image": "https://images.luxuryescapes.com/08kr7lcsvgho32t3kq",
    "image_two": "https://images.luxuryescapes.com/uucj03sk1xdpmpv01uo",
    "image_three": "https://images.luxuryescapes.com/lehlzc9ealsx31ewhup",
    "vendor_name": "Banyan Tree Puebla",
    "title": "Five-Star Ornate Escape in World Heritage Puebla City with Authentic Mexican Bar",
    "description": "Immerse yourself in the timeless elegance of traditional Mexican design at the Banyan Tree Puebla, nestled within the beautifully preserved UNESCO World-Heritage listed city of Puebla. This five-star sanctuary offers a captivating journey through Mexico's past - the onsite Los Lavaderos bar dates back to the 19th century and offers an extensive list of cocktails. Indulge in a culinary adventure at the five restaurants and bars, or take a bespoke cooking class with the hotel's esteemed chefs.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Puebla",
    "offer_geo_area_level_2": "Puebla",
    "location_heading": "Puebla",
    "location_subheading": "Mexico",
    "location_description": "Banyan Tree Puebla",
    "offer_address": "10 Norte #1402, Col. Barrio del Alto, Puebla, CP. 72000, Mexico",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 149.0,
    "value": 149.0
  }
]