[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X99RaQAJ",
    "hero_image": "https://images.luxuryescapes.com/ucojfqvsyhdwfrxn3l6j",
    "image_two": "https://images.luxuryescapes.com/equaihxfegtvuwmalgh5",
    "image_three": "https://images.luxuryescapes.com/z0thpbtjulwpgehwn9sl",
    "vendor_name": "Grand Velas Riviera Nayarit",
    "title": "Next-Level All-Inclusive: Luxury Dining, Premium Drinks & Room Service Included",
    "description": "Experience all-inclusive luxury that reaches new heights at the Grand Velas Riviera Nayarit resort, nestled beachfront in Mexico’s beautiful Puerto Vallarta. Whether you’re tucking into lobster and black truffle specialties, dining in the resort’s Four and Five Diamond AAA-rated restaurants, enjoying a candlelit table with your complimentary room service or relaxing with unlimited premium drinks at the bar, you’ll want for absolutely nothing at this exquisite resort. Stay in all-suite luxury with 24-hour concierge, daily breakfast, lunch and dinner at any restaurant of your choice, unlimited drinks including premium international alcohol, mini-bar refilled daily, a US$50 spa or golf credit per person, per day, a US$100 credit towards an unforgettable private dining experience and more.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Nayarit",
    "offer_geo_area_level_2": "Nuevo Vallarta",
    "location_heading": "Puerto Vallarta",
    "location_subheading": "Mexico",
    "location_description": "Grand Velas Riviera Nayarit",
    "offer_address": "98, Paseo de los Cocoteros, Sur, 63735 Nuevo Vallarta, Nay., Mexico",
    "percentage_discount": 38.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 2474.0,
    "value": 3974.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gJJzAAM",
    "hero_image": "https://images.luxuryescapes.com/ojva3k03xpn7tuqwf1u",
    "image_two": "https://images.luxuryescapes.com/tcgb5d7p6pdnd6w20iqh",
    "image_three": "https://images.luxuryescapes.com/86p1lqs4s8q9nseuph34",
    "vendor_name": "One & Only Mandarina",
    "title": "Mexico One&Only All-Villa Luxury with Beach Club & Celebrity Chef Dining",
    "description": "Set on a dreamy stretch of coastline on Mexico's Riviera Nayarit is the five-star One&Only Mandarina, a secluded resort overlooking the Pacific Ocean. Be wined and dined at three celebrity chef-led restaurants, or enjoy local, sustainably made tipples at The Treetop bar and savour each captivating sunset. The One&Only Spa is heaven on Earth, serving up a range of treatments using Tata Harper products designed to pamper you into bliss. A dedicated butler will take care of everything during your stay, leaving you free to enjoy the world-class facilities, including six swimming pools, a pristine beach with crystal-clear swimmable water and immersive nature activities. Did we mention the resort's beach club? This oceanfront haven invites you to pad barefoot from your cabana to the warm waters of the ocean, feast on fresh oysters and sip on expertly-mixed drinks in the sunshine.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Nayarit",
    "offer_geo_area_level_2": "Lo de Marcos",
    "location_heading": "Puerto Vallarta",
    "location_subheading": "Mexico",
    "location_description": "One&Only Mandarina",
    "offer_address": "x",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 854.0,
    "value": 854.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BzRXAA0",
    "hero_image": "https://images.luxuryescapes.com/tsldvyj3nw1egtp8eup",
    "image_two": "https://images.luxuryescapes.com/h8u46vj48mo0op6nyicf",
    "image_three": "https://images.luxuryescapes.com/lqns0zwqb52p3bxgpfc5",
    "vendor_name": "Grand Velas Riviera Nayarit",
    "title": "Five-Star Mexico Award-Winning Retreat near Puerto Vallarta with Six Onsite Restaurants",
    "description": "On the northern edge of Banderas Bay near the historic centre of Puerto Vallarta lies a secluded gem that encapsulates the essence of Mexico - the luxurious five-star Grand Velas Riviera Nayarit. Designed with grandiose architecture and surrounded by stunning tropical landscapes, the award-winning resort features six restaurants showcasing the best culinary delights from around the world. Satisfy your palate with all-inclusive dining and drinks, ranging from traditional Mexican cuisine, Asian fusion delights and flavourful Italian and Mediterranean dishes to classic French simplicity.\n\nThe stunning azure waters and sparkling white sand beaches are as alluring as the hotel’s sparkling infinity pool and relaxing jacuzzi. Dive off the beautiful coast and spend the day snorkelling, kayak through emerald waters to majestic waterfalls, stroll along Puerto Vallarta’s boardwalk as you take in the sweeping ocean views or visit one of the many nearby golf courses that have made Puerto Vallarta a golf lovers’ paradise. Then, head back to the hotel for a serene holistic treatment at the blissful SE Spa and poolside sunset cocktails.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Nayarit",
    "offer_geo_area_level_2": "Nuevo Vallarta",
    "location_heading": "Puerto Vallarta",
    "location_subheading": "Mexico",
    "location_description": "Grand Velas Riviera Nayarit",
    "offer_address": "Av. Cocoteros, 98 Sur, Nuevo Vallarta, Riviera Nayarit, Mexico, C.P 63735",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 877.0,
    "value": 877.0
  }
]