[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GK7aQYAT",
    "hero_image": "https://images.luxuryescapes.com/fr2x7wwmurie107hf8yw",
    "image_two": "https://images.luxuryescapes.com/7iscjogj8ll9shf6xtpi",
    "image_three": "https://images.luxuryescapes.com/i1r9euqg6f2f2lxjkbgc",
    "vendor_name": "Bianco Riccio",
    "title": "Italy All-Suite Elegance in Puglia with Daily Breakfast & Lunch",
    "description": "Tucked away in the sun-kissed paradise of Fasano, this Italian hideaway is your ticket to discovering the magic of Puglia - also known as the heel of Italy. This gem looks out upon the stunning Adriatic coastline, with views fit for a postcard.\n\nGet spoiled with a swimming pool straight out of a travel magazine, a rooftop terrace with 360-degree views of the Mediterranean and surrounding region, plus an underground spa cave. The onsite restaurant offers everything from freshly caught fish to locally grown produce, a true love letter to Italian cuisine.\n\nThis hotel's location hits the jackpot, placing you near charming villages full of ancient conical trulli houses and authentic local eats like panzerotti (fried pizza bites) or zeppole (cream-filled donuts with black cherry). Local boat tours reveal hidden caves, grottos and the immense coastline of this magical region.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Puglia",
    "offer_geo_area_level_2": "Savelletri",
    "location_heading": "Puglia",
    "location_subheading": "Italy",
    "location_description": "Bianco Riccio Suite Hotel",
    "offer_address": "4 Via degli Scavi, Fasano, Brindisi 72015, Italy",
    "percentage_discount": 63.0,
    "min_duration": 4,
    "max_duration": 25,
    "price": 839.0,
    "value": 2270.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DMpsQYAT",
    "hero_image": "https://images.luxuryescapes.com/ayq22i5wfogbh16osfhm",
    "image_two": "https://images.luxuryescapes.com/q6vwdx8wwjd1vtxt3or8",
    "image_three": "https://images.luxuryescapes.com/wtc28mms9z215jlldq8",
    "vendor_name": "Bianco Riccio",
    "title": "Italy Coastal Puglia Elegance with Daily Breakfast & Nightly Drinks",
    "description": "Tucked away in the sun-kissed paradise of Fasano, this Italian hideaway is your ticket to discovering the magic of Puglia - also known as the heel of Italy. This gem looks out upon the stunning Adriatic coastline, with a view that's like a postcard come to life.\n\nStay spoiled with a swimming pool straight out of a travel magazine, a rooftop terrace with 360-degree views of the Mediterranean and surrounding region, plus an underground spa cave. The onsite restaurant offers everything from exquisite freshly caught fish to locally grown produce, a true love letter to Italian cuisine.\n\nThis property's location hits the jackpot, near charming villages full of ancient conical trulli houses straight out of a fantasy, authentic local eats like panzerotti (fried pizza bites) and zeppole (cream-filled donuts with black cherry) and boat tours that reveal hidden caves, grottos and the immense coastline of this magical region.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Puglia",
    "offer_geo_area_level_2": "Savelletri",
    "location_heading": "Puglia",
    "location_subheading": "Italy",
    "location_description": "Bianco Riccio Suite Hotel",
    "offer_address": "4 Via degli Scavi, Fasano, Brindisi 72015, Italy",
    "percentage_discount": 64.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 619.0,
    "value": 1720.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Jyp4jYAB",
    "hero_image": "https://images.luxuryescapes.com/mexwp439ylf362vh3gfl",
    "image_two": "https://images.luxuryescapes.com/6azenwxu6h1l48d6fgg6",
    "image_three": "https://images.luxuryescapes.com/744mkpc0lfongdxlh7",
    "vendor_name": "Bianco Riccio",
    "title": "Boutique Puglia All-Suite Elegance with Daily Breakfast, Daily Lunch & Nightly Drinks",
    "description": "Tucked away in the sun-kissed paradise of Fasano, this Italian hideaway is your ticket to discovering the magic of Puglia, also known as the heel of Italy. This gem looks out upon the stunning Adriatic coastline, with views fit for a postcard. You'll be spoilt with a swimming pool straight out of a travel magazine, a rooftop terrace with 360-degree views of the Mediterranean and surrounding region, plus an underground spa cave. \n\nThe onsite restaurant offers everything from freshly caught fish to locally grown produce, with menus that are a true love letter to Italian cuisine. Bianco Riccio Suite Hotel's location hits the jackpot, placing you near charming villages full of ancient conical trulli houses and authentic local eats like panzerotti (fried pizza bites) or zeppole (cream-filled donuts with black cherry). Local boat tours reveal hidden caves, grottos and the immense coastline of this magical region.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Puglia",
    "offer_geo_area_level_2": "Savelletri",
    "location_heading": "Puglia",
    "location_subheading": "Italy",
    "location_description": "Bianco Riccio Suite Hotel",
    "offer_address": "4 Via degli Scavi, Fasano, Brindisi 72015, Italy",
    "percentage_discount": 65.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 639.0,
    "value": 1850.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HSQCIYA5",
    "hero_image": "https://images.luxuryescapes.com/8f8s3ajbvyxsptun7ny",
    "image_two": "https://images.luxuryescapes.com/j28for5ek6cqixpmqqns",
    "image_three": "https://images.luxuryescapes.com/vxvpsu0k1tmwj8sth5o4",
    "vendor_name": "Il Melograno",
    "title": "Boutique 17th-Century Puglian Residence with Daily Breakfast & Free-Flow Drinks Hour",
    "description": "Tucked among ancient olive sentinels in Monopoli's dreamy landscape, this boutique five-star escape is more than just Italy's first masseria-turned-hotel - it's a 400-year ode to life in Puglia. History lingers in the stone walls, the scent of sun-warmed earth drifts through the gardens and mornings begin with an espresso under centuries-old arches.\n\nTake a slow swim in Il Melograno's heated indoor pool, unwind with a candlelit spa treatment, or let the hours slip by in gardens touched by sea breeze and citrus trees. Just ten minutes away, Tamerici Beach Club awaits with pristine Adriatic shores and comfortable white sofas on a panoramic terrace.\n\nBack at the masseria, Mùmmulo Restaurant brings rustic tradition to the table - named after the clay jugs once used to cool water in the summer heat. Whether you're strolling along flower-lined paths or sinking into a suite filled with character, Il Melograno invites you to kick off your shoes, slow down and soak up the good life.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Puglia",
    "offer_geo_area_level_2": "Monopoli",
    "location_heading": "Puglia",
    "location_subheading": "Italy",
    "location_description": "Il Melograno",
    "offer_address": "Contrada Torricella 345, Monopoli, Bari, 70043, Italy",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 24,
    "price": 739.0,
    "value": 1620.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JEiO1YAL",
    "hero_image": "https://images.luxuryescapes.com/1f5rgg3ft8s3lsfrgfq",
    "image_two": "https://images.luxuryescapes.com/q7i0nnovqm064yywp9c9",
    "image_three": "https://images.luxuryescapes.com/5yc7ugmuodxr5j87s8e",
    "vendor_name": "Acaya Golf Resort & Spa",
    "title": "Secluded Italy Puglia Coastal Escape with Daily Breakfast, EUR100 Hotel Credit & Three-Course Dinner",
    "description": "Escape to Salento’s crown jewel, where ancient olive groves and championship fairways meet the crystalline shores of Puglia. Unwind by one of two serene outdoor pools or embrace total relaxation at the expansive 1,200sqm Acaya Spa. Enjoy a classic Puglian aperitif at the breezy Rock Bar before indulging in authentic regional flavours at Gian Giacomo Restaurant.\n\nLet the Mediterranean breeze, scented with wild herbs, drift over you as you tee off amid ancient stone walls, cascading waterfalls and endless blue skies. Just five minutes from sun-drenched beaches and nestled beside the untamed beauty of the Cesine Nature Reserve, this is the essence of a postcard-perfect escape.",
    "offer_country_name": "Italy",
    "offer_country_code_alpha_2": "IT",
    "offer_geo_area_level_1": "Puglia",
    "offer_geo_area_level_2": "Vernole",
    "location_heading": "Puglia",
    "location_subheading": "Italy",
    "location_description": "Acaya Golf Resort & Spa",
    "offer_address": "Strada Comunale di Acaya, Km 2, Acaya, Lecce 73029, Italy",
    "percentage_discount": 68.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 369.0,
    "value": 1139.0
  }
]