[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxyFKQAZ",
    "hero_image": "https://images.luxuryescapes.com/ztu50e9mnmqdm1tpnlsf",
    "image_two": "https://images.luxuryescapes.com/iwfnxg3ichldz0q5eul8",
    "image_three": "https://images.luxuryescapes.com/iydobd4s6vn2uqqjpsfz",
    "vendor_name": "Borneo Eagle Resort",
    "title": "Grand Opening: Malaysian Borneo Island Hideaway",
    "description": "Experience the volcanic mud pools hidden inside lush rainforests, colourful coral reefs and white-sand shores of Pulau Tiga, the original island that the ‘Survivor’ reality TV series was filmed on. Stay in one of just 9 beachfront pool villas with personalised butler service at the secluded Borneo Eagle Resort, a newly opened island hideaway off the coast of Malaysian Borneo. Includes daily breakfast, nightly three-course dinners, nightly cocktails, a daily replenished minibar, return speedboat transfers, massages, water sports and more.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Sabah",
    "offer_geo_area_level_2": "",
    "location_heading": "Pulau Tiga",
    "location_subheading": "Malaysian Borneo",
    "location_description": "Borneo Eagle Resort 2019",
    "offer_address": "Borneo Eagle Resort Pulau Tiga Kuala Penyu, 89740 Kota Kinabalu, Sabah, Malaysia",
    "percentage_discount": 63.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 2232.0,
    "value": 6007.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlUrAAK",
    "hero_image": "https://images.luxuryescapes.com/g796cswyvpk19pi11cg5",
    "image_two": "https://images.luxuryescapes.com/n9balpmlntvb6xwr0aa",
    "image_three": "https://images.luxuryescapes.com/nl5mcal26lf1swpcm00f",
    "vendor_name": "Borneo Eagle Resort",
    "title": "Malaysian Island Pool Villa Hideaway with All-Inclusive Dining & Nightly Drinks",
    "description": "Set your watch to island time and be the star of your own tropical adventure at the secluded Borneo Eagle Resort, a boutique hideaway on the lush island of Pulau Tiga in Malaysia, just off the coast of Borneo. Embrace the laid-back vibes of this serene destination and explore verdant rainforests, colourful coral reefs and white-sand shores. A unique selling point: the tropical island featured on the first season of reality TV show 'Survivor'. Pulau Tiga is easily reached from mainland Borneo, with return speedboat and airport transfers included in your package.\n\nStay in a palatial Pool Villa, complete with a private pool and an open-deck balcony overlooking the sea, all while enjoying all-inclusive dining - daily breakfast, lunch and dinner - nightly cocktails, a daily replenished minibar with soft drinks and beers, return speedboat transfers, return airport transfers, a 60-minute massage per person, unlimited use of non-motorised watersports equipment, and complimentary Wi-Fi.\n\n⏱**Buy now, book later**: Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Sabah",
    "offer_geo_area_level_2": "Tiga Island",
    "location_heading": "Pulau Tiga",
    "location_subheading": "Malaysia",
    "location_description": "Borneo Eagle Resort",
    "offer_address": "Borneo Eagle Resort Pulau Tiga Kuala Penyu, 89740 Kota Kinabalu, Sabah, Malaysia",
    "percentage_discount": 56.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 1859.0,
    "value": 4238.0
  }
]