[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009C7ecAAC",
    "hero_image": "https://images.luxuryescapes.com/c6hhdxh3xth9g2p3pq9k",
    "image_two": "https://images.luxuryescapes.com/jqpnelw13q6okmveal2",
    "image_three": "https://images.luxuryescapes.com/9meo2xirty1zjkavfcp",
    "vendor_name": "Fort Jadhavgadh Pune",
    "title": "Royal Heritage Fort Stay near Pune with Daily Breakfast, Daily Drinks & One Dinner",
    "description": "Journey through 300 years of Maratha legacy at Fort JadhavGADH - a luxury heritage hotel spread across 25 acres of gorgeous landscape. Built in 1710 by Shir Pilaji Jadhavrao, a Maratha General, as a royal residence, Fort JadhavGADH is the only heritage hotel in Maharashtra. Just a five-hour drive from Mumbai, rich history, secret passages, dungeons, canons, lush lawns and modern amenities await. Across just 58 unique rooms ranging from royal suites to outdoor tents, intricate interiors and luxury touches combine with enthralling stories of the property’s regal past to create a unique experience you won’t soon forget. \n\nChoose to enjoy a rejuvenating massage at the serene poolside spa or wade in the temperature-controlled pool. Get active with a vast range of outdoor activities available, including rifle shooting, archery and more (additional charges apply). After you’ve worked up an appetite, visit Chhajja restaurant for traditional and continental delicacies, Payatha for fine dining meals in an alfresco setting and Aangan for mouthwatering cuisine under a century-old tree. To explore the property’s long history, head to the onsite museum, venture out on a guided tour of the fort-turned-hotel or take part in one of the many cultural experiences available onsite.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Sasvad",
    "location_heading": "Pune",
    "location_subheading": "India",
    "location_description": "Fort JadhavGADH",
    "offer_address": "Hadapsar Saswad Road, Jadhavwadi Pune, Maharashtra 412301 India",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 202.0,
    "value": 480.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgq8TQAQ",
    "hero_image": "https://images.luxuryescapes.com/cvifpgjqmzv5cfozmrhz",
    "image_two": "https://images.luxuryescapes.com/xcu65drzahlkq4h5lbe7",
    "image_three": "https://images.luxuryescapes.com/jzba8pdrat96izu3v2ge",
    "vendor_name": "Hilton Shillim",
    "title": "Hilton Eco-Wellness Retreat in India",
    "description": "Journey into India's enchanting UNESCO World Heritage-listed Western Ghats mountains for a tranquil eco wellness escape at the Hilton Shillim Estate Retreat & Spa. Located just a three-hour drive from Mumbai, this spectacular all-villa property is surrounded by lush forests, mysterious lakes and miles of greenery perfect for trekking, biking, fishing and more. Experience a getaway in a private villa with daily breakfast, daily three-course dining experiences, daily cocktails and your choice of a trek or cooking class. Or for a truly blissful holiday, choose a Wellness Escape and embark on the Dharana Life Science Program with included breakfast, lunch and dinner, daily wellness therapy, daily activities like pottery or bird-watching, daily yoga or meditation sessions, and much more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Wadgaon",
    "location_heading": "Pune",
    "location_subheading": "India",
    "location_description": "Hilton Shillim Estate Retreat & Spa, India",
    "offer_address": "Pawana Nagar, Taluka Maval, Shilimb, Maharashtra 410406, India",
    "percentage_discount": 41.0,
    "min_duration": 3,
    "max_duration": 3,
    "price": 561.0,
    "value": 949.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgqkHQAQ",
    "hero_image": "https://images.luxuryescapes.com/ourz3h9eokarpqfqsv5g",
    "image_two": "https://images.luxuryescapes.com/tj0hd3cqptgdyo4hnmhx",
    "image_three": "https://images.luxuryescapes.com/yi32d1hgikwrrjl1ff1n",
    "vendor_name": "Hilton Shillim",
    "title": "Hilton Eco-Wellness Retreat in India",
    "description": "Journey into India's enchanting UNESCO World Heritage-listed Western Ghats mountains for a tranquil eco-wellness escape at the Hilton Shillim Estate Retreat & Spa. Located just a three-hour drive from Mumbai, this spectacular all-villa property is surrounded by lush forests, majestic lakes and miles of greenery perfect for trekking, biking, fishing and more. Stay in a King Valley Villa with daily breakfast, daily three-course dining experiences, daily cocktails and your choice of a trek or cooking class. Or for a truly blissful holiday, choose a Wellness Escape and embark on the Dharana Life Sciences Program, with all-inclusive dining, daily wellness therapy, daily activities like pottery or bird-watching, daily yoga or meditation sessions, plus two nights at the Hilton Mumbai staying in an Executive Room and much more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Wadgaon",
    "location_heading": "Pune",
    "location_subheading": "India",
    "location_description": "Hilton Shillim Estate Retreat & Spa",
    "offer_address": "Pawana Nagar, Taluka Maval, Shilimb, Maharashtra 410406, India",
    "percentage_discount": 40.0,
    "min_duration": 5,
    "max_duration": 9,
    "price": 940.0,
    "value": 1570.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005GtC4AAK",
    "hero_image": "https://images.luxuryescapes.com/4hfwajhoprxb14ox30ju",
    "image_two": "https://images.luxuryescapes.com/v3cd2m77nsowoc6r7vnu",
    "image_three": "https://images.luxuryescapes.com/018vzeljr4cbv2u99la",
    "vendor_name": "Conrad Pune",
    "title": "Five-Star Art Deco Stay in the Heart of Pune with Dinner & Daily Breakfast",
    "description": "It's time to pamper yourself with a staycation at Conrad Pune, a five-star hotel in the heart of Pune's Central Business District. This Art Deco-inspired hotel promises to spoil you with stylish accommodation, gourmet dining options, endless experiences and indulgent leisure facilities.\n\nOffering incomparable hospitality synonymous with the Hilton brand, Conrad Pune is just a three-hour drive from the metropolis of Mumbai. Unwind and relax in sophisticated luxury at Conrad Pune or get out and explore surrounding attractions such as Shaniwar Wada fort, Aga Khan Palace and Parvati Hill temples and museum.\n\n**Your handpicked inclusions:**\n\n- Begin every morning with set-menu or buffet breakfast at Kabana or Coriander Kitchen\n- Enjoy one set-menu or buffet dinner per stay at Kabana or Coriander Kitchen\n- Toast your holiday with one cocktail, beer or glass of wine per stay with dinner (one drink per adult) at Kabana or Coriander Kitchen\n- Make the most of your stay with a 20% discount on drinks, dining and spa\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** Two kids (aged five years and under) stay free in existing bedding with all package inclusions (excludes alcohol).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Pune",
    "location_heading": "Pune",
    "location_subheading": "India",
    "location_description": "Conrad Pune",
    "offer_address": "7, Mangaldas Rd, Sangamvadi, Pune, Maharashtra 411001",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 195.0,
    "value": 512.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI6BZAA1",
    "hero_image": "https://images.luxuryescapes.com/es6xlg1sxwkdfk44jevk",
    "image_two": "https://images.luxuryescapes.com/oib089ukoaf0zqfq8j0m",
    "image_three": "https://images.luxuryescapes.com/ruvth8fios1k36u3kwgo",
    "vendor_name": "Holiday Inn Express Pune Pimpri",
    "title": "Modern West Indian Hotel Stay in Pimpri Chinchwad Township",
    "description": "Holiday Inn Express Pune Pimpri, an IHG hotel, offers a prime location for adventure enthusiasts, history buffs and those travelling for business alike - with convenient self-service laundry facilities and onsite dining options available to all. A fitness and recreation centre and plush lobby add to what is sure to be a value-rich stay, allowing you to make the most of your stay in this bustling and vibrant region of beautiful India.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Pune",
    "location_heading": "Pune",
    "location_subheading": "India",
    "location_description": "Holiday Inn Express Pune Pimpri, an IHG Hotel",
    "offer_address": "Plot No. 2, CTS No.- 5758 B, Haveli Maharashtra, Pimpri, Pune, Maharashtra, India, 411018",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 37.0,
    "value": 37.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DI5rjAAD",
    "hero_image": "https://images.luxuryescapes.com/37a4zncyafkrrl7qr35a",
    "image_two": "https://images.luxuryescapes.com/n821awfzlghba7zxjsri",
    "image_three": "https://images.luxuryescapes.com/wc2chtr4cqhu3t2dygjf",
    "vendor_name": "Holiday Inn Express Pune Hinjewadi",
    "title": "Centrally Located India City Retreat with Onsite Cafe & Fitness Centre",
    "description": "Ideal for workers or travellers looking for a comfortable escape from the excitement of Pune, Holiday Inn Express Pune Hinjewadi, an IHG Hotel offers a calm atmosphere with modern facilities. Quickly access Pune's business district from the hotel’s prime location or have a chat with the friendly staff for personalised suggestions on what to do in the area. If self-care is top of mind, stay in and enjoy a coffee from Express Café or work out in the fully-equipped Fitness Centre.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Paud",
    "location_heading": "Pune",
    "location_subheading": "India",
    "location_description": "Holiday Inn Express Pune Hinjewadi, an IHG Hotel",
    "offer_address": "Survey No. 9/2 Hinjewadi Main Road, Pune, Maharashtra, 411057 India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 33.0,
    "value": 33.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQJbqAAH",
    "hero_image": "https://images.luxuryescapes.com/u9esw45b6o5x018vbyn",
    "image_two": "https://images.luxuryescapes.com/b19vcgg8nqrhk6ey2mj",
    "image_three": "https://images.luxuryescapes.com/eyqx471bodeuh2nd6s6w",
    "vendor_name": "Crowne Plaza Pune City Centre",
    "title": "India Vibrant Pune City Escape with Sophisticated Sky Lounge",
    "description": "Toe the line between old and new and lose yourself in the excitement of a thriving metropolis with an escape to Crowne Plaza Pune City Centre, an IHG Hotel - the perfect getaway to explore all that Koregaon Park has to offer. Visit the famed Osho International Meditation Resort, wander palaces forgotten by time, or saunter in tranquil nearby gardens. Then, head to Evviva Sky Lounge for sweeping vistas of Pune and delicious cocktails or rejuvenate in the dazzling outdoor pool.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Pune",
    "location_heading": "Pune",
    "location_subheading": "India",
    "location_description": "Crowne Plaza Pune City Centre, an IHG Hotel",
    "offer_address": "Cts No. 37 & 37, 1, Bund Garden Rd, next to Jehangir Hospital, Sangamvadi, Pune, Maharashtra 411001, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 51.0,
    "value": 51.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib04IYAR",
    "hero_image": "https://images.luxuryescapes.com/k21iik7qjmxubs6ply1w",
    "image_two": "https://images.luxuryescapes.com/9we4qowkbdgtphay261",
    "image_three": "https://images.luxuryescapes.com/ezajmsmh6smc60owyu2k",
    "vendor_name": "Novotel Pune Nagar Road",
    "title": "West India Pune City Escape with Outdoor Pool & Onsite Dining",
    "description": "Embrace the excitement of a thriving metropolis with an escape to Novotel Pune Nagar Road - the perfect getaway to explore all that the bustling Viman Nagar district has to offer. Make the most of your coveted location just moments from the city's finest restaurants, trendy boutiques and cultural landmarks, including the historic Aga Khan Palace.\n\nThe hotel's modern rooms offer a tranquil escape from the city's lively rhythm, while the state-of-the-art fitness centre and shimmering pool provide a perfect balance of relaxation and rejuvenation. Venture beyond the hotel to explore Pune's rich history and dynamic culinary scene.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Maharashtra",
    "offer_geo_area_level_2": "Pune",
    "location_heading": "Pune",
    "location_subheading": "India",
    "location_description": "Novotel Pune Nagar Road",
    "offer_address": "City Infopark, Weikfield IT Citi Info Park, Sakore Nagar, Viman Nagar, Pune, Maharashtra 411014, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 63.0,
    "value": 63.0
  }
]