[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008nFHdAAM",
    "hero_image": "https://images.luxuryescapes.com/ayez5dqgz2dsi686gfqs",
    "image_two": "https://images.luxuryescapes.com/3id62hf1eot77n55ooam",
    "image_three": "https://images.luxuryescapes.com/9t5se2dfpuhr2cnv04eq",
    "vendor_name": "Anand at the Satluj",
    "title": "Satluj River Eco-Luxury Farm Escape with Daily Breakfast, One Dinner & Welcome Drink",
    "description": "Serenity seekers will find their version of paradise at Anand at the Satluj - an eco-luxury farm retreat in the town of Anandpur Sahib, Punjab. This relaxing haven is located approximately 1.5 hours drive from Chandigarh and a seven-hour drive from Delhi, and the property will bring you closer to nature and away from the hustle and bustle of city life. The lively Satluj River flowing nearby offers soothing sounds and the surrounding greenery will make you feel instantly calmer. Existing as part of the AM Hotel Kollection, the hotel has been constructed on Sodhi Vikram Singh's ancestral farm, a member of the former ruling family of Sri Anandpur Sahib. It also happens to be a mere four-hour drive from the famous Golden Temple in Amritsar and the alluring city of Shimla.\n\nEach of the gorgeous cottages takes you one step closer to peace with charming organic interiors, nestled amidst Poplar trees and green fields. Walking barefoot on the pathways which are paved with small stones will flood relief and calmness to you. Delicious food prepared with the organic produce of the farm will delight your palate and gaming facilities such as a pool table, chess boards and more will be at your disposal throughout your stay. For those who want to unwind, yoga and meditation classes can be arranged (extra charges apply). Don't forget to visit the peaceful Gurudwaras with ample history attached to them in the peaceful town of Anandpur Sahib.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Punjab",
    "offer_geo_area_level_2": "Anandpur Sahib",
    "location_heading": "Punjab",
    "location_subheading": "India",
    "location_description": "Anand at the Satluj",
    "offer_address": "Lodhipur, Sri Anandpur Sahib, Anandpur, Punjab 140118 India",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 149.0,
    "value": 248.0
  }
]