[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006y1QtAAI",
    "hero_image": "https://images.luxuryescapes.com/srf1v8plp9mkk2mcqbnb",
    "image_two": "https://images.luxuryescapes.com/dm9yvc2obn3l5pnu9lug",
    "image_three": "https://images.luxuryescapes.com/1pmkjmwhh96d0sx2jude",
    "vendor_name": "Hacienda AltaGracia",
    "title": "Glamorous Costa Rica Retreat Amid 180 Acres of Untamed Forest with World-Renowned Wellness Spa",
    "description": "Seek out true relaxation and unbridled wellbeing at the serene Hacienda AltaGraciam, Costa Rica's first hotel from the Auberge Resorts Collection, buried amid 180 acres of untamed tropical forest, coffee farms and organic chef gardens in the rolling hills of Pérez Zeledón. Hiding just 50 boutique, hacienda-style casitas with sprawling terraces, this undisturbed mountain haven invites you to discover your personal peace with authentic wellness experiences at the iconic THE WELL, adrenaline-packed adventures in nature, and soulful, organic cuisine inspired by the seasons across five restaurants. There are two pools for floating away and a third in the spa's Casa de Agua, an all-glass, greenhouse-inspired oasis and one of the world's most renowned holistic centres. \n\nFind refuge from the base of the Talamanca Mountains with a range of different natural experiences, such as mountain horseback riding or bespoke day excursions to the unexplored regions of Costa Rica (surcharges apply).",
    "offer_country_name": "Costa Rica",
    "offer_country_code_alpha_2": "CR",
    "offer_geo_area_level_1": "San Jose Province",
    "offer_geo_area_level_2": "Cajón",
    "location_heading": "Pérez Zeledón",
    "location_subheading": "Costa Rica",
    "location_description": "Hacienda AltaGracia, Auberge Resorts Collection",
    "offer_address": "Contiguo a la Escuela de, Cajón - Sta. Teresa - Quizarrá, San José Province, Pérez Zeledón, 11908, Costa Rica",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 2015.0,
    "value": 2015.0
  }
]