[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DYP1JYAX",
    "hero_image": "https://images.luxuryescapes.com/py0ucan4bwh32pjmzrn",
    "image_two": "https://images.luxuryescapes.com/45st2gwc8ulick940sd",
    "image_three": "https://images.luxuryescapes.com/rht5nstcwk9b0cw075tn",
    "vendor_name": "Ifuru Island",
    "title": "Maldives Tropical Paradise with All-Inclusive Dining, Free-Flow Drinks & Roundtrip Malé Transfers",
    "description": "Sink your toes into soft sands and swim into shades of Maldivian blue at this sprawling island retreat, an all-inclusive tropical playground. Days in paradise begin with a delightful spread at the open-air Social House, enjoy lunch between dips in the lagoon, and take yourself out for dinner at one of six venues.\n\nSip on refreshing poolside cocktails with daily free-flow drinks, and when adventure calls, explore the surrounding marine life with a thrilling scuba dive. If you’re craving a late-night snack, order Ifuru Eats straight to your door so you can unwind in the privacy of your suite or villa.\n\nKeep up with your routine at the onsite fitness centre, snorkel or kayak the pristine lagoon or go on an island-hopping excursion to see beyond the horizon. Drop the little ones at the Coconut Kids Club while you indulge in a tension-melting massage at Xanadu Spa. With equal doses of adventure and relaxation, this is island living at its finest.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Raa Atoll",
    "offer_geo_area_level_2": "Ifuru",
    "location_heading": "Raa Atoll",
    "location_subheading": "Maldives",
    "location_description": "Ifuru Island Maldives",
    "offer_address": "Raa Atoll, Ifuru Island, Maldives",
    "percentage_discount": 73.0,
    "min_duration": 5,
    "max_duration": 28,
    "price": 1899.0,
    "value": 7123.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LfU6AAK",
    "hero_image": "https://images.luxuryescapes.com/nve5rk8qolmc1gc3rj2c",
    "image_two": "https://images.luxuryescapes.com/x1d67vysot1p0wmxxl8b",
    "image_three": "https://images.luxuryescapes.com/6dnnx4cdfpqj7qq39l1d",
    "vendor_name": "Heritance Aarah Maldives",
    "title": "Grand Opening: All-Inclusive Maldives Luxury with Return Transfers from Malé, Unlimited Drinks & Premium Dining - YIDU DUPLICATE",
    "description": "Surrender to tropical island life with an all-inclusive escape in the Maldives’ newest luxury resort, Heritance Aarah - a tropical oasis cradled by the aquamarine waters of the Raa Atoll. Experience one of the finest resorts in the Maldives and immerse yourself in the dream-like island lifestyle with a carefree getaway offering you a wealth of extraordinary inclusions: domestic plane and speedboat transfers from Male, unlimited premium all-inclusive dining at any of the resort’s five restaurants (including a 12-course degustation dinner with matched wines), unlimited alcoholic and soft drinks, complimentary mini-bar replenished daily and two daily bottles of wine in-room. \n\nAlso included in your package: Daily Maldivian experiences including fun-filled cooking classes, three excursions during your stay including a sunrise cruise tour and sunset photo cruise tour, complimentary use of non-motorized water sports and snorkelling equipment and an introductory dive, a welcome massage and a complimentary face scan at Medi Spa. Take luxury up a notch when you upgrade to one of the palatial overwater villas and suites, offering you direct access to the waters of the lagoon and even more spectacular views. Upgrading to a Suite? Enjoy over 158sqm of beautifully designed space as well as exclusive access to Baani which serves authentic Middle Eastern and international cuisine.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Raa Atoll",
    "offer_geo_area_level_2": "Aarah",
    "location_heading": "Raa Atoll",
    "location_subheading": "Maldives",
    "location_description": "Heritance Aarah",
    "offer_address": "Raa Atoll, Republic of MALDIVES Raa North MV, Maldives",
    "percentage_discount": 28.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 2665.0,
    "value": 3699.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csfBvQAI",
    "hero_image": "https://images.luxuryescapes.com/xwf2dw02yrectdi3inot",
    "image_two": "https://images.luxuryescapes.com/e7dqex63xuuehr0hy2yi",
    "image_three": "https://images.luxuryescapes.com/y8jpfj5kacpjig7g8ey",
    "vendor_name": "Heritance Aarah Maldives",
    "title": "Grand Opening: All-Inclusive Maldives Luxury with Return Transfers from Malé, Unlimited Drinks & Premium Dining",
    "description": "Surrender to tropical island life with an all-inclusive escape in the Maldives’ newest luxury resort, Heritance Aarah - a tropical oasis cradled by the aquamarine waters of the Raa Atoll. Experience one of the finest resorts in the Maldives and immerse yourself in the dream-like island lifestyle with a carefree getaway offering you a wealth of extraordinary inclusions: domestic plane and speedboat transfers from Male, unlimited premium all-inclusive dining at any of the resort’s five restaurants (including a 12-course degustation dinner with matched wines), unlimited alcoholic and soft drinks, complimentary mini-bar replenished daily and two daily bottles of wine in-room. \n\nAlso included in your package: Daily Maldivian experiences including fun-filled cooking classes, three excursions during your stay including a sunrise cruise tour and sunset photo cruise tour, complimentary use of non-motorized water sports and snorkelling equipment and an introductory dive, a welcome massage and a complimentary face scan at Medi Spa. Take luxury up a notch when you upgrade to one of the palatial overwater villas and suites, offering you direct access to the waters of the lagoon and even more spectacular views. Upgrading to a Suite? Enjoy over 158sqm of beautifully designed space as well as exclusive access to Baani which serves authentic Middle Eastern and international cuisine.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Raa Atoll",
    "offer_geo_area_level_2": "Aarah",
    "location_heading": "Raa Atoll",
    "location_subheading": "Maldives",
    "location_description": "Heritance Aarah",
    "offer_address": "Raa Atoll, Republic of MALDIVES Raa North MV, Maldives",
    "percentage_discount": 36.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 3713.0,
    "value": 5788.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IQcqIAG",
    "hero_image": "https://images.luxuryescapes.com/rn4wtrgqndrjrah7i6m",
    "image_two": "https://images.luxuryescapes.com/uqitqj4t5x8od85ldbo",
    "image_three": "https://images.luxuryescapes.com/y1ov2n95z9knj2bciqzc",
    "vendor_name": "Raaya by Atmosphere",
    "title": "Grand Reopening: Maldives All-Inclusive Villas with Unlimited Dining, Premium Free-Flow Drinks & Roundtrip Seaplane Transfers",
    "description": "Barefoot luxury awaits at this dreamy five-star Maldives sanctuary, surrounded by pristine sands, turquoise waters and vibrant tropical marine life. This spectacular villa-only retreat is situated on an enchanting small island, in the Raa Atoll. Offering unparalleled all-inclusive hospitality, you're bound to have a carefree stay in paradise.\n\nEmbark on an unforgettable culinary journey across six diverse restaurants and bars throughout the resort. Indulge in a decadent buffet spread at all-day dining destination RAAYA Life or opt for a la carte dishes at the three onsite specialty restaurants. Enjoy an all-inclusive selection of over 30 wines from renowned vineyards, carefully curated to complement each dining experience.\n\nDine on Italian classics at The Village, sample locally sourced seafood at Pan-Asian restaurant Ampers&nd or savour an evening of Middle Eastern fine dining at MIZĀJ, all while enjoying the ocean breeze. Between gourmet meals, cool off with a tropical drink from SOAQ Pool Bar or sip an ice-cold beer at Seb's Shack.\n\nMaximise your time in paradise with various activities tailored to your desires. Indulge in a relaxing treatment at ELE|NA Spa, inspired by local traditions, or dive into adventure with snorkelling along the coral reef and sunset cruises. Your stay promises to be as relaxing or adventurous as you choose.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Raa Atoll",
    "offer_geo_area_level_2": "Kudakurathu",
    "location_heading": "Raa Atoll",
    "location_subheading": "Maldives",
    "location_description": "RAAYA by Atmosphere",
    "offer_address": "Kudakurathu Island, Raa Atoll, The Maldives",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 2439.0,
    "value": 4794.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FjEzBAAV",
    "hero_image": "https://images.luxuryescapes.com/fcuhch30jnnhhkd5pix",
    "image_two": "https://images.luxuryescapes.com/eq1406nuq3tpmibvef",
    "image_three": "https://images.luxuryescapes.com/36jfcryuqkdlmi7suzu",
    "vendor_name": "Intercontinental Maamunagau",
    "title": "Five-Star Maldives Overwater Pool Villas with Daily Breakfast, Nightly Dinner & Domestic Seaplane Transfers",
    "description": "Be one with nature at the tranquil InterContinental Maldives Maamunagau Resort, an IHG Hotel, floating on the azure waters of the immaculate Raa Atoll. Be lulled into a state of serene relaxation by the tidal lullaby of the Indian Ocean as you live out your tropical island fantasies within your private villa. Feel your stresses slip away as you glide through the turquoise waters of the open waters atop a paddleboard or snorkelling below the surface. With the stunning resort positioned near one of Maldives’ UNESCO Biosphere Reserves, the protected Hanifaru Bay sanctuary, staying here means once-in-a-lifetime opportunities to view a rich and diverse marine habitat, with large populations of whale sharks and endangered manta rays.\n\nPamper yourself at the ethereal AVI Spa and watch as the sky turns a cacophony of orange while submerged in the pool, a refreshing cocktail never far out of reach. Let your tastebuds dance over incredible Maldivian seafood plucked straight from the tranquil waters at Fish Market, try Mediterranean flavours with a twist in a nautical lighthouse and experience a hands-on teppanyaki experience at Cafe Umi. For travelling families, Planet Trekkers Kids Club is sure to keep the little ones entertained while the adults indulge in fine cheese and impeccable wines at The Retreat.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Raa Atoll",
    "offer_geo_area_level_2": "Maamunagau Island",
    "location_heading": "Raa Atoll",
    "location_subheading": "Maldives",
    "location_description": "InterContinental Maldives Maamunagau Resort, an IHG Hotel",
    "offer_address": "Maamunagau Island, Raa Atoll, 05060, Maldives",
    "percentage_discount": 42.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 5799.0,
    "value": 9961.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J1LQIA0",
    "hero_image": "https://images.luxuryescapes.com/h3464b3128txibwcs7o9",
    "image_two": "https://images.luxuryescapes.com/wdspxmqcvqo9y824wsyf",
    "image_three": "https://images.luxuryescapes.com/c2b1fehcpu7c4tae905gq",
    "vendor_name": "JOALI BEING",
    "title": "Maldives Ultimate Wellbeing Retreat with Private Pool Villas, Butler Service & Onsite Dining",
    "description": "Step into a realm of transformative luxury at the Maldives’ first wellbeing island and a sanctuary unlike any other. Cocooned in crystalline waters, this private island retreat is devoted to deep, personalised healing. Each of the 68 ocean and beach villas is a spacious haven, complete with its own private pool, panoramic views and interiors designed to inspire harmony.\n\nFrom Michelin-starred Japanese dining at Yutori to the Mediterranean decadence of MOJO’s multi-tiered sundeck, every experience here is carefully curated to delight the senses and nourish the soul.\n\nBeyond culinary indulgence, JOALI BEING invites you to rediscover yourself through science-backed wellness programmes and ancient wisdom. Whether you're floating in the warm embrace of a Watsu pool in the hydrotherapy hall, engaging in cryotherapy at CORE, enjoying a massage or exploring mindful movement with pilates and Muay Thai, there is a wellbeing experience for everyone.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Raa Atoll",
    "offer_geo_area_level_2": "Bodufushi Island",
    "location_heading": "Raa Atoll",
    "location_subheading": "Maldives",
    "location_description": "JOALI BEING",
    "offer_address": "Bodufushi Island, Raa Atoll, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 1629.0,
    "value": 1629.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002J2jhIAC",
    "hero_image": "https://images.luxuryescapes.com/9271eriqk8a808iernh",
    "image_two": "https://images.luxuryescapes.com/gkenr5tdv8ksmnxpl9n5",
    "image_three": "https://images.luxuryescapes.com/rkmc2gp24dmgbalkrdcn",
    "vendor_name": "JOALI Maldives",
    "title": "Maldives Private Pool Oceanfront Glamour with Onsite Dining, Spa & Private Beach",
    "description": "Feel the magic from the moment you arrive at this shimmering Maldives paradise, where azure waters kiss ivory beaches and every worry melts away. This art-immersive Raa Atoll retreat is home to a collection of exclusive overwater and beach villas and sprawling residences, each designed to embrace the very best of blissful island living. \n\nSavour culinary delights across six distinctive dining venues, where global flavours shine through local island-harvested ingredients. By day, explore coral reefs teeming with marine life or sink into serenity at the world-class spa offering ancient healing treatments. By night, sip handcrafted cocktails under starlit skies at the oceanfront Mura Bar. JOALI has perfected the art of Maldivian luxury.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Raa Atoll",
    "offer_geo_area_level_2": "Muravandhoo",
    "location_heading": "Raa Atoll",
    "location_subheading": "Maldives",
    "location_description": "JOALI Maldives",
    "offer_address": "Muravandhoo Island, Raa Atoll, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 1792.0,
    "value": 1792.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HicEUYAZ",
    "hero_image": "https://images.luxuryescapes.com/njbyt0e5x7g456fe8fo",
    "image_two": "https://images.luxuryescapes.com/9wdium7xxi5zze4cyvo8",
    "image_three": "https://images.luxuryescapes.com/d8qj6dksqxm9f07eiwd",
    "vendor_name": "Alila Kothaifaru Maldives",
    "title": "Idyllic Maldives Private Island Seclusion with Six Restaurants & Bars, World-Class House Reef & Overwater Pool Villa Upgrades",
    "description": "Escape to a private island sanctuary where luxury meets nature in perfect harmony. Nestled in the remote Raa Atoll, just a breathtaking 45-minute seaplane ride from Malé, this pool villa paradise is your gateway to serenity. Surrounded by lush greenery, crystal-clear waters, and vibrant marine life, the resort’s 80 villas-each with a private pool-blend minimalist elegance with total seclusion.\n\nWhether perched above the water or tucked along the beach, every villa is a haven of space, style, and tranquillity. Dine your way around the globe with six unique venues serving bold flavours, from Mediterranean and Arabic to Japanese and Portuguese. For those seeking tranquillity, the resort's spa offers a range of rejuvenating treatments, inspired by ancient Asian healing techniques.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Raa Atoll",
    "offer_geo_area_level_2": "Kothaifaru",
    "location_heading": "Raa Atoll",
    "location_subheading": "Maldives",
    "location_description": "Alila Kothaifaru Maldives",
    "offer_address": "Kothaifaru, Raa Atoll, Republic of Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 583.0,
    "value": 583.0
  }
]