[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009EA9vAAG",
    "hero_image": "https://images.luxuryescapes.com/jbw2q5w2lof7rr66d7tr",
    "image_two": "https://images.luxuryescapes.com/m8s75vw6tsnwno9u95bn",
    "image_three": "https://images.luxuryescapes.com/7cb612561o322iwgmqe",
    "vendor_name": "Umaid Palace - An Organic Retreat",
    "title": "Regal Rajasthan Palace Retreat with Daily Farm-to-Table Breakfast & Unique Local Experiences",
    "description": "Escape the hustle and bustle of the city and head to Umaid Palace - An Organic Retreat, a charming resort set in the alluring countryside of Rajasthan. Overlooking tranquil Kalakho Lake and garlanded by a Mughal-style garden, this palatial 20-acre resort was once a royal hunting lodge. A regal sanctuary perfect for a weekend escape, Umaid Palace - An Organic Retreat is a family-run resort that promises heartwarming hospitality and personalised service. All food served at the resort is grown and sourced locally, with an emphasis on fresh, healthy and organic cuisine. The dishes are flavoured with herbs and spices from the onsite garden, adding a wholesome, authentic Rajasthani touch. Spend time at the Umaid farm and dairy and learn about everyday life on the land, maybe even trying your hand at harvesting and cooking crops.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Dausa",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Umaid Palace - An Organic Retreat",
    "offer_address": "Village Kalakho, Post Office Kalakho Dist. Dausa, Jaipur Agra National Highway Village Kalakho, Area, Kandoli, Rajasthan 303304",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 131.0,
    "value": 320.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CPqUqAAL",
    "hero_image": "https://images.luxuryescapes.com/bzox75j7pd8m4eek1n59",
    "image_two": "https://images.luxuryescapes.com/hie9xfev2hmcnikbbfy",
    "image_three": "https://images.luxuryescapes.com/qou3asoh7rx1ut3qqf7qi",
    "vendor_name": "Mihirgarh",
    "title": "Ultra-Luxe Thar Desert Suite Escape with Daily Breakfast, Daily Lunch or Dinner & One Safari Experience",
    "description": "Rising out of Rajasthan's majestic Thar Desert, Mihir Garh is a magnificent fort-style resort from the world-famous Relais & Châteaux collection. Authentic desert luxury awaits in this rustic paradise, a favourite of many celebrities, including Madonna. Stay in one of the eight exclusive suites with either a private plunge pool or jacuzzi for a truly unforgettable experience.\n\nOccupying a prime position in Rajasthan's unique desert landscape, Mihir Garh is a desert oasis that shimmers like a mirage. Its fort-inspired exteriors, elegant interiors and personalised service make it absolutely unique, while experiences including horseriding and Jeep safaris invite you to discover the beauty of the desert. This enchanting boutique resort should definitely be on your bucket list.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Pali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Mihir Garh",
    "offer_address": "Village khandi Jodhpur Rajasthan 306421 India",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 948.0,
    "value": 1394.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BfxVpAAJ",
    "hero_image": "https://images.luxuryescapes.com/po391h9abhrll0fsiuzj",
    "image_two": "https://images.luxuryescapes.com/i09u86a5s2l7fefng1",
    "image_three": "https://images.luxuryescapes.com/9hpxy5rumfnvb6yrcp1y",
    "vendor_name": "Alsisar Mahal",
    "title": "Rajasthan 17th-Century Palace Escape with Daily Breakfast, Drinks & One-Time Dinner",
    "description": "Rising out of the awe-inspiring desert landscape of Rajasthan is the glorious Alsisar Mahal. Set in the middle of the desert, the 17th-century palace has retained the grandeur of its bygone days, and guests can expect royal Rajasthani hospitality. Located within driving distance of Delhi (five hours) and Jaipur (four hours), Alsisar's charming setting, luxurious heritage rooms, imposing exterior, splendid courtyards, and tempting cuisine make it perfect for couples and families.\n\nTake part in the hotel's curated activities such as heritage walks, safaris and cooking demos (charges apply), or create your own adventure by taking day trips to nearby forts and temples. Roam through the rustic village of Alsisar, home to many colourful havelis, step-wells and age-old cenotaphs, or visit the Laxmi Narayan Temple, the largest and oldest temple in the village.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jhunjhunu",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Alsisar Mahal",
    "offer_address": "Jhunjhunu, Village, Alsisar, Rajasthan 331025, India",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 152.0,
    "value": 244.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002GQNEAA4",
    "hero_image": "https://images.luxuryescapes.com/k6t4bxdyoaa14krimuf",
    "image_two": "https://images.luxuryescapes.com/pbberqy97o3a1domvobk",
    "image_three": "https://images.luxuryescapes.com/joxkjl29uik3dv9k4ud",
    "vendor_name": "Umaid Palace - An Organic Retreat",
    "title": "Regal Rajasthan Palace Retreat with Daily Farm-to-Table Dining & Unique Local Experiences",
    "description": "Escape the hustle and bustle of the city and head to Umaid Lake Palace - An Organic Retreat, a charming resort set in the alluring countryside of Rajasthan. Overlooking tranquil Kalakho Lake and garlanded by a Mughal-style garden, this palatial 20-acre resort was once a royal hunting lodge. A regal sanctuary perfect for a weekend escape, Umaid Lake Palace is a family-run resort that promises heartwarming hospitality and personalised service.\n\nAll food served at the resort is grown and sourced locally, with an emphasis on fresh, healthy and organic cuisine. The dishes are flavoured with herbs and spices from the onsite garden, adding a wholesome, authentic Rajasthani touch. Spend time at the Umaid farm and dairy and learn about everyday life on the land, maybe even trying your hand at harvesting and cooking crops.\n\n**Your handpicked inclusions:**\n\n- Begin each day with authentic farm-to-table breakfast\n- Enjoy a nightly buffet or three-course dinner during your stay\n- End the day with one nightly beer per adult (one drink per person, per day)\n- Make the most of your stay with unique experiences such as a village cycling tour featuring home-hosted masala tea with the village tribe, an introductory lesson to Rajasthani turban tying, an evening arati ceremony at the in-house temple, a nature walk and a guided tour of the in-house organic farm and dairy per stay\n- Craving more deliciousness? Enjoy a 15% discount on food and soft drinks\n\n**Travelling with family?** Two kids (aged five years and under) stay free in existing bedding with all package inclusions (excludes alcohol).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Dausa",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Umaid Lake Palace - An Organic Retreat OLD",
    "offer_address": "Kalakho, Post Office Kalakho Dist. Dausa, Jaipur Agra National Highway, Village Kalakho (Area Kandoli), Rajasthan 303304, India",
    "percentage_discount": 71.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 139.0,
    "value": 472.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xXUYAA2",
    "hero_image": "https://images.luxuryescapes.com/a3jl57jwb1abizyps0b",
    "image_two": "https://images.luxuryescapes.com/406dv2jyb88ief8zf25j",
    "image_three": "https://images.luxuryescapes.com/k7z9mdg2h0h0gg16sgh",
    "vendor_name": "Umaid Palace - An Organic Retreat",
    "title": "Regal Rajasthan Palace Retreat with Daily Farm-to-Table Breakfast & Unique Local Experiences",
    "description": "Escape the hustle and bustle of the city and head to Umaid Lake Palace - An Organic Retreat, a charming resort set in the alluring countryside of Rajasthan. Overlooking tranquil Kalakho Lake and garlanded by a Mughal-style garden, this palatial 20-acre resort was once a royal hunting lodge. A regal sanctuary perfect for a weekend escape, Umaid Lake Palace is a family-run resort that promises heartwarming hospitality and personalised service.\n\nAll food served at the resort is grown and sourced locally, with an emphasis on fresh, healthy and organic cuisine. The dishes are flavoured with herbs and spices from the onsite garden, adding a wholesome, authentic Rajasthani touch. Spend time at the Umaid farm and dairy and learn about everyday life on the land, maybe even trying your hand at harvesting and cooking crops.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Dausa",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Umaid Lake Palace - An Organic Retreat OLDER ONE",
    "offer_address": "Kalakho, Post Office Kalakho Dist. Dausa, Jaipur Agra National Highway Village Kalakho, Area, Kandoli, Rajasthan 303304",
    "percentage_discount": 69.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 115.0,
    "value": 372.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cpMS6QAM",
    "hero_image": "https://images.luxuryescapes.com/jskrxwbaydut396vw6f",
    "image_two": "https://images.luxuryescapes.com/mgdmrdu9opz0s085x30c",
    "image_three": "https://images.luxuryescapes.com/ydbdb7jmumfefn4fr5b",
    "vendor_name": "Suryagarh Jaisalmer",
    "title": "Royal Luxury at the Gateway to the Thar Desert",
    "description": "Welcome to Suryagarh Jaisalmer, a renowned five-star property favoured among India's elite, including Bollywood film directors and dignitaries, located at the gateway to the golden Thar Desert in Jaisalmer. Spend two nights in award-winning royal luxury in this recreated fort and enjoy daily breakfast, one dinner for two per stay, one glass of wine or beer each per stay, a 20% discount on a la carte meals and spa treatments, and more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jaisalmer",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Suryagarh Jaisalmer OLD",
    "offer_address": "Kahala Phata, Jaislmer - Sam - Dhanana Rd, Jaisalmer, Rajasthan 345001, India",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 254.0,
    "value": 554.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lp4kAAA",
    "hero_image": "https://images.luxuryescapes.com/743y0230v8cpulnslld9t",
    "image_two": "https://images.luxuryescapes.com/x232l2u30xexcbwgxl6",
    "image_three": "https://images.luxuryescapes.com/doij1qxjll87gjht6xk",
    "vendor_name": "Alsisar Mahal",
    "title": "Rajasthan 17th-Century Palace Escape with Daily Breakfast, Drinks & One-Time Dinner",
    "description": "Rising out of the awe-inspiring desert landscape of Rajasthan is the glorious Alsisar Mahal. Set in the middle of the desert, the 17th-century palace has retained the grandeur of its bygone days, and guests can expect royal Rajasthani hospitality.\n\nLocated within driving distance of Delhi and Jaipur, Alsisar's rustic setting, luxurious heritage rooms, imposing facades, splendid courtyards, and tempting cuisine make it perfect for couples and families. Take part in the hotel's curated activities such as heritage walks, safaris and cooking demos (charges apply), or create your own adventure by taking day trips to nearby forts and temples.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jhunjhunu",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Alsisar Mahal OLDER ONE",
    "offer_address": "Jhunjhunu, Village, Alsisar, Rajasthan 331025",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 134.0,
    "value": 225.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FipQCAAZ",
    "hero_image": "https://images.luxuryescapes.com/qxpi2wnppfjbo5a0xb",
    "image_two": "https://images.luxuryescapes.com/ewaxpd1em6mcp3zzrtgc",
    "image_three": "https://images.luxuryescapes.com/mfp9n6t1ktvq3dn2tx",
    "vendor_name": "Ramathra Fort",
    "title": "Regal Rajasthan Heritage Escape near Jaipur with All-Inclusive Dining & Nature Experiences",
    "description": "Perched on a hilltop amid the lush Kalisil River valley of royal Rajasthan is Ramathra Fort, a secluded 17th-century fort-turned-hotel that promises a relaxing escape in the lap of nature. Blending heritage with contemporary luxury, this tranquil sanctuary evokes a regal charm with its aesthetically appealing interiors reflecting the local Rajasthani art and craft in its decor, from stone latticework to ornamental ceilings. Once serving as a battle fort, the plush hotel overlooks an undulating landscape dotted with a pristine lake, charming rural hamlets and picturesque farmlands. Lying within easy driving distance of Jaipur and New Delhi, this is a unique heritage stay with tastefully designed rooms, suites and luxury tents to choose from.\n\nUnwind in style with family and friends and enjoy all-inclusive meals while experiencing farm-to-table dining and savouring lip-smacking flavours. Situated between the world-famous Keoladeo Ghana Bird Sanctuary in Bharatpur and Ranthambore Tiger Reserve in Sawai Madhopur, the property is ideal for birdwatching and boating on the nearby lake. Explore the rugged countryside with a nature walk, embark on wilderness drives or experience a camel cart ride and make this Rajasthan escape memorable.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Sapotra",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Ramathra Fort",
    "offer_address": "Near Kalisil Dam, Sapotara, Rajasthan 322218",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 412.0,
    "value": 656.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lIvfAAE",
    "hero_image": "https://images.luxuryescapes.com/6f8pcjeh9orz0jp9wzt",
    "image_two": "https://images.luxuryescapes.com/2n0qijy07qxtw32g3sn",
    "image_three": "https://images.luxuryescapes.com/674abyicnc8wpsspnbi",
    "vendor_name": "Tree Of Life Chhota Mahal Amer, Jaipur",
    "title": "Grand Opening: Luxe Tree of Life Escape near Amer Fort with Daily Breakfast",
    "description": "Luxury seekers, there's a new address in Jaipur waiting to be discovered - Tree Of Life Chhota Mahal Amer, Jaipur. A brand-new retreat from the famous Tree of Life hotel group, this gorgeous resort resembles a typical Rajasthani palace with its detailed arches, royal corridors, and intricately designed porches.\n\nLive out your dreams of being royalty at this regal palace-style hotel all the while indulging in contemporary comforts. Less than an hour's drive from Jaipur Airport and easily accessible via Delhi (a five-hour drive), Tree of Life Chhota Mahal Amer won't make you work too hard for that holiday experience. Plus, the hotel is close to most of the Pink City's major attractions, including the magnificent Amer Fort (a 10-minute drive), Hawa Mahal and more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Amer",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Tree Of Life Chhota Mahal Amer, Jaipur",
    "offer_address": "Village Natata, Amer, Jaipur, Rajasthan 302028 India",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 149.0,
    "value": 307.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002yzKUAAY",
    "hero_image": "https://images.luxuryescapes.com/kti9q2d6t5qcn113by9l",
    "image_two": "https://images.luxuryescapes.com/tnctycbhqpa5huho1pf4",
    "image_three": "https://images.luxuryescapes.com/og8my98zlk5ewvxsezt",
    "vendor_name": "Ramathra Fort",
    "title": "Rajasthan Escape Driving Distance from Delhi, Jaipur & Agra with All Meals",
    "description": "Perched on a hill amid the lush Kalisil River Valley of royal Rajasthan is Ramathra Fort, a secluded fort-turned-hotel that promises a relaxing getaway in the lap of nature. Situated between the world-famous Keoladeo Ghana Bird Sanctuary in Bharatpur and Ranthambore Tiger Reserve in Sawai Madhopur, this 17th-century regal retreat overlooks an undulating landscape dotted with a pristine lake, charming rural hamlets and picturesque farmlands.\n\nUnwind with family and friends and enjoy all-inclusive meals with bottled water and non-alcoholic drinks (daily breakfast, lunch and dinner, plus morning and afternoon tea), a nightly glass of wine or beer per adult, 20% discount on additional food, drinks and spa treatments, and exclusive complimentary activities such as wilderness drives, boating, birdwatching and organic farm visits.\n\n**Travelling as a family?** Two children (aged four years and under) stay free with all meals and activities.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Sapotra",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Ramathra Fort",
    "offer_address": "Near Kalisil Dam, Sapotara, Rajasthan 322218",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 300.0,
    "value": 538.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FMeKeAAL",
    "hero_image": "https://images.luxuryescapes.com/yv3lzj4tl959kmclvtx",
    "image_two": "https://images.luxuryescapes.com/8lorklkr4tl44qjjakms",
    "image_three": "https://images.luxuryescapes.com/zu5n6coptnz6gj3p8rjk",
    "vendor_name": "Teela l The Glamping Resort, Jaipur",
    "title": "Luxe Desert Glamping Escape near Jaipur with Daily Breakfast & One Dinner",
    "description": "Immerse yourself in the grandeur of the desert at Teela The Glamping Resort, Jaipur, a unique oasis just an hour from the enchanting Pink City and a leisurely drive from New Delhi. Nestled amid the rugged Aravalli Hills, this luxury retreat features distinctive lunar-inspired domes, offering an unparalleled blend of adventure and opulence. Indulge in a plethora of activities, from paintball to ATV rides, under the vast star-studded skies. Savour exquisite cuisine crafted from organic produce, and explore the captivating allure of nearby landmarks like Amber Palace and Hawa Mahal. This is more than a stay, it's an unforgettable Rajasthani journey.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jamwa Ramgarh",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Teela The Glamping Resort, Jaipur",
    "offer_address": "Teela, NH11C Jaipur- Delhi Exp, Achrol Jaipur Rajasthan 303002 India",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 334.0,
    "value": 528.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlhqAAC",
    "hero_image": "https://images.luxuryescapes.com/p03yoai7xidrfoahpvfq",
    "image_two": "https://images.luxuryescapes.com/aqlc4trcwj4wfred9y1",
    "image_three": "https://images.luxuryescapes.com/s32ssdusw6xyh4n3t845",
    "vendor_name": "The Tree Of Life Kipling Lodge Ranthambore",
    "title": "Exotic Jungle Retreat on the fringe of Ranthambore National Park",
    "description": "Answer the call of the wild at Tree of Life Kipling Jungle Lodge, an exotic hideaway located on the fringe of the world-famous Ranthambore National Park. A former hunting ground of the Maharajas of Jaipur, today Ranthambore is a major wildlife tourist attraction and also one of the largest tiger reserves in the country. With the idyllic Aravalli Range as the backdrop, this resort promises royal living like no other.\n\nYour escape includes daily breakfast, a three-course dinner once during your stay, a mocktail tasting experience one during your stay, a traditional welcome on arrival and a 20% discount on food and soft drinks.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Sawai Madhopur",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Tree of Life Kipling Jungle Lodge OLD",
    "offer_address": "Charoda Rd, Ranwal, Rajasthan 322029, India",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 115.0,
    "value": 234.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004TiLrAAK",
    "hero_image": "https://images.luxuryescapes.com/02f6f8tfgg8ihr9npapu",
    "image_two": "https://images.luxuryescapes.com/s899qi2ihbsna0nolhp",
    "image_three": "https://images.luxuryescapes.com/3fm7csub8cfpsxak4i08",
    "vendor_name": "Tree of Life Inderpura Resort",
    "title": "Royal Rajasthan Palace Stay with Aravalli Range Views & Decadent Dining",
    "description": "Authentic Rajasthani luxury and hospitality await at WelcomHeritage Inderpura Resort, a tranquil paradise just five hours from Delhi and two hours from Jaipur. Under the gaze of the alluring Aravalli Range, and scattered across a lush 1.72 acres in Rajasthan's lesser-known Udaipurwati region, WelcomHeritage Inderpura Resort is the perfect escape for those who want a break from chaotic city life. Ideal for friends, families and couples, the resort will wow you with its regal, palace-like architecture, heartwarming hospitality and spectacular views.\n\nWhile away the days drinking in the lush green beauty of the surrounding landscape and breathing the crisp mountain air. The hotel can also help organise a variety of activities, such as stargazing sessions, camel rides, and much more (charges apply).",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipurwati",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "WelcomHeritage Inderpura Resort",
    "offer_address": "PFFW+V2, Delhi-Bikaner Road, Udaipurwati, Jhunjhunu, Rajasthan 333307",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 84.0,
    "value": 163.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eJujMQAS",
    "hero_image": "https://images.luxuryescapes.com/d75al3xaf67iha0w17t",
    "image_two": "https://images.luxuryescapes.com/gfzpk9ej6te045ayxtql",
    "image_three": "https://images.luxuryescapes.com/cqwnqgfu8vjst5lirnb",
    "vendor_name": "Ramathra Fort",
    "title": "Historic Fort Stay with All Daily Meals, Nightly Cocktail & Exclusive Activities",
    "description": "Discover the historical beauty of Ramathra Fort, an ancient hilltop fort outside Jaipur, Rajasthan, dating back to the 16th-century. Experience an idyllic escape amid nature as you indulge in daily breakfast, lunch and dinner, a 60-minute massage each (once per stay), a cocktail per person each night, 20% discount on food, drinks and spa treatments, and exclusive activities such as a walking tour of Ramathra village, nature walks and so much more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Ramathra Fort OLD",
    "offer_address": "Karauli District, Sapotara, Rajasthan 322218, India",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 326.0,
    "value": 674.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y2gkJQAR",
    "hero_image": "https://images.luxuryescapes.com/ml99tliezfenjfy3peha",
    "image_two": "https://images.luxuryescapes.com/xselbvbqj3e0mhxnoivr",
    "image_three": "https://images.luxuryescapes.com/zvfpx8lm0rycwkgitxj5",
    "vendor_name": "Rohet Garh",
    "title": "Boutique Stay at One of India's Finest Heritage Hotels",
    "description": "Discover the unique Rohet Garh Hotel in Jodhpur, one of the finest heritage hotels in the country with an Escapes Club’s exclusive offer. Spend two or three nights in a palatial Heritage Super Deluxe Room and enjoy daily buffet breakfast, a multi-course dinner during your stay, an exclusive village safari excursion, a refreshing juice on arrival and a convenient pick up from Jodhpur Airport or railway station.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Pali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Rohet Garh - OLD",
    "offer_address": "Village Post Rohet, Rohet Garh, Rajasthan 306421, India",
    "percentage_discount": 72.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 167.0,
    "value": 595.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UIZlJQAX",
    "hero_image": "https://images.luxuryescapes.com/evhygruta7zf29yqluth",
    "image_two": "https://images.luxuryescapes.com/ydsfbkc5593fnoi7uopi",
    "image_three": "https://images.luxuryescapes.com/tjtly1fczffdeogdufyp",
    "vendor_name": "Nahargarh, Ranthambhore",
    "title": "Heritage Escape in Ranthambore",
    "description": "Explore one of India's most renowned tiger reserves in style, staying at the luxurious Nahargarh Hotel located near Ranthambore National Park: home to tigers, leopards, hyenas, crocodiles, pythons and much more. Spend two or three nights in this majestic palace, with all meals included, a complimentary bottle of wine on arrival and a 20% discount on spa treatments.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Sawai Madhopur",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Nahargarh, Ranthambhore OLD",
    "offer_address": "Ranthambhore Road, Village Khilchipur, Sawai Madhopur",
    "percentage_discount": 71.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 276.0,
    "value": 942.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000Ip1MqAAJ",
    "hero_image": "https://images.luxuryescapes.com/cl6isb3wk1yk1rfv4wbv",
    "image_two": "https://images.luxuryescapes.com/durgkznuyq0wzr9prcxd",
    "image_three": "https://images.luxuryescapes.com/e1knrh69cl512douyuft",
    "vendor_name": "Suryagarh Jaisalmer",
    "title": "Royal Luxury at the Gateway to the Thar Desert",
    "description": "Uncover the wonders of India's 'Golden City' staying at Suryagarh, named one of the Top 25 Hotels in India by TripAdvisor 2017. Located at the gateway to the golden Thar Desert in Jaisalmer you can spend three days/two nights in award-winning royal luxury in this recreated fort and enjoy daily breakfasts, one signature Thali dining experience, one 60-minute spa therapy treatment each and more for only INR12,999 for two adults, valued up to INR54,650.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jaisalmer",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Suryagarh [196141] Royal Luxury at the Gateway to the Thar Desert OLD",
    "offer_address": "Kahala Phata, Sam Road Jaisalmer",
    "percentage_discount": 76.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 172.0,
    "value": 723.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GNL2AAO",
    "hero_image": "https://images.luxuryescapes.com/5vctlp6ramapxq1sami",
    "image_two": "https://images.luxuryescapes.com/t60z2n58pdweal8ym2",
    "image_three": "https://images.luxuryescapes.com/1saijyup6hiyr6pboba",
    "vendor_name": "Mihirgarh",
    "title": "Ultra-Luxe Thar Desert Suite Escape with Indulgent Daily Dining & Drinks",
    "description": "Rising out of Rajasthan's majestic Thar Desert, Mihir Garh is a magnificent fort-style resort from the world-famous Relais & Châteaux collection. Authentic desert luxury awaits in this rustic paradise, a favourite of many celebrities, including Madonna. Stay in one of the eight exclusive suites with either a private plunge pool or jacuzzi for a truly unforgettable experience.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Pali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Mihir Garh 2020",
    "offer_address": "Village Khandi Jodhpur, Rajasthan 306421",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 690.0,
    "value": 1366.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000ExEeEAAV",
    "hero_image": "https://images.luxuryescapes.com/gan7ibj6o9y9npeqcthn",
    "image_two": "https://images.luxuryescapes.com/yg8tate5sqhjtn5t599",
    "image_three": "https://images.luxuryescapes.com/ivefurxtywa5vs6nltp",
    "vendor_name": "The Leela Palace Jaipur",
    "title": "Five-Star Leela Jaipur Escape with Daily Breakfast, Daily Drinks & One Dinner",
    "description": "Discover the charms of Rajputana heritage with an opulent escape to The Leela Palace Jaipur, a luxurious oasis set against the backdrop of the magnificent Aravallis. Spread over eight acres of gorgeous landscaped gardens, the palatial property is intricately designed with traditional thikri craft, inlaid mirrors, Shekhawati paintings and silver foiled domes. An hour’s drive from Jaipur International Airport (JAI) and a four-hour drive from New Delhi, The Leela Palace Jaipur basks in regal grandeur and is a gem in the ‘Pink City’. Luxuriate in the elegantly designed rooms and suites, take a dip in the turquoise pool, destress with a pamper session at the spa and relish delectable delicacies across four exquisite restaurants and bars.\n\nFor history, heritage and culture lovers, The Leela Palace Jaipur is bound to cast an alluring spell as Rajasthan’s vibrant past comes alive here. Lying less than 40 minutes from the iconic gems of the ‘Pink City, like Hawa Mahal, Nahargarh Fort and the City Palace, The Leela Palace Jaipur is perfect for your Pink City explorations.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jamwa Ramgarh",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "The Leela Palace Jaipur",
    "offer_address": "Jaipur-Delhi Highway, NH 11, Kukas, Jaipur - 302028, Rajasthan India",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 370.0,
    "value": 991.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cpPfvQAE",
    "hero_image": "https://images.luxuryescapes.com/v3mda51iivk3i3gkyaj",
    "image_two": "https://images.luxuryescapes.com/jmb4gpv6wpc6s1cvuu1c",
    "image_three": "https://images.luxuryescapes.com/96g2qpgbrkkpw2zsspn",
    "vendor_name": "Rohet Garh",
    "title": "Boutique Stay at One of India's Finest Heritage Hotels",
    "description": "Discover the unique Rohet Garh Hotel in Jodhpur, one of the finest heritage hotels in the country with an Escapes Club’s exclusive offer. Spend two or three nights in this stunning hotel and enjoy daily buffet breakfast, a three-course lunch during your stay, an exclusive village safari excursion, a welcome refreshment on arrival and a convenient pick up from Jodhpur Airport or railway station.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Pali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Rohet Garh - 2019",
    "offer_address": "Village Post Rohet, Rohet Garh, Rajasthan 306421, India",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 194.0,
    "value": 512.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CyB8CAAV",
    "hero_image": "https://images.luxuryescapes.com/bi9tq0k5xeo997yzoeby",
    "image_two": "https://images.luxuryescapes.com/flt1e8jddna9qeex172h",
    "image_three": "https://images.luxuryescapes.com/5inbj6dkcii17u88ai7",
    "vendor_name": "Amritara Jawai Sagar",
    "title": "Luxurious Jawai Wilderness Escape with All-Inclusive Dining & One Jeep Safari",
    "description": "Find yourself in the land of leopards at Amritara Jawai Sagar, a luxe resort set amid the untamed wilderness of Jawai in Rajasthan. Tucked at the foot of Cobra Mountain, on the edge of tranquil Jawai Lake, you might find yourself in the company of an Indian Mugger crocodile lazing among flocks of flamingos and pelicans, or glimpse the regal Indian leopard. The hotel's tasteful rooms blend seamlessly with the environment, providing guests with a truly immersive experience. Whether you're lounging by the pool, savouring local cuisine, or embarking on a thrilling safari, Amritara Jawai Sagar is the perfect place to reconnect with nature.\n\nLocated a three-hour drive from Maharana Pratap Airport Udaipur (UDR), a six-hour drive from Ahmedabad, and an eight-hour drive from Jaipur,  this wilderness retreat is what you need for a truly luxurious detox. Fill your days with dips in the swimming pool, enthralling jeep safaris where you might just spot a leopard or two, or a bush dinner for that ultimate romantic experience.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Bali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Amritara Jawai Sagar",
    "offer_address": "Village Sena, Pali, Rajasthan 306707, India",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 582.0,
    "value": 983.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fli1dAAB",
    "hero_image": "https://images.luxuryescapes.com/63icbo8o8russkjxfeel",
    "image_two": "https://images.luxuryescapes.com/6mh0n4k1k96a3sb931lg",
    "image_three": "https://images.luxuryescapes.com/t8j86vooyum5w9gxbsnm",
    "vendor_name": "Mihirgarh",
    "title": "Luxe Thar Desert Suite Escape with Daily Breakfast, One Dinner & One Safari Experience",
    "description": "Immerse yourself in the regal splendour of Mihir Garh, a Relais & Châteaux jewel rising majestically from Rajasthan's Thar Desert. This fortress-style haven, frequented by the likes of Madonna, offers nine sumptuous suites, each boasting private plunge pools or jacuzzis. Just an hour from the azure-hued city of Jodhpur, this opulent retreat mirrors the vibrant Rajasthani heritage. Indulge in bespoke experiences like horseback safaris and village tours, making this desert oasis an unmissable addition to your luxury travel bucket list.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Pali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Mihir Garh",
    "offer_address": "Village khandi Jodhpur Rajasthan 306421 India",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 640.0,
    "value": 1049.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BfwSpAAJ",
    "hero_image": "https://images.luxuryescapes.com/ba9vcigv3d5kh8sjrqkq",
    "image_two": "https://images.luxuryescapes.com/1391lctnrl5vhgtbzth",
    "image_three": "https://images.luxuryescapes.com/8hobrrj8rmjmlx5u3zkf",
    "vendor_name": "The Kafila Desert Camp Jaisalmer",
    "title": "Rajasthan Desert Glamping Luxury with All-Inclusive Dining & Daily Cocktails",
    "description": "Experience the mysterious Thar desert with a luxe glamping escape at The Kafila Desert Camp near Jaisalmer, Rajasthan. This boutique oasis features 14 exquisite, hand-stitched tents that have been designed beautifully with modern comforts for a luxurious experience in the desert.\n\nDiscover a true wilderness - just an 11-hour drive from Ahemdabad or a 13-hour drive from Delhi - where you can immerse yourself in cultural experiences that introduce you to the rich heritage of Rajasthan, like jeep and camel safaris and romantic dinners on the dunes (extra charges apply). Indulge in aromatic delicacies crafted to perfection by master chefs and sip cocktails at the bar overlooking the sweeping sands. Winner of the Tripadvisor Travellers' Choice Award 2022, this property invites you to experience the desert, in style.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jaisalmer",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "The Kafila Desert Camp Jaisalmer",
    "offer_address": "Village Kanoi, Sam Sand Dunes, Jaisalmer, Rajasthan 345001 India",
    "percentage_discount": 31.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 303.0,
    "value": 441.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000DdL4UAAV",
    "hero_image": "https://images.luxuryescapes.com/buld40fn4ceuatzfipip",
    "image_two": "https://images.luxuryescapes.com/awso4ev8nixwf57daaq4",
    "image_three": "https://images.luxuryescapes.com/dmwsedvthk4tpxvrlm9d",
    "vendor_name": "Narendra Bhawan Bikaner",
    "title": "Grand Opening Special at Narendra Bhawan",
    "description": "Holiday like a Maharajah spending 3 nights at the newly opened boutique resort Narendra Bhawan, with daily breakfasts, a Crescent Dinner for two adults, nightly drink per adult and return private car transfers for two adults for only INR14,999, valued up to INR57,700.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Bikaner",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Narendra Bhavan Palace [189544] Grand Opening Special at Narendra Bhawan OLD",
    "offer_address": "Samvit Shikshan Sansthan, Gandhi Colony, Samta Nagar, Bikaner, Rajasthan",
    "percentage_discount": 74.0,
    "min_duration": 3,
    "max_duration": 3,
    "price": 198.0,
    "value": 763.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lIuNAAU",
    "hero_image": "https://images.luxuryescapes.com/v56gkdx0tjec4hy3xdd",
    "image_two": "https://images.luxuryescapes.com/f82ezb90wmtwjt3mqqzm",
    "image_three": "https://images.luxuryescapes.com/qsonpwb50w9d6no21joa",
    "vendor_name": "Tree of Life Inderpura Resort",
    "title": "Royal Rajasthan Palace Stay with Daily Breakfast, One Dinner & Aravalli Views",
    "description": "Authentic Rajasthani luxury and hospitality await at Tree of Life Inderpura Resort, a tranquil paradise just five hours from Delhi and just over two hours from Jaipur. Under the gaze of the alluring Aravalli Range, and spread across just under two acres in Rajasthan's lesser-known Udaipurwati region, Tree of Life Inderpura Resort is the perfect escape for those who want a break from chaotic city life. Ideal for friends, families and couples, the resort will wow you with its palatial architecture, heartwarming hospitality and spectacular views.\n\nWhile away the days drinking in the lush green beauty of the surrounding landscape and breathing the crisp mountain air. The hotel can also help organise a variety of activities, such as stargazing sessions, camel rides, and much more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipurwati",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Tree of Life Inderpura Resort",
    "offer_address": "PFFW+V2, Delhi-Bikaner Road Udaipurwati, Rajasthan 333307 India",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 124.0,
    "value": 302.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FPFkKAAX",
    "hero_image": "https://images.luxuryescapes.com/03c5lt4r1yd5yzsil71na",
    "image_two": "https://images.luxuryescapes.com/2t2fnxsutc8xvomvpz0a",
    "image_three": "https://images.luxuryescapes.com/p7kt79e3ctjxc2sbyfs",
    "vendor_name": "Radisson Blu Resort Kumbhalgarh",
    "title": "Grand Opening: Majestic Kumbhalgarh Escape w. Daily Breakfast, One Dinner & One Guided Trek",
    "description": "Immerse yourself in the regal allure of Radisson Blu Resort Kumbhalgarh, a newly unveiled sanctuary nestled within the verdant Aravalli Hills, just a two-hour drive from Udaipur. This vintage-chic retreat, built around an ancient banyan tree, is a whisper away from the UNESCO-protected Kumbhalgarh Fort. The property harmoniously marries historical charm with contemporary elegance, offering 86 meticulously crafted rooms and suites, a tranquil outdoor pool, a luxurious spa, and exciting dining sites. Indulge in gastronomic delights and inventive cocktails at the resort's three exquisite dining venues and bar. \n\nExperience the warm embrace of Mewari hospitality at this hidden jewel in the heart of Kumbhalgarh. Venture out to explore the awe-inspiring Kumbhalgarh Fort, India's own Great Wall, or embark on a thrilling safari at the nearby Kumbhalgarh Wildlife Sanctuary, where you might be fortunate enough to spot a pack of wolves.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Kumbhalgarh",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Radisson Blu Resort Kumbhalgarh",
    "offer_address": "Radisson Blu Resort, Khasra No. 516/212 & 549/212, Beer Ki Bhagal, Kelwara, Rajsamand District Kumbhalgarh Rajasthan 313325 India",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 345.0,
    "value": 723.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqJnKAAV",
    "hero_image": "https://images.luxuryescapes.com/6030wln6np4a6plg3wo9m",
    "image_two": "https://images.luxuryescapes.com/2koov3gcww7u6adrtmx",
    "image_three": "https://images.luxuryescapes.com/u5gt0y66zlc09jo13ao",
    "vendor_name": "Umaid Palace - An Organic Retreat",
    "title": "Heritage Rajasthan Palace Escape with Daily Breakfast & Local Experiences",
    "description": "Set in the charming countryside of Rajasthan, merely an hour's drive from Jaipur International Airport (JAI), Umaid Palace - An Organic Retreat is calling your name. An erstwhile Rajput hunting lodge, this palatial paradise is easily accessible from Delhi (a 3.5-hour drive) and ideal for a weekend escape. Step into this 20-acre property that is dotted with lush landscapes and well-manicured Mughal-style gardens overlooking the tranquil Kalakho Lake. A family-run resort offering heart-warming Rajasthani hospitality, Umaid Palace - An Organic Retreat makes for an ideal break, away from the hustle and bustle of the city. Enjoy a luxurious escape with a stay in your upgraded room  - Junior Suite or relax in the swimming pool, go on nature walks, visit the in-house organic farm, take bicycle tours, and feel truly rejuvenated.\n\nWith an in-house organic kitchen garden and dairy farm, the resort takes great pride in its cuisine and dishes out mouth-watering delicacies while curating a unique farm-to-table dining experience. Unwind at an unhurried pace at Umaid Palace - An Organic Retreat as you explore the nearby attractions of the 9th-century Chand Baori Stepwell (a 30-minute drive) or visit the haunted ruins of Bhangarh (a 50-minute drive) or explore a little further and visit the Bharatpur Bird Sanctuary (a 1.5-hour drive) to make your escape memorable.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Dausa",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Umaid Palace - An Organic Retreat",
    "offer_address": "Village Kalakho, Post Office Kalakho Dist. Dausa, Jaipur Agra National Highway Village Kalakho, Area, Kandoli, Rajasthan 303304",
    "percentage_discount": 70.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 126.0,
    "value": 415.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000WJb6vQAD",
    "hero_image": "https://images.luxuryescapes.com/s3deozhp1lyrothxpipq",
    "image_two": "https://images.luxuryescapes.com/goipg6ufltmwi9knultt",
    "image_three": "https://images.luxuryescapes.com/t1hoyq9acufiaczhkpcl",
    "vendor_name": "Mihirgarh",
    "title": "Mihir Garh: Relais & Châteaux Fortress Luxury in the Thar Desert",
    "description": "Escapes Club invites you to discover a desert oasis at the spectacular Mihir Garh, a one-of-a-kind luxury fort in the heart of the Thar desert, Rajasthan. Part of the prestigious Relais & Châteaux collection, it was once hailed ‘The Most Extraordinary Hotel in the World’ by Lonely Planet. Stay in a luxurious suite with a private plunge pool or jacuzzi with daily buffet breakfast, one indulgent dining experience, airport pickup on arrival, one INR1,000 spa credit per person and more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Pali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Mihir Garh - 2018",
    "offer_address": "Village Khandi, Khandi Rajasthan, Rajasthan 306421, India",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 479.0,
    "value": 1436.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csSxaQAE",
    "hero_image": "https://images.luxuryescapes.com/2n5h2k0mrwkb2vut3s8o",
    "image_two": "https://images.luxuryescapes.com/dbqqu1rxhgu59moua77p",
    "image_three": "https://images.luxuryescapes.com/5bau3z6nikpzn2kwzghs",
    "vendor_name": "Mihirgarh",
    "title": "Mihir Garh: Relais & Châteaux Fortress Luxury in the Thar Desert",
    "description": "You're invited to discover a desert oasis at the spectacular Mihir Garh, a one-of-a-kind luxury fort in the heart of the Thar desert, Rajasthan. Part of the prestigious Relais & Châteaux collection, it was once hailed ‘The Most Extraordinary Hotel in the World’ by Lonely Planet. Stay in a luxurious suite with a private plunge pool or Jacuzzi with daily buffet breakfast, one indulgent three-course dinner, airport or railway station pickup on arrival, a village safari, welcome drink on arrival and more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Pali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Mihir Garh OLD",
    "offer_address": "Village Khandi, Khandi Rajasthan, Rajasthan 306421, India",
    "percentage_discount": 63.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 762.0,
    "value": 2080.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dfu8gAAB",
    "hero_image": "https://images.luxuryescapes.com/fi30qbuykui97aeikiai",
    "image_two": "https://images.luxuryescapes.com/f94ds4ebz7hewpza045f",
    "image_three": "https://images.luxuryescapes.com/xtji7amiv8sy0k3082n",
    "vendor_name": "Chunda Shikar Oudi",
    "title": "Grand Opening: Tranquil Lakeview Suites near Udaipur with All-Inclusive Dining, Daily Cocktails & Jeep Safari",
    "description": "Less than an hour from Udaipur, find your paradise at Chunda Shikar Oudi, a recently opened resort with a calming lake as its backdrop. Unwind amid 150 hectares of scenic woodlands surrounding you at this former hunting outpost of the royals. Easily accessible from Maharana Pratap Airport (UDR) in Udaipur (a 40-minute drive), this boutique property features just 10 opulent rooms, each with exquisite furnishings and tranquil lake views. The highlights of your escape will include dining by the gorgeous infinity pool where you can savour perfectly prepared meals, exciting pursuits like safaris for thrill-seekers, stargazing to tickle your romantic bone, boating to feel the gentle breeze on your face and more.\n\nWhether it's a romantic holiday or a quick weekend escape or a family vacation, Chunda Shikar Oudi has something for everyone.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Udaipur",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Chunda Shikar Oudi",
    "offer_address": "Gram Panchayat Batharda Kalan, Kheroda Udaipur Rajasthan 313602 India",
    "percentage_discount": 31.0,
    "min_duration": 2,
    "max_duration": 11,
    "price": 1889.0,
    "value": 2740.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006C9REAA0",
    "hero_image": "https://images.luxuryescapes.com/fiis3rmq9n1acn0gievl",
    "image_two": "https://images.luxuryescapes.com/38joqobgnj2zta5u7a6",
    "image_three": "https://images.luxuryescapes.com/dxg8edpc0oky6dbfyyr",
    "vendor_name": "Mihirgarh",
    "title": "Ultra-Luxe Thar Desert Suite Escape with Daily Breakfast & Safari Experience",
    "description": "Rising out of Rajasthan's majestic Thar Desert, Mihir Garh is a magnificent fort-style resort from the world-famous Relais & Châteaux collection. Authentic desert luxury awaits in this rustic paradise, a favourite of many celebrities, including Madonna. Stay in one of the eight exclusive suites with either a private plunge pool or jacuzzi for a truly unforgettable experience.\n\nOccupying a prime position in Rajasthan's unique desert landscape, Mihir Garh is a desert oasis that shimmers like a mirage. Its fort-inspired exteriors, elegant interiors and personalised service make it absolutely unique, while experiences including horseriding and Jeep safaris invite you to discover the beauty of the desert. This enchanting boutique resort should definitely be on your bucket list.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Pali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Mihir Garh",
    "offer_address": "Village khandi Jodhpur Rajasthan 306421 India",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 670.0,
    "value": 1280.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C230gAAB",
    "hero_image": "https://images.luxuryescapes.com/1faoqdo2wlhknno94st",
    "image_two": "https://images.luxuryescapes.com/4tvyqdlnxvkryttn25ap",
    "image_three": "https://images.luxuryescapes.com/ywymk53snv59nog5gzu",
    "vendor_name": "Brij Lakshman Sagar",
    "title": "Lakeside Heritage Escape near Jaipur with Daily Breakfast & Dinner",
    "description": "Leave it all behind for the beautiful Brij Lakshman Sagar, sprawling across 32 rural acres in Raipur, Rajasthan - an expanse of untouched nature just four hours from the beautiful cities of Jaipur and Udaipur, and eight hours from Delhi. Originally built as a hunting lodge by the Thakur of Raipur in the late 19th century, this boutique resort is organically designed offering you a rustic luxury experience. 12 unique cottages, each with their own pool, connect you with the essence of the surroundings. The stunning rock-carved pool built into the hillside gives you an exhilarating experience, highly personalized and curated food experiences entice you at Lakshman Sagar and the chefs transport you back in time with age-old Raipur recipes, prepared with local ingredients. \n\nNaturalists create personalized experiences like nature walks, fishing and other activities to give you a taste of the gorgeous surroundings. You simply can’t miss the flock of resident peacocks on the property. A distinctive trip to Rajasthan that brings you closer to nature.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Raipur",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Brij Lakshman Sagar",
    "offer_address": "Raipur Road, Near Haripur Railway Station, Pali, Raipur 306304 India",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 610.0,
    "value": 1043.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006yP4WAAU",
    "hero_image": "https://images.luxuryescapes.com/e91e9h7d75e0op2nzb8",
    "image_two": "https://images.luxuryescapes.com/5qmcdf8ux7ky6jdobikp",
    "image_three": "https://images.luxuryescapes.com/e1f57pgdyq1uq370i3wi",
    "vendor_name": "Welcomhotel Khimsar Fort & Dunes",
    "title": "Luxe Thar Desert Escape Amid the Sand Dunes with Daily Breakfast & Daily Drinks",
    "description": "Shimmering like an oasis on the edge of the Great Indian Thar Desert in Rajasthan, Welcomhotel Khimsar Fort & Dunes is calling your name. Experience a mesmerising mix of desert luxury, ITC hospitality and regal ambience at this 500-year-old manor-turned-hotel. \n\nErected in the 15th century by the eighth son of Rao Jodha, the founder of Jodhpur, this majestic fort stands tall amid the sand dunes of Thar and echoes Rajput's traditional architecture at every corner. Relax amid 44,515 square metres of sprawling lawns, orchards, and open courtyards at a hotel rated among the top 10% of properties worldwide on Tripadvisor. Less than two hours from the Blue City of Jodhpur, this luxurious hotel will charm you with its beautiful blend of royal accommodation, decadent cuisine and authentic desert experiences. While history buffs will enjoy spending time in the ancient fort-hotel, adventure enthusiasts will love the mud huts scattered amid the impressive sand dunes of Thar. Enjoy contemporary luxury in the heart of the desert from these uniquely designed cottages - an experience you won't find anywhere else.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Nagaur",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Welcomhotel Khimsar Fort & Dunes",
    "offer_address": "P.O. Khimsar, Dist, Khimsar, Rajasthan 341025",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 208.0,
    "value": 305.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LjYHAA0",
    "hero_image": "https://images.luxuryescapes.com/le050o0mil21uenbmzf",
    "image_two": "https://images.luxuryescapes.com/h8bztayxod5duvzuqlyh",
    "image_three": "https://images.luxuryescapes.com/b57sw3kyx6tt7p4fhqmo",
    "vendor_name": "Rohet Garh",
    "title": "Boutique Stay at One of India's Finest Heritage Hotels",
    "description": "Discover the unique Rohet Garh Hotel in Jodhpur, one of the finest heritage hotels in the country. Spend two or three nights in this stunning hotel and enjoy daily buffet breakfast, a three-course lunch during your stay, an exclusive village safari excursion, a welcome refreshment on arrival and a convenient pick up from Jodhpur Airport or railway station.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Pali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Rohet Garh OLD",
    "offer_address": "Village Post Rohet, Rohet Garh, Rajasthan 306421, India",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 195.0,
    "value": 510.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062800000PMvrmAAD",
    "hero_image": "https://images.luxuryescapes.com/bfiq0q8alf5plhmnmyyk",
    "image_two": "https://images.luxuryescapes.com/cj5dhuyiygbbveo1emed",
    "image_three": "https://images.luxuryescapes.com/hahaooqvwxeiw2rh3e4d",
    "vendor_name": "Narendra Bhawan Bikaner",
    "title": "Holiday like Royalty at Narendra Bhawan Bikaner",
    "description": "Experience a holiday fit for a Maharajah with a two-night stay at Narendra Bhawan Bikaner. Stay in a Residence Room and enjoy daily breakfasts, one three-course dining experience, one nightly wine, beer or spirit each and more for two adults.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Bikaner",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Narendra Bhavan Palace [213704] Holiday like a Maharajah in Bikaner OLD",
    "offer_address": "Samvit Shikshan Sansthan, Gandhi Colony, Samta Nagar, Bikaner, Rajasthan",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 2,
    "price": 222.0,
    "value": 446.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004TWkvAAG",
    "hero_image": "https://images.luxuryescapes.com/j2xzlbdyagau0si4u7",
    "image_two": "https://images.luxuryescapes.com/85rr7mtj6o51sfk0dnut",
    "image_three": "https://images.luxuryescapes.com/0et9nuc6k88dyjbbtru",
    "vendor_name": "Dera Village, The Clement Retreats",
    "title": "Eco-Friendly Rajasthan Cottage Stay with All-Inclusive Dining & Nightly Drinks",
    "description": "Escape to the charming rural hinterland of Rajasthan with a stay at Dera Village, The Clement Retreats. Nestled in the lap of the majestic Aravallis and just 4.5 hours from Delhi, this cottage-only rustic retreat is an ideal escape from the chaotic city life. Enjoy a luxurious vacation in the green surrounds of this eco-friendly resort where you can truly connect with Mother Nature, staying in one of 16 cosy cottages that feature all the contemporary comforts necessary for a perfect stay.\n\nEnjoy true Rajasthani hospitality with all meals included in your package, feasting on the freshest organic farm-to-table produce grown in the resort's own organic gardens, and end each day's adventures with a complimentary glass of house wine or beer.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Sakrai",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Dera Village, The Clement Retreats",
    "offer_address": "Dera Village, Gadoli, Sikandra, Dausa, Rajasthan 303502 India",
    "percentage_discount": 43.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 215.0,
    "value": 376.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdP2mAAF",
    "hero_image": "https://images.luxuryescapes.com/e57aea3a04z6jbivvba",
    "image_two": "https://images.luxuryescapes.com/5j4ykhvy0kgpir8iov8",
    "image_three": "https://images.luxuryescapes.com/snavssrhb3biljma07y",
    "vendor_name": "Six Senses Fort Barwara",
    "title": "Ultra-Luxe Six Senses Rajasthan Escape with Daily Breakfast, One Lunch/Dinner & Daily Happy Hour",
    "description": "Colossal and exquisite, Six Senses Fort Barwara is a 14th-century royal abode restored into an ultra-lux paradise. Steeped in history, art and culture, the luxurious fort reflects the opulence of a bygone era, as it lies nestled in the lap of the woody Aravallis. With its immaculate palatial design and regal ambience, Six Senses Fort Barwara is only a three-hour drive from Jaipur International Airport (JAI) and a six-hour drive from New Delhi. A favourite with celebrities, this 700-year-old fort hotel curates a spectacular experience with its ancient sandstone domes and picturesque setting. Boasting 48 lavish suites, two glimmering pools, a massive 30,000 sq ft ayurvedic spa centre and a plethora of dining spaces, the fort hotel will leave you mesmerised.\n\nCombining two palaces and two temples, the once-rambling hilltop garrison has now been restored into a Six Senses sanctuary of well-being and is an ideal retreat for hedonistic travellers. Facing the famous Chauth Ka Barwara Temple, this luxurious fort hotel lies close to Ranthambore National Park (an hour’s drive) and is the perfect place for embarking on wildlife safaris while experiencing the opulence of royal Rajasthani culture.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Sawai Madhopur (Ranthambore)",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Six Senses Fort Barwara",
    "offer_address": "Six Senses Fort, Chauth Ka Barwara Rajasthan Rajasthan 322702 India",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 833.0,
    "value": 1255.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GOy9AAG",
    "hero_image": "https://images.luxuryescapes.com/a8l3qv5f1cb1884aaytu",
    "image_two": "https://images.luxuryescapes.com/iee66l5jmq7sxxfvr9tj",
    "image_three": "https://images.luxuryescapes.com/sg41jkdc9f0z32hh9s1",
    "vendor_name": "Fateh Safari Suites Kumbalgarh",
    "title": "Hilltop Kumbhalgarh Suite Stay with Panoramic Valley Views & Decadent Dining",
    "description": "Experience luxurious hospitality and unparalleled views of the valley and famed Kumbhalgarh Fort at Fateh Safari Suites, a boutique resort perched 1,000 metres above sea level on 75 acres of private forest in Rajasthan. Located two hours from Udaipur, this suite-only property is perfect for a long weekend staycation. Just 10 minutes from Kumbhalgarh Wildlife Sanctuary, and equipped with a swimming pool, restaurant and games room, this fabulous resort is a great base for those seeking adventurous wildlife escapes or simply a relaxing break amid nature.\n\n**Your handpicked inclusions:**\n\n- Start every day in this regal retreat with a delicious buffet breakfast at Baradari Restaurant\n- Enjoy one three-course or buffet dinner, once during your stay at Baradari Restaurant\n- Relax with one non-alcoholic drink per adult, per day (one drink per person) at Baradari Restaurant\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** Two children (aged five years and under) stay free in existing bedding with dining inclusions per package purchased.\n\n**Private Pool Upgrade**: Cool off in your private plunge pool when you upgrade to a magnificent Plunge Pool Suite.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Kumbhalgarh",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Fateh Safari Suites",
    "offer_address": "Delas near Aaret ki Bhagal, Chouhano ki ghatti, Saira Road, Kumbhalgarh, Rajasthan 313325",
    "percentage_discount": 48.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 155.0,
    "value": 299.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNJA7AAP",
    "hero_image": "https://images.luxuryescapes.com/vssidq4jl18qoujp8ej",
    "image_two": "https://images.luxuryescapes.com/9e7dmsmejvyc6mm5tck",
    "image_three": "https://images.luxuryescapes.com/v3ipizupr885ay115gvo",
    "vendor_name": "WelcomHeritage Cheetahgarh Resort & Spa",
    "title": "Luxurious Jawai Lakeside Escape with Daily Breakfast, Daily Dinner & Daily Safari",
    "description": "WelcomHeritage Cheetahgarh Resort & Spa has swung open the gates to adventure, luxury and unfiltered wilderness in Rajasthan. Set within 20 acres of the leopard heartland of Jawai in Rajasthan, this beautiful paradise overlooks a gorgeous lake and is just a three-hour drive from Maharana Pratap Airport (UDR) in Udaipur. With the promise of the best wildlife and wellness experiences, this Jawai resort offers incredible accommodations, lip-smacking dining, amazing experiences and picturesque views of the Aravallis.\n\nOne of the best wildlife resorts in Rajasthan, this gorgeous paradise has unique dining experiences like dining on the rocks by the lake where the skilled chef serves a tailor-made menu to delight your palate. Where culinary adventures end, adrenaline-pumping experiences begin with the famous leopard safaris of Jawai - spot the spotted ones with expert guides! Indulge in a wide range of therapies at the opulent spa and spend your evenings lazing by the pool. The resort has got it all.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Bali",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "WelcomHeritage Cheetahgarh Resort & Spa",
    "offer_address": "Varawal, Bera, District Pali, Rajasthan, 306126, India",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 408.0,
    "value": 1012.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3LGSQA3",
    "hero_image": "https://images.luxuryescapes.com/xpaetsejfplulqvz4fpy",
    "image_two": "https://images.luxuryescapes.com/pzmp2uoygiecynztjjii",
    "image_three": "https://images.luxuryescapes.com/z1klkduvixvor5q9khge",
    "vendor_name": "Ramathra Fort",
    "title": "Stay in an Historic Fort with All Meals, Spa Treatments, Cocktails & Sunset Boat Cruise",
    "description": "Discover the historical beauty of Ramathra Fort, an ancient hilltop fort outside Jaipur, Rajasthan, dating back to the 16th-century. Experience a two-night Escapes Club staying in a Luxury Tent set amid the lush gardens, and indulge in daily breakfast, lunch and dinner, a 60-minute massage each, a sunset boat cruise with a cocktail each plus a cocktail per person, per night for two adults.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Ramathra Fort 2018",
    "offer_address": "Karauli District, Sapotara, Rajasthan 322218, India",
    "percentage_discount": 44.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 368.0,
    "value": 652.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dbGJpQAM",
    "hero_image": "https://images.luxuryescapes.com/7diwddlb8l17hp1iv9d",
    "image_two": "https://images.luxuryescapes.com/81q79hf5kpdc7f3eyh8",
    "image_three": "https://images.luxuryescapes.com/dzk0npm67iw7lwqws6gl",
    "vendor_name": "Umaid Palace - An Organic Retreat",
    "title": "Historic Palace Stay with Daily Breakfast and Nightly Drinks",
    "description": "Experience a unique combination of royalty, history and modern-day organic farming at Umaid Lake Palace. Built in the 1970s by Thakur Umaid Singh Rathore, the resort was once a favourite hunting ground of the Peelwa family. Today, it has been converted to a stunning retreat and is run by the family who are wonderful hosts as they personally interact with guests to make their stay a memorable one. Your royal getaway includes daily buffet breakfast, one buffet or three-course dinner per stay and drinks and savings of 15% on food and soft beverages along with local experiences.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Dausa",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Umaid Lake Palace 2019",
    "offer_address": "Kalakho, Post Office Kalakho Dist. Dausa, Jaipur Agra National Highway, Village Kalakho (Area Kandoli), Rajasthan 303304, India",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 156.0,
    "value": 467.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C52c7AAB",
    "hero_image": "https://images.luxuryescapes.com/to8v47l6rmggvfd768jp",
    "image_two": "https://images.luxuryescapes.com/8tpy5f50qjw7ecrulcke",
    "image_three": "https://images.luxuryescapes.com/t77sfhwbalhfb1znv8l",
    "vendor_name": "Gaj Kesri Bikaner",
    "title": "Boutique Bikaner Stay with Daily Veg. Breakfast, Dinner & High-Tea",
    "description": "One of the finest luxury boutique hotels in Bikaner, Gaj Kesri is the confluence of modernity and tradition. A joyous eight-hour drive from Delhi, this hotel takes you in its warm embrace and surrounds you with art that tells you tales of a bygone era. Whether you're looking for a family holiday or a romantic sojourn, this hotel has the ambience to please both. By day, Gaj Kesri is an amazing base to start exploring some famous attractions of Rajasthan - like the Lalgarh Palace and Karni Mata Temple - and by night, it's a tranquil oasis that serenades you to sleep.\n\nIndulge in delicious vegetarian cuisine at the onsite Polki restaurant, a haven for foodies searching for a mouthwatering meal. Get your morning caffeine fix at Coffee & Co. and pair it with a sweet or savoury treat before visiting the onsite spa for a truly relaxing experience. Meanwhile, an immaculate front lawn and verdant gardens beckon you towards moments of peace and quiet. With acres of untouched nature surrounding the property, spacious and well-designed rooms, a shimmering pool and some of best restaurants in town within a short drive, this hotel promises a peaceful escape.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Bikaner",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Gaj Kesri",
    "offer_address": "Bypass Road Nainon Ka Bas, Ridmalsar Sipahiyan Bikaner Rajasthan 334022 India",
    "percentage_discount": 65.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 166.0,
    "value": 480.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zGeKAAU",
    "hero_image": "https://images.luxuryescapes.com/il7r8okpvy4mt3uehva",
    "image_two": "https://images.luxuryescapes.com/vjbuvm8ns2ckzdojlt48",
    "image_three": "https://images.luxuryescapes.com/ec8al3gpqmftwzhswhj",
    "vendor_name": "Alsisar Mahal",
    "title": "Rajasthan 17th-Century Palace Escape with Gourmet Dining",
    "description": "Rising out of the awe-inspiring desert landscape of Rajasthan is the glorious palace of Alsisar Mahal. With history seeping out of every corner and royal Rajasthani hospitality, this 17th-century palace-turned-hotel promises to pamper you. Located within driving distance of Delhi and Jaipur, Alsisar's rustic setting, luxurious heritage rooms, imposing facades, splendid courtyards and tempting cuisine are perfect for couples and families.\n\nTake part in the hotel's curated activities such as heritage walks, safaris and cooking demos (charges apply), or create your own adventure by taking day trips to nearby forts and temples.\n\n**Your handpicked inclusions**:\n\n- Start your days with daily buffet breakfast in the Dining Hall\n- Enjoy one three-course dinner for two in the Dining Hall, once per stay\n- Relax with one glass of house wine or beer per adult, once per stay, at the courtyard or Badal Mahal\n- Treat your tastebuds with a 20% discount on drinks and dining\n\n**Travelling with family?** Stay three nights or more and two kids (aged 11 years and under) stay free in existing bedding with all package inclusions.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jhunjhunu",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Alsisar Mahal OLD",
    "offer_address": "Alsisar Village, Jhunjhunu District Jhunjhunu, 331025",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 109.0,
    "value": 173.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Guc14AAB",
    "hero_image": "https://images.luxuryescapes.com/aonl9rrdls3ue0g1om42g",
    "image_two": "https://images.luxuryescapes.com/77tb569jmer4kvscx3xn",
    "image_three": "https://images.luxuryescapes.com/d89z3wvtqy76plocyc4",
    "vendor_name": "Brij Bageecha Jaipur",
    "title": "Luxe Jaipur Private Villa Escape with Daily Breakfast, High Tea & One Dinner",
    "description": "Immerse yourself in Rajasthan's vintage charms with an elegant private villa stay at the Brij Bageecha Jaipur, nestled amid 11 acres of lush greenery and surrounded by scenic courtyards. Boasting 20 stylishly designed villas overlooking a private lake, some with heated private pools, relax and rejuvenate in the tranquil surroundings. Lying within easy driving distance from the 'Pink City' of Jaipur and New Delhi, these luxurious villas are ideal for lavish indulgences and taking a break from the hustle and bustle of city life. Go for a swim in the azure outdoor pool, unwind in the jacuzzi tub, watch spectacular sunsets as you sip on a warm cuppa or savour authentic Rajasthani cuisine at the property's all-day dining restaurant, Sangri.\n\nTake it slow and admire the beauty of your natural surroundings - from blooming orchards to organic farms to the soothing water bodies of the villa property, enjoy heartwarming Rajasthani hospitality. If you wish to explore Jaipur, all the popular attractions like the Hawa Mahal and the forts of Amer and Nahargarh are only an hour's drive away. After a long day of exploring, return to Rang, Sunset Bar and Lounge and toast to the sunset with a drink in hand.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jamwa Ramgarh",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Brij Bageecha Jaipur",
    "offer_address": "Bhanpur-Saiwar Road, Bhanpur Kalan, Kukas Jaipur Rajasthan 302028 India",
    "percentage_discount": 29.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 489.0,
    "value": 691.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dZSR8QAO",
    "hero_image": "https://images.luxuryescapes.com/ieuaxzeyynsjvnfg23c7",
    "image_two": "https://images.luxuryescapes.com/i0a46v8rq6g6znowr3m",
    "image_three": "https://images.luxuryescapes.com/e8samna13qxkjqs58w9d",
    "vendor_name": "Nahargarh, Ranthambhore",
    "title": "Palatial Jungle Escape with All-Inclusive Dining",
    "description": "Explore one of India's most renowned tiger reserves in style, staying at the luxurious Nahargarh Ranthambhore Hotel-brought to you by the Royal Alsisar family-located near Ranthambhore National Park, home to exotic animals including tigers, leopards, hyenas, crocodiles, pythons and more. Spend two or three nights in this majestic palace, with all meals included, a complimentary bottle of wine on arrival, welcome drink and more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jaipur",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Nahargarh Ranthambhore OLD",
    "offer_address": "Ranthambhore Road, Village Khilchipur, Sawai Madhopur, Rajasthan 322001, India",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 370.0,
    "value": 979.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000X97zBQAR",
    "hero_image": "https://images.luxuryescapes.com/i3zdxr7yzkayx6ywdr7b",
    "image_two": "https://images.luxuryescapes.com/fvypvpizz6mwmzctyz50",
    "image_three": "https://images.luxuryescapes.com/c3jvftunmtvzeh45vzr3",
    "vendor_name": "Rawla Narlai",
    "title": "Eco-Friendly Getaway in Aravalli Hills",
    "description": "Escape to the lush rolling hills of the Narlai Village to a spectacular heritage hotel set against a granite mountain backdrop. The perfect base to explore the attractions between Jodhpur and Udaipur, enjoy a two or three-night stay at Rawla Narlai with daily buffet breakfast, one three-course dinner and 20% off spa treatments, food and beverage and activities like a Leopard safari and horse riding.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Desuri",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Rawla Narlai",
    "offer_address": "Village Narlai, Rajasthan, India",
    "percentage_discount": 76.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 158.0,
    "value": 660.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y3VjIQAV",
    "hero_image": "https://images.luxuryescapes.com/wqsqfferkcpkuhovuzig",
    "image_two": "https://images.luxuryescapes.com/kk4oifvqy5oy0a9phdxl",
    "image_three": "https://images.luxuryescapes.com/li8xn8zy2npqd25wrmr1",
    "vendor_name": "Nahargarh, Ranthambhore",
    "title": "Palatial Jungle Escape with All-Inclusive Dining",
    "description": "Explore one of India's most renowned tiger reserves in style, staying at the luxurious Nahargarh Hotel, located near Ranthambhore National Park, home to exotic animals including tigers, leopards, hyenas, crocodiles, pythons and more. Spend two or three nights in this majestic palace, with all meals included and a complimentary bottle of wine on arrival, plus more indulgent Escapes Club inclusions.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Jaipur",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Nahargarh Ranthambhore - Nov 2018",
    "offer_address": "Ranthambhore Road, Village Khilchipur, Sawai Madhopur, Rajasthan 322001, India",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 325.0,
    "value": 896.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gnUyAAI",
    "hero_image": "https://images.luxuryescapes.com/cqx4qssd2psgn1z40sr3",
    "image_two": "https://images.luxuryescapes.com/a4jz3t7e98ud5rcl4ot",
    "image_three": "https://images.luxuryescapes.com/69til8e739glsaf8fka",
    "vendor_name": "Six Senses Fort Barwara",
    "title": "Royal Rajasthani Sojourn in Barwara",
    "description": "A royal Rajasthani family abode turned exquisite hotel, Six Senses Fort Barwara is steeped in Rajasthan's culture, history and art, and is embellished with regal touches. Reflecting the opulence of a bygone era, the 14th-century fort gives you the feeling of grandeur from the moment you step foot in this palace turned sanctuary of wellbeing. With exquisite suites that offer views of the imposing Aravali range, the shimmering waters of a magical lake and the famous temple Chauth ka Barwara Mandir, you'll be at a loss for words to describe your stay in this luxurious haven.\n\nPrepare your taste buds for unique dining experiences, ranging from The Cortile, offering a Mediterranean and pan-Asian array of culinary delights, to meals under the blanket of stars at the Shikar Burj. The spa is always ready to pamper your senses with soothing therapies, and The Viewing Gallery offers perspectives that are magnificent at any time of day. If you are in need for some Rajasthani splendour and hospitality, then this royal escape is the best option for you.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Rajasthan",
    "offer_geo_area_level_2": "Sawai Madhopur (Ranthambore)",
    "location_heading": "Rajasthan",
    "location_subheading": "India",
    "location_description": "Six Senses Fort Barwara",
    "offer_address": "Chauth Ka Barwara, Rajasthan 322702, India",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 461.0,
    "value": 461.0
  }
]