[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvpDvAAJ",
    "hero_image": "https://images.luxuryescapes.com/7v6eev457cspfo91me77",
    "image_two": "https://images.luxuryescapes.com/bih0hkc6ga24w8z5qypi",
    "image_three": "https://images.luxuryescapes.com/be9vgmeys061q1my30f",
    "vendor_name": "The Taaras Beach & Spa Resort",
    "title": "Malaysian Beachfront Bliss on Redang Island with Daily Breakfast, Nightly Cocktail & Snorkelling Adventure",
    "description": "Discover the pinnacle of tropical paradise with a relaxing beachfront escape at The Taaras Beach & Spa Resort, where barefoot luxury awaits. Perched on Redang Island off the east coast of Malaysia, this five-star resort overlooks the pristine ocean, where powdery white sands and the crystal-clear ocean are home to beautiful coral reefs, turtles and stingrays. Snorkel off the hotel's jetty, take a kayak out to sea or stretch it out with a nourishing yoga class.\n\nDiscover tranquillity and spend the afternoon pampering yourself at the onsite Taaras Spa, where treatments combine traditional techniques with modern wellness knowledge. Sample contemporary Italian dining at MareNero, a sophisticated beachside restaurant with an open-concept kitchen, or a sumptuous oceanfront meal at Beach Brasserie. For something a little more relaxed, head to Asean All Day Dining, where authentic Malaysian dishes sit beside international classics.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Terengganu",
    "offer_geo_area_level_2": "Redang Island",
    "location_heading": "Redang Island",
    "location_subheading": "Malaysia",
    "location_description": "The Taaras Beach and Spa Resort",
    "offer_address": "Redang Island, 20928 Kuala Terengganu, Malaysia",
    "percentage_discount": 70.0,
    "min_duration": 3,
    "max_duration": 15,
    "price": 599.0,
    "value": 2030.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005KA04AAG",
    "hero_image": "https://images.luxuryescapes.com/ch8hb3iug2pr70yolqbv",
    "image_two": "https://images.luxuryescapes.com/gxfg0tunfo46nza3pg9",
    "image_three": "https://images.luxuryescapes.com/455nevje78ry4t2bod",
    "vendor_name": "The Taaras Beach & Spa Resort",
    "title": "Five-Star Beachfront Malaysia Island Suites with All-Inclusive Dining & Snorkelling Adventure",
    "description": "Discover the pinnacle of tropical paradise with a relaxing beachfront escape at The Taaras Beach & Spa Resort, where barefoot luxury awaits. Perched on Redang Island off the east coast of Malaysia, this five-star resort overlooks the pristine South China Sea, where powdery white sands and crystal-clear ocean are home to beautiful coral reefs and marine life including sea turtles and stingrays.\n\nOffering the utmost in luxury and seclusion, The Taaras Beach & Spa Resort is home to 125 stylish suites and rooms, with sweeping views of perfectly placed palm trees and the ocean below. While leaving your sumptuous sanctuary is optional, there’s more to explore. Discover true tranquillity at Taaras Spa, where treatments combine traditional techniques with modern wellness knowledge. Sample contemporary dining at Beach Brasserie, a sophisticated beachside restaurant that celebrates high-quality ingredients and global influences, or opt for something a little more relaxed at Asean All Day Dining, where authentic Malaysian dishes sit beside international classics. As the evening continues, unwind at either the Asean Terrace Lounge or Bayu Bar, perfect for soaking up the sights and sounds of the ocean.\n\n**Your handpicked inclusions:**\n\n- Feast on delicious daily buffet breakfast, lunch and dinner served by the pool at Asean All Day Dining\n- Enjoy a once-in-a-lifetime turtle discovery snorkelling experience\n- Raise a glass to your glamorous escape with a delicious cocktail each on arrival\n- Start your escape feeling fresh with a welcome hygiene pack on arrival\n- Take more than memories home with a complimentary T-shirt, beach hat and beach bag to keep\n\n**Travelling with family or friends?** Upgrade to the Two-Bedroom Hillview Deluxe with one king bed and twin single beds, valid for up to four guests.\n\n**Book with 100% Confidence:** Right up until 14 days before check-in you can enjoy unlimited, free date changes, or cancel and get a 100% credit to use at Luxury Escapes for any other Limited Time Lux Exclusive accommodation, tour or cruise offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Terengganu",
    "offer_geo_area_level_2": "Redang Island",
    "location_heading": "Redang Island",
    "location_subheading": "Malaysia",
    "location_description": "The Taaras Beach and Spa Resort",
    "offer_address": "Redang Island, 20928 Kuala Terengganu, Malaysia",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 929.0,
    "value": 1872.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UQWAAA4",
    "hero_image": "https://images.luxuryescapes.com/52uzltve2swi5tu72tdk",
    "image_two": "https://images.luxuryescapes.com/a7faqqh0tm75985g99sh",
    "image_three": "https://images.luxuryescapes.com/pq293qd04eiohv03up9h",
    "vendor_name": "The Taaras Beach & Spa Resort",
    "title": "Five-Star Tropical Malaysia Island Escape",
    "description": "Discover the pinnacle of tropical paradise with an escape at The Taaras Beach & Spa Resort. Perched on the largest island in the Redang archipelago, the luxury lodging sits on the pristine South China Sea, where powdery white sand and crystal-clear ocean give way to some of the region’s most colourful coral reefs and marine life. Aspiring mermaids and mermen will find wonderlands to explore under the surface thanks to the onsite PADI dive centre - but with so much to discover at the resort, landlubbers won’t be disappointed.\n\nSpend hours on the white sand of the private beach, lazily lap the palm-tree-lined infinity pool or watch others splash about while you make your way through the menu at poolside Asean restaurant. When the sun starts to move west, venture to the beachfront for a cocktail or two at Baya Bar or stay by the pool to quench your thirst at Asean Terrace Lounge, where a carefully crafted list of drinks awaits. Families will find something to entertain both little and big kids: a bevvy of watersports can be organised by the onsite centre, while a children’s paddling pool means everyone can spend hours splashing about. When it’s time for some adults-only serenity, drop the kids off at JoJo playroom, where they’ll be entertained by trained staff, before hot-footing it to Taaras Spa for a rejuvenating treatment.",
    "offer_country_name": "Malaysia",
    "offer_country_code_alpha_2": "MY",
    "offer_geo_area_level_1": "Terengganu",
    "offer_geo_area_level_2": "Redang Island",
    "location_heading": "Redang Island",
    "location_subheading": "Malaysia",
    "location_description": "The Taaras Beach and Spa Resort",
    "offer_address": "Redang Island, 20928 Kuala Terengganu, Malaysia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 565.0,
    "value": 565.0
  }
]