[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4vlUQAR",
    "hero_image": "https://images.luxuryescapes.com/m9zxmr3wkococikssuap",
    "image_two": "https://images.luxuryescapes.com/qytndcmpe6qdqe8p50wi",
    "image_three": "https://images.luxuryescapes.com/wjdqxuniejugmryjrrlq",
    "vendor_name": "Exeter Hotel",
    "title": "Harbourside Designer Stay with Daily Breakfast in Europe’s Northernmost Capital",
    "description": "The colorful buildings, eye popping design and spectacular natural wonders of Iceland are calling: answer in style, staying at the Exeter Hotel - an industrial chic hotel located near Reykjavik’s old harbour. Discover Iceland’s dramatic landscapes while enjoying a complimentary upgrade to a Superior Room, daily breakfast and access to the sauna and fitness centre.",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Capital Region",
    "offer_geo_area_level_2": "Reykjavik",
    "location_heading": "Reykjavik",
    "location_subheading": "Iceland",
    "location_description": "Exeter Hotel",
    "offer_address": "Tryggvagata 12  Reykjavik, Iceland 101",
    "percentage_discount": 42.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 576.0,
    "value": 996.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000R8CyaQAF",
    "hero_image": "https://images.luxuryescapes.com/hjjid7tmvgni1xrfyhrk",
    "image_two": "https://images.luxuryescapes.com/f7nlwwret23hiwm1x7zz",
    "image_three": "https://images.luxuryescapes.com/f6azj5kwbjsgxu7sfx8y",
    "vendor_name": "Swan House",
    "title": "Designer Apartment Stay in the Heart of Europe's Trendiest City",
    "description": "Discover the hidden charms of the world’s northernmost capital, Reykjavik, spending three nights in a Chic Studio at the trendy Swan House apartment hotel, located right in the heart of the city. Enjoy a delicious daily breakfast basket filled with all the goods, before you head out to explore Iceland’s dramatic landscape made up of volcanoes, glaciers, geysers, hot springs and lava fields or go in search of the famed Northern Lights.",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Capital Region",
    "offer_geo_area_level_2": "Reykjavik",
    "location_heading": "Reykjavik",
    "location_subheading": "Iceland",
    "location_description": "Swan House",
    "offer_address": "Vatnsstígur 11, 101 Reykjavík, Iceland",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 433.0,
    "value": 925.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y32u4QAB",
    "hero_image": "https://images.luxuryescapes.com/ppjwpa6lkeeepjnqwlo8",
    "image_two": "https://images.luxuryescapes.com/morccwb6yf4880olo6je",
    "image_three": "https://images.luxuryescapes.com/n42c5hhsr3zqkakoj3yr",
    "vendor_name": "Center Hotel Arnharhvoll",
    "title": "Tick Iceland of Your Bucket List and Discover the Happiest Country in the World",
    "description": "Visit one of Europe’s hottest destinations and uncover the hidden charms of the world’s northernmost capital city, Reykjavik. Explore Iceland’s dramatic landscape made up of volcanoes, glaciers, geysers, hot springs and lava fields or go in search of the famed Northern Lights with a three, five or seven-night stay at CenterHotel Arnharhvoll on Iceland’s coast. Enjoy daily buffet breakfast and daily access to the hotel’s wellness area including use of the hot tub and sauna.",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Capital Region",
    "offer_geo_area_level_2": "Reykjavik",
    "location_heading": "Reykjavik",
    "location_subheading": "Iceland",
    "location_description": "Centerhotel Arnarhvoll",
    "offer_address": "Ingólfsstræti 1, 101 Reykjavík, Iceland",
    "percentage_discount": 29.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 582.0,
    "value": 816.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UvfJjQAJ",
    "hero_image": "https://images.luxuryescapes.com/m5o2v50r1nml2inhnwur",
    "image_two": "https://images.luxuryescapes.com/dqkutqqim1re7uo8fkly",
    "image_three": "https://images.luxuryescapes.com/axpp49twpjdgiqow6tcm",
    "vendor_name": "CenterHotel Midgardur",
    "title": "Discover One of Europe’s Hottest Destinations, Iceland",
    "description": "Visit one of the happiest countries on earth and discover the hidden charms of the world’s northernmost capital, Reykjavik. Explore Iceland’s dramatic landscape made up of volcanoes, glaciers, geysers, hot springs and lava fields or go in search of the famed Northern Lights. Spend three nights at the CenterHotel Midgardur with daily breakfasts and a three-course chef’s choice dinner featuring Nordic fusion cuisine.",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Capital Region",
    "offer_geo_area_level_2": "Reykjavik",
    "location_heading": "Reykjavik",
    "location_subheading": "Iceland",
    "location_description": "CenterHotel Midgardur",
    "offer_address": "Laugavegur 120, 101 Reykjavík, Iceland",
    "percentage_discount": 59.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 627.0,
    "value": 1516.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Ux1YAAS",
    "hero_image": "https://images.luxuryescapes.com/bb00xdc1bfslzfh73otr",
    "image_two": "https://images.luxuryescapes.com/jrz51hs0rwc4j121gyxb",
    "image_three": "https://images.luxuryescapes.com/yw7g9i0n7j3cxg3slf3",
    "vendor_name": "Skuggi Hotel",
    "title": "Stylish Designer Escape in the Heart of Reykjavik with Daily Breakfast",
    "description": "Find new levels of Icelandic inspiration with a stay at the contemporary-cool Skuggi Hotel by Keahotels. Sitting on one of Reykjavik’s oldest streets, Hverfisgata, this boutique lodging is steps from the city's first food hall and just a short wander from the restaurants, boutiques, shops and cafés of Laugavegur, Reykjavik’s main shopping street. Lovely landmarks, like the famous Hallgrímskirkja church, are just a 10-minute stroll away.\n\nStyle and substance are served in equal measure at Skuggi Hotel, with sultry shades of grey paired with comfortably chic furnishings and prints of black-and-white photos by famous Icelandic photographer Ragnar Axelsson. If you can pull your eyes from the striking art, make sure you speak to the reception team - they are on hand to share recommendations and organise tours or car hire, so you can explore Iceland in style.",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Capital Region",
    "offer_geo_area_level_2": "Reykjavik",
    "location_heading": "Reykjavik",
    "location_subheading": "Iceland",
    "location_description": "Skuggi Hotel by Keahotels",
    "offer_address": "Hverfisgata 103, 101 Reykjavík, Iceland",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UwIcAAK",
    "hero_image": "https://images.luxuryescapes.com/strj5qhf3mllg6xlba",
    "image_two": "https://images.luxuryescapes.com/6qeijk1ms4nj1k7knvp",
    "image_three": "https://images.luxuryescapes.com/2hpux2svmi6ffwac3a7",
    "vendor_name": "Apotek Hotel",
    "title": "Stylish Heritage Break in the Centre of Reykjavik",
    "description": "Book a front-row seat to Reykjavik’s action with a stay at the intimate Apotek Hotel by Keahotels, rated among the top 10% worldwide on Tripadvisor. Sitting in the middle of Reykjavik’s buzzing shopping, entertainment and cultural centre, the boutique hotel is within walking distance of a symphony of sights, including Tjornin Lake and Hallgrimskirkja church, as well as sensational boutiques and lively restaurants and bars.\n\nApotek Hotel by Keahotels' foundation was built in 1917 and designed by Iceland’s former State Architect Guðjón Samúelsson, who was also responsible for the National Theatre building and Hallgrímskirkja. It housed the Reykjavik Apothecary (Reykjavíkurapotek) from 1930 to 1999 but has now been lovingly restored, balancing original Art Nouveau features with all the modern amenities you’d expect of a luxury hotel. All 45 rooms and suites are fitted with neutral tones and feature views of the surrounding cityscape - the perfect antidote after busy days exploring what Reykjavik has to offer. The ground-floor restaurant will look after all your feasting needs, serving breakfast through to late-night bites with Icelandic and European flavours. Don’t forget to sample one of the pastries or desserts - they’re worth saving space for!\n\n**Luxury Escapes inclusions (select packages/nights)**\n\n- Enjoy every second of your Reykjavik stay with **a late checkout**, subject to availability (for stays of 2+ nights)\n- Feel like a VIP with an **upgrade to the next room category**, subject to availability (for stays of 4+ nights, excludes Tower Suite)\n\n**Tower Suite Upgrade**: Soak up panoramic views of Reykjavik from the three-storey Tower Suite. With generous living space and an expansive bathroom, it has all the room you need for a seamless stay.\n\n**Travelling with family?** One child aged 11 years and under stays free in existing bedding (excludes Single Rooms).",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Capital Region",
    "offer_geo_area_level_2": "Reykjavik",
    "location_heading": "Reykjavik",
    "location_subheading": "Iceland",
    "location_description": "Apotek Hotel by Keahotels",
    "offer_address": "Austurstraeti 16, 101 Reykjavik",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 22,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UwUkAAK",
    "hero_image": "https://images.luxuryescapes.com/hbng2lcz4nssy4hho6p",
    "image_two": "https://images.luxuryescapes.com/rwe27aeg20bn4d983d",
    "image_three": "https://images.luxuryescapes.com/geg72qtqnjhae0z3ctm9",
    "vendor_name": "Hotel Borg",
    "title": "Historic Art Deco Glamour in the Heart of Reykjavik",
    "description": "Explore the beating heart of Iceland with a stay at the historic Hotel Borg by Keahotels, Reykjavik’s very first luxury hotel. Overlooking the stunning Austurvöllur Square, just moments from the Icelandic Parliament House and city cathedral, this historic hotel balances serenity and sophistication, creating a bubble of peace and quiet in the action-packed centre. Explore the city’s best bits on foot - you’ll find remarkable restaurants, cultural phenomena and natural wonders within walking distance.\n\nOriginally built in 1930, Hotel Borg by Keahotels has been artfully restored to balance the original Art Deco glamour with modern facilities. In the foyer, chrome elevators, custom-made furnishings and patterned wallpaper set the opulent tone, which continues in the 99 rooms and suites, where armoires, parquet flooring and leather armchairs sit alongside Bang & Olufsen tech, Nespresso coffee machines and heated marble bathroom floors.\n\nWhile all these mod-cons may encourage staying in, Hotel Borg’s appeal lies in its location, so ask the reception staff for tips - they’ll be more than happy to recommend restaurants, transfers, tours and car hire options. Spend your days following their suggestions or build your own itinerary - with so many attractions nearby, there will be something to see around every corner. When you’re done for the day, return to Hotel Borg for a pampering session - the spa has relaxation areas, a steam bath, sauna and treatment rooms for facials, massages and more.\n\n**Luxury Escapes inclusions (select packages/nights)**\n\n- Enjoy every second of your Reykjavik stay with **a late checkout**, subject to availability (for stays of 2+ nights)\n- Feel like a VIP with an **upgrade to the next room category**, subject to availability (for stays of 4+ nights, excludes Tower Suite)\n\n**Tower Suite Upgrade**: Soak up panoramic views of Reykjavik from the second floor of the Tower Suite. With two storeys, separate living space and an expansive bathroom, it has all the room you need for a seamless stay.\n\n**Travelling with family?** One child aged 11 years and under stays free in existing bedding (excludes Single Rooms).",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Capital Region",
    "offer_geo_area_level_2": "Reykjavik",
    "location_heading": "Reykjavik",
    "location_subheading": "Iceland",
    "location_description": "Hotel Borg by Keahotels",
    "offer_address": "Pósthússtræti 11, 101 Reykjavík, Iceland",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 22,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Ux7qAAC",
    "hero_image": "https://images.luxuryescapes.com/4ihoz4akeb9uzn1ehc8",
    "image_two": "https://images.luxuryescapes.com/i6dvia6qykqitlph2ilk",
    "image_three": "https://images.luxuryescapes.com/o0oc0hnuariv4il0sm8",
    "vendor_name": "Storm Hotel",
    "title": "Stylish Designer Reykjavik Retreat with Daily Breakfast",
    "description": "Embrace the dramatic landscapes and diverse history of the world’s northernmost capital city with an escape to the Nordic-inspired Storm Hotel by Keahotels. Perched between Reykjavik’s business district and the beating heart of the city, bustling Laugavegur street, this boutique hotel is perfectly positioned for days of laidback café-hopping and culture-soaking, or adrenaline-laced adventures through Iceland’s southern waterfalls, national parks and geothermal areas.\n\nIf you’re not sure where to start with your Reykjavik exploration, turn to the friendly staff at Storm Hotel - they’ll happily share their recommendations and organise tours or car hire for you. After days spent discovering, retire to your comfortable Nordic-style room for what’s sure to be a good night’s sleep.\n\n**Luxury Escapes inclusions (select packages/nights):**\n\n- Dive into a diverse **daily** **breakfast buffet** of baked goods, cereal, eggs, pancakes and more\n- Settle in with **a late checkout**, subject to availability (for stays of 2+ nights)\n- **Upgrade to the next room category,** subject to availability (excludes Superior Rooms; for stays of 4+ nights)",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Capital Region",
    "offer_geo_area_level_2": "Reykjavik",
    "location_heading": "Reykjavik",
    "location_subheading": "Iceland",
    "location_description": "Storm Hotel by Keahotels",
    "offer_address": "4 Þórunnartún, 105 Reykjavík, Iceland",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Ux5GAAS",
    "hero_image": "https://images.luxuryescapes.com/fxyympv8bgqigo6raz",
    "image_two": "https://images.luxuryescapes.com/ij9ifg2k7tluz2r2s1xa",
    "image_three": "https://images.luxuryescapes.com/2d8foa391o8m1mpq97c",
    "vendor_name": "Reykjavik Lights",
    "title": "Contemporary Designer Reykjavik Retreat",
    "description": "Illuminate your Icelandic adventures with a stay at the enchanting Reykjavik Lights by Keahotels, a contemporary concept hotel on the edge of downtown Reykjavik. With the adventure-packed Laugardalur Valley on one side and the shops, restaurants and bars of Laugavegur high street on the other, it’s perched perfectly for diverse days of exploring. Enjoy a 30-minute wander through the city to find the iconic Hallgrímskirkja church, Reykjavik Harbour and galleries, or opt for the local buses - they depart right outside the hotel.\n\nAn elegantly minimalist design starts in the lobby and continues to every room at Reykjavik Lights, with references to the ancient Icelandic calendar on the bright walls. After dropping your bags off, venture back down to the reception for a chat with the friendly team - they’ll have the inside scoop on tours and sightseeing, as well as the best restaurants and bars to visit. Hire a hotel bicycle to see the best of the city on two wheels, or settle in for days spent at the nearby Laugardalur outdoor park, home to Iceland’s largest outdoor thermal pool area.\n\n**Luxury Escapes inclusions (select packages/nights)**\n\n- Start each morning with **daily continental breakfast**\n- Enjoy every second of your Icelandic adventure with **a** **late checkout**, subject to availability (for stays of 2+ nights)\n- Feel like a VIP with an **upgrade to the next available room category**, subject to availability (excludes Superior Double Rooms and Triple Rooms; for stays of 4+ nights)",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Capital Region",
    "offer_geo_area_level_2": "Reykjavik",
    "location_heading": "Reykjavik",
    "location_subheading": "Iceland",
    "location_description": "Reykjavik Lights by Keahotels",
    "offer_address": "Suðurlandsbraut 16, Suðurlandsbraut 16, 108 Reykjavík, Iceland",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Ux2qAAC",
    "hero_image": "https://images.luxuryescapes.com/lwxv2ctypm9hm4d67ke",
    "image_two": "https://images.luxuryescapes.com/x0rt5zjg0s7p90z1yb3k",
    "image_three": "https://images.luxuryescapes.com/15i8trdkemqlit1zyj0h",
    "vendor_name": "Sand Hotel",
    "title": "Historic Reykjavik Boutique Break with Daily Breakfast",
    "description": "Discover historic and hip Reykjavik with a stay at the contemporary Sand Hotel by Keahotels. This unique boutique escape neighbours three of the city's most famous historic buildings: Iceland’s oldest tailor, Verslun Guðsteins Eyjólfssonar; one of the city’s best bakeries, Sandholt; and the birthplace of Nobel-Prize-winning writer Halldór Laxness. All this history also happens to be perched on the city’s buzzing shopping strip, Laugavegur, surrounded by restaurants, cafés, boutiques and bars. Famous attractions, like the Hallgrímskirkja church, are also just a short wander away.\n\nThe hotel’s unique history is showcased with pride at Sand Hotel. In the lobby, a number of Laxness' books sit beside contemporary photographs and paintings by local artists. In the rooms and suites, headboards and pillows are upholstered with fabric from Verslun Guðsteins Eyjólfssonar, while freshly baked goods from Sandholt make up part of the hotel's satisfying breakfast spread. While leaving your bed’s embrace may seem impossible, the resolute will be rewarded - there are countless day trips to embark upon, and plenty of city highlights to discover.\n\n**Luxury Escapes inclusions (select packages/nights)**\n\n- Prepare for a busy day ahead with **daily breakfast**, including freshly baked treats from Sandholt\n- Savour every second of your Reykjavik adventure with **a late checkout**, subject to availability (for stays of 2+ nights)\n- Enjoy an **upgrade to the next room category**, subject to availability (excludes Family Rooms; for stays of 4+ nights)\n\n**Travelling with family?** Separate sleeping alcoves offer a little more privacy in the Family Room, complete with a king and queen bed. Packages valid for up to four guests.",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Capital Region",
    "offer_geo_area_level_2": "Reykjavik",
    "location_heading": "Reykjavik",
    "location_subheading": "Iceland",
    "location_description": "Sand Hotel by Keahotels",
    "offer_address": "Laugavegur 34, 101 Reykjavík, Iceland",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]