[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Icx8mAAB",
    "hero_image": "https://images.luxuryescapes.com/3y0855qsdgt6q6es5v7i",
    "image_two": "https://images.luxuryescapes.com/79aukq36vjm2p8rlkt",
    "image_three": "https://images.luxuryescapes.com/4vuf488djw4vvgicckf",
    "vendor_name": "Sheraton Rhodes Resort",
    "title": "Rhodes Oceanfront Marriott Luxury with Sea Views, Daily Breakfast & Nightly Dinner",
    "description": "Immerse yourself in the rich heritage of Greek opulence during your stay at this luxurious five-star haven, nestled on a private beach along the sun-kissed shores of Ixia Bay. Admire sweeping vistas of the glistening Aegean Sea or the lush hillsides from every angle of this idyllic retreat. Delight in the culinary mastery of Chef Nikos Zervos at L'Onda, sample delectable Greek delicacies - from saganaki prawns to galaktompoureko - at Thèa restaurant or unwind with refreshing cocktails among fragrant olive groves at Mediterraneo.\n\nTake a refreshing plunge into one of the resort's shimmering pools, perfect your backhand on the immaculate tennis courts or indulge in a blissful couples massage at The Σpa. Situated just a stone's throw away from the UNESCO-listed Rhodes Town, this resort provides convenient access to the island's historic landmarks, bustling markets and charming tavernas.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Sheraton Rhodes Resort",
    "offer_address": "Ialyssos Avenue, Rhodes 85100, Greece",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 729.0,
    "value": 1820.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000Y4IkKQAV",
    "hero_image": "https://images.luxuryescapes.com/ffugkite4iolmvbj5d5t",
    "image_two": "https://images.luxuryescapes.com/pafzjk5gpl74jwn4qy4b",
    "image_three": "https://images.luxuryescapes.com/lc6bvmpkmma6ooag3dws",
    "vendor_name": "All Senses Nautica Blue Exclusive Resort & Spa",
    "title": "All-Inclusive Greek Island Getaway with All Meals and Drinks Included",
    "description": "Escape on a Greek island getaway to Rhodes, where azure waters meet ancient ruins and little whitewashed villages. Stay in a prime beachfront location overlooking the Aegean Sea at All Senses Nautica Blue Exclusive Resort & Spa, a resort modelled on a traditional fishing village where all-inclusive indulgence awaits. Enjoy daily breakfast, lunch and dinner, snacks including ice creams and more, all drinks including cocktails, a relaxing 15-minute massage per person and savings on spa treatments and themed a la carte dining.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "All Senses Nautica Blue Exclusive Resort & Spa OLD*",
    "offer_address": "Fanes Rhodes Island, 851 00, Greece",
    "percentage_discount": 35.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 430.0,
    "value": 660.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000JlqkzYAB",
    "hero_image": "https://images.luxuryescapes.com/2xh0vorua3i46gn59tx",
    "image_two": "https://images.luxuryescapes.com/z2jugugm1cneo4rz1ldj",
    "image_three": "https://images.luxuryescapes.com/y73apqmpy9ix2qsvas1",
    "vendor_name": "Sheraton Rhodes Resort",
    "title": "Greece Oceanfront Opulence: Rhodes Island Escape with Sea Views, Daily Breakfast & Nightly Dinner",
    "description": "Embrace the rich heritage of Greek opulence with a stay at this luxurious five-star haven, nestled on a private beach along the sun-kissed shores of Ixia Bay. Admire sweeping vistas of the glistening Aegean Sea or the lush hillsides from every angle of this idyllic retreat.\n\nTake a refreshing plunge into one of the resort's shimmering pools, perfect your backhand on the immaculate tennis courts or indulge in a blissful couples massage at The Spa, all before refuelling at one of the delectable onsite restaurants.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Sheraton Rhodes Resort",
    "offer_address": "Ialyssos Avenue, Rhodes 85100, Greece",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 769.0,
    "value": 1535.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ic80HAAR",
    "hero_image": "https://images.luxuryescapes.com/r3qetl25hl899y5an239",
    "image_two": "https://images.luxuryescapes.com/5c5nsfk8gpvt1dk12bhh",
    "image_three": "https://images.luxuryescapes.com/i0usygyuudedc6p5gnh",
    "vendor_name": "Hotel Mediterranean, Rhodes",
    "title": "Beachfront Rhodes Retreat Near Old Town with Daily Breakfast & Nightly Dinner",
    "description": "The coastal allure and relaxed island lifestyle awaits along the sandy shores of Rhodes' Elli Beach. Inspired by the Mediterranean way of life, this chic five-star haven, located on the island's sun-drenched northern coast, is just steps from the sparkling waterfront - perfect for everything from romantic beach walks to thrilling watersports. Sample local Greek ouzo while indulging in delectable local dishes at Thalassa Restaurant, or sip a refreshing cocktail at the trendy Mediterranean Cafe while watching the sunset over the Aegean Sea.\n\nHistory buffs are well-placed to explore the island's vibrant Old Town, a destination in its own right, loved for its rich medieval history and architecture. Continue the exploration with a short walk to the likes of Rhodes Aquarium, the Palace of the Grand Master, and the bustling Mandraki Harbour before returning for a quick dip in the hotel's shimmering pool.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Hotel Mediterranean",
    "offer_address": "35-37 Kos Street, Rhodes Town, 851 00, Greece",
    "percentage_discount": 64.0,
    "min_duration": 5,
    "max_duration": 29,
    "price": 479.0,
    "value": 1336.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000G6tFEYAZ",
    "hero_image": "https://images.luxuryescapes.com/aoctqzyfydi1u4j555k",
    "image_two": "https://images.luxuryescapes.com/xtvwd4wmdhssawgcf7g",
    "image_three": "https://images.luxuryescapes.com/8n3elwng8zvpxxx6h8b",
    "vendor_name": "Lindian Village All Inclusive Resort Rhodes , Curio Collection by Hilton",
    "title": "All-Inclusive Greek Island Indulgence with Unlimited Dining & Daily Free-Flow Drinks",
    "description": "Discover laidback luxury among the ancient ruins of Rhodes at this boho-chic haven, part of the esteemed Curio Collection by Hilton. Here, zen-inspired waterways, secluded gardens and design-led minimalism offer a Mediterranean escape that lingers in the senses.\n\nAfter days spent splashing in balmy waters, lazing on the resort’s private beach or exploring the island's gems, return to Japanese plates at Niku, fine wines and seasonal bites at Alas Ouzeri and soul-soothing treatments at Calli Spa. With your all-inclusive package, you can also enjoy unlimited gelato, snacks and kids' club access for your little one in tow.\n\nOutside of the hotel, Rhodes' ancient history is yours to explore - discover remnants of the Crusaders unearthed in the Old Town, from the Palace of the Grand Master of the Knights of Rhodes to the medieval Street of the Knights. Dive into Greek heritage at the Archeological Museum, wander the grounds of Lindos Castle and visit the spectacular Valley of the Butterflies.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Lindian Village All Inclusive Resort Rhodes, Curio Collection by Hilton",
    "offer_address": "Lardos Beach 85 109 Rhodes, Greece",
    "percentage_discount": 43.0,
    "min_duration": 3,
    "max_duration": 26,
    "price": 1199.0,
    "value": 2095.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Gxn8pAAB",
    "hero_image": "https://images.luxuryescapes.com/wc4qs8vtxigd3ccw7yc",
    "image_two": "https://images.luxuryescapes.com/603pea8zthr5r0myvj2",
    "image_three": "https://images.luxuryescapes.com/cw1bk9l1qia33l3psuo",
    "vendor_name": "Elissa Lifestyle Resort - Rhodes",
    "title": "Adults-Only Rhodes Beachfront Luxury with Daily Breakfast, Nightly Dinner & Spa Credit",
    "description": "A world of Mediterranean-style five-star luxury awaits at Elissa Adults-Only Lifestyle Beach Resort, a haven of tranquillity in the north-east of the Dodecanese Islands. Overlooking the pristine Aegean Sea, this chic coastal retreat is situated just steps from the mesmerising foreshore and a short drive from Rhodes' buzzing city centre and iconic Old Town. From the sensational buffet spreads at Fanes Restaurant to the poolside Rodini Bar, where cocktails are served with a smile, explore the resort's collection of five inventive restaurants and four sophisticated bars, designed to satisfy every craving.\n\nRelax as you please with access to the resort's natural sanctuary - Ella Wellness & Spa - which promotes traditional Greek resorative practices, a collection of sparkling pools and a pair of tennis courts, perfect for practicing your serve.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Elissa Adults-Only Lifestyle Beach Resort",
    "offer_address": "Epar.Od, Koskinou, Rhodes, 851 00, Greece",
    "percentage_discount": 63.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 569.0,
    "value": 1550.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000FmnYsYAJ",
    "hero_image": "https://images.luxuryescapes.com/3cgteknnahsmmgd1eqe3",
    "image_two": "https://images.luxuryescapes.com/tjk6uonyuafj6nnf8tim",
    "image_three": "https://images.luxuryescapes.com/je0zcob35miy4lxeik1o",
    "vendor_name": "Sheraton Rhodes Resort",
    "title": "Rhodes Oceanfront Luxury with Guaranteed Sea Views, Daily Breakfast & Nightly Dinner",
    "description": "Embrace the rich heritage of Greek opulence with a stay at this luxurious five-star haven, nestled on a private beach along the sun-kissed shores of Ixia Bay. Admire sweeping vistas of the glistening Aegean Sea or the lush hillsides from every angle of this idyllic retreat.\n\nDelight in the culinary mastery of our chefs at L'Onda, sample delectable Greek delicacies - from saganaki prawns to galaktompoureko - at Thèa restaurant or unwind with refreshing cocktails among fragrant olive groves at Mediterraneo.\n\nTake a refreshing plunge into one of the resort's shimmering pools, perfect your backhand on the immaculate tennis courts or indulge in a blissful couples massage at The Spa.\n\nSituated just a stone's throw away from the UNESCO World Heritage-listed Rhodes Town, this resort provides convenient access to the island's historic landmarks, bustling markets and charming tavernas.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Sheraton Rhodes Resort",
    "offer_address": "Ialyssos Avenue, Rhodes 85100, Greece",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 839.0,
    "value": 1785.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Fj8qCAAR",
    "hero_image": "https://images.luxuryescapes.com/lfrjcoavsax8p34u9b4c",
    "image_two": "https://images.luxuryescapes.com/0itd5w9u3ekxg3j4qeg",
    "image_three": "https://images.luxuryescapes.com/8lf02f47o4em0y3im06d",
    "vendor_name": "Lindian Village All Inclusive Resort Rhodes , Curio Collection by Hilton",
    "title": "Rhodes Five-Star Curio Collection by Hilton Glamour with Daily Breakfast, Nightly Dinner & Nightly Cocktails",
    "description": "Discover laidback luxury among the ancient ruins of Rhodes at the five-star Lindian Village Rhodes Beach Resort - Curio Collection by Hilton. Here, zen-inspired waterways, secluded gardens and design-led minimalism offer a Mediterranean escape that lingers in the senses. After days spent splashing in balmy waters, lazing on the resort’s shimmering private beachfront or exploring Rhodes' famed Valley of the Butterflies, return to Japanese plates at Niku Nikkei, fine Greek wines and seasonal bites at Alas Ouzeri and soul-soothing wellness treatments at Calli Spa.\n\nOutside of the hotel, Rhodes' ancient history is yours to explore - discover remnants of the Crusaders unearthed in the Old Town, from the Palace of the Grand Master of the Knights of Rhodes to the medieval Street of the Knights, and bask in Greek heritage at the Archeological Museum.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Lindian Village All Inclusive Resort Rhodes, Curio Collection by Hilton",
    "offer_address": "Lardos Beach 85 109 Rhodes, Greece",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 719.0,
    "value": 1415.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Huec5YAB",
    "hero_image": "https://images.luxuryescapes.com/a57fd62kpmfpowvv2mys",
    "image_two": "https://images.luxuryescapes.com/29jdtklkhxda369ru75",
    "image_three": "https://images.luxuryescapes.com/mybf15fzkq5i5f99c0i",
    "vendor_name": "Gennadi Grand Resort",
    "title": "Idyllic Greek Island Private Beach Retreat with Daily Breakfast & Nightly Dinner",
    "description": "This beachfront Mediterranean treasure ticks all the boxes for a dreamy Greek island escape, offering everything along the unspoiled Gennadi Beach. Claim a spot along the beachfront or enjoy lazing poolside on an overwater sunbed, cocktail in hand. Taste your way through the resort’s eight restaurants and four bars, offering everything from buffet indulgence at Filoxenia Main Restaurant to fine dining Greek degustation at Eδesma.\n\nTake some time to relax at Kozeen Spas, treating yourself to a healing massage, hydrotherapy jacuzzi session or tailored facial treatment. Get your heart pumping with a game of tennis or beach volleyball (complimentary during daylight hours), unwind with yoga or water aerobics or hire a mountain bike to explore nearby cliffs and trails (additional charges apply).",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Gennadi Grand Resort",
    "offer_address": "Rhodes Dodecanese, Gennadi, Rhodes 85109, Greece",
    "percentage_discount": 72.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 729.0,
    "value": 2575.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DlZPSYA3",
    "hero_image": "https://images.luxuryescapes.com/f5fwr2ujdh6mbvpv7y",
    "image_two": "https://images.luxuryescapes.com/efhxbuj9y7llaerrfyx9",
    "image_three": "https://images.luxuryescapes.com/h1aj5k4c7kbdqflurl8",
    "vendor_name": "Gennadi Grand Resort",
    "title": "Greek Island Idyllic Rhodes Retreat on Private Beach with Daily Breakfast & Nightly Dinner",
    "description": "This beachfront Mediterranean treasure ticks all the boxes for a dreamy Greek island escape, offering everything from a private beach to an abundance of dining options. Situated just off the southeastern coast of Rhodes, Gennadi Grand Resort is set within perfectly manicured gardens and right along the unspoiled Gennadi Beach.\n\nClaim a spot along the beachfront or enjoy lazing poolside on an overwater sunbed, cocktail in hand. Taste your way through the resort’s eight restaurants and four bars, offering everything from buffet indulgence at Filoxenia to a fine dining Greek degustation at Eδesma.\n\nTake some time to relax at Kozeen Spas, treating yourself to a healing massage, hydrotherapy jacuzzi session or tailored facial treatments. Get your heart pumping with a game of tennis or beach volleyball (complimentary during daylight hours), unwind with yoga or water aerobics or hire a mountain bike (additional charges apply) to explore nearby cliffs and trails.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Gennadi Grand Resort",
    "offer_address": "Rhodes Dodecanese, Gennadi, Rhodes 85109, Greece",
    "percentage_discount": 75.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 599.0,
    "value": 2375.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DfEToAAN",
    "hero_image": "https://images.luxuryescapes.com/ikymvwk43of2ejzt88i",
    "image_two": "https://images.luxuryescapes.com/563g6klxqnfzmx6cc7",
    "image_three": "https://images.luxuryescapes.com/r4670nhbca6wrothm7t",
    "vendor_name": "LuxMe Dama Dama Rhodes",
    "title": "All-Inclusive Rhodes Greek Island Escape with Private Beach Access, Guaranteed Sea View Upgrade, Free-Flow Drinks & Massages",
    "description": "Between ancient sun-kissed marble, shadowed deer-filled forests and the shining Aegean Sea stands GRECOTEL LUX ME DAMA DAMA, RHODES, the ultimate family-friendly, all-inclusive Greek island escape. Positioned on the golden sands of Faliraki Beach, there’s no better place to experience the island’s countless charms - whether it’s explorations through antiquity at the Acropolis of Lindos, world-class diving in Kallithea or the Rhodes Town’s electrifying nightlife. Return to unrestricted dining across five world-class venues, lazy moments by the resort’s three dazzling pools or glorious afternoons on its exquisite stretch of private shoreline.\n\nIt may be hard to tear yourself away from this relaxing resort: GRECOTEL LUX ME DAMA DAMA, RHODES' all-inclusive concept includes an extraordinary array of activities, including live music, world-class spa and wellness facilities, a fun-filled kids’ club, and a designated adults-only beach zone.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Grecotel LUXME Dama Dama",
    "offer_address": "Kallithea, Rhodes 851 00, Greece",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 15,
    "price": 792.0,
    "value": 1765.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdmiYAAR",
    "hero_image": "https://images.luxuryescapes.com/d50qeaedzj88wsott3aq",
    "image_two": "https://images.luxuryescapes.com/7uqlz96gyu9fjr3hdf",
    "image_three": "https://images.luxuryescapes.com/h6yvxrfigis7hxtbt8u4",
    "vendor_name": "Gennadi Grand Resort",
    "title": "Idyllic Rhodes Retreat with Private Beach, Daily Breakfast & Nightly Dinner",
    "description": "This luxurious Mediterranean resort ticks all the boxes for a dreamy Greek island escape, with everything from a pristine private beach to an abundance of dining options. Situated just off the stunning south-eastern coast of Rhodes, between the picturesque village of Lindos and the striking Prasonisi peninsula, this idyllic retreat is set along the unspoiled Gennadi Beach. \n\nClaim a tranquil spot along the beachfront, dipping in and out of the Aegean Sea as you please. Closer to your modern accommodation, enjoy lazing poolside on an overwater sunbed, cocktail in hand, or taste test your way through the resort's eight restaurants and four bars, specialising in everything from casual bites and fresh buffet dining at Filoxenia Main Restaurant to fine dining Greek degustation at Eδesma.\n\nTake some time to utterly relax at the resort's spa, operated by Kozeen Spas, treating yourself to a healing massage, a hydrotherapy jacuzzi session or select from various tailored face and body treatments. Between walks along the beachfront and cocktails poolside, get your heart pumping with a game of tennis or beach volleyball, join a yoga or water aerobics class or rent a mountain bike (additional charges may apply) and explore the nearby picture-perfect cliffs and trails.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Gennadi Grand Resort",
    "offer_address": "Rhodes Dodecanese, Gennadi, Rhodes 85109, Greece",
    "percentage_discount": 75.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 549.0,
    "value": 2175.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bfZ5uQAE",
    "hero_image": "https://images.luxuryescapes.com/k4xjmsh0og7aciwer45r",
    "image_two": "https://images.luxuryescapes.com/f86h78zztin0ainfgkji",
    "image_three": "https://images.luxuryescapes.com/tqk2cqf9ja3yet3by5bg",
    "vendor_name": "All Senses Nautica Blue Exclusive Resort & Spa",
    "title": "All-Inclusive Greek Island Escape",
    "description": "Escape on a Greek island getaway to Rhodes, where azure waters meet ancient ruins and little whitewashed villages. Stay in a prime beachfront location overlooking the Aegean Sea at All Senses Nautica Blue Exclusive Resort & Spa, a resort modelled on a traditional fishing village where all-inclusive indulgence awaits. Enjoy daily breakfast, lunch and dinner, snacks including ice creams and more, all drinks including cocktails, a relaxing 15-minute massage per person and savings on spa treatments and themed a la carte dining. Plus, all government taxes are included in the package.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "All Senses Nautica Blue Exclusive Resort & Spa",
    "offer_address": "Fanes Rhodes Island, 851 00, Greece",
    "percentage_discount": 57.0,
    "min_duration": 4,
    "max_duration": 7,
    "price": 443.0,
    "value": 1036.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvmBpAAJ",
    "hero_image": "https://images.luxuryescapes.com/8u2hlgbqaar5tbu2kvp",
    "image_two": "https://images.luxuryescapes.com/w6g8trf62d2iypf2psf8",
    "image_three": "https://images.luxuryescapes.com/szmbypz3y815t74trbn4",
    "vendor_name": "LuxMe Dama Dama Rhodes",
    "title": "All-Inclusive Rhodes Greek Island Escape with Private Beach Access, Guaranteed Sea View Upgrade, Free-Flow Drinks & Massages",
    "description": "Between ancient sun-kissed marble, shadowed deer-filled forests and the shining Aegean Sea stands Grecotel LUXME Dama Dama, the ultimate family-friendly, all-inclusive Greek island escape. Positioned on Faliraki Beach, there’s no better place to experience the island’s countless charms - whether it’s explorations through antiquity at the Acropolis of Lindos, world-class diving in Kallithea or the Rhodes Town’s electrifying nightlife. Return to unrestricted dining across five world-class venues, lazy moments by the resort’s three dazzling pools or glorious afternoons on its exquisite stretch of private shoreline.\n\nIt may be hard to tear yourself away from this relaxing resort: Grecotel LUXME Dama Dama's all-inclusive concept includes an extraordinary array of activities, including live music, world-class spa and wellness facilities, a fun-filled kids’ club, and a designated adults-only beach zone.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Grecotel LUXME Dama Dama",
    "offer_address": "Kallithea, Rhodes 851 00, Greece",
    "percentage_discount": 74.0,
    "min_duration": 5,
    "max_duration": 26,
    "price": 849.0,
    "value": 3285.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DOpBlAAL",
    "hero_image": "https://images.luxuryescapes.com/ur9ebertfavnpv4j6di",
    "image_two": "https://images.luxuryescapes.com/7adbfv9l88ph8fyf9dwh",
    "image_three": "https://images.luxuryescapes.com/ujmk18cei8b43defp1k6",
    "vendor_name": "Lindian Village All Inclusive Resort Rhodes , Curio Collection by Hilton",
    "title": "Newly Transformed Hilton Five-Star Rhodes Greek Island Glamour with Private Beach, Daily Dining & Nightly Cocktails",
    "description": "Discover new heights of laidback luxury among the golden beaches, olive groves and ancient ruins of Rhodes, with a five-star stay at the newly renovated Lindian Village Rhodes Beach Resort - Curio Collection by Hilton. Here, Zen-inspired waterways, secluded gardens and design-led minimalism offer a Mediterranean escape to linger in the senses. After days spent splashing in balmy waters, lazing on the resort’s shimmering private beachfront or exploring the Valley of the Butterflies, return to Nikkei-inspired plates at Niku Asian Restaurant, fine Greek wines and seasonal-focused bites at Alas Ouzeri or Calli Spa for soul-soothing wellness treatments surrounded by the island’s soaring beauty.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Lindian Village All Inclusive Resort Rhodes, Curio Collection by Hilton",
    "offer_address": "Lardos Beach 85 109 Rhodes, Greece",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 659.0,
    "value": 1655.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000COVlJYAX",
    "hero_image": "https://images.luxuryescapes.com/1dpcdjup9jz4ldm82jh",
    "image_two": "https://images.luxuryescapes.com/z1lyhe4pxjztm66gr1lt",
    "image_three": "https://images.luxuryescapes.com/26wur65sk5wqrq4cc",
    "vendor_name": "Caesars Gardens Hotel & Spa - Adults Only- Rhodes, Greece",
    "title": "Boutique Greek Island Adults-Only Retreat with Outdoor Pool & Onsite Spa",
    "description": "Seamlessly blending into Rhodes' natural landscape, this intimate, adults-only hotel is where Greek Island sophistication meets rustic charm. The crown jewel is the Magnolia Spa, featuring outdoor treatment pavillions amid ancient olive trees, while Tárate Restaurant serves traditional Greek cuisine using herbs and vegetables from the hotel's garden.\n\nBeyond the hotel's tranquil grounds, guests can explore Rhodes' immense southeastern coastline, with pristine beaches and hidden coves dotting the shoreline. Adventure seekers can discover ancient ruins perched dramatically on clifftops, while the nearby village of Lindos captivates with its maze of whitewashed alleyways, traditional tavernas and local craft boutiques.",
    "offer_country_name": "Greece",
    "offer_country_code_alpha_2": "GR",
    "offer_geo_area_level_1": "South Aegean",
    "offer_geo_area_level_2": "Rhodes",
    "location_heading": "Rhodes",
    "location_subheading": "Greece",
    "location_description": "Caesars Gardens Hotel & Spa",
    "offer_address": "Lindos, Rhodes 85107, Greece",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 270.0,
    "value": 270.0
  }
]