[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DNG8hAAH",
    "hero_image": "https://images.luxuryescapes.com/c9xvscjefylce19dk7i",
    "image_two": "https://images.luxuryescapes.com/v8tp5jkwzw2squipwjo",
    "image_three": "https://images.luxuryescapes.com/diuox1wya7hx5yy14l3",
    "vendor_name": "Prospect Country House",
    "title": "Award-Winning Wine Country Retreat near Hobart with Daily Breakfast & Wine Tasting",
    "description": "Follow the food and wine trail to the heart of Tasmania’s Coal River Valley region with a luxe stay at Prospect Country House, at the entrance of the historic Richmond village. Alongside a fascinating history dating back to 1830, the private manor is the perfect base for enjoying the culinary spoils of the region. The onsite garden and orchard are abundant, with fresh produce used in exquisite dishes, and the convict-built cellar is home to award-winning Tasmanian wines. Head out of the manor grounds and discover the award-winning Pooley Wines cellar door across the road, where you can admire panoramic views of the region’s vineyards and valleys during a wine tasting experience pulled from a collection of over 100 acclaimed wines.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Hobart",
    "location_heading": "Richmond",
    "location_subheading": "Tasmania",
    "location_description": "Prospect Country House",
    "offer_address": "1384 Richmond Rd, Richmond, Tasmania 7025",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 479.0,
    "value": 788.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000eKuX5QAK",
    "hero_image": "https://images.luxuryescapes.com/z6945moi3n3bwfyhwgn6",
    "image_two": "https://images.luxuryescapes.com/t24sxerf1tkhx69c4g",
    "image_three": "https://images.luxuryescapes.com/nd5oox2ppj6cbdyy6rr",
    "vendor_name": "Prospect Country House",
    "title": "Adults-Only Retreat in Tasmania's Coal River Valley Wine Region with Gourmet Dining",
    "description": "Only a stone’s throw from Hobart but a world away from the hustle and bustle of the city lies Prospect House, a timepiece of Australia’s colonial history featuring old-world charm and elegant country atmosphere only 25 minutes from Hobart. Here you will have easy access to picturesque Richmond Village, the Coal River Valley wine region and so much more. Be introduced to the fine local wine upon your arrival at this adults-only retreat, and enjoy the best Prospect House has to offer with a decadent three-course dinner, daily homemade breakfast, welcome drink on arrival, daily afternoon tea and so much more, including a complimentary tasting at the award-winning Pooley Wines.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Hobart",
    "location_heading": "Richmond",
    "location_subheading": "Tasmania",
    "location_description": "Prospect House NOV19",
    "offer_address": "1384 Richmond Rd, Richmond TAS 7025",
    "percentage_discount": 39.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 309.0,
    "value": 506.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000705SqAAI",
    "hero_image": "https://images.luxuryescapes.com/2hn1lfucig7mec9xme",
    "image_two": "https://images.luxuryescapes.com/szgo7qz1y8p57fucgoll",
    "image_three": "https://images.luxuryescapes.com/sn9kve1ev8by519xajp",
    "vendor_name": "Prospect Country House",
    "title": "Award-Winning Tasmania Country Retreat with Five-Course Degustation Dinner & Premium Wine Tasting",
    "description": "Follow the food and wine trail to the heart of Tasmania’s Coal River Valley region with a luxe stay at Prospect House Private Hotel. Ranked #1 of lodges in Richmond and earning a Tripadvisor Travellers’ Choice 2021 award, this elegant countryside manor is a breath of fresh air. Built in the 1830s at the entrance of the historic Richmond village, evidence of the manor’s heritage roots pop up throughout the property in the trick doorways, black-market brickwork, the cannonball in the front lounge, and the intriguing tale of Lady Elizabeth Buscombe’s missing jewels. Alongside a fascinating history, the private manor is the perfect base for enjoying the culinary spoils of the region. The onsite garden and orchard are abundant with fresh produce used by head chef Kurstin Berriman in her exquisite dishes, and the convict-built cellar is home to award-winning Tasmanian wines.\n\nHead out of the manor grounds and discover the award-winning Pooley Wines cellar door across the road where you can admire panoramic views of the region’s vineyards and valleys during a wine tasting experience. Venture further afield to wander thorugh the quaint village of Richmond, taste artisan cheeses at local fromageries, set off on your own winery tour, browse the antique stores in town and stroll over the iconic Richmond Bridge.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Hobart",
    "location_heading": "Richmond",
    "location_subheading": "Tasmania",
    "location_description": "Prospect House Private Hotel Jan 22",
    "offer_address": "1384 Richmond Rd, Richmond TAS 7025",
    "percentage_discount": null,
    "min_duration": 2,
    "max_duration": 5,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000biqz1QAA",
    "hero_image": "https://images.luxuryescapes.com/9kl0i8usu6z0oild0as",
    "image_two": "https://images.luxuryescapes.com/t06v4uhm0rpg983dcy39",
    "image_three": "https://images.luxuryescapes.com/n9rnle7h2bwywd3f0a",
    "vendor_name": "Prospect Country House",
    "title": "Adults-Only Country Retreat in the Heart of Tasmania’s Wine Region",
    "description": "Only a stone’s throw from Hobart but a world away from the hustle and bustle of the city lies Prospect House, a luxe hotel featuring old-world charm and elegant country atmosphere only 15-minutes drive from Hobart. Here you will have easy access to the picturesque Richmond Village, the Coal River Valley wine region and so much more. Or simply relax and unwind in your luxe hotel with a glass of local wine. Experience the best Tasmania has to offer with a decadent three-course dinner, daily homemade breakfast, welcome drink on arrival, daily afternoon tea and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Clarence City Council",
    "location_heading": "Richmond",
    "location_subheading": "Tasmania",
    "location_description": "Prospect House - June 2019",
    "offer_address": "1384 Richmond Rd, Richmond TAS 7025",
    "percentage_discount": 31.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 380.0,
    "value": 551.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DovAcAAJ",
    "hero_image": "https://images.luxuryescapes.com/jpw5gef0i9fytrzt5q2d",
    "image_two": "https://images.luxuryescapes.com/9fdbamelkec0w3bgttevv",
    "image_three": "https://images.luxuryescapes.com/42wgomr2xerd78sxmvvj",
    "vendor_name": "The Motley Hotel",
    "title": "Grand Opening: Richmond's Coolest New Hotel with Daily Breakfast, Nightly Drinks & Complimentary Minibar",
    "description": "Be one of the first to discover The Motley, Richmond’s charismatic new kid on the block, bursting with eclectic charm. This artfully curated boutique hotel rises from behind the heritage facade of two Federation-style terraces. The former headquarters of costumier Ms Mary Parker, the heritage-rich building is dripping with odes to its colourful origins, celebrating the spirit of artistry and craftsmanship where vibrant galleries extend from the lobby walls to the upbeat Ms Parker restaurant. Here, glorious Victorian produce is woven through every dish, patterned with diverse textures and flavours.\n\nBoasting an enviable location on Bridge Road, The Motley offers guests a gateway to the very best of Melbourne. Clink craft cocktails at world-class bars, savour a perfect espresso, and browse for boutique bargains along the vibrant strip. For sports enthusiasts, the roar of the MCG is just a short stroll away, and for art lovers, a short tram ride will whisk you to The LUME Melbourne, where captivating exhibitions await.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Melbourne",
    "location_heading": "Richmond",
    "location_subheading": "Victoria",
    "location_description": "The Motley",
    "offer_address": "205 Bridge Road, Richmond, Victoria 3121, Australia",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 274.0,
    "value": 433.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009EgI5AAK",
    "hero_image": "https://images.luxuryescapes.com/6mhanjcsx5ya8a29vhjk",
    "image_two": "https://images.luxuryescapes.com/7ex12xas6sm2wjlum4b8",
    "image_three": "https://images.luxuryescapes.com/sjmxyc8r21hwmxgkfxsu",
    "vendor_name": "Prospect Country House",
    "title": "Award-Winning Tasmania Wine Country Retreat near Hobart with Five-Course Degustation Dinner & Wine Tasting",
    "description": "Follow the food and wine trail to the heart of Tasmania’s Coal River Valley region with a luxe stay at Prospect House Private Hotel, at the entrance of the historic Richmond village. Earning a Tripadvisor Travellers’ Choice 2022 award, this elegant countryside manor is a breath of fresh air. Built in the 1830s, evidence of the manor’s heritage roots pop up throughout the property in the trick doorways, black-market brickwork, the cannonball in the front lounge and the intriguing tale of Lady Elizabeth Buscombe’s missing jewels. Alongside a fascinating history, the private manor is the perfect base for enjoying the culinary spoils of the region. The onsite garden and orchard are abundant, with fresh produce used by head chef Kurstin Berriman in her exquisite dishes, and the convict-built cellar is home to award-winning Tasmanian wines.\n\nHead out of the manor grounds and discover the award-winning Pooley Wines cellar door across the road, where you can admire panoramic views of the region’s vineyards and valleys during a wine tasting experience. Venture further afield to wander through the Georgian village of Richmond, taste artisan cheeses at local fromageries, set off on your own winery tour, browse the antique stores in town and stroll over the iconic Richmond Bridge.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Hobart",
    "location_heading": "Richmond",
    "location_subheading": "Tasmania",
    "location_description": "Prospect Country House",
    "offer_address": "1384 Richmond Rd, Richmond, Tasmania 7025",
    "percentage_discount": 31.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 617.0,
    "value": 893.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C20uvAAB",
    "hero_image": "https://images.luxuryescapes.com/xe8ah6jsayewltg66wq",
    "image_two": "https://images.luxuryescapes.com/4b5fa07bgfkb4s6vn5v",
    "image_three": "https://images.luxuryescapes.com/mlza278kaqb3oa7b21og",
    "vendor_name": "Prospect Country House",
    "title": "Award-Winning Adults-Only Country Retreat in the Heart of Tasmania’s Wine Region",
    "description": "Follow the food and wine trail to Tasmania’s Coal River Valley region with a luxe stay at Prospect House Private Hotel, at the entrance of the historic Richmond village. The heritage manor, built in the 1830s, remains true to its roots, with a cannonball in the front lounge and a convict-built wine cellar. An onsite garden and orchard supply fresh produce used in the manor's dining room, best paired with a glass from Pooley Wines, located just metres away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Hobart",
    "location_heading": "Richmond",
    "location_subheading": "Tasmania",
    "location_description": "Prospect Country House",
    "offer_address": "1384 Richmond Rd, Richmond, Tasmania 7025",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 14,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gRMlAAM",
    "hero_image": "https://images.luxuryescapes.com/3ngkuxf3bw6r72423j9j",
    "image_two": "",
    "image_three": "",
    "vendor_name": "Pacific Gateway Hotel",
    "title": "Pacific Gateway Hotel LPC- Preferred Hotels",
    "description": "Part of Preferred Hotel group and BC Tourism campaign (Vancouver). Please ASAP production.",
    "offer_country_name": "Canada",
    "offer_country_code_alpha_2": "CA",
    "offer_geo_area_level_1": "British Columbia",
    "offer_geo_area_level_2": "Richmond",
    "location_heading": "Richmond",
    "location_subheading": "British Columbia",
    "location_description": "Pacific Gateway Hotel",
    "offer_address": "3500 Cessna Drive Richmond, British Columbia V7B 1C7 Canada",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000AZyx0AAD",
    "hero_image": "https://images.luxuryescapes.com/y9i8kz1a1dkkt25y9bf",
    "image_two": "https://images.luxuryescapes.com/1yo5edt81vs7hwxd7qji",
    "image_three": "https://images.luxuryescapes.com/ds6qzpkt3maib3ihntcp",
    "vendor_name": "Prospect Country House",
    "title": "Award-Winning Tasmania Wine Country Retreat near Hobart",
    "description": "Follow the food and wine trail to Tasmania’s Coal River Valley region with a luxe stay at Prospect House Private Hotel, at the entrance of the historic Richmond village. Earning a Tripadvisor Travellers’ Choice 2022 award, the manor was built in the 1830s, and evidence of its heritage roots pops up throughout the property with a cannonball in the front lounge and a convict-built wine cellar. The onsite garden and orchard are abundant with fresh produce used in the manor's dining room.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Hobart",
    "location_heading": "Richmond",
    "location_subheading": "Tasmania",
    "location_description": "Prospect Country House",
    "offer_address": "1384 Richmond Rd, Richmond, Tasmania 7025",
    "percentage_discount": null,
    "min_duration": 2,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]