[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqZXHAA3",
    "hero_image": "https://images.luxuryescapes.com/0d81c8c5bcep3dhcfw",
    "image_two": "https://images.luxuryescapes.com/qbp8hawdv0x9sg7zvdu",
    "image_three": "https://images.luxuryescapes.com/1ug0k78o7ozf83sk9ns",
    "vendor_name": "Andaz Mayakoba Resort Riviera Maya",
    "title": "Five-Star Mexico Oceanfront Oasis within Prestigious Mayakoba Precinct with US$100 Food & Drinks Credit",
    "description": "Discover a secluded beachfront paradise at the Andaz Mayakoba Resort Riviera Maya surrounded by lush vegetation nestled in the private, gated Mayakoba complex in Playa del Carmen on the Mexican Caribbean coast. Enjoy luxurious rooms and suites with terraces, exquisite gastronomy, feet-in-the-sand activities, unforgettable local experiences and much more. Andaz Mayakoba has been consistently ranked among the top 10 resorts in Mexico in Conde Nast Traveler's Readers' Choice Awards. Stay and experience a Riviera Maya Paradise with five on-site restaurants showcasing a diverse range of cuisines, incorporating local flavours and international influences.\n\nWith one oceanfront pool featuring glistening views of the Caribbean Sea, and one lagoon-esque pool offering secluded intimacy, it's easy to spend days stretched out in a poolside cabana achieving a state of pure bliss, alongside a rejuvenating visit to the Naum Wellness & Spa. For those seeking adventure, a myriad of wellness activities, watersports and outdoor fun are on offer, including an 18-hole golf course. Whatever your vacation style, Andaz Mayakoba Resort provides an unforgettable retreat that celebrates the beauty of its surroundings and offers an unparalleled luxury experience.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Quintana Roo",
    "offer_geo_area_level_2": "Playa del Carmen",
    "location_heading": "Riviera Maya",
    "location_subheading": "Mexico",
    "location_description": "Andaz Mayakoba Resort Riviera Maya",
    "offer_address": "Carretera Federal, Carr. Cancun - Tulum Kilometre 298, 77710 Playa del Carmen, Quintana Roo, Mexico",
    "percentage_discount": 42.0,
    "min_duration": 4,
    "max_duration": 25,
    "price": 1341.0,
    "value": 2307.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GLKLAA4",
    "hero_image": "https://images.luxuryescapes.com/hhkmoj2gs2v1vfynf3n",
    "image_two": "https://images.luxuryescapes.com/bo49h3yi5mhky23qowqs",
    "image_three": "https://images.luxuryescapes.com/u53avwp78ngo1m6v6xj",
    "vendor_name": "Andaz Mayakoba Resort Riviera Maya",
    "title": "Cancun Five-Star Oceanfront Oasis with Five On-Site Restaurants",
    "description": "Discover a Mexican beachfront paradise in Cancun’s luxury Andaz Mayakoba Resort Riviera Maya, an oasis on a private beach overlooking the Caribbean Sea. This spectacular resort is beach lovers’ bliss, with aquamarine waters only steps from the modern luxuries of this five-star haven. Dive into the crystal-clear waters, stroll for hours along the powdery-white sand beaches, lounge poolside in a cabana and indulge in mouth-watering meals from any of the five onsite restaurants.",
    "offer_country_name": "Mexico",
    "offer_country_code_alpha_2": "MX",
    "offer_geo_area_level_1": "Quintana Roo",
    "offer_geo_area_level_2": "Playa del Carmen",
    "location_heading": "Riviera Maya",
    "location_subheading": "Mexico",
    "location_description": "Andaz Mayakoba Resort Riviera Maya",
    "offer_address": "Carretera Federal, Carr. Cancun - Tulum Kilometre 298, 77710 Playa del Carmen, Quintana Roo, Mexico",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1707.0,
    "value": 1707.0
  }
]