[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006CApdAAG",
    "hero_image": "https://images.luxuryescapes.com/i74iujpck8uf98bcbcf9",
    "image_two": "https://images.luxuryescapes.com/i24ctlw3im4lajws1v3",
    "image_three": "https://images.luxuryescapes.com/u8mlr573o7i65bdya8rp",
    "vendor_name": "L'Abode Accommodation",
    "title": "Grand Reopening: Tasmania Private Homestead Estate Overlooking Tamar River",
    "description": "Food, wine and nature sublime: discover it all with a stay at Pointe Rapide Estate - L'Abode Accommodation, a grand three-bedroom estate in Tasmania’s Tamar Valley. This heritage property was built in 1835 as one of the first homesteads established in Tasmania. It has recently undergone a complete refurbishment and, for the first time in the estate’s history, opened its doors to the public. Enjoy exclusive hire of the entire property and spend your days curled up by the fire in the cosy living room, cooking up a feast of local produce with friends in the fully equipped kitchen, and sitting out on the patio with a glass of wine. The 37-acre estate offers a variety of scenic walking trails, inviting you to pass lush botanical gardens, meander through the adjacent vineyard or trace the riverbank on foot.\n\nThe Tamar Valley is renowned worldwide for its wine, mouthwatering local cuisine and breathtaking natural landscapes. Hop in your car and explore the area at your own pace - discover more than 30 wineries, indulge in paddock-to-plate meals, head out on a bushwalk or enjoy a leisurely stroll across Gravelly Beach.\n\n**Your handpicked inclusions:**\n\n- Find a bottle of Tamar Valley wine waiting for you on arrival\n- Celebrate your escape with a welcome box of artisan chocolates\n\n**Travelling as a group?** Packages are available for four or six guests, so you can simply choose the one that suits you best (additional guests may stay for a surcharge, see Room Policies for details).\n\n**Half-Day Wine Tour Upgrade:** Take your escape to the next level when you upgrade to a Tamar Valley wine tour package. Spend five hours traversing the countryside, stopping at a handful of vineyards to enjoy cellar door tastings and meet the winemakers, before a gourmet lunch with a glass of wine each.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Rowella",
    "location_heading": "Rowella",
    "location_subheading": "Tasmania",
    "location_description": "Pointe Rapide Estate - L'Abode Accommodation",
    "offer_address": "57 West Bay Road, Rowella",
    "percentage_discount": 22.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 975.0,
    "value": 1254.0
  }
]