[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GwKxvAAF",
    "hero_image": "https://images.luxuryescapes.com/4aym1j4uj4i52wojsz",
    "image_two": "https://images.luxuryescapes.com/glm5t2o8lmy5an8mngr",
    "image_three": "https://images.luxuryescapes.com/lse2h4i1ju42cg2uni",
    "vendor_name": "Maha Hills Resort",
    "title": "Adults-Only Bali Wellness Retreat with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Spoilt with views of rice paddies in every room and waterfalls, jungle and ocean nearby - this adults-only wellness retreat is everything you could want from a northern Bali escape. Spend time in the serene surrounds of Sambangan practising yoga in the hilltop Shala, and heal from the inside out with farm-to-table fare at two eateries - with ingredients sourced locally from organic gardens. Holistic wellness is at the forefront of life at Maha Hills, with activities including healer-led meditation and traditional Balinese rituals offered daily, alongside indulgent spa treatments, fresh-fruit cocktails and a glistening infinity pool. When you feel like exploring, the sparkling Aling Aling waterfall and the island's untouched northern beaches are a short drive away.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Sukasada",
    "location_heading": "Sambangan",
    "location_subheading": "Bali",
    "location_description": "Maha Hills Resort",
    "offer_address": "Jalan Tiying Tali, Banjar Anyar 8, Sambangan, Kec. Sukasada, Kabupaten Buleleng, Bali 81161, Indonesia",
    "percentage_discount": 67.0,
    "min_duration": 2,
    "max_duration": 27,
    "price": 349.0,
    "value": 1070.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002It8XIAS",
    "hero_image": "https://images.luxuryescapes.com/6h9xggr8iquh3shsag1b",
    "image_two": "https://images.luxuryescapes.com/odqy0l4mrps73eed7z1",
    "image_three": "https://images.luxuryescapes.com/24ikdywo1ekpg5s6zey",
    "vendor_name": "Maha Hills Resort",
    "title": "Bali Hilltop Wellness Retreat near Lovina with Daily Breakfast, Nightly Dinner, Nightly Cocktails & Dolphin Tour",
    "description": "Savour views of rice paddies from every room and waterfalls, jungle and ocean nearby at this idyllic wellness retreat near Lovina. Your included dolphin spotting tour is the perfect introduction to the majestic marine life, black sands and villages of this idyllic Northern Bali destination.\n\nSpend time in the serene surroundings of Sambangan practising yoga in the hilltop Shala, and heal from the inside out with farm-to-table fare at two eateries - with ingredients sourced locally from organic gardens.\n\nHolistic wellness is at the forefront of life at Maha Hills, with activities including healer-led meditation and traditional Balinese rituals offered daily, alongside indulgent spa treatments, fresh-fruit cocktails and a glistening infinity pool.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Sukasada",
    "location_heading": "Sambangan",
    "location_subheading": "Bali",
    "location_description": "Maha Hills Resort",
    "offer_address": "Jalan Tiying Tali, Banjar Anyar 8, Sambangan, Kec. Sukasada, Kabupaten Buleleng, Bali 81161, Indonesia",
    "percentage_discount": 72.0,
    "min_duration": 4,
    "max_duration": 26,
    "price": 439.0,
    "value": 1541.0
  }
]