[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006Q0TyAAK",
    "hero_image": "https://images.luxuryescapes.com/f2g6io6aya76zjebrit",
    "image_two": "https://images.luxuryescapes.com/pq1ghgm904mxcxxdtm0qo",
    "image_three": "https://images.luxuryescapes.com/7q2vzvmt1achl5g0fky",
    "vendor_name": "Corinthia Palace Hotel & Spa",
    "title": "Five-Star 19th-Century Heritage Escape in the Heart of Malta Opposite San Anton Palace",
    "description": "Enter a world of tranquil, high-end opulence at the Corinthia Palace Hotel, Malta, a 19th-century oasis of calm where history meets five-star service.\n\nIdeally located in the heart of Malta, directly adjacent to the President’s San Anton Palace and its public gardens, the Corinthia Palace Hotel, Malta offers an ideal mix of polished elegance and modern comforts, while maintaining traditional Maltese hospitality and authentic Neoclassical style. Guests can sharpen their appetite with traditional flavours at the refined Villa Corinthia, or indulge in exotic, Far Eastern-inspired cuisine at Rickshaw. For something more casual, Josephine's is ideal for those looking for freshly brewed specialty coffee or plant-based delicacies. Once you've had your fill, sink into blissful repose at Athenaeum Spa, relax poolside with a drink in hand or work up a sweat in the gymnasium or on the tennis court. \n\nThen, hit the streets and learn of the ancient Corinthia legend as you create your own tale exploring this glorious archipelago. It's time to taste, discover and immerse yourself in the real magic of Malta.",
    "offer_country_name": "Malta",
    "offer_country_code_alpha_2": "MT",
    "offer_geo_area_level_1": "Central Region",
    "offer_geo_area_level_2": "Attard",
    "location_heading": "San Anton",
    "location_subheading": "Malta",
    "location_description": "Corinthia Palace Hotel, Malta",
    "offer_address": "De Paule Avenue, San Anton BZN 9023, Malta",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 230.0,
    "value": 230.0
  }
]