[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002I3liIAC",
    "hero_image": "https://images.luxuryescapes.com/xr95r1ewvrr0gnrzp5da",
    "image_two": "https://images.luxuryescapes.com/8d20hi4vclmv8k89g46",
    "image_three": "https://images.luxuryescapes.com/ru765y1gqqotf402v5eb",
    "vendor_name": "Silverwater Resort",
    "title": "Serene Coastal Victoria Escape near Phillip Island with Daily Breakfast & Two Heated Onsite Pools",
    "description": "Experience the very best of regional Victoria at this serene stay just minutes from iconic Phillip Island with panoramic views over San Remo and the Bass Coast. The resort boasts a range of accommodation options - from stylish resort rooms to self-contained one-, two- and three-bedroom apartments with private terraces or balconies.\n\nIndulge in gourmet meals at Watermark Restaurant which offers stunning views through floor-to-ceiling windows, or sophisticated drinks at the onsite Lounge Bar. Unwind by one of two heated onsite pools, or opt for the spa pool or steam room while the kids are kept busy with the onsite jumping pillows, games room and playground.\n\nFrom the resort, you're perfectly placed to explore the Bass Coast. A short drive takes you to Phillip Island Wildlife Park, where you can spot sleepy koalas napping in the eucalyptus trees or hand feed the kangaroos and wallabies. Don't miss the Penguin Parade at dusk and witness hundreds of penguins making their way ashore.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "San Remo",
    "location_heading": "San Remo",
    "location_subheading": "Victoria",
    "location_description": "Silverwater Resort",
    "offer_address": "17 Potters Hill Road, San Remo, Victoria 3925, Australia",
    "percentage_discount": 60.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 219.0,
    "value": 551.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EdJMmAAN",
    "hero_image": "https://images.luxuryescapes.com/dsmqqhx8ka2tun8dva7",
    "image_two": "https://images.luxuryescapes.com/ycbnnzngqqbip7mfgeiw",
    "image_three": "https://images.luxuryescapes.com/9vyt1kcek527b950a0h",
    "vendor_name": "Silverwater Resort",
    "title": "Serene Coastal Escape near Phillip Island with Daily Breakfast",
    "description": "Experience the very best of regional Victoria at Silverwater Resort, located just minutes from iconic Phillip Island. Offering a serene stay, with panoramic views over San Remo and the Bass Coast, Silverwater Resort boasts a range of accommodation options - from stylish resort rooms to self-contained one-, two- and three-bedroom apartments with private terraces or balconies. From the resort, you're perfectly placed to enjoy everything Phillip Island has to offer, including the famous Penguin Parade, beautiful beaches, wildlife encounters, bustling cafes and gourmet restaurants.\n\nAt the resort, indulge in gourmet meals at Watermark Restaurant, which offers stunning views through its floor-to-ceiling windows, or sophisticated drinks at the onsite Lounge Bar, while the kids are kept busy with the onsite jumping pillow, games room and playground.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "San Remo",
    "location_heading": "San Remo",
    "location_subheading": "Victoria",
    "location_description": "Silverwater Resort",
    "offer_address": "17 Potters Hill Road, San Remo, Victoria 3925, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 25,
    "price": 209.0,
    "value": 413.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvpNqAAJ",
    "hero_image": "https://images.luxuryescapes.com/6odbpkddmn51efo3umd",
    "image_two": "https://images.luxuryescapes.com/shpozjhsya6dx5aygimj",
    "image_three": "https://images.luxuryescapes.com/6dk4315jxg28uzanzeda",
    "vendor_name": "Silverwater Resort",
    "title": "Serene Coastal Victoria Escape near Phillip Island with Two Heated Onsite Pools & Daily Breakfast",
    "description": "Experience the very best of regional Victoria at Silverwater Resort, located just minutes from iconic Phillip Island. Offering a serene stay, with panoramic views over San Remo and the Bass Coast, Silverwater Resort boasts a range of accommodation options - from stylish resort rooms to self-contained one-, two- and three-bedroom apartments with private terraces or balconies. Indulge in gourmet meals at Watermark Restaurant, which offers stunning views through its floor-to-ceiling windows, or sophisticated drinks at the onsite Lounge Bar, while the kids are kept busy with the onsite jumping pillow, games room and playground.\n\nFrom the resort, you're perfectly placed to enjoy everything the Bass Coast has to offer. A short drive from Phillip Island Wildlife Park, you’ll find yourself immersed in unique wildlife experiences, such as spotting sleepy koalas napping in the eucalyptus trees or handfeeding native kangaroos and wallabies. As evening falls, venture to the famous Penguin Parade, where you can witness hundreds of penguins making their way ashore. There’s no shortage of aquatic activities to partake in, with plenty of beaches nearby, or simply mosey down to nearby Kilcunda for a relaxing sea break.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "San Remo",
    "location_heading": "San Remo",
    "location_subheading": "Victoria",
    "location_description": "Silverwater Resort",
    "offer_address": "17 Potters Hill Road, San Remo, Victoria 3925, Australia",
    "percentage_discount": 61.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 209.0,
    "value": 533.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002In8EIAS",
    "hero_image": "https://images.luxuryescapes.com/nl3uxg09mm0an1bmqgyj",
    "image_two": "https://images.luxuryescapes.com/s1xt2bffhseremi4lu2k",
    "image_three": "https://images.luxuryescapes.com/m0cx38g8eqp59ezfn1",
    "vendor_name": "Silverwater Resort",
    "title": "Serene Coastal Victoria Escape near Phillip Island with Daily Breakfast & Two Heated Onsite Pools",
    "description": "Experience the very best of regional Victoria at this serene stay just minutes from iconic Phillip Island with panoramic views over San Remo and the Bass Coast. The resort boasts a range of accommodation options - from stylish resort rooms to self-contained one-, two- and three-bedroom apartments with private terraces or balconies.\n\nIndulge in gourmet meals at Watermark Restaurant, offering stunning views through floor-to-ceiling windows, or sip sophisticated drinks at the onsite Lounge Bar. Unwind by one of two heated onsite pools, or opt for the spa pool or steam room while the kids are kept busy with the onsite jumping pillows, games room and playground.\n\nFrom the resort, you're perfectly placed to explore the Bass Coast. A short drive takes you to Phillip Island Wildlife Park, where you can spot sleepy koalas napping in the eucalyptus trees or hand-feed the kangaroos and wallabies. Don't miss the Penguin Parade at dusk, watching as hundreds of penguins make their way ashore.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "San Remo",
    "location_heading": "San Remo",
    "location_subheading": "Victoria",
    "location_description": "Silverwater Resort",
    "offer_address": "17 Potters Hill Road, San Remo, Victoria 3925, Australia",
    "percentage_discount": 59.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 219.0,
    "value": 533.0
  }
]