[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009BXmPAAW",
    "hero_image": "https://images.luxuryescapes.com/hy06xsrtrvuo1cqwi1a",
    "image_two": "https://images.luxuryescapes.com/97omopm2js7ip9v3pzpd",
    "image_three": "https://images.luxuryescapes.com/whxgxosiclw1qf50fa3r",
    "vendor_name": "WelcomHeritage Shivavilas Palace Sandur",
    "title": "Heritage Sandur Palace Stay near UNESCO World Heritage-Listed Hampi with Private Butler Dinner & Daily Breakfast",
    "description": "You are invited to experience a picture-perfect escape at WelcomHeritage Shivavilas Palace Sandur (near Hampi), a former king's palace set in the mining hub of Sandur, Karnataka. An hour from the state's famous UNESCO World-Heritage listed town, Hampi, and under six hours from Bengaluru, this majestic property is now a heritage hotel offering a mesmerising dose of history, arts, culture and culinary fare - and easy access to the region's famous attractions, including the ruined temple complexes from the Vijayanagara Empire.\n\nThe 22-acre site is home to just 12 luxurious rooms and suites, with each offering a trip back in time to the era of the Ghorpade rulers. Be treated like royalty within this beautifully restored oasis which hides within its bejewelled walls the legacy of the royal family and a bounty of history with its vintage car and weapon museums, alongside an inviting swimming pool and intimate dining hall accommodating just 25 guests at any one time.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Sandur",
    "location_heading": "Sandur",
    "location_subheading": "Karnataka",
    "location_description": "WelcomHeritage Shivavilas Palace Sandur",
    "offer_address": "No. 97, Palace Road, Bellary Dist. Sandur Karnataka 583119 India",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 245.0,
    "value": 463.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EyWUrAAN",
    "hero_image": "https://images.luxuryescapes.com/wk0y3ft9xcfzyr3tjgb8",
    "image_two": "https://images.luxuryescapes.com/rpwdedzk5lh990lu8kb",
    "image_three": "https://images.luxuryescapes.com/m5n4ip9o99w39drbjyqr",
    "vendor_name": "WelcomHeritage Shivavilas Palace Sandur",
    "title": "Sandur Palatial Escape near Hampi with Daily Breakfast, One Lunch/Dinner & Heritage Experiences",
    "description": "Immerse yourself in royal grandeur at WelcomHeritage Shivavilas Palace Sandur, a regal sanctuary nestled in the heart of North Karnataka's Vijayanagara district. This palatial retreat, steeped in history and culture, offers a unique blend of luxury and heritage and is only a 30-minute drive from Jindal Vijaynagar Airport (VDY) and an hour's drive from the UNESCO World Heritage-listed town of Hampi. A former king's palace, this sprawling 22-acre property is now a heritage hotel waiting to be explored and experienced, a 5.5-hour drive from Bengaluru. Indulge in a gastronomic journey at the hotel's multiple restaurants, go for a swim in the pool, take a tour of the vintage car museum, or take a leisurely stroll through the palace gardens, and you'll be left mesmerised.\n\nJourney back in time and savour the taste of India's glorious regal past as you will be treated like royalty within this beautifully restored oasis which hides within its bejewelled walls the legacy of the Ghorpade family. Lying close to the ruined temples of Hampi, the property is ideal for exploring the historical Vijayanagara region, while basking in utmost luxury and comfort.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Sandur",
    "location_heading": "Sandur",
    "location_subheading": "Karnataka",
    "location_description": "WelcomHeritage Shivavilas Palace Sandur",
    "offer_address": "No. 97, Palace Road, Bellary Dist. Sandur Karnataka 583119 India",
    "percentage_discount": 36.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 339.0,
    "value": 533.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006yfiCAAQ",
    "hero_image": "https://images.luxuryescapes.com/9z3l65d9sf191vywssp8",
    "image_two": "https://images.luxuryescapes.com/s72zg23s9km5dwr6s56o",
    "image_three": "https://images.luxuryescapes.com/zpes5pf8fikaguwofy2p",
    "vendor_name": "WelcomHeritage Shivavilas Palace Sandur",
    "title": "Heritage Sandur Palace Stay near Hampi with Daily Dining",
    "description": "You are invited to experience a picture-perfect escape at WelcomHeritage Shivavilas Palace Sandur, a former king's palace set in the mining hub of Sandur, Karnataka. An hour from the state's famous heritage town, Hampi, and less than six hours from Bengaluru, this majestic property is now a heritage hotel offering a mesmerising dose of history, arts, culture and culinary fare - and easy access to the region's famous attractions.\n\nThe 22-acre site is home to just 12 luxurious rooms and suites, with each offering a trip back in time to the era of the Ghorpade rulers. 'See Sandur in September', declared Mahatma Gandhi when he landed in Karnataka during his travels in 1930, mesmerised by the beauty of this town. But this charming destination is equally gorgeous around the year and makes for a perfect escape from the cities with families and friends.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Karnataka",
    "offer_geo_area_level_2": "Sandur",
    "location_heading": "Sandur",
    "location_subheading": "Karnataka",
    "location_description": "WelcomHeritage Shivavilas Palace Sandur OLD",
    "offer_address": "No. 97, Palace Rd, Sandur, Karnataka 583119",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 485.0,
    "value": 748.0
  }
]