[
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070iP6AAI",
    "hero_image": "https://images.luxuryescapes.com/pnh0hjpukcazaro23u6",
    "image_two": "https://images.luxuryescapes.com/8ks7s9x9uj97p37o3af",
    "image_three": "https://images.luxuryescapes.com/ytgy2w58gn5q2hp64zrn",
    "vendor_name": "Cambridge Beaches Resort & Spa",
    "title": "Bermuda Oceanfront Retreat with Four Private Beaches, Two Coves & Boutique Heritage Cottages",
    "description": "If you’re dreaming of secluded island perfection, it doesn't get better than a unique stay at Cambridge Beaches Resort & Spa, established nearly a century ago as Bermuda’s first cottage-style accommodation. Allow yourself to be immediately spellbound by this 23-acre resort perched at the west end of Bermuda and encircled by glorious white-sand beaches and turquoise waters. Part of the prestigious Preferred Hotels group, the property boasts more than 80 pastel-pink cottages with architectural details dating back to the 17th century.\n\nA wealth of amenities are scattered across the property, including an infinity pool and indoor pool, tranquil spa, four private beaches, two coves, a putting green, three tennis courts and the onsite Water Sports Marina, which allows you to make the ocean your aquatic playground. Gourmands will love feasting daily at Tamarisk Restaurant, sipping cocktails at Shutters and enjoying open-air dining at Breezes. Beyond the resort, the serene Somerset Village is within close reach, or you can venture further and explore Bermuda’s unforgettable beauty at popular sites like Horseshoe Bay or the Crystal Caves.",
    "offer_country_name": "Bermuda",
    "offer_country_code_alpha_2": "BM",
    "offer_geo_area_level_1": "Sandys Parish",
    "offer_geo_area_level_2": "Sandys Parish",
    "location_heading": "Sandys Parish",
    "location_subheading": "Bermuda",
    "location_description": "Cambridge Beaches Resort & Spa",
    "offer_address": "30 Kings Point Road Sandys Parish, MA 02, Bermuda",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 319.0,
    "value": 319.0
  }
]