[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csUbTQAU",
    "hero_image": "https://images.luxuryescapes.com/ee0094grykwbvrb4ol5c",
    "image_two": "https://images.luxuryescapes.com/bvkav7s45mdpav0rjyxj",
    "image_three": "https://images.luxuryescapes.com/hcz7sewes55d6e65hcb7",
    "vendor_name": "Resorts World Sentosa - Equarius Hotel",
    "title": "Resorts World™ Sentosa Escape with Universal Studios Singapore Access",
    "description": "With pristine beaches, celebrity restaurants and round-the-clock entertainment at your fingertips, dive into Asia’s adventure playground with a stay at Resorts World™ Sentosa’s Equarius Hotel™. You’ll be perfectly placed to embrace near-endless fun with two tickets each to your choice of three world-class attractions, including Universal Studios Singapore, Adventure Cove Waterpark™ or S.E.A. Aquarium™, valued at over A$400, daily buffet breakfast, a multi-course dinner at your choice of two restaurants, 20% food and drink discount, and a 15% spa discount for the award-winning ESPA. Reach new heights as you ride thrilling rollercoasters and bring the family along for the ride with upgrades for up to two adults and two children available!",
    "offer_country_name": "Singapore",
    "offer_country_code_alpha_2": "SG",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Singapore",
    "location_heading": "Sentosa",
    "location_subheading": "Singapore",
    "location_description": "Resorts World™ Sentosa - Equarius Hotel™",
    "offer_address": "8 Sentosa Gateway, Singapore 098269",
    "percentage_discount": 52.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 860.0,
    "value": 1779.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvJvYAAV",
    "hero_image": "https://images.luxuryescapes.com/0ub68dyh8c1hw720jjun",
    "image_two": "https://images.luxuryescapes.com/wcolnebrpais33n6xz4j",
    "image_three": "https://images.luxuryescapes.com/lff9g6y6d3tceexii3q",
    "vendor_name": "Sofitel Singapore Sentosa Resort & Spa",
    "title": "French-Inspired Singapore Sofitel Sentosa with Daily Breakfast, Daily Lunch or Dinner & Nightly Cocktails",
    "description": "Situated in the heart of Sentosa Island, overlooking the shining blues of the Singapore Strait, Sofitel Singapore Sentosa Resort & Spa graciously invites you to indulge in French-inspired elegance. Blessed with one of the best locations on the island, this chic retreat boasts excellence at every turn, from the sumptuous dining options to the luxurious day spa, glittering seafront pools and collection of elegant suites and rooms. Prestigiously positioned over the shores of Tanjong Beach, the resort exudes signature French elegance while drawing inspiration from Singaporean culture.\n\nStep out on the champagne shores and discover the very best of Sentosa on your doorstep: take on thrills at the island's theme parks, tick off major sites like historic Fort Siloso, and catch the spellbinding water and laser light show each evening. You're also less than 15 minutes from the mainland, where you'll find the famed Orchard Road shopping precinct, UNESCO World Heritage-listed Botanic Gardens, hawker centres, historic markets and iconic Gardens by the Bay.",
    "offer_country_name": "Singapore",
    "offer_country_code_alpha_2": "SG",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Singapore",
    "location_heading": "Sentosa",
    "location_subheading": "Singapore",
    "location_description": "Sofitel Singapore Sentosa Resort & Spa",
    "offer_address": "2 Bukit Manis Road, Sentosa 099891, Singapore",
    "percentage_discount": 41.0,
    "min_duration": 2,
    "max_duration": 20,
    "price": 669.0,
    "value": 1138.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CtzAQYAZ",
    "hero_image": "https://images.luxuryescapes.com/f2z3v10b68yuhcautmm9",
    "image_two": "https://images.luxuryescapes.com/7hzl50tu8szow3f66q",
    "image_three": "https://images.luxuryescapes.com/yoyo5xrj5bocsfi9lbx",
    "vendor_name": "Sofitel Singapore Sentosa Resort & Spa",
    "title": "French-Inspired Singapore Luxury with Daily Breakfast, Nightly Dinner & Two Nightly Cocktails",
    "description": "Situated in the heart of Sentosa, overlooking the shining waters of the Singapore Strait, this five-star resort and spa graciously invites you to indulge in French-inspired elegance. Blessed with one of the best locations on the island, this chic retreat boasts excellence at every turn, from sumptuous dining options to glittering seafront pools, and a collection of elegant suites and rooms.\n\nPrestigiously positioned with direct access to Tanjong Beach, the resort exudes signature French elegance while drawing inspiration from Singaporean culture. Step out on the champagne shores and discover the very best of Sentosa on your doorstep: take on thrills at the island's theme parks, tick off major sites like the heritage Fort Siloso, and catch the spellbinding water and laser light show each evening.\n\nYou're also a short drive away from the famed Orchard Road shopping precinct, UNESCO World Heritage-listed Singapore Botanic Gardens, hawker centres, heritage markets and Gardens by the Bay.",
    "offer_country_name": "Singapore",
    "offer_country_code_alpha_2": "SG",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Singapore",
    "location_heading": "Sentosa",
    "location_subheading": "Singapore",
    "location_description": "Sofitel Singapore Sentosa Resort & Spa",
    "offer_address": "2 Bukit Manis Road, Sentosa 099891, Singapore",
    "percentage_discount": 53.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 889.0,
    "value": 1903.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMrYdAAL",
    "hero_image": "https://images.luxuryescapes.com/gelkjt9nshd7dlue9z",
    "image_two": "https://images.luxuryescapes.com/2xx7bexylivr1ygkql",
    "image_three": "https://images.luxuryescapes.com/jzqlweoawezq4087q73f",
    "vendor_name": "Sofitel Singapore Sentosa Resort & Spa",
    "title": "French-Inspired Singapore Luxury with Daily Breakfast, Nightly Free-Flow Drinks & Canapes Hour",
    "description": "Situated in the heart of Sentosa Island, overlooking the shining blues of the Singapore Strait, this five-star resort and spa graciously invites you to indulge in French-inspired elegance. Blessed with one of the best locations on the island, this chic retreat boasts excellence at every turn, from sumptuous dining options to glittering seafront pools, and a collection of elegant suites and rooms.\n\nPrestigiously positioned with direct access to Tanjong Beach, the resort exudes signature French elegance while drawing inspiration from Singaporean culture. Step out on the champagne shores and discover the very best of Sentosa Island on your doorstep: take on thrills at the island's theme parks, tick off major sites like heritage Fort Siloso, and catch the spellbinding water and laser light show each evening.\n\nYou're also less than 15 minutes from the mainland, where you'll find the famed Orchard Road shopping precinct, UNESCO World Heritage-listed Singapore Botanic Gardens, hawker centres, heritage markets and iconic Gardens by the Bay.",
    "offer_country_name": "Singapore",
    "offer_country_code_alpha_2": "SG",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Singapore",
    "location_heading": "Sentosa",
    "location_subheading": "Singapore",
    "location_description": "Sofitel Singapore Sentosa Resort & Spa",
    "offer_address": "2 Bukit Manis Road, Sentosa 099891, Singapore",
    "percentage_discount": 50.0,
    "min_duration": 3,
    "max_duration": 27,
    "price": 869.0,
    "value": 1749.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzXksAAF",
    "hero_image": "https://images.luxuryescapes.com/62xqow5ogqvlxmzu50df",
    "image_two": "https://images.luxuryescapes.com/kvm44z544m0qvqrxno6",
    "image_three": "https://images.luxuryescapes.com/on58x4y3p919mbw5w8pt",
    "vendor_name": "Sofitel Singapore Sentosa Resort & Spa",
    "title": "Singapore French-Inspired Sofitel Sentosa Island Stay with Daily Breakfast, Nightly Dinner & Evening Cocktails",
    "description": "Situated in the heart of adventurous Sentosa Island, overlooking the shining blues of the Singapore Strait, Sofitel Singapore Sentosa Resort & Spa graciously invites you to indulge in French-inspired elegance with daily dining and nightly cocktails included. Offering one of the best hotel positions on the island, this tres-chic retreat boasts excellence at every turn - from the sumptuous dining options to the luxurious day spa, glittering seafront pools and collection of elegant suites and rooms. Prestigiously positioned atop the shores of Tanjong Beach, Sofitel Singapore Sentosa Resort & Spa exudes signature French elegance while drawing inspiration from Singaporean culture.\n\nStep out on the champagne shores and discover the very best of Sentosa on your doorstep: take on thrills at the island's theme parks, tick off major sites like historic Fort Siloso, and catch the spellbinding water and laser light show each evening. You're also less than 15 minutes from the mainland, where you'll find the famed Orchard Road shopping precinct, UNESCO World Heritage-listed Botanic Gardens, hawker centres, historic markets and iconic Gardens by the Bay",
    "offer_country_name": "Singapore",
    "offer_country_code_alpha_2": "SG",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Singapore",
    "location_heading": "Sentosa",
    "location_subheading": "Singapore",
    "location_description": "Sofitel Singapore Sentosa Resort & Spa",
    "offer_address": "2 Bukit Manis Road, Sentosa 099891, Singapore",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 17,
    "price": 975.0,
    "value": 2013.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DV5QAAW",
    "hero_image": "https://images.luxuryescapes.com/s40cmwgzvjynu2w4wd3",
    "image_two": "https://images.luxuryescapes.com/yjjd50rqcol5d2aope",
    "image_three": "https://images.luxuryescapes.com/hcm6433p3jrl1kv4754n",
    "vendor_name": "Hard Rock Hotel Singapore",
    "title": "Five-Star Sentosa Island Glamour with Universal Studios Singapore & S.E.A. Aquarium Tickets",
    "description": "Experience the glitz and glamour of Hard Rock Hotel Singapore, perfectly positioned on blissful Sentosa Island, minutes from the famous theme parks and bustling activity of Resorts World Sentosa. From the recognisable intertwined guitar statues to the colourful yet sophisticated interior, the hotel is designed to bring you back in time with old school rock ’n’ roll flair mixed with contemporary decadence. Fuel up with an invigorating buffet breakfast before exploring Southeast Asia’s first and only Universal Studios theme park, packed with thrilling rides, fun-filled interactive shows, and delicious dining options. Immerse yourself in marine life at the S.E.A. Aquarium, filled with a range of mesmerising aquatic animals, before heading back for a rockstar-inspired cocktail in the hotel’s signature bar.\n\nWith fascinating architecture, world-class shopping avenues, decadent food and some of the cleanest streets in the world, Singapore combines ultra-modern luxury and historic charm to produce iconic monuments and attractions right on your doorstep. Walk amongst the trees of a futuristic Cloud Forest, marvel at vibrant marketplaces bursting with spices or simply enjoy the melting pot of cultures prevalent throughout this unique, vibrant city.",
    "offer_country_name": "Singapore",
    "offer_country_code_alpha_2": "SG",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Singapore",
    "location_heading": "Sentosa",
    "location_subheading": "Singapore",
    "location_description": "Hard Rock Hotel Singapore",
    "offer_address": "8 Sentosa Gateway Singapore 098269",
    "percentage_discount": 37.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 870.0,
    "value": 1386.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lp4AAAS",
    "hero_image": "https://images.luxuryescapes.com/fu8uijmbofuakprfsvaq",
    "image_two": "https://images.luxuryescapes.com/iikzylogh6te2oveandm",
    "image_three": "https://images.luxuryescapes.com/vqg1r0xg8nc41zyjmn",
    "vendor_name": "Sofitel Singapore Sentosa Resort & Spa",
    "title": "Sensational Sofitel Sentosa Retreat with Decadent Daily Dining",
    "description": "Be immersed in a five-star Singapore experience with a stay at the renowned Sofitel Singapore Sentosa Resort & Spa. A relaxing island break just off the coast, Sentosa is a must when visiting Singapore. Putting you within easy reach of all Singapore’s best shopping, theme parks, beaches and attractions, but just outside the hustle and bustle of the city, a stay at Sofitel Singapore Sentosa Resort & Spa is the ideal choice for every kind of traveller. Enjoy flexible dining options with daily breakfast, a choice of daily lunch or dinner and a daily cocktail per adult included.",
    "offer_country_name": "Singapore",
    "offer_country_code_alpha_2": "SG",
    "offer_geo_area_level_1": "",
    "offer_geo_area_level_2": "Singapore",
    "location_heading": "Sentosa",
    "location_subheading": "Singapore",
    "location_description": "Sofitel Singapore Sentosa Resort & Spa",
    "offer_address": "2 Bukit Manis Road, Sentosa 099891, Singapore",
    "percentage_discount": 61.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 659.0,
    "value": 1681.0
  }
]