[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib17lYAB",
    "hero_image": "https://images.luxuryescapes.com/b8vnjm9zxi2tzba40xg",
    "image_two": "https://images.luxuryescapes.com/mq821pb3anvy23cnopu9",
    "image_three": "https://images.luxuryescapes.com/g4p96vtqhe0ydyxiil4o",
    "vendor_name": "Pullman Sharjah",
    "title": "Modern Sharjah City Break Moments from Al Qasba with Restaurant, Rooftop Swimming Pool & Spa",
    "description": "Immerse yourself in the cultural capital of the UAE at this contemporary Pullman stay, where luxury meets inspiration in the vibrant Al Taawun district. Just minutes from Al Khan Lagoon, Sharjah Expo Centre and the buzzing Al Qasba waterfront, this five-star hotel blends upscale comfort with dynamic energy.\n\nVenture out to discover traditional souks, high-end shopping malls and fascinating museums, returning to the hotel for a refreshing dip in the rooftop swimming pool or a fresh juice at the poolside bar. Recharge with a sweet treat and freshly-brewed coffee at The Junction or feast on international favourites and Middle Eastern fare at Al Khan Restaurant, before retiring to your modern room or suite boasting views over the dazzling city or sparkling lagoon.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Sharjah",
    "offer_geo_area_level_2": "Sharjah",
    "location_heading": "Sharjah",
    "location_subheading": "UAE",
    "location_description": "Pullman Sharjah",
    "offer_address": "Al Taawun Street, Al Khalidiya District, Sharjah, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 58.0,
    "value": 58.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000CnP82YAF",
    "hero_image": "https://images.luxuryescapes.com/uak7lkjvx3uyyfyt05",
    "image_two": "https://images.luxuryescapes.com/tkmcbge3mrk9tbtjdtad",
    "image_three": "https://images.luxuryescapes.com/vghob1l993mj1nh4z8qwp",
    "vendor_name": "Novotel Sharjah Expo Centre",
    "title": "Sophisticated Sharjah Stay near Expo Centre with Two Restaurants & Outdoor Pool",
    "description": "Embrace the urban elegance of Sharjah from this Novotel abode, perfectly positioned near the Sharjah Expo Centre and overlooking the serene Al Mamzar Lagoon. Soak up panoramic views from your contemporary room or suite, take a refreshing dip in the outdoor pool and work up a sweat at the onsite fitness centre.\n\nWhen it's time to indulge, savour Middle Eastern and Moroccan delicacies at the stylish Tahi, or lounge poolside with refreshing drinks and light bites from the Pool Cafe. Head out to discover nearby cultural and shopping hubs, including the Blue Souk, Al Noor Mosque and the Sharjah Art Museum, or head to Dubai for the day.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Sharjah",
    "offer_geo_area_level_2": "Sharjah",
    "location_heading": "Sharjah",
    "location_subheading": "United Arab Emirates",
    "location_description": "Novotel Sharjah Expo Centre",
    "offer_address": "Al Khan Area - Al Taawun Street, Next To Sharjah Expo Centre, Sharjah 72717, United Arab Emirates",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 39.0,
    "value": 39.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zvbZAAQ",
    "hero_image": "https://images.luxuryescapes.com/10anx3qc6205ykyj1xw",
    "image_two": "https://images.luxuryescapes.com/r4lxonq6igplosoz3xk",
    "image_three": "https://images.luxuryescapes.com/iuqql7ab79z8wbzl1k7",
    "vendor_name": "Chedi Al Bait Sharjah",
    "title": "United Arab Emirates Five-Star Escape in the Heart of Sharjah",
    "description": "The comforts of a heritage Arabic home meet new levels of indulgent hospitality at the award-winning Chedi Al Bait, Sharjah, named one of the most remarkable new hotels in the world in Travel + Leisure’s 2020 IT List. Sitting in the heart of Sharjah, the UAE's third most populous city, this five-star hotel is a tranquil haven among the hustle and bustle, with plenty of key attractions just a short walk away. Stroll through the traditional Souq Al Arsah bazaar, learn about the Emirates' thriving art scene at the cutting-edge Sharjah Art Foundation and Museum or wander along the waterfront, following the Buhaira Corniche walkway.\n\nA sense of ‘home’ reverberates throughout The Chedi Al Bait, Sharjah, starting with its design - it occupies a number of lovingly restored historic properties, enhanced with the latest in luxury amenities and indulgent comforts. Experience Emirati elegance at its finest at The Arabic Restaurant, where chefs share their take on traditional dishes, or sample sensational international flavours at The Restaurant. Sip a Turkish coffee at The Café or beat the heat with an ice cream in the courtyard of Al Bareed. Slip into the sanctuary of The Spa to indulge in ayurvedic massages, traditional hammam rituals or sauna sessions, learn more about the hotel’s history and location at the onsite museum, or discover a new favourite read in The Library.",
    "offer_country_name": "United Arab Emirates",
    "offer_country_code_alpha_2": "AE",
    "offer_geo_area_level_1": "Sharjah",
    "offer_geo_area_level_2": "Sharjah",
    "location_heading": "Sharjah",
    "location_subheading": "UAE",
    "location_description": "The Chedi Al Bait, Sharjah",
    "offer_address": "Heart of Sharjah - Sharjah - United Arab Emirates",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]