[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib18DYAR",
    "hero_image": "https://images.luxuryescapes.com/cvpidanjjhd1xazx7tis",
    "image_two": "https://images.luxuryescapes.com/611udos8ig0jebmjyp",
    "image_three": "https://images.luxuryescapes.com/xhv069sl49tcliyqi3en",
    "vendor_name": "Rixos Sharm El Sheikh",
    "title": "Beachfront Adults-Only Egyptian Oasis with Seven Pools & Eight Restaurants",
    "description": "Indulge in the epitome of luxury at this lavish adults-only sanctuary nestled along the pristine shores of the Red Sea in the picturesque city of Sharm El Sheikh. Here, days unfold beside one of seven sparkling pools, each a serene haven or lively social hub. As the sun sets, the resort transforms into a playground of entertainment with live music, DJ sets and themed parties.\n\nCulinary enthusiasts can indulge across eight restaurants, sampling Indian, Japanese, Ottoman and Italian flavours, while the resort's nine bars dole out delicious drinks. Just outside, adventure seekers can explore the underwater world of the Red Sea, renowned for its vibrant coral reefs and diverse marine life. After a day of exploration, return for some restorative treatments and pampering at the luxe Anjana Spa.",
    "offer_country_name": "Egypt",
    "offer_country_code_alpha_2": "EG",
    "offer_geo_area_level_1": "South Sinai Governorate",
    "offer_geo_area_level_2": "Sharm El Sheikh",
    "location_heading": "Sharm El Sheikh",
    "location_subheading": "Egypt",
    "location_description": "Rixos Sharm El Sheikh",
    "offer_address": "South Sinai Nabq Bay, Sharm El Sheikh, South Sinai Governorate 46628, Egypt",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 256.0,
    "value": 256.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib18FYAR",
    "hero_image": "https://images.luxuryescapes.com/tj391ree6jcaxzolgb4i",
    "image_two": "https://images.luxuryescapes.com/uhpv9b6oihyx4pt7fo1h",
    "image_three": "https://images.luxuryescapes.com/1e7alp0qzjwjnvwex2r6",
    "vendor_name": "Naama Bay Promenade Beach Resort",
    "title": "Beachfront Naama Bay Escape with Private Beach, Two Pools & Five Restaurants & Bars",
    "description": "Immerse yourself in the timeless allure of Egypt with a stay at this breathtaking beachfront resort, offering the best of both mountain and beachside beauty. Feel the warm breeze as you unwind by the sparkling pool, surrounded by swaying palm trees and lush manicured gardens, or step outside to discover the lively local markets that define the region’s rich culture.\n\nIndulge in a culinary journey with a myriad of dining options, from a vibrant selection at Sharm Buffet, charming Italian fare at Parmizzanos, to cocktails poolside at the Beach Bar. For the ultimate seaside experience, enjoy exclusive access to the resort's private beach, where soft sands and turquoise waters await, offering another way to kick back and relax.",
    "offer_country_name": "Egypt",
    "offer_country_code_alpha_2": "EG",
    "offer_geo_area_level_1": "South Sinai Governorate",
    "offer_geo_area_level_2": "Sharm El Sheikh",
    "location_heading": "Sharm El Sheikh",
    "location_subheading": "Egypt",
    "location_description": "Naama Bay Promenade Beach Resort",
    "offer_address": "El Salam Road, Naama Bay, Sharm El Sheikh 46691, Egypt",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 41.0,
    "value": 41.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Ib18HYAR",
    "hero_image": "https://images.luxuryescapes.com/uyg9zq0vmu2metpwqqfl",
    "image_two": "https://images.luxuryescapes.com/xz0jbb6pljrnpbg0rid6",
    "image_three": "https://images.luxuryescapes.com/gl89qfwrik8mz36xc4gf",
    "vendor_name": "Rixos Radamis Sharm El Sheikh",
    "title": "Egypt Coastal Elegance with Onsite Restaurants, Bars, Pool & Spa",
    "description": "Escape to paradise at Rixos Radamis in stunning Sharm El Sheikh, where the Red Sea meets world-class accommodation. This spectacular resort transforms your getaway into an unforgettable adventure with pristine beaches, crystal-clear waters and Egypt's legendary hospitality.\n\nIndulge your every craving at 23 incredible bars and restaurants from sizzling Mexican at Cactus to Mediterranean delights at Riviera and ocean-fresh seafood at Salt. Cool off in the glistening outdoor pool, then surrender to pure bliss at the amazing Anjana Spa. Children will love Rixy Kids Town, an enchanting world for kids to embrace games and play. Every moment here is designed to exceed your wildest vacation dreams.",
    "offer_country_name": "Egypt",
    "offer_country_code_alpha_2": "EG",
    "offer_geo_area_level_1": "South Sinai Governorate",
    "offer_geo_area_level_2": "Sharm El Sheikh",
    "location_heading": "Sharm El Sheikh",
    "location_subheading": "Egypt",
    "location_description": "Rixos Radamis Sharm El Sheikh",
    "offer_address": "Nabq Bay, Sharm El Sheikh 2, South Sinai Governorate 8752413, Egypt",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 275.0,
    "value": 275.0
  }
]