[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvaIYAAZ",
    "hero_image": "https://images.luxuryescapes.com/65jaepf4bnrlhhbzqjl",
    "image_two": "https://images.luxuryescapes.com/52azfwl2t3k8kx79o4",
    "image_three": "https://images.luxuryescapes.com/9wo8n1fw7iq926v6ab9",
    "vendor_name": "Ramada Resort by Wyndham Shoal Bay",
    "title": "Beachside Shoal Bay Suites along NSW North Coast with Lagoon Pool & Dining Credit",
    "description": "Follow the sun-kissed Central Coast to Shoal Bay, and enjoy a relaxing beachside paradise perched on the glorious shores in Port Stephens, an hour from Newcastle. Home to a sun-lit lagoon pool with a kids' wading area and indoor lap pool, the palm-fringed Ramada Resort by Wyndham Shoal Bay is ideal for groups and families travelling with children, and offers suites for two to six guests. \n\nWork up a sweat at the indoor gym, dine at one of onsite eateries or unwind at Sirène Spa - this tranquil retreat has something for everyone.\n\nExplore the surrounding coastal trails on foot or take to two wheels and feel the sea breeze from a bicycle. Plunge into the rolling waves on a stand-up paddle board, test out your rowing skills in the comfort of a kayak, explore nearby Port Stephens or take the drive south to Newcastle, where top restaurants, boutiques, galleries and more gorgeous beaches await.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Shoal Bay",
    "location_heading": "Shoal Bay",
    "location_subheading": "New South Wales",
    "location_description": "Ramada Resort by Wyndham Shoal Bay",
    "offer_address": "35-45 Shoal Bay Road, Shoal Bay, New South Wales 2315, Australia",
    "percentage_discount": 53.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 259.0,
    "value": 548.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Db8C4YAJ",
    "hero_image": "https://images.luxuryescapes.com/5jkcskbsf7179hak7m2ho",
    "image_two": "https://images.luxuryescapes.com/ckyvxe1qxp38pmrclp6",
    "image_three": "https://images.luxuryescapes.com/bnmh09seu43gaakg5btf",
    "vendor_name": "Ramada Resort by Wyndham Shoal Bay",
    "title": "Beachside Shoal Bay Apartment-Style Resort along NSW's North Coast with Lagoon Pool & Dining Credit",
    "description": "Follow the sun-kissed Central Coast to Shoal Bay, and enjoy a relaxing beachside paradise perched on the glorious shores in Port Stephens, an hour from Newcastle. Home to a sun-lit lagoon pool with a kids' wading area and indoor lap pool, this palm-fringed resort is ideal for groups and families.\n\nWork up a sweat at the fitness centre, dine at one of the onsite eateries and unwind at Sirène Spa - this tranquil retreat has something for everyone.\n\nExplore the surrounding coastal trails on foot or take two wheels and feel the sea breeze from a bicycle. Plunge into rolling waves on a stand-up paddleboard and test your water sports skills in the comfort of a kayak. Explore nearby Port Stephens, which has everything from wildlife to wineries, or drive south to Newcastle, where top restaurants, boutiques, galleries and more gorgeous beaches await.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Shoal Bay",
    "location_heading": "Shoal Bay",
    "location_subheading": "New South Wales",
    "location_description": "Ramada Resort by Wyndham Shoal Bay",
    "offer_address": "35-45 Shoal Bay Road, Shoal Bay, New South Wales 2315, Australia",
    "percentage_discount": 56.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 239.0,
    "value": 539.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gsVVAAY",
    "hero_image": "https://images.luxuryescapes.com/xrx7bo3ctccbfz4o02e",
    "image_two": "https://images.luxuryescapes.com/r5n5hzd1jqz85g6aiuw5",
    "image_three": "https://images.luxuryescapes.com/8kffbn7ggdcmzjo029fb",
    "vendor_name": "Ramada Resort by Wyndham Shoal Bay",
    "title": "Beachside Shoal Bay Resort near Port Stephens with Lagoon Pool",
    "description": "Follow the sun-kissed Central Coast to Ramada Resort by Wyndham Shoal Bay, a relaxing beachside resort perched on the glorious shores near Port Stephens, an hour from Newcastle. Home to a sun-lit lagoon pool with a kids' wading area and indoor lap pool, this palm-fringed retreat is ideal for groups and families travelling with children, and offers suites for two to six guests. Work up a sweat at the indoor gym, dine at one of three onsite eateries or unwind at Sirène Spa: this tranquil retreat has something for everyone.\n\nExplore the surrounding coastal trails on foot or take to two wheels and feel the sea breeze from a bicycle. Plunge into the rolling waves on a stand-up paddleboard, explore nearby Port Stephens or take the drive south to bustling Newcastle, where top restaurants, boutiques, galleries and more gorgeous beaches await.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Shoal Bay",
    "location_heading": "Shoal Bay",
    "location_subheading": "New South Wales",
    "location_description": "Ramada Resort by Wyndham Shoal Bay",
    "offer_address": "35-45 Shoal Bay Road, Shoal Bay, New South Wales 2315, Australia",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 8,
    "price": 239.0,
    "value": 491.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CQkLrAAL",
    "hero_image": "https://images.luxuryescapes.com/zq4z0s6svqdb40zegfq",
    "image_two": "https://images.luxuryescapes.com/9axaye419mo9rahofeq9",
    "image_three": "https://images.luxuryescapes.com/4mqd26spm8aqvj68ea5",
    "vendor_name": "Ramada Resort by Wyndham Shoal Bay",
    "title": "Beachside Shoal Bay Resort within Port Stephens with Lagoon Pool",
    "description": "Follow the sun-kissed Central Coast to Ramada Resort by Wyndham Shoal Bay, a relaxing beachside paradise perched on the glorious shores in Port Stephens, an hour from Newcastle. Home to a sun-lit lagoon pool with a kids' wading area and indoor lap pool, this palm-fringed retreat is ideal for groups and families travelling with children, and offers suites for two to six guests. Work up a sweat at the indoor gym, dine at one of onsite eateries or unwind at Sirène Spa - this tranquil retreat has something for everyone.\n\nExplore the surrounding coastal trails on foot or take to two wheels and feel the sea breeze from a bicycle. Plunge into the rolling waves on a stand-up paddleboard, test out your rowing skills in the comfort of a kayak, explore nearby Port Stephens or take the drive south to Newcastle, where top restaurants, boutiques, galleries and more gorgeous beaches await.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Shoal Bay",
    "location_heading": "Shoal Bay",
    "location_subheading": "New South Wales",
    "location_description": "Ramada Resort by Wyndham Shoal Bay",
    "offer_address": "35-45 Shoal Bay Road, Shoal Bay, New South Wales 2315, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 239.0,
    "value": 476.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HiNfIAK",
    "hero_image": "https://images.luxuryescapes.com/sq5kyxzqfi610aayot9",
    "image_two": "https://images.luxuryescapes.com/fuepqvdromzbrydr6qvb",
    "image_three": "https://images.luxuryescapes.com/zmmoxf7phnt7tgq8gaab",
    "vendor_name": "Ramada Resort by Wyndham Shoal Bay",
    "title": "Family-Friendly Shoal Bay Beachside Resort along New South Wales' North Coast with Lagoon Pool",
    "description": "Follow the sun-kissed Central Coast to Shoal Bay, and enjoy this relaxing beachside paradise on the glorious shores of Port Stephens. Home to a sun-lit lagoon pool with a kids' wading area and indoor lap pool, the palm-fringed Ramada Resort by Wyndham Shoal Bay is ideal for groups and families travelling with children.\n\nExplore the nearby coastal trails on foot or take to two wheels and feel the sea breeze from bicycle (available for rent from the front desk). Plunge into the rolling waves on a paddle board, test out your rowing skills in a kayak, explore nearby Port Stephens or drive south to Newcastle, where top restaurants, boutiques, galleries and more gorgeous beaches await.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Shoal Bay",
    "location_heading": "Shoal Bay",
    "location_subheading": "New South Wales",
    "location_description": "Ramada Resort by Wyndham Shoal Bay",
    "offer_address": "35-45 Shoal Bay Road, Shoal Bay, New South Wales 2315, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 100.0,
    "value": 100.0
  }
]