[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DotyuAAB",
    "hero_image": "https://images.luxuryescapes.com/96x2ojl6cc6dbj3mwaqq",
    "image_two": "https://images.luxuryescapes.com/8ezksivg1c6g1z2lwvcl",
    "image_three": "https://images.luxuryescapes.com/68ds6a6poktlegpb77qu",
    "vendor_name": "Terrara House",
    "title": "New South Wales South Coast Manor near Berry for 14 Guests with Welcome Champagne & Grazing Board",
    "description": "Nestled between New South Wales beaches and countryside sits Terrara House, a sophisticated estate boasting 23 rooms, set amongst 17 acres of perfectly manicured gardens. Established in the mid-1800s, this elegant property pays homage to its history through chic country styling across the historical main house, stables, event spaces, luxury tennis court and pool. Indulge in a lavish group escape and enjoy otherworldly luxury by opting into bespoke farm-to-table dining experiences lead by the Terrara Artisan catering team, including privately catered dinners, woodfire pizza nights and picnics featuring homegrown seasonal produce. Relax and unwind with the option to include luxury spa and wellness treatments in the onsite wellness salon.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Nowra",
    "location_heading": "Shoalhaven",
    "location_subheading": "New South Wales",
    "location_description": "Terrara House",
    "offer_address": "77 Millbank Road, Terara 2540, New South Wales, Australia",
    "percentage_discount": 21.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 3599.0,
    "value": 4578.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqTERAA3",
    "hero_image": "https://images.luxuryescapes.com/9ty2salx9zqzebta786",
    "image_two": "https://images.luxuryescapes.com/ojf0ugrcilf6k5rbpv2ce",
    "image_three": "https://images.luxuryescapes.com/9r0nywq7vsqsep2a4o0e",
    "vendor_name": "Motel Molly",
    "title": "Coastal NSW Boutique Designer Escape with Wine Tasting & Luxe Locally-Sourced Minibar",
    "description": "Tucked within thriving bursts of bougainvillea and swaying leafy palms, the blushing rosé hued Motel Molly sits pretty overlooking the crashing waves of Mollymook Beach. Uncover tranquil hideaways in abundance, boasting breezy balconies and private terraces - this boutique beachside beauty offers timeless luxury with a vibrant modern spin. Let the impeccable Mediterranean tiling, soft colour palette and incredible local wining and dining opportunities whisk you away on a southern European-inspired escape.\n\nJust steps from the pristine south coast shoreline, barbeque your fresh catch of the day and enjoy it in the laid-back cabana, or wander next door and try your swing on the rolling hills of Mollymook Golf Club. Sip on summer spritzes in tropical gardens, and watch as the sky turns apricot from the sparkling shallows of the hotel’s idyllic pool.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Ulladulla",
    "location_heading": "Shoalhaven",
    "location_subheading": "New South Wales",
    "location_description": "Motel Molly",
    "offer_address": "2 Shepherd Street, Mollymook, New South Wales 2539, Australia",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 286.0,
    "value": 441.0
  }
]