[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ed6CZAAZ",
    "hero_image": "https://images.luxuryescapes.com/obxwrc0hltttzo2z67x",
    "image_two": "https://images.luxuryescapes.com/4r453inv2q9ij6ohemu",
    "image_three": "https://images.luxuryescapes.com/x1ac7nhtvjr7g3my4hj",
    "vendor_name": "The Temi Bungalow, Eco Adventure Resorts",
    "title": "Sikkim Tea Estate Escape with Daily Breakfast, Daily Lunch or Dinner & One Forest Walk",
    "description": "Set amid a 400-acre tea estate and overlooking the majestic Kanchenjunga, The Temi Bungalow, Eco Adventure Resorts in Sikkim invites you for a relaxing escape. A two-hour drive from Pakyong Airport (PYG) and a 2.5-hour drive from Darjeeling, this regal bungalow was built way back in 1885 and offers gorgeous rooms and suites with contemporary amenities, each one more beautiful than the next. Wake to panoramic views of the lush tea plantations, breathe in the crisp mountain air, cut out all the digital noise and unwind in this tranquil paradise. Take walks in the garden, learning about the intricate process of tea-making. Or, dine under a shower of cherry blossoms overlooking the peak of Kangchenjunga, the world’s third tallest mountain.\n\nBeyond the estate, bucket-list experiences for mountaineers and thrill-seekers await in every picturesque enclave. Trek the lap of the Himalayas, explore Tsomgo Lake by a yak and bike ride through the altitudes of Sikkim as you encounter once-in-a-lifetime moments.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Sikkim",
    "offer_geo_area_level_2": "Namchi",
    "location_heading": "Sikkim",
    "location_subheading": "India",
    "location_description": "The Temi Bungalow, Eco Adventure Resorts",
    "offer_address": "Eco Adventure Resorts, Temi Bungalow, Namchi Sikkim 737139, India",
    "percentage_discount": 57.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 187.0,
    "value": 436.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DqSCFAA3",
    "hero_image": "https://images.luxuryescapes.com/lro963t58gnz717hc73m",
    "image_two": "https://images.luxuryescapes.com/tp5ivx68hgizbqi4f0q",
    "image_three": "https://images.luxuryescapes.com/hxd4gi1jjn9ppoht9xn",
    "vendor_name": "Indra Mandala, Gangtok - AM Hotel Kollection",
    "title": "Relaxing Gangtok Boutique Stay with Daily Breakfast, One Experiential Dinner & more",
    "description": "The serene Indra Mandala, Gangtok - AM Hotel Kollection is a gem of a hotel waiting to greet you in the land of monasteries. Step into a boutique hotel that features traditional Newar architecture and simple decor, making it the ideal place to unwind amidst the beautiful green hills of Sikkim. Merely a 1.5-hour drive from Pakyong Airport (PYG), this tranquil hotel boasts stylish accommodations. Enjoy a meal at the beautiful restaurant, which serves both traditional Tibetan and Nepalese cuisine, and is also home to Gangtok's first wood-fire fusion pizzeria, which combines classic Neapolitan pizza cooking with a variety of Newari and Tibetan toppings. Plus, the hotel puts you in close proximity to some of Sikkim's most popular tourist attractions, including Nathula Pass, Tsomgo Lake, ancient Buddhist monasteries and more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Sikkim",
    "offer_geo_area_level_2": "Gangtok",
    "location_heading": "Sikkim",
    "location_subheading": "India",
    "location_description": "Indra Mandala, Gangtok - AM Hotel Kollection",
    "offer_address": "Lower Luing, Road, Bakthang Gangtok Sikkim 737103 India",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 136.0,
    "value": 206.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000COUWqAAP",
    "hero_image": "https://images.luxuryescapes.com/n38i2z36maaflm0qy6f",
    "image_two": "https://images.luxuryescapes.com/k4llr5g2nf03nsf31tl",
    "image_three": "https://images.luxuryescapes.com/ll1maxokehb5tihodtp",
    "vendor_name": "Indra Mandala, Gangtok - AM Hotel Kollection",
    "title": "Grand Opening: Tranquil Gangtok Boutique Stay with Daily Breakfast & Experiential Dinner",
    "description": "The newly opened Indra Mandala, Gangtok - AM Hotel Kollection is a gem of a hotel waiting to greet you in the land of monasteries. The latest addition to the acclaimed AM Hotel Kollection group, this boutique hotel features traditional Newar architecture and simple decor, making it the ideal place to unwind amidst the beautiful green hills of Sikkim. Merely a 1.5-hour drive from Pakyong Airport (PYG), this boutique hotel boasts stylish accommodations. Enjoy a meal at the beautiful restaurant, which serves both traditional Tibetan and Nepalese cuisine, and is also home to Gangtok's first wood-fire fusion pizzeria, which combines classic Neapolitan pizza cooking with a variety of Newari and Tibetan toppings.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Sikkim",
    "offer_geo_area_level_2": "Gangtok",
    "location_heading": "Sikkim",
    "location_subheading": "India",
    "location_description": "Indra Mandala, Gangtok - AM Hotel Kollection",
    "offer_address": "Lower Luing, Road, Bakthang Gangtok Sikkim 737103 India",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 152.0,
    "value": 264.0
  }
]