[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cqLPsQAM",
    "hero_image": "https://images.luxuryescapes.com/msnkxg2imbeavxekqkvs",
    "image_two": "https://images.luxuryescapes.com/4xv93ruk5drroxih3ewg",
    "image_three": "https://images.luxuryescapes.com/xnbqh34tjg53u13vnp",
    "vendor_name": "Grand Hotel Admiral Slano",
    "title": "Croatian Beachfront Luxury with Fabulous Dining Inclusions",
    "description": "Picture yourself lounging on a Croatian beach with nothing but the Adriatic Sea out in front of you and all of the charms of ancient Dubrovnik within easy reach. Enjoy the ultimate European beachside getaway staying on an untouched bay at the Admiral Grand Hotel - Slano and enjoy daily breakfast, nightly buffet dinners, a bottle of wine and a 10% discount on spa treatments. Starting planning your 2020 European summer getaway now!",
    "offer_country_name": "Croatia",
    "offer_country_code_alpha_2": "HR",
    "offer_geo_area_level_1": "Dubrovnik-Neretva",
    "offer_geo_area_level_2": "Dubrovacko Primorje",
    "location_heading": "Slano",
    "location_subheading": "Croatia",
    "location_description": "Grand Hotel Admiral - Slano (2019)",
    "offer_address": "Ruđera Boškovića bb, 20232, Slano, Croatia",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 454.0,
    "value": 1066.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C2256AAB",
    "hero_image": "https://images.luxuryescapes.com/ayno4z4nyhynsuljr7r7",
    "image_two": "https://images.luxuryescapes.com/bkafcxssmtc8854ofyr",
    "image_three": "https://images.luxuryescapes.com/rqpi4cg6l38nw5ka4l0vd",
    "vendor_name": "Grand Hotel Admiral Slano",
    "title": "Croatia Secluded Beachfront Luxury near Dubrovnik with Daily Breakfast & Nightly Dinner",
    "description": "Discover the unbelievable beauty of Croatia's Dubrovnik Riviera with a sensational stay at Admiral Grand Hotel, a luxury oasis nestled in an untouched bay in the charming harbourside village of Slano. This beautiful hotel has a private beach and is ideally located for leaving the hustle and bustle behind as you embrace the coastal serenity of this picturesque part of the world. Perched overlooking the azure waters of Luka Slano, spend your days lazing poolside, lounging on the beach, exploring the lush Mediterranean countryside, unwinding at the onsite spa, practicing your serve on one of three tennis courts or eating your fill at the multiple restaurants and bars scattered around the hotel.",
    "offer_country_name": "Croatia",
    "offer_country_code_alpha_2": "HR",
    "offer_geo_area_level_1": "Dubrovnik-Neretva",
    "offer_geo_area_level_2": "Dubrovacko Primorje",
    "location_heading": "Slano",
    "location_subheading": "Croatia",
    "location_description": "Admiral Grand Hotel",
    "offer_address": "Trg Ruđera Boskovica, 20232, Slano, Croatia",
    "percentage_discount": 36.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 472.0,
    "value": 742.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070f7xAAA",
    "hero_image": "https://images.luxuryescapes.com/2dagtaur7ike7dz93v0w",
    "image_two": "https://images.luxuryescapes.com/1cyq3o74ljzb0xth8kc",
    "image_three": "https://images.luxuryescapes.com/km3btre0nl21nqynsmcf",
    "vendor_name": "Grand Hotel Admiral Slano",
    "title": "Secluded Beachfront Luxury near Dubrovnik with Daily Breakfast & Nightly Dinner",
    "description": "Discover the raw beauty of Croatia's Dubrovnik Riviera with a glamorous stay at the Admiral Grand Hotel, a luxury oasis nestled in an untouched bay in the charming harbourside village of Slano. This stunning hotel has a private beach and is ideally located for leaving the hustle and bustle behind as you embrace the serenity of this picturesque part of the world.\n\nUnwind amid azure waters, verdant hillsides, and rugged coastline, with days spent lazing poolside, lounging on the beach, exploring the lush Mediterranean countryside, discovering UNESCO-listed sites such as the Old City of Dubrovnik, and tasting local gourmet cuisine. That is if you can tear yourself away from the hotel, which features an onsite spa, indoor and outdoor pool, and multiple restaurants and bars.",
    "offer_country_name": "Croatia",
    "offer_country_code_alpha_2": "HR",
    "offer_geo_area_level_1": "Dubrovnik-Neretva",
    "offer_geo_area_level_2": "Dubrovacko Primorje",
    "location_heading": "Slano",
    "location_subheading": "Croatia",
    "location_description": "Admiral Grand Hotel",
    "offer_address": "Trg Ruđera Boskovica, 20232, Slano, Croatia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 332.0,
    "value": 613.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zgcYAAQ",
    "hero_image": "https://images.luxuryescapes.com/z9l6cmv07cj6t98xayb5",
    "image_two": "https://images.luxuryescapes.com/1p2b35vfrwtfdn417t9l",
    "image_three": "https://images.luxuryescapes.com/w7vwk37doo8oms95dti4",
    "vendor_name": "Grand Hotel Admiral Slano",
    "title": "Croatia Beachfront Luxury with Daily Breakfast & Nightly Dinner",
    "description": "Discover the raw beauty of Croatia's Dubrovnik Riviera with a glamorous stay at the Admiral Grand Hotel, a luxury oasis nestled in an untouched bay in the charming harbourside village of Slano. This award-winning hotel - the recipient of a Tripadvisor Travellers' Choice 2020 Award - comes complete with a private beach, and is ideally located for leaving the hustle and bustle behind as you embrace the serenity of this picturesque part of the world.\n\nAmid azure waters, verdant hillsides and rugged coastline, days here are spent lazing poolside, lounging on the beach, exploring the lush Mediterranean countryside, discovering UNESCO-listed monuments and tasting local gourmet cuisine. That is if you can tear yourself away from the hotel, which features an onsite spa, indoor and outdoor pool and multiple restaurants and bars.\n\n**Your handpicked inclusions:**\n\n- Start each day with breakfast served in the hotel's restaurant\n- End each evening with a delicious dinner served in the hotel's restaurant\n- Celebrate your escape with a welcome bottle of wine on arrival\n- Unwind with a 20% discount on relaxing treatments at the hotel's spa\n\n**Suite Upgrade**: Enjoy the luxury of more space to unwind in the Junior Suite Sea Side with Balcony, a spacious waterside abode with tranquil sea vistas and a separate living and dining room.\n\n**Book with 100% Confidence:** If for whatever reason you don’t want to go on your holiday, you can cancel right up to 14 days before check-in and get a 100% credit to use at Luxury Escapes for any other accommodation offer. Excludes flights, see the Fine Print for details.",
    "offer_country_name": "Croatia",
    "offer_country_code_alpha_2": "HR",
    "offer_geo_area_level_1": "Dubrovnik-Neretva",
    "offer_geo_area_level_2": "Dubrovacko Primorje",
    "location_heading": "Slano",
    "location_subheading": "Croatia",
    "location_description": "Grand Hotel Admiral Old",
    "offer_address": "Trg Ruđera Boškovića, 20232, Slano, Croatia",
    "percentage_discount": 40.0,
    "min_duration": 3,
    "max_duration": 21,
    "price": 332.0,
    "value": 553.0
  }
]