[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005IQFaAAO",
    "hero_image": "https://images.luxuryescapes.com/t7j30f962iskqvrl9y2i",
    "image_two": "https://images.luxuryescapes.com/lvs4t6cqlr87ha8hxkq",
    "image_three": "https://images.luxuryescapes.com/bp31321mj81o3u8ch6mt",
    "vendor_name": "AX The Victoria Hotel",
    "title": "Heritage-Luxe Malta Stay in the Heart of Sliema with Rooftop Pool",
    "description": "Malta may be small - but a stay at AX The Victoria Hotel will soon prove there is more to this Mediterranean haven than meets the eye. Stay in the heart of Sliema and discover its fascinating ancient history, compelling culture, flawless natural beauty and myriad hidden treasures. A typical day in this charming coastal town may begin with sweeping sea vistas at Upper Barrakka Gardens, followed by sightseeing at St. John's Co-Cathedral and the surrounding ancient forts, finishing with dinner at the Grand Harbour.\n\nTucked away in the highly sought-after coastal town of Sliema, this top-rated hotel is characterised by contemporary touches, yet wholeheartedly honours the Victorian style that previously dominated the surrounding area. It sits less than two kilometres from the seafront and main promenade, where you will find an abundance of bars, restaurants and designer outlets. After days spent exploring, return to revitalising treatments at the spa or a cocktail by the city-view rooftop pool before dinner at the onsite restaurant.",
    "offer_country_name": "Malta",
    "offer_country_code_alpha_2": "MT",
    "offer_geo_area_level_1": "Central Region",
    "offer_geo_area_level_2": "Sliema",
    "location_heading": "Sliema",
    "location_subheading": "Malta",
    "location_description": "AX The Victoria Hotel",
    "offer_address": "Gorg Borg Olivier Street Sliema, SLM 1807, Malta",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 86.0,
    "value": 86.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I8ZBAA0",
    "hero_image": "https://images.luxuryescapes.com/e6empblilv93kzkf9i6b",
    "image_two": "https://images.luxuryescapes.com/u4c4n8oxicjn1xvjg9wg",
    "image_three": "https://images.luxuryescapes.com/ji0c0io8cpxwzgv9l72g",
    "vendor_name": "AX The Palace",
    "title": "Five-Star Harbour-View Malta Luxury with Rooftop Infinity Pool",
    "description": "Stay in the heart of Malta's upmarket Sliema resort town while relaxing in contemporary, five-star luxury at the stylish AX The Palace. With designer décor, superb dining options and a laidback-chic vibe, this is the perfect mix of comfort and charm. Spectacular views of the town, Mediterranean Sea and Valletta Grand Harbour can be admired from most rooms and public spaces. Dine at a handful of excellent venues; whether you’re craving Asian fusion, Mediterranean-inspired street food or coffee and burgers, you’ll find something that satisfies your tastebuds here. For a relaxed summer evening, head up to Lounge 360, the panoramic rooftop terrace with a gorgeous infinity pool, where you can enjoy a handcrafted cocktail with a side of breathtaking vistas.\n\nYou can’t beat Sliema’s urban beachside location. AX The Palace is only minutes from the waterfront, where you’ll find restaurants, bars and cafés lined up along a coastline that’s perfect for swimming. Enjoy a warm summer’s night strolling along the promenade, while days can be spent exploring the historic sites of Valletta, only a 10-minute ferry across the harbour.",
    "offer_country_name": "Malta",
    "offer_country_code_alpha_2": "MT",
    "offer_geo_area_level_1": "Central Region",
    "offer_geo_area_level_2": "Sliema",
    "location_heading": "Sliema",
    "location_subheading": "Malta",
    "location_description": "AX The Palace",
    "offer_address": "Triq il-Kbira Sliema, SLM 1542, Malta",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 108.0,
    "value": 108.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005IQDAAA4",
    "hero_image": "https://images.luxuryescapes.com/hd3w0ygh0gjjww53shij",
    "image_two": "https://images.luxuryescapes.com/iv0wig2umshrvkn8mzbf",
    "image_three": "https://images.luxuryescapes.com/ylytj8gogau2bmnwyfo",
    "vendor_name": "AX Palazzo Capua",
    "title": "Romantic Five-Star Suites on Malta’s East Coast",
    "description": "Setting a new benchmark in luxury, AX Palazzo Capua delivers romance and opulence in a 200-year-old landmark Maltese building - one of the oldest and finest buildings in Sliema. This picturesque resort town on Malta's East Coast offers charm in abundance, from its waterfront promenade to the baroque architecture and ancient forts.\n\nMarrying exclusivity with comfort, AX Palazzo Capua invites you to explore this once quiet fishing village, then bliss out in prestigious palatial surrounds. Ascend to the rooftop pool to drink in the breathtaking panoramic views, indulge in global fare courtesy of the palazzo’s two adjoining sister hotels (offering everything from pub classics to high-end Asian cuisine), work out in the state-of-the-art fitness centre or be pampered at the onsite spa. With the best of the town on your doorstep, you'll be truly spoilt for choice.",
    "offer_country_name": "Malta",
    "offer_country_code_alpha_2": "MT",
    "offer_geo_area_level_1": "Central Region",
    "offer_geo_area_level_2": "Sliema",
    "location_heading": "Sliema",
    "location_subheading": "Malta",
    "location_description": "AX Palazzo Capua",
    "offer_address": "George Borg Olivier St, Sliema SLM 1807, Malta",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]