[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005I7CEAA0",
    "hero_image": "https://images.luxuryescapes.com/5t1r7915fed00o81s11p",
    "image_two": "https://images.luxuryescapes.com/3spd56svo9p3il8n92pl",
    "image_three": "https://images.luxuryescapes.com/jrlkc0p8hiocvqf08kl",
    "vendor_name": "DoubleTree Resort by Hilton Hotel Fiji - Sonaisali Island",
    "title": "DoubleTree by Hilton Fiji Beachfront Resort with All-Inclusive Dining, Nightly Sunset Drinks & Roundtrip International Flights with Fiji Airways for Two Adults",
    "description": "Succumb to a world of sophistication with a blissful stay at DoubleTree Resort by Hilton Hotel Fiji - Sonaisali Island, a hideaway just 300 metres off the mainland of Viti Levu, offering exquisite views from the beachfront towards the picturesque Mamanuca archipelago. Tucked away on a causeway only 30 minutes from Nadi and Port Denarau, where cruises depart daily to Yasawa Island, the resort is perfectly poised for blissful seclusion, island hopping and renowned DoubleTree by Hilton service.\n\nAs the first DoubleTree by Hilton-branded hotel in the South Pacific nation, this flagship property offers guests impeccable facilities. From the lavish full-service spa, private untouched beach and lagoon-style swimming pool (with swim-up bar service) to à la carte dining with themed nights and live entertainment at Vulani restaurant, and the expert chefs preparing BBQ-style pool and beachfront dishes at Tavu Bar and Grill, this sunkissed resort will leave you spoiled for choice.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Sonaisali Island",
    "location_heading": "Sonaisali Island",
    "location_subheading": "Fiji",
    "location_description": "DoubleTree Resort by Hilton Hotel Fiji - Sonaisali Island",
    "offer_address": "Naisali Island, Sonaisali, Fiji Nadi 0000 Fiji",
    "percentage_discount": 0.0,
    "min_duration": 5,
    "max_duration": 16,
    "price": 846.0,
    "value": 0.0
  }
]