[
  {
    "link": "https://luxuryescapes.com/offer/006RF00000IbCO1YAN",
    "hero_image": "https://images.luxuryescapes.com/gpry6jtf6kqoe9plzhub",
    "image_two": "https://images.luxuryescapes.com/3sk4v65kzxt2u20j8bj",
    "image_three": "https://images.luxuryescapes.com/255k7k9r0s0g9ny3qsm",
    "vendor_name": "Angsana Velavaru",
    "title": "Maldives All-Inclusive Villas with Unlimited Free-Flow Drinks & Roundtrip Seaplane Transfers",
    "description": "Step into a world of laidback luxury and all-inclusive indulgence at this stunning villa-only retreat set on a turquoise lagoon in the untouched South Nilandhe Atoll. Whether you choose a beachfront villa surrounded by lush palms, an overwater sanctuary with direct lagoon access or a blend of both, each space is thoughtfully designed for uninterrupted relaxation.\n\nHere, the days are yours to shape. Savour daily meals across a variety of venues - from beachfront buffets at Kaani Restaurant to poolside delights at Kuredhi Pool Bar. Enjoy daily afternoon tea, and sip your way through free-flow cocktails and drinks served throughout the day.\n\nWhen adventure calls, dive into vibrant marine life with complimentary snorkelling gear, paddle across the lagoon or explore over 30 nearby dive sites with expert guidance from the PADI five-star Gold Dive Centre.\n\nKids can join in the fun at the lively Rangers’ Club, while adults unwind with open-air spa rituals at Angsana Spa - offering a remedy for every need - or take a refreshing dip in the sparkling infinity pool framed by white sandy shores and loungers. With seamless roundtrip seaplane transfers included, your unforgettable Maldivian escape begins the moment you land.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Velavaru",
    "location_heading": "South Nilandhe Atoll",
    "location_subheading": "Maldives",
    "location_description": "Angsana Velavaru",
    "offer_address": "South Nilandhe Atoll, Velavaru Island, Malé 20177, Maldives",
    "percentage_discount": 55.0,
    "min_duration": 5,
    "max_duration": 20,
    "price": 2519.0,
    "value": 5565.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UREfAAO",
    "hero_image": "https://images.luxuryescapes.com/r2lrlv4vbfrt3i8mem1r",
    "image_two": "https://images.luxuryescapes.com/5zfhyp3ms8hd31deu2g",
    "image_three": "https://images.luxuryescapes.com/6t0t2sg07891o4eyn8nd",
    "vendor_name": "Angsana Velavaru",
    "title": "Five-Star Maldives Escape on Secluded Turtle Island",
    "description": "Plunge into the sparkling waters of the Maldives' Turtle Island from the ultra-glamorous five-star island paradise that is Angsana Velavaru. Evoking a sweet sense of seclusion and serenity, this untouched haven boasts a heavenly spa, five indulgent eateries and a world-class marine centre. With splashes of colour, jazzy wall art and traditional cajan huts, this quintessential Maldivian retreat is guaranteed to enthral.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Velavaru",
    "location_heading": "South Nilandhe Atoll",
    "location_subheading": "Maldives",
    "location_description": "Angsana Velavaru",
    "offer_address": "South Nilandhe Atoll, Velavaru Island, Malé 20177, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 362.0,
    "value": 362.0
  }
]