[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004i8ZZAAY",
    "hero_image": "https://images.luxuryescapes.com/4162wkhncpdacmuitcc",
    "image_two": "https://images.luxuryescapes.com/k1ydkgfsqrrjtxq13pk",
    "image_three": "https://images.luxuryescapes.com/sfp0uk5cboybu3n90z",
    "vendor_name": "Quickenberry Lodge",
    "title": "New Zealand Southern Alps Lodge Serenity with Daily Breakfast & Gourmet Four-Course Dinner",
    "description": "Leave it all behind for the breathtaking natural splendour of New Zealand’s Southern Alps, where Quickenberry Lodge awaits to welcome you. Nestled in the foothills of Canterbury, this boutique lodge is surrounded by rolling green hills, snow-dusted mountains and paddocks of grazing sheep - all just an hour from the attractions of Christchurch and Mt Hutt Ski Area.\n\nAfter making the most of the great outdoors, return to this cosy four-room lodge to relax beside the crackling fire with a book and glass of wine. Nurture yourself with freshly prepared dishes crafted using premium New Zealand produce, from lamb and salmon to summer vegetables and herbs from the lodge’s own garden. Whether you choose to embrace nature and revel in the stillness or immerse yourself in the South Island’s adrenaline-fuelled adventure scene, you’ll have the perfect base to return to at Quickenberry Lodge.\n\n**Your handpicked inclusions**:\n\n- Prepare for Southern Alps adventures with daily cooked breakfast\n- Enjoy a gourmet four-course dinner for two on your day of arrival\n- Toast your stay with a welcome drink each on arrival\n- Make the most of guaranteed 12pm late checkout\n\n**This deal has NO surcharges** - travel any time you like, for the same great price.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Canterbury",
    "offer_geo_area_level_2": "Windwhistle",
    "location_heading": "Southern Alps",
    "location_subheading": "New Zealand",
    "location_description": "Quickenberry Lodge",
    "offer_address": "Coleridge Road, Terrace Downs, Methven/Mt Hutt 7572, New Zealand",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 10,
    "price": 299.0,
    "value": 461.0
  }
]