[
  {
    "link": "https://luxuryescapes.com/offer/0062y000008J06oAAC",
    "hero_image": "https://images.luxuryescapes.com/vso6k4ftf03uhe5d25",
    "image_two": "https://images.luxuryescapes.com/opur6x0trglia4spgs9m",
    "image_three": "https://images.luxuryescapes.com/a8cdw63mhxrf066u7vs",
    "vendor_name": "Olive + July",
    "title": "South Perth: Two-Hour Bespoke Relaxation Spa Package with Infrared Sauna, Full-Body Massage, Facial & Fruit Platter",
    "description": "Surrender to a blissful journey of relaxation and holistic therapies that starts from the moment you walk into the stunning white marbled day spa at Olive + July, South Perth. The warm neutral tones and textures of the decor add to the essence of purity that aligns with the company's ethos. The old heritage building is adorned with glorious stained glass windows as well as regional artworks and statues that you pass by as you're escorted down to the locker room. This exclusive day spa boasts seven treatment rooms and is well equipped with the latest beauty therapy treatments for your experience.\n\nSlip into your robe as you begin your tailored wellbeing treatments, performed by a team of highly trained beauty therapists. Using only the highest-quality skincare products, each treatment is designed to promote skin rejuvenation, accelerate cell cycle turnover and leave you feeling fully recharged. Enjoy a restorative infrared sauna experience, followed by a relaxing 60-minute full-body massage, targeting the muscles through soothing, rhythmical movements. Finally, boost hydration, eliminate toxins and nourish your complexion with a 30-minute Hydro Glow facial treatment - designed to activate your radiance. At the latter stage of your experience, you'll move into the aptly named, 'Relaxation Room' which features a built-in skylight, for hot tea and a refreshing fruit platter to enjoy at your own pace.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Western Australia",
    "offer_geo_area_level_2": "Perth",
    "location_heading": "South Perth",
    "location_subheading": "Western Australia",
    "location_description": "Olive + July",
    "offer_address": "28 Charles Street",
    "percentage_discount": 12.0,
    "min_duration": 1,
    "max_duration": 1,
    "price": 149.0,
    "value": 169.0
  }
]