[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005HowkAAC",
    "hero_image": "https://images.luxuryescapes.com/a1gifzwk7sl87u6qe1dr",
    "image_two": "https://images.luxuryescapes.com/ajtkbdvftwwcgk789jj",
    "image_three": "https://images.luxuryescapes.com/epotyt6gnmgav8z19gv7",
    "vendor_name": "South Golden Beach Abode",
    "title": "Blissful Mediterranean-Style Villa Escape near Byron Bay for up to 10 Guests",
    "description": "An escape from everyday life beckons on the shores of South Golden Beach in Northern New South Wales with a boutique stay at South Golden Beach Abode - a striking, Mediterranean-inspired, five-bedroom villa sleeping up to 10 guests, surrounded by fragrant gardens. With an enviable location just 30 minutes from both Byron Bay and the Gold Coast Airport, this boutique home is ideally nestled a short distance from the very best the area has on offer. Head north and you’ll reach blissful Cabarita Beach, Coolangatta and the Gold Coast, or venture south and immerse yourself in the laidback vibes of Byron Bay.\n\nLive like a local in this beautifully designed haven for up to 10 people, complete with a fully furnished alfresco area, five private bedrooms, three bathrooms, two kitchens, a BBQ and a wood-fire pizza oven, perfect for embracing the balmy weather. And when you're ready to unwind by the ocean, the champagne sands of South Golden Beach are just a two-minute stroll from your private sanctuary.\n\n**Your handpicked inclusions:**\n\n- Enjoy a breakfast hamper on arrival filled with local produce, cheeses, fresh eggs, muesli, fresh fruit and more delicacies\n- Toast your escape with a bottle of sparkling wine on arrival\n- Dine out with A$100 credit per package to be spent at Brunswick Pasta Bar in Brunswick Heads\n- Sleep in with leisurely 12pm late checkout on your final day, subject to availability\n- Have a stress-free stay with cleaning fee included in your package",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "South Golden Beach",
    "location_heading": "South Golden Beach",
    "location_subheading": "New South Wales",
    "location_description": "South Golden Beach Abode",
    "offer_address": "13 Peter Street, Ocean Shores, NSW, 2482",
    "percentage_discount": 29.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 1599.0,
    "value": 2262.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003dnQuAAI",
    "hero_image": "https://images.luxuryescapes.com/uzb039totpyt1m14ib75",
    "image_two": "https://images.luxuryescapes.com/7yi3podebq59y5e0mmg9",
    "image_three": "https://images.luxuryescapes.com/he1wcp036me9x5keti61",
    "vendor_name": "South Golden Beach Abode",
    "title": "Mediterranean-Style Villa Escape near Byron Bay for up to 10 Guests",
    "description": "Get a taste of the Mediterranean on the shores of Northern New South Wales with a boutique stay at South Golden Beach Abode - a striking five-bedroom villa sleeping up to 10 guests, surrounded by fragrant gardens.\n\nWith an enviable location at South Golden Beach, just 30 minutes north of Byron Bay and a 30-minute drive from Gold Coast Airport, this boutique home will place you a short drive away from the very best the area has on offer. Head north and you’ll reach blissful Cabarita Beach, Coolangatta and the Gold Coast, or head south and you’ll be able to immerse yourself in the laidback vibes of Byron Bay. When you're ready to unwind by the ocean, the champagne sands of South Golden Beach are just a two-minute stroll from your private sanctuary.\n\nLive like a local in this exceptional home, a beautifully designed haven for up to 10 people complete with a fully furnished alfresco area with a BBQ and wood-fire pizza oven, perfect for embracing the balmy weather.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "South Golden Beach",
    "location_heading": "South Golden Beach",
    "location_subheading": "New South Wales",
    "location_description": "South Golden Beach Abode",
    "offer_address": "13 Peter Street, Ocean Shores, NSW, 2482",
    "percentage_discount": 37.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 1499.0,
    "value": 2361.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006xw86AAA",
    "hero_image": "https://images.luxuryescapes.com/tkouh9f08gj97nharcz",
    "image_two": "https://images.luxuryescapes.com/o9oqv155c05mmsrw6hm",
    "image_three": "https://images.luxuryescapes.com/z3yxqomxiex31ziqfrc",
    "vendor_name": "South Golden Beach Abode",
    "title": "Blissful Mediterranean-Style Villa Escape near Byron Bay for up to 10 Guests",
    "description": "Get that Mediterranean-style beach holiday feeling at South Golden Beach Abode, a boutique five-bedroom villa that sleeps up to 10 guests in Northern New South Wales. Recently renovated, this stylish home is flooded with natural light and designed with beach-chic in mind. It features three bathrooms, three spacious living areas and two ultra-modern kitchens. Meanwhile, the outdoor areas are perfect for enjoying sunny days and balmy nights: unwind in the alfresco dining area with a glass of wine, make use of the BBQ facilities for a lunchtime cook up and gather to make homemade pizza with the outdoor pizza oven in true Mediterranean-style with family and friends for a long, leisurely dinner.\n\nWhen you’re ready to tear yourself away from your blissful haven, follow the sounds of crashing waves to the dog-friendly South Golden Beach, an easy two-minute walk away. Head north and you’ll reach the serene shores of Cabarita Beach, Coolangatta and the Gold Coast, or make your way 30 minutes south and immerse yourself in the laidback vibes of Byron Bay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "South Golden Beach",
    "location_heading": "South Golden Beach",
    "location_subheading": "New South Wales",
    "location_description": "South Golden Beach Abode",
    "offer_address": "13 Peter Street, Ocean Shores, NSW, 2482",
    "percentage_discount": 29.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 1549.0,
    "value": 2192.0
  }
]