[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMsXRAA1",
    "hero_image": "https://images.luxuryescapes.com/hhe7faqak7qjkc0ed79",
    "image_two": "https://images.luxuryescapes.com/l681yqkmeqp1skq3rw3p",
    "image_three": "https://images.luxuryescapes.com/hp8xst7ywjpsbsap18z",
    "vendor_name": "The Elandra, Mission Beach",
    "title": "Grand Opening: Adults-Only Mission Beach Clifftop Luxury with Daily Breakfast & Nightly Drinks Just Two Hours from Cairns",
    "description": "Step from the rainforest canopy to sun-kissed sands and savour every moment in paradise: this is your invitation to discover new heights of adults-only luxury at this brand-new clifftop boutique hideaway, operated by the team behind the acclaimed Bedarra Island Resort and perfectly positioned just two hours from Cairns above Tropical North Queensland’s spectacular Mission Beach.\n\nDine al fresco on freshly caught seafood and modern Australian cuisine on the resort’s shaded pool deck, or watch the day amble gently by with an ice-cold beer or a spritz at the bar. With dining credit included in your package, you’ll be all set to sample the region’s finest, surrounded by unrivalled views of Mission Beach and its surrounding islands.\n\nWhen you're ready to explore, there are lazy palms, secret waterholes, and Great Barrier Reef adventures in abundance, while endangered cassowaries wander gently along the shore. Return from explorations afield to exceptional hospitality and a design-led abode - one of the resort’s 20 boutique rooms - with magnificent views over the Coral Sea.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "South Mission Beach",
    "location_heading": "South Mission Beach",
    "location_subheading": "Queensland",
    "location_description": "The Elandra, Mission Beach",
    "offer_address": "23 Explorers Drive, South Mission Beach, Queensland 4852, Australia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 609.0,
    "value": 1104.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Cz4KlYAJ",
    "hero_image": "https://images.luxuryescapes.com/nkdbmty9so7fbdvztz6",
    "image_two": "https://images.luxuryescapes.com/ad14jpp4s976xby2ema",
    "image_three": "https://images.luxuryescapes.com/m8owg2wc0c29jm8oq",
    "vendor_name": "The Elandra, Mission Beach",
    "title": "Adults-Only Mission Beach Clifftop Luxury with Coral Sea Views, Daily Breakfast & Nightly Drinks",
    "description": "Step out from the rainforest canopy onto sun-kissed sands and savour every moment in paradise: this is your invitation to discover new heights of luxury at this clifftop boutique hideaway. Operated by the team behind the acclaimed Bedarra Island Resort, this adults-only haven is perfectly positioned just two hours from Cairns and set within six hectares of private tropical rainforest.\n\nDine al fresco with freshly caught seafood and modern Australian cuisine on the resort’s shaded pool deck, or watch the day amble gently by with an ice-cold beer or a spritz at the bar. With a dining credit included in your package, you’ll be all set to sample the region’s finest, surrounded by unrivalled views of Mission Beach and its surrounding islands.\n\nWhen you're ready to explore, there are lazy palms, secret waterholes, and Great Barrier Reef adventures in abundance, while endangered cassowaries wander along the shore. Return from explorations afield to exceptional hospitality and a design-led abode - one of the resort’s 20 boutique rooms - with magnificent views over the Coral Sea.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "South Mission Beach",
    "location_heading": "South Mission Beach",
    "location_subheading": "Queensland",
    "location_description": "The Elandra, Mission Beach",
    "offer_address": "23 Explorers Drive, South Mission Beach, Queensland 4852, Australia",
    "percentage_discount": 37.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 619.0,
    "value": 976.0
  }
]