[
  {
    "link": "https://luxuryescapes.com/offer/0062y0000037J6HAAU",
    "hero_image": "https://images.luxuryescapes.com/ke74qn4qv2w332vzu9v",
    "image_two": "https://images.luxuryescapes.com/1o4h4pm990l6znhwl6h",
    "image_three": "https://images.luxuryescapes.com/kc2xuobzpgyoq8y4oesb",
    "vendor_name": "Park Hyatt St. Kitts",
    "title": "A-List Park Hyatt Caribbean Island Retreat with US$150 Dining Credit & Spa Discounts",
    "description": "Make like the jet-set elite and disconnect to reconnect with a luxurious stay at Park Hyatt St. Kitts Christophe Harbour, hidden away on one of Condé Nast Traveler’s 2020 ‘The Most Beautiful Islands in the Caribbean’. Tucked away in Banana Bay, near Cockleshell Bay Beach’s high-end restaurants and vibrant bars, this luxe hotel invites you to enjoy a stay that reflects the island's rich culture and lush landscape with sustainably designed architecture, contemporary sophistication and a beachfront location that taps into the island's historic roots\n\nExperience a stay that feels utterly secluded and exclusive, with free rein of the private beachfront, two beautiful swimming pools and access to three signature dining experiences at the island's #1 resort on TripAdvisor. Watch the sun melt into the warm depths of the turquoise Caribbean from the ocean-to-table Fisherman’s Village restaurant, be wined and dined in the adults-only Stone Barn restaurant or find tranquillity in Sugar Mill Spa & Sanctuary. Whatever your ideal escape, this one-of-a-kind oasis will deliver an A-list retreat.",
    "offer_country_name": "Saint Kitts and Nevis",
    "offer_country_code_alpha_2": "KN",
    "offer_geo_area_level_1": "Saint George Basseterre Parish",
    "offer_geo_area_level_2": "Basseterre",
    "location_heading": "St. Kitts",
    "location_subheading": "Caribbean Islands",
    "location_description": "Park Hyatt St. Kitts Christophe Harbour",
    "offer_address": "Banana Bay, South East Peninsula, Parish of St. George, St. Kitts, St. Kitts & Nevis",
    "percentage_discount": 20.0,
    "min_duration": 5,
    "max_duration": 15,
    "price": 1715.0,
    "value": 2156.0
  }
]