[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UIcIoQAL",
    "hero_image": "https://images.luxuryescapes.com/nkny7wxzgjl15ugil5ry",
    "image_two": "https://images.luxuryescapes.com/veny7p2rytcc8aplxeik",
    "image_three": "https://images.luxuryescapes.com/gv3eu8pvynkiidpqkpvr",
    "vendor_name": "Carlton Hotel St Moritz",
    "title": "Carlton Hotel St. Moritz, Switzerland",
    "description": "Welcome to the five-star Carlton Hotel in St. Moritz, Switzerland’s premier hotel - named the top ski resort in Europe by Condè Nast Traveler. Enjoy four nights in a lavish Junior Suite with butler service, private limousine service, daily Swiss buffet breakfast, over $100 credit per person per day to use toward food and beverages - including at the hotel's Michelin-starred restaurant. Also enjoy a complimentary minibar and discounted treatments at the 1,200sqm Carlton Spa and more for two.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Graubuenden",
    "offer_geo_area_level_2": "St. Moritz",
    "location_heading": "St. Moritz",
    "location_subheading": "Switzerland",
    "location_description": "Carlton Hotel St. Moritz",
    "offer_address": "Via Johannes Badrutt 11, 7500 St. Moritz, Switzerland",
    "percentage_discount": 39.0,
    "min_duration": 4,
    "max_duration": 8,
    "price": 2551.0,
    "value": 4165.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000dZq56QAC",
    "hero_image": "https://images.luxuryescapes.com/7nxyw24ptwczn2kov7d",
    "image_two": "https://images.luxuryescapes.com/155z6ov91wesgnj49j",
    "image_three": "https://images.luxuryescapes.com/t873bl8f25vxin3e55mm",
    "vendor_name": "Kempinski Grand Hotel des Bains St Moritz",
    "title": "Luxury Kempinski Stay in Switzerland’s Premier Ski Resort",
    "description": "Join the rich and famous for a glamorous stay in one of the world’s most luxurious ski resorts: St Moritz. Treat yourself to an unforgettable stay at the iconic Grand Hotel des Bains Kempinski St Moritz, housed in a historic building dating back to 1864, boasting five-star facilities, fine dining venues including a Michelin-starred restaurant and a 2,800sqm spa area. Your ultra-luxe winter escape includes daily buffet and à la carte breakfast, a welcome glass of Prosecco on arrival, a buffet or four-course dinner during your stay and complimentary access to the idyllic Spa.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Graubuenden",
    "offer_geo_area_level_2": "St. Moritz",
    "location_heading": "St. Moritz",
    "location_subheading": "Switzerland",
    "location_description": "Grand Hotel Des Bains Kempinski St. Moritz",
    "offer_address": "Via Mezdi 27, 7500 St. Moritz, Switzerland",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 9,
    "price": 2439.0,
    "value": 4872.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003GIRhAAO",
    "hero_image": "https://images.luxuryescapes.com/30uqciy73ns660gxwczf",
    "image_two": "https://images.luxuryescapes.com/258nctuhztatlsafb2w",
    "image_three": "https://images.luxuryescapes.com/rh095s4oygctje88m03h",
    "vendor_name": "Carlton Hotel St Moritz",
    "title": "Top-Rated Five-Star St. Moritz Ski Luxury with Daily Breakfast & Resort Credit",
    "description": "Discover an extravagant winter wonderland in the heart of the Swiss Alps at the Carlton Hotel St. Moritz, rated among the top 1% of hotels worldwide on Tripadvisor and part of the renowned Leading Hotels of the World group. Ski playground of celebrities and royalty, St. Moritz is home to some of Switzerland’s most picturesque landscapes and spectacular slopes. Ski bunnies will relish the resort's proximity to the pistes, but there's plenty to keep you entertained off the slopes too, with two fine-dining restaurants and a luxury spa.\n\nEach of the 60 Carlo Rampazzi-designed suites redefine alpine opulence, with palatial architecture and jaw-dropping vistas of the surrounding lake and mountains. The luxurious interiors are more than matched by the dining options on offer - the two-Michelin-starred Da Vittorio delivers hearty yet refined Italian delights, while Restaurant Romanoff looks after breakfast and dinner with both traditional dishes and international specialities. Before eating, pop into Carlton Bar & Lobby, identified by Forbes Travel as one of the world’s best hotel bars, for a cocktail or champagne, complete with gentle background music courtesy of a grand piano. Should the sun be shining, the Sun Terrace is the perfect place to watch the world go by with a cup of tea in hand. The Carlton Spa will relieve ski-fatigued muscles, with a sauna, gym, and indoor and outdoor pool. Mountain-inspired treatments range from anti-stress facials to Thai massage, all using 100% natural ingredients.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Graubuenden",
    "offer_geo_area_level_2": "St. Moritz",
    "location_heading": "St. Moritz",
    "location_subheading": "Switzerland",
    "location_description": "Carlton Hotel St. Moritz",
    "offer_address": "Via Johannes Badrutt 11, 7500 St. Moritz, Switzerland",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  }
]