[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006PyD1AAK",
    "hero_image": "https://images.luxuryescapes.com/6a78grrs0vp1qlygw2ka",
    "image_two": "https://images.luxuryescapes.com/i3n87wdsd6zn6s0x4v7u",
    "image_three": "https://images.luxuryescapes.com/241v6su3qu7khshjrg03",
    "vendor_name": "Corinthia St.Georges Bay",
    "title": "Malta Five-Star Oceanfront Luxury with Six Outdoor Pools",
    "description": "Uncover the magic of the Mediterranean with a stay at the stunning Corinthia St George's Bay in Malta, a Tripadvisor Travellers' Choice 2021 awarded, seafront resort. This sun-soaked hotel welcomes you with five-star elegance at every turn: pull up a sun lounger at one of the six superb outdoor swimming pools and enjoy the use of a private lido with direct ocean access. If you're feeling active, make your way to the watersports centre where paddleboarding, jet skis and private yacht hire is available. For a blissful escape from reality, schedule in a pampering treatment from Apollo by Dee Spa, where you can treat yourself to a dip in the jacuzzi or a soothing massage. When you're feeling peckish, there's eight restaurants and bars to choose from, serving everything from all-American grills to fresh seafood, Italian favourites and handcrafted cocktails.\n\nDon't miss out on exploring Malta's exquisite sites during your stay. Check out the luminous waters at Blue Grotto, only a 25-minute drive from the hotel. Or head to the breathtaking Dingli Cliffs, an easy 30-minute drive away. Right on the hotel's doorstep is a host of incredible beach bars, restaurants, the Bay Street shopping complex and Malta Casino, all conveniently located around St George's Bay.",
    "offer_country_name": "Malta",
    "offer_country_code_alpha_2": "MT",
    "offer_geo_area_level_1": "Central Region",
    "offer_geo_area_level_2": "St. Julian's",
    "location_heading": "St Julian's",
    "location_subheading": "Malta",
    "location_description": "Corinthia St George's Bay",
    "offer_address": "St George's Bay, St. Julian's STJ 3301, Malta",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]