[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006ziHXAAY",
    "hero_image": "https://images.luxuryescapes.com/arb6p3ewrogvfl7pbnl",
    "image_two": "https://images.luxuryescapes.com/mel1i2rg0faef9s86hi5",
    "image_three": "https://images.luxuryescapes.com/r0afa7zuck6g9yo7t0k",
    "vendor_name": "East Winds Resort Ltd",
    "title": "St Lucia All-Inclusive Beachfront Hideaway on Gros Islet",
    "description": "Discover a new level of all-inclusive luxury at East Winds on St Lucia's Gros Islet. Sitting on the shores of the breathtaking East Winds Beach, the boutique resort is a masterclass in tropical tranquility, surrounded by 12 acres of gardens and perfectly perched to admire some of St Lucia’s most sensational sunsets. With just 30 cottages, East Winds is an intimate escape within reach of the rest of St Lucia - the island’s main resort area, Rodney Bay Village, is just 10 minutes away.\n\nThe only finger you’ll be lifting is to turn the pages of your beachside book - every other element is covered by the welcoming and friendly staff. Wake to the sounds of lapping waters, before sauntering over to the oceanfront restaurant to explore the breakfast buffet. Spend your days swimming up to the pool bar for refreshments, take to the sea with the resort’s extensive selection of non-motorised watersports, or experience true relaxation at the open-air spa. Sip on a cocktail at one of the resort’s three bars as the sun sets, before returning to the main restaurant for dinner - with everything included, you can indulge for days on end.",
    "offer_country_name": "Saint Lucia",
    "offer_country_code_alpha_2": "LC",
    "offer_geo_area_level_1": "Gros Islet",
    "offer_geo_area_level_2": "Gros Islet",
    "location_heading": "St Lucia",
    "location_subheading": "Caribbean",
    "location_description": "East Winds",
    "offer_address": "La Brelotte Bay, Gros Islet, St Lucia",
    "percentage_discount": 0.0,
    "min_duration": 3,
    "max_duration": 29,
    "price": 2100.0,
    "value": 2100.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zWgyAAE",
    "hero_image": "https://images.luxuryescapes.com/bsi9cdkk7h0r1hque9og",
    "image_two": "https://images.luxuryescapes.com/k4z0wokzrgnbs6p90kgn",
    "image_three": "https://images.luxuryescapes.com/1s99i3ov27fw470mewon",
    "vendor_name": "Bay Gardens Beach Resort & Spa",
    "title": "Family-Friendly Beachfront St Lucia Escape with Island's Largest Water Park",
    "description": "Create lasting memories with family and friends at Bay Gardens Beach Resort & Spa, a relaxed resort on the sands of one of the best beaches in St Lucia. Located in Rodney Bay, in St Lucia’s north, and ranked within the top 10% of properties on Tripadvisor, the resort has something for everyone from adventure-seekers to spa savants, honeymooners, and families.\n\nFirst-class facilities stretch from the over-the-ocean Splash Island Water Park to the luxurious La Mer Spa. Laze by the lagoon-style pool, paddle around Rodney Bay with the hotel’s supply of stand-up paddleboards and kayaks, or stretch out with a yoga class. Embrace holistic remedies with Ayurvedic treatments while the little ones are entertained at Coral Kidz Club. However you spend your days, fresh flavours are a guarantee: local and international delicacies are on offer at the beachfront Hi Tide Restaurant, while SeaGrapes Beach Bar & Restaurant serves St Lucian seafood in a ‘barefoot beach’ setting.",
    "offer_country_name": "Saint Lucia",
    "offer_country_code_alpha_2": "LC",
    "offer_geo_area_level_1": "Gros Islet",
    "offer_geo_area_level_2": "Gros Islet",
    "location_heading": "St Lucia",
    "location_subheading": "Caribbean",
    "location_description": "Bay Gardens Beach Resort & Spa",
    "offer_address": "Rodney Bay, St. Lucia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 193.0,
    "value": 193.0
  }
]