[
  {
    "link": "https://luxuryescapes.com/offer/0062800000JiPF5AAN",
    "hero_image": "https://images.luxuryescapes.com/fuczfwss5m3o7un16rfr",
    "image_two": "https://images.luxuryescapes.com/gpwe6ok1tbymz1he5pxa",
    "image_three": "https://images.luxuryescapes.com/mlhumx2wbjhkwh1vnynf",
    "vendor_name": "Aspect Tamar Valley Resort",
    "title": "Country Escape in Tasmania's Famous Tamar Valley",
    "description": "Set off for an unforgettably unique holiday to Tasmania's sensational Tamar Valley. Stay four days/three nights at the charming Aspect Tamar Valley Resort and enjoy daily buffet breakfasts, welcome chocolates on arrival, spa credits, free entry to Seahorse World, late midday checkout, unlimited golf and mini golf, paddle boat hire, savings on local experiences and more. Only $299 for two adults, valued up to $782.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Grindelwald",
    "location_heading": "Tamar Valley",
    "location_subheading": "Tasmania",
    "location_description": "Aspect Tamar Valley Resort",
    "offer_address": "7 Waldhorn Drive Grindelwald, Tasmania",
    "percentage_discount": 62.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 199.0,
    "value": 527.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bPK2dQAG",
    "hero_image": "https://images.luxuryescapes.com/ovgcgote6xg1klmtsprn",
    "image_two": "https://images.luxuryescapes.com/lfkgpnhxgbi8iff4er1k",
    "image_three": "https://images.luxuryescapes.com/ak2gbektpdunmgcv0aai",
    "vendor_name": "Rosevears Hotel",
    "title": "Tasmanian Wine Country Escape Near Launceston",
    "description": "Experience the gourmet food, wine and natural beauty of Tasmania’s famous wine region, Tamar River, with a riverside escape at Rosevears Hotel, a 30-minute drive from Launceston Airport. Home to over 30 sprawling wineries, berry farms, local wildlife and secret beaches (where you can spot the world’s smallest penguin), this tranquil part of the world allows you to truly disconnect. Includes a complimentary Superior Room upgrade with romantic outdoor spa, a platter of local cheeses to share, a welcome drink on arrival and 20% off wine tours.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Rosevears",
    "location_heading": "Tamar Valley",
    "location_subheading": "Tasmania",
    "location_description": "Rosevears Hotel",
    "offer_address": "215 Rosevears Dr, Rosevears TAS 7277",
    "percentage_discount": 54.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 250.0,
    "value": 541.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zHGMAA2",
    "hero_image": "https://images.luxuryescapes.com/vuxyblya4qnra9h617nr",
    "image_two": "https://images.luxuryescapes.com/3yonaelxmt3uxadgx056",
    "image_three": "https://images.luxuryescapes.com/v1j5af6bfuebzvtqwg8f",
    "vendor_name": "Aspect Tamar Valley Resort",
    "title": "Charming Alpine-Inspired Tamar Valley Stay with Daily Breakfast & Round of Golf",
    "description": "Tucked away in the rolling hills of Northern Tasmania, surrounded by a serene golfing green, pretty vineyards and produce-led restaurants lies Aspect Tamar Valley Resort, a rustic, Alpine-inspired retreat less than 30 minutes from Launceston.\n\nA beguiling Swiss-style village feel pervades this unique resort, where you'll find 150 acres of verdant landscapes, a beautiful lakeside position and an intimate collection of cosy, timber-clad chalets, a shopping village and golfing green with a 10-hole course (and mini golf) onsite. Cocoon yourself here and relax with a slew of exquisite onsite facilities: melt away in the indoor heated pool, sauna or bubbly spa, practice your swing on the tennis courts and let the kids run free on the pirate ship playground.\n\nBeyond the serenity of this country-feel haven, the world-renowned Tamar Valley wine region beckons. Hire a pedal cart and race through the natural surrounds, get a ducks-eye view of the resort grounds on a paddleboat across the lake or stroll to the top of Tamarhorn Lookout for panoramic valley vistas. If you want to venture further afield, you could go berry-picking at nearby Hillwood Berry Farm or taste a tipple or two at one of the many surrounding vineyards.\n\n**Your handpicked inclusions**:\n\n- Fuel up for adventures with daily buffet breakfast at Alpenrose Bistro\n- Celebrate on arrival with a welcome glass of beer, wine or soft drink each\n- Explore until the very last moment with guaranteed 12pm checkout\n- One-time complimentary round of golf per person, including green fees and club hire\n- Enjoy A$25 dining credit per package, per stay, to spend at Alpenrose Bistro\n- Swing into your escape with unlimited mini golf throughout your stay\n\n**Travelling with family?** Upgrade to spacious Family Room for up to two adults and two children (12 and under).\n\n**Extended stay bonus**: Stay 4+ nights and receive two A$25 drink and dining credits per package, or five nights to receive three A$25 drink and dining credits per package.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Grindelwald",
    "location_heading": "Tamar Valley",
    "location_subheading": "Tasmania",
    "location_description": "Aspect Tamar Valley Resort",
    "offer_address": "7 Waldhorn Drive Grindelwald, Tasmania",
    "percentage_discount": 57.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 220.0,
    "value": 513.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Sy9PAAS",
    "hero_image": "https://images.luxuryescapes.com/0vvwryavnnstt43skau",
    "image_two": "https://images.luxuryescapes.com/j9t80ixzx8tz4g7q8na",
    "image_three": "https://images.luxuryescapes.com/ijjyhq3zqxlfeoow989",
    "vendor_name": "Rosevears Hotel",
    "title": "Tamar Valley Riverside Wine Lovers' Escape",
    "description": "Experience the gourmet food, wine and natural beauty of Tasmania’s Tamar Valley wine region with a riverside escape at Rosevears Hotel, a 30-minute drive from Launceston Airport. Home to sprawling wineries, berry farms and local wildlife, this tranquil part of the world allows you to truly disconnect.\n\nPerched on the edge of the Tamar River, this boutique property features just 26 rooms, allowing the attentive staff to offer impeccable service throughout your stay. Head to the hotel’s beer garden and deck to enjoy local wine or beer in front of the cosy log fire, and watch the world go by at the waterfront restaurant. The emphasis here is on fresh local food, with Tasmanian oysters, scallops and market fish on the menu. When you're ready to turn in, head to your cosy room with guaranteed river views from your private balcony.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Tasmania",
    "offer_geo_area_level_2": "Rosevears",
    "location_heading": "Tamar Valley",
    "location_subheading": "Tasmania",
    "location_description": "Rosevears Hotel",
    "offer_address": "215 Rosevears Dr, Rosevears TAS 7277",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 91.0,
    "value": 91.0
  }
]