[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zN1kAAE",
    "hero_image": "https://images.luxuryescapes.com/j2wrucx1ctg0yhoezx",
    "image_two": "https://images.luxuryescapes.com/hi194yii17fw2qoddwhi",
    "image_three": "https://images.luxuryescapes.com/w6slp3mrck7rcopih1iqg",
    "vendor_name": "Powerhouse Hotel Tamworth By Rydges",
    "title": "Five-Star Tamworth Luxury with Daily Breakfast & Welcome Cocktails",
    "description": "An escape to regional NSW doesn't get much better than a stay at the recently renovated Powerhouse Hotel Tamworth by Rydges in the heart of Tamworth. This sophisticated five-star property, ranked within the top 10% of properties on Tripadvisor, is on the site of a former power station and has been artfully reimagined with a A$12 million refresh as a luxury hotel that dials up the indulgence.\n\nThere's no shortage of things to do in Australia’s country music capital and while the city of Tamworth is famed for its annual country music festival, it's also renowned for its museums, cafés and restaurants  -  and as the gateway to breathtaking national parks and charming country towns. After a day of exploring, head back to your contemporary hotel and be wined and dined at The Workshop Kitchen (currently ranked in Tamworth's top three restaurants on Tripadvisor) or pull up a seat at the classy-cool Coal Bunker Bar. Take a dip in the swimming pool, relax at the spa or sauna, or hit the gym. This modern abode even has Tesla charging stations. With genuine hospitality and attentive service, luxurious rooms, suites, and serviced apartments that exude style, comfort and include the latest tech - this is the place you need to be in Tamworth.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tamworth",
    "location_heading": "Tamworth",
    "location_subheading": "New South Wales",
    "location_description": "Powerhouse Hotel Tamworth by Rydges",
    "offer_address": "248 Armidale Rd, East Tamworth, New South Wales 2340, Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 251.0,
    "value": 432.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006yNnyAAE",
    "hero_image": "https://images.luxuryescapes.com/fa3ohyz0e5z67y8c4vh",
    "image_two": "https://images.luxuryescapes.com/gry0maypgskwaz0wezf",
    "image_three": "https://images.luxuryescapes.com/zcr5yvzzqqs9llftuonr",
    "vendor_name": "Mercure Tamworth",
    "title": "Modern Mercure Tamworth Escape with Complimentary Room Upgrade & Daily Breakfast",
    "description": "With top-notch dining, picture-perfect landscapes and a thriving country music scene, Tamworth is sure to draw you in time and again - and there is no better place to stay than Mercure Tamworth. Just four kilometres from The Big Golden Guitar, with views of the picturesque mountains in the northwest, this exceptional property is the epitome of a modern stay. You'll find 52 meticulously designed rooms, two onsite restaurants, an outdoor pool, fitness centre, meeting rooms and parking at this gem in the heart of Tamworth. Directly connected to West Tamworth League Club, the hotel offers entertainment on your doorstep.\n\nGet to the city’s heart on tree-lined Peel Street, a bustling strip with cafés and shops, and visit the Tamworth Regional Gallery. No trip would be complete without boot scooting your way to The Big Golden Guitar and the National Guitar Museum. For adventures beyond the town, head to Oxley Scenic Lookout for stunning views across the region, or travel further to Barraba to admire the impressive Barraba Silo Art mural, The Water Diviner - a spectacular 40-metre-high artwork.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tamworth",
    "location_heading": "Tamworth",
    "location_subheading": "New South Wales",
    "location_description": "Mercure Tamworth",
    "offer_address": "Scully Park, Kent St, Tamworth NSW 2340 Australia",
    "percentage_discount": 35.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 223.0,
    "value": 343.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zIq4AAE",
    "hero_image": "https://images.luxuryescapes.com/m3lnchbdaxh9bhmcqdui",
    "image_two": "https://images.luxuryescapes.com/g9ivwrokbkqm0hrav6q6",
    "image_three": "https://images.luxuryescapes.com/qybww521c90kalz4uicc",
    "vendor_name": "Powerhouse Hotel Tamworth By Rydges",
    "title": "Award-Winning Tamworth Luxury with Daily Breakfast",
    "description": "Be introduced to award-winning excellence at Powerhouse Hotel Tamworth by Rydges, showcasing brand new looks following a spectacular $12 million renovation. Known as Australia's country music capital, Tamworth in regional New South Wales is famed for its annual country music festival and streets brimming with museums, cafés and restaurants. Experience an unparalleled stay at this sophisticated property that boasts first-class facilities including a multi-award-winning restaurant and bar, and offers genuine hospitality together with attentive service.\n\nIndulge in an escape worthy of Tripadvisor’s 2020 Travellers’ Choice Award with daily breakfast, a welcome cocktail per adult and a leisurely 12pm checkout. Plus, enjoy the VIP treatment with a Luxury Escapes Experience Passport, granting you special access to exclusive offers, such as two-for-one tastings at Dobson's Distillery and The Welder's Dog local brewery.\n\n**Wine & Dine Upgrade available:** Upgrade and add to the indulgence of this regional escape with a three-course, set menu dining experience for two at the award-winning The Workshop Kitchen, where each course will highlight premium local ingredients and will be perfectly paired with a matching glass of local wine or boutique beer.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tamworth",
    "location_heading": "Tamworth",
    "location_subheading": "New South Wales",
    "location_description": "Powerhouse Hotel Tamworth by Rydges",
    "offer_address": "248 Armidale Rd, East Tamworth, New South Wales 2340, Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 239.0,
    "value": 413.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004URN8AAO",
    "hero_image": "https://images.luxuryescapes.com/3eaepq8irqg3tk0rigdr",
    "image_two": "https://images.luxuryescapes.com/acqy8cc0i6laxcdqo0ywk",
    "image_three": "https://images.luxuryescapes.com/imrr7ocy5r2mqjc5jqw",
    "vendor_name": "Powerhouse Hotel Tamworth By Rydges",
    "title": "Award-Winning Tamworth Luxury with Daily Breakfast & Welcome Cocktails",
    "description": "Experience award-winning excellence at Powerhouse Hotel Tamworth by Rydges, showcasing a brand-new look following a spectacular A$12 million renovation. Set in the heart of NSW's charming regional city of Tamworth, this sophisticated five-star property is the winner of a Tripadvisor 2021 Travellers’ Choice Award. Also known as Australia’s country music capital, the city is famed for its annual country music festival and as the home of The Big Golden Guitar. It’s also renowned for its streets brimming with museums, cafés and restaurants and as the gateway to breathtaking national parks and charming country towns.\n\nThis former power station site has been artfully reimagined as a luxury hotel that dials up the indulgence. The contemporary refresh remains true to its elegant design, from the slick interiors of The Workshop Kitchen (currently ranked in Tamworth's top three restaurants on Tripadvisor) to the classy-cool Coal Bunker Bar and luxurious rooms, suites and serviced apartments that exude style, comfort and the latest tech. First-class facilities include a swimming pool, spa, sauna, BBQ, gym, guest laundry and Tesla charging stations. With genuine hospitality and attentive service, this is the only place to stay in Tamworth.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tamworth",
    "location_heading": "Tamworth",
    "location_subheading": "New South Wales",
    "location_description": "Powerhouse Hotel Tamworth by Rydges",
    "offer_address": "248 Armidale Rd, East Tamworth, New South Wales 2340, Australia",
    "percentage_discount": 42.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 251.0,
    "value": 432.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002zJD1AAM",
    "hero_image": "https://images.luxuryescapes.com/6bzmw2s6gxuilpqbnkr",
    "image_two": "https://images.luxuryescapes.com/2bvok3s0ldlsp9hf3l",
    "image_three": "https://images.luxuryescapes.com/upm59s7caipe6sc1muoo9",
    "vendor_name": "Powerhouse Hotel Tamworth By Rydges",
    "title": "Five-Star Stay in Country Music Capital Tamworth",
    "description": "Experience award-winning excellence at Powerhouse Hotel Tamworth by Rydges, showcasing a brand-new look following a spectacular A$12 million renovation. Enjoy an unparalleled stay at this sophisticated five-star property, winner of a Tripadvisor 2020 Travellers’ Choice Award and set in the heart of NSW's charming regional city of Tamworth. Also known as Australia’s country music capital, the city is famed for its annual country music festival and as the home of the Big Golden Guitar. It’s also renowned for its streets brimming with museums, cafes and restaurants and as the gateway to breathtaking national parks and charming country towns.\n\nOn the site of a former power station, the 81-room Powerhouse Tamworth has been artfully reimagined as a luxury hotel that dials up the indulgence. The contemporary refresh remains true to its elegant design, from the slick interiors of The Workshop Kitchen (ranked in Tamworth's top three restaurants on Tripadvisor) to the classy-cool Coal Bunker Bar and luxurious rooms, suites and serviced apartments that exude style, comfort and the latest tech. First-class facilities include an outdoor pool, spa, sauna, BBQ, gym, guest laundry and Tesla charging stations. With genuine hospitality and attentive service, this is the only place to stay in Tamworth.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tamworth",
    "location_heading": "Tamworth",
    "location_subheading": "New South Wales",
    "location_description": "Powerhouse Hotel Tamworth by Rydges",
    "offer_address": "248 Armidale Rd, East Tamworth, New South Wales 2340, Australia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 7,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004v1XJAAY",
    "hero_image": "https://images.luxuryescapes.com/r39eedibareyirbngc8u",
    "image_two": "https://images.luxuryescapes.com/gv0ux3falaqz7lwv5tk",
    "image_three": "https://images.luxuryescapes.com/w7vyja4owgsn0hlklqts",
    "vendor_name": "Powerhouse Hotel Tamworth By Rydges",
    "title": "Five-Star Tamworth Luxury with Top-Rated Restaurant",
    "description": "An escape to regional NSW doesn't get much better than a stay at Powerhouse Hotel Tamworth by Rydges, the region's only five-star property. After a day of exploring, head back to your hotel to be wined and dined at The Workshop Kitchen, one of Tamworth's top restaurants, or pull up a seat at the classy-cool Coal Bunker Bar. Take a dip in the swimming pool, relax at the spa or sauna, or hit the gym. This contemporary abode even has Tesla charging stations for the modern traveller.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tamworth",
    "location_heading": "Tamworth",
    "location_subheading": "New South Wales",
    "location_description": "Powerhouse Hotel Tamworth by Rydges",
    "offer_address": "248 Armidale Rd, East Tamworth, New South Wales 2340, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 140.0,
    "value": 140.0
  }
]