[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000daZGXQA2",
    "hero_image": "https://images.luxuryescapes.com/u12at07pisyf1967r3l",
    "image_two": "https://images.luxuryescapes.com/h015zswuh75fak8g77sa",
    "image_three": "https://images.luxuryescapes.com/7d3w06lfmuz68whecfv",
    "vendor_name": "Tanja Lagoon Camp",
    "title": "Safari-Style Glamping Overlooking the Coastal Tanja Lagoon",
    "description": "Offering coastal lagoon vistas and surrounded by the Spotted Gum forest of Mimosa Rocks National Park on the Sapphire Coast of NSW, immerse yourself in the rugged beauty of this eco-sanctuary at Tanja Lagoon Camp. Stay in a safari-style glamping tent over three or four-nights with all the mod cons, plus enjoy daily breakfast, a complimentary handmade Tilba cheese hamper and guaranteed 12pm late checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tanja",
    "location_heading": "Tanja",
    "location_subheading": "New South Wales",
    "location_description": "Tanja Lagoon Camp",
    "offer_address": "142 Haighs Rd, Tanja NSW 2550",
    "percentage_discount": null,
    "min_duration": 3,
    "max_duration": 4,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JUXqAAO",
    "hero_image": "https://images.luxuryescapes.com/6gdgo3nzd9de7h1mo6",
    "image_two": "https://images.luxuryescapes.com/8hyt0n8lko56ubj9ux3k",
    "image_three": "https://images.luxuryescapes.com/licpiuzz5agb88gkwrq",
    "vendor_name": "Tanja Lagoon Camp",
    "title": "Glamping Retreat on NSW's Sapphire Coast",
    "description": "When you want to get away from it all, without forgoing the comforts of home, head to Tanja Lagoon Camp for the ultimate glamping wilderness retreat in NSW’s Mimosa Rocks National Park. On the edge of a wild coastal lagoon, surrounded by serene spotted gum forest, this hideaway invites you to escape, relax and immerse yourself in nature within an hour's drive of Merimbula. Stay in tents that feature everything you need from a camping holiday and more: fully stocked kitchenettes, private ensuites and plush beds which make for a serene night's sleep. Enjoy canoeing and kayaking across the sparkling lagoon alongside the pelicans and swans or lace up your walking shoes and follow bushwalking tracks through spotted gums and cycads towards Middle Beach.\n\nAt night, the stargazing is spectacular - lay back and be mesmerised by the constellations and clear skies above. Come morning, is there anything better than waking up to the sounds of rustling trees, red-necked wallabies snuffling for food and the song of rainbow lorikeets?",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tanja",
    "location_heading": "Tanja",
    "location_subheading": "New South Wales",
    "location_description": "Tanja Lagoon Camp",
    "offer_address": "142 Haighs Rd, Tanja NSW 2550",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 302.0,
    "value": 302.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000005JUZmAAO",
    "hero_image": "https://images.luxuryescapes.com/duibnzdxedvs66vssfp",
    "image_two": "https://images.luxuryescapes.com/ul1brvj5kxgzzeu0zix5",
    "image_three": "https://images.luxuryescapes.com/03em2q4paom0lj1rr5i",
    "vendor_name": "Tanja Lagoon Camp",
    "title": "Glamping Retreat Steps from Mimosa Rocks National Park on NSW's Sapphire Coast",
    "description": "When you want to get away from it all, without forgoing the comforts of home, head to Tanja Lagoon Camp for the ultimate glamping wilderness retreat steps from NSW’s Mimosa Rocks National Park. On the edge of a wild coastal lagoon, surrounded by serene spotted gum forest, this hideaway invites you to escape, relax and immerse yourself in nature just 40 minutes from the coastal town of Merimbula.\n\nStay in spacious tents that feature everything you need from a luxurious camping escape: fully stocked kitchenettes, private ensuites, and plush beds for a serene night's sleep. Enjoy canoeing and kayaking across the sparkling lagoon alongside the pelicans and swans, or lace up your walking shoes and follow bushwalking tracks through spotted gums and cycads towards Middle Beach. At night, the stargazing is spectacular - lie back and be mesmerised by the constellations. Come morning, wake to the sounds of rustling trees, red-necked wallabies snuffling for food, and the song of rainbow lorikeets.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Tanja",
    "location_heading": "Tanja",
    "location_subheading": "New South Wales",
    "location_description": "Tanja Lagoon Camp",
    "offer_address": "142 Haighs Rd, Tanja NSW 2550",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 315.0,
    "value": 315.0
  }
]