[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zQSxAAM",
    "hero_image": "https://images.luxuryescapes.com/0cv01zv1oeiy7mvaarxe",
    "image_two": "https://images.luxuryescapes.com/z8rtvohnp7oujvjerhf2",
    "image_three": "https://images.luxuryescapes.com/mj909xk34g7l5xankn",
    "vendor_name": "The Oliver",
    "title": "Heritage Tennessee Escape in the Heart of Downtown Knoxville",
    "description": "Discover Knoxville’s vibrant Downtown precinct with a stay at The Oliver Hotel, a heritage property dating back to 1876. The hotel has had many faces - it’s been a bakery, a pharmacy and even an ice-cream parlour. Its 2011 renovations pay tribute to the history and soul of the area, with local artwork scattered throughout, while still giving the hotel a fresh, modern feel. The onsite Oliver Royale is a stylish dining hall serving up seasonal dishes with an extensive drinks menu, while the Peter Kern Library is Knoxville’s one and only speakeasy.\n\nStep out of The Oliver Hotel's front door and find yourself in the Downtown hub, Market Square. A mecca for craft beer, food, live music and art, this is the perfect base for your time in Knoxville. When you’re itching for open spaces and fresh air, the stunning Knoxville Urban Wilderness area is only a mile away: here, you’ll find pristine lakes, wildlife and an abundance of walking trails.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Tennessee",
    "offer_geo_area_level_2": "Knoxville",
    "location_heading": "Tennessee",
    "location_subheading": "USA",
    "location_description": "The Oliver Hotel",
    "offer_address": "407 Union Ave, Knoxville TN 37902 United States",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 22,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006zbPXAAY",
    "hero_image": "https://images.luxuryescapes.com/vtzfna8v6yktygxe3m",
    "image_two": "https://images.luxuryescapes.com/mnyz7bjeaeiur8ie6zi",
    "image_three": "https://images.luxuryescapes.com/vflp7hwv58ktslxw7rgh",
    "vendor_name": "The Hermitage Hotel",
    "title": "Downtown Nashville Heritage Luxury",
    "description": "Discover five-star indulgence with heritage flair at The Hermitage Hotel, a historic landmark drenched in old-world charm and ranked in the top 10% of hotels worldwide by Tripadvisor in 2021. Established in 1910, this charming hotel evokes the luxury and romance of a bygone era through its marble columns, ornate mirrors and original art. Stop in at the restaurant Drusie & Darr to enjoy a taste of Tennessee’s finest regional produce and enjoy a coffee and pastry at The Pink Hermit café, which transforms into a sultry wine bar by night. Sweat it out at the fitness centre, where Peloton bikes are at your disposal, or indulge and treat yourself to afternoon tea, available every Friday, Saturday and Sunday.\n\nThe Hermitage Hotel is ideally located in downtown Nashville, across from Tennessee State Capitol and Tennessee Performing Arts Center. Walk to an array of other city sights and enjoy a bounty of uber-cool bars and restaurants at your fingertips.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Tennessee",
    "offer_geo_area_level_2": "Nashville",
    "location_heading": "Tennessee",
    "location_subheading": "USA",
    "location_description": "The Hermitage Hotel",
    "offer_address": "231 6th Ave N, Nashville, TN 37219, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 22,
    "price": 524.0,
    "value": 524.0
  }
]