[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IeSzJAAV",
    "hero_image": "https://images.luxuryescapes.com/d9wzfmg8w9lfdji734dr",
    "image_two": "https://images.luxuryescapes.com/enu5vf2bdnr1hf3vc5bs",
    "image_three": "https://images.luxuryescapes.com/5mq6sq5vgm8jhzaitlr",
    "vendor_name": "COMO Maalifushi",
    "title": "COMO Maldives World-Class Private Island Resort with Daily Breakfast, Dinner, Drinks & Roundtrip Seaplane Transfers",
    "description": "This is the Maldives at its finest: unspoilt natural beauty, unrivalled tranquility and unparalleled luxury. From one of the world's best and most exclusive hotel brands, this COMO paradise is a destination like no other, and the first and only resort to open on the secluded Thaa Atoll. \n\nSurrounded by uninhabited islands, world-class surf breaks and thriving marine life, spend your days in paradise lounging next to your private pool, diving into the crystal-clear waters of the Indian Ocean and dining on exceptional cuisine. All the while, COMO's signature top-notch service elevates your stay, with warm and friendly staff committed to crafting an experience this is truly five-star. \n\nScuba-diving lovers will find Maalifushi's reef a step above the rest, with onsite PADI-approved courses and countless untouched secret reefs for divers of all levels. Those who prefer to stay above the water can lean into the luxury by chartering the resort's private yacht for a day of adventure.\n\nSpend your evenings admiring spectacular sunsets from the comfort of your sprawling accommodation - exquisitely crafted by renowned Japanese atelier Koichiro Ikebuchi - or seeking out whale sharks for a nighttime snorkelling experience. With a world-class stay at COMO's largest private island resort in the Maldives, it's easy to lose yourself in paradise.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Maalefushi",
    "location_heading": "Thaa Atoll",
    "location_subheading": "Maldives",
    "location_description": "COMO Maalifushi",
    "offer_address": "Thaa Atoll Maldives 00000, Maldives",
    "percentage_discount": 44.0,
    "min_duration": 5,
    "max_duration": 22,
    "price": 5489.0,
    "value": 9827.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GODzOAAX",
    "hero_image": "https://images.luxuryescapes.com/k17pjt0ghu3k036qpd9x",
    "image_two": "https://images.luxuryescapes.com/2fwdah4i2j0c6ufsb6h94v",
    "image_three": "https://images.luxuryescapes.com/m6fk0ytji2iitcq47j98r",
    "vendor_name": "COMO Maalifushi",
    "title": "COMO Maldives Boutique Private Island Retreat with Daily Breakfast, Nightly Cocktails & Roundtrip Domestic Seaplane Transfers",
    "description": "Discover unparalleled island opulence with a five-star stay at the acclaimed COMO Maalifushi, the first and only resort in the Maldives’ alluring Thaa Atoll. Awake each morning to the gentle murmur of the endless Indian Ocean and savour halcyon days filled with inimitable luxury - experience authentic Maldivian beachside dining at Madi, exquisite omakase and Japanese whisky at Tai or charter the resort’s private luxury yacht for unforgettable adventures in paradise. Spend early evenings admiring each spectacular sunset from the comfort of your sleek, lavishly furnished accommodation - exquisitely crafted by renowned Japanese atelier Koichiro Ikebuchi - or savour unforgettable evenings snorkelling with whale sharks.\n\nCOMO is renowned worldwide for tremendous hospitality, and backed by their signature top-notch service it's easy to lose yourself in paradise. Enjoy one of the Maldives' most exceptional surf spots, praise the sun with complimentary yoga classes or allow the resort's rotating guest mixologists to take you on a journey in modern cocktail magic. Scuba-diving lovers will find Maalifushi's reef a step above the rest, with onsite PADI-approved courses and countless untouched secret reefs for divers of all levels.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Maalefushi",
    "location_heading": "Thaa Atoll",
    "location_subheading": "Maldives",
    "location_description": "COMO Maalifushi",
    "offer_address": "Thaa Atoll Maldives 00000, Maldives",
    "percentage_discount": 46.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 5399.0,
    "value": 10077.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvzxwAAB",
    "hero_image": "https://images.luxuryescapes.com/i8wwq95s49fnlwyyjqws",
    "image_two": "https://images.luxuryescapes.com/lxe8ib1adinutarbyc1d",
    "image_three": "https://images.luxuryescapes.com/r4wzo64s0655ijs3l1xj",
    "vendor_name": "COMO Maalifushi",
    "title": "COMO Maldives Boutique Private Island Retreat with Daily Breakfast, Nightly Dinner & Roundtrip Domestic Seaplane Transfers",
    "description": "Discover unparalleled island opulence with a five-star stay at the acclaimed COMO Maalifushi, the first and only resort in the Maldives’ alluring Thaa Atoll. Awake each morning to the gentle murmur of the endless Indian Ocean and savour days filled with inimitable luxury. Experience authentic Maldivian beachside dining at Madi, exquisite omakase and Japanese whisky at Tai or charter the resort’s private luxury yacht for unforgettable adventures in paradise. Spend early evenings admiring each spectacular sunset from the comfort of your sleek, lavishly furnished accommodation - exquisitely crafted by renowned Japanese atelier Koichiro Ikebuchi - or savour once-in-a-lifetime evenings snorkelling with whale sharks.\n\nEnjoy one of the Maldives' most exceptional surf spots, praise the sun with complimentary yoga classes or allow the resort's rotating guest mixologists to take you on a journey in modern cocktail magic. Scuba-diving lovers will find Maalifushi's reef a step above the rest, with onsite PADI-approved courses and countless untouched secret reefs for divers of all levels.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Maalefushi",
    "location_heading": "Thaa Atoll",
    "location_subheading": "Maldives",
    "location_description": "COMO Maalifushi",
    "offer_address": "Thaa Atoll Maldives 00000, Maldives",
    "percentage_discount": 45.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 5489.0,
    "value": 9896.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070y7PAAQ",
    "hero_image": "https://images.luxuryescapes.com/8cm51zfvtrr7f4s56iug",
    "image_two": "https://images.luxuryescapes.com/ycw1zwvrpd5um24oizq",
    "image_three": "https://images.luxuryescapes.com/8tvpidsf8dwv39hz7eh",
    "vendor_name": "COMO Maalifushi",
    "title": "Boutique COMO Maldives Five-Star Paradise in Idyllic South Thaa Atoll",
    "description": "Discover unparalleled island opulence with a five-star stay at COMO Maalifushi, the first and only resort in the Maldives’ alluring Thaa Atoll. Awake each morning to the gentle murmur of the endless Indian Ocean, and savour halcyon days filled with inimitable luxury - experience authentic Maldivian beachside dining at Madi, exquisite omakase and Japanese whisky at Tai or charter the resort’s private luxury yacht for unforgettable adventures in paradise. Spend early evenings admiring each spectacular sunset from the comfort of your sleek, lavishly furnished accommodation - exquisitely crafted by renowned Japanese atelier Koichiro Ikebuchi - or spend unforgettable evenings snorkelling with the atoll’s whale sharks.",
    "offer_country_name": "Maldives",
    "offer_country_code_alpha_2": "MV",
    "offer_geo_area_level_1": "Central Atolls",
    "offer_geo_area_level_2": "Maalefushi",
    "location_heading": "Thaa Atoll",
    "location_subheading": "Maldives",
    "location_description": "COMO Maalifushi",
    "offer_address": "Thaa Atoll, Male, Maldives",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 1483.0,
    "value": 1483.0
  }
]