[
  {
    "link": "https://luxuryescapes.com/offer/0062y000009C85KAAS",
    "hero_image": "https://images.luxuryescapes.com/j8ubvqfrlg7bvnnmurfm",
    "image_two": "https://images.luxuryescapes.com/4b8njs7futx5ka71urz",
    "image_three": "https://images.luxuryescapes.com/brw7h4vkidgvcx21vu5",
    "vendor_name": "Hotel Pullman Phuket Arcadia Naithon Beach",
    "title": "Five-Star Pullman Phuket Cliffside Haven with Massages & Daily All-Inclusive Breakfast, Lunch & Dinner",
    "description": "Set your sights on the five-star Pullman Phuket Arcadia Naithon Beach, a sprawling resort set on a headland overlooking the impossibly turquoise Andaman Sea. This tropical haven emanates contemporary glamour and sophistication from all corners, and the state-of-the-art facilities offer everything you need for a rejuvenating stay. You'll be spoiled for ways to fill your days, with two stunning infinity pools and a tranquil spa for moments of well-deserved bliss. For those who prefer an active escape, head to the Fit Lounge with ocean views and a range of daily activities for the mind, body and soul, including yoga, pilates, traditional Muay Thai and more.\n\nWhen you're ready to leave your secluded haven, the white sands of Naithon Beach are within easy reach, or travel further afield to discover Phang Nga Bay or the Big Buddha. To round out your day, venture to the onsite restaurants, including Elements Restaurant for traditional Thai and international favourites, Vero for authentic Italian-inspired fare, or any of the three ultra-stylish bars for expertly shaken cocktails.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phuket",
    "offer_geo_area_level_2": "Sa Khu",
    "location_heading": "Thailand",
    "location_subheading": "Phuket",
    "location_description": "Hotel Pullman Phuket Arcadia Naithon Beach",
    "offer_address": "22/2 Moo 4 Naithon Beach, Amphur Talang, 83110, Thailand Saky Thailand 83110 Thailand",
    "percentage_discount": 48.0,
    "min_duration": 3,
    "max_duration": 20,
    "price": 1319.0,
    "value": 2522.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000BfkaEAAR",
    "hero_image": "https://images.luxuryescapes.com/me8d00yepdximgwbwl2h",
    "image_two": "https://images.luxuryescapes.com/i1ezy027oi3p1rj4wr9",
    "image_three": "https://images.luxuryescapes.com/584k83xhz9v9snhz31t",
    "vendor_name": "Novotel Phuket Kata Avista Resort and Spa",
    "title": "Phuket Five-Star Novotel Resort near Kata Beach with Daily Breakfast, Lunch or Dinner & Drinks",
    "description": "Surfside serenity awaits at the five-star Novotel Phuket Kata Avista Resort and Spa, an oasis of laidback luxury just minutes from Kata Beach’s platinum sands. With breathtaking hillside views of the shining Andaman Sea and three shimmering swimming pools to match, Novotel Phuket Kata Avista Resort and Spa offers a paradise for the entire family - younger children will adore the Little Ocean Kids' Club's fun-filled activities and the resort’s dedicated family zones guarantee excitement for the young and the young at heart. Easygoing serenity has never been closer - dine under the open sky at elegant eatery En Vogue, sip mai tais at Zing Swim-Up Pool Bar or indulge with a traditional treatment at the onsite Inbalance Spa.\n\nNovotel Phuket Kata Avista Resort and Spa is the perfect base from which to explore Phuket’s countless riches - you’ll only be a 12-minute walk from the Karon Beach’s famous stretch, and the island’s most iconic sights - including the mighty Big Buddha and Patong - are only a short tuk-tuk ride away.",
    "offer_country_name": "Thailand",
    "offer_country_code_alpha_2": "TH",
    "offer_geo_area_level_1": "Phuket",
    "offer_geo_area_level_2": "Karon",
    "location_heading": "Thailand",
    "location_subheading": "Phuket",
    "location_description": "Novotel Phuket Kata Avista Resort and Spa",
    "offer_address": "4, 1, 4 Leam Sai Road, Tambon Karon, Muang, Chang Wat, Phuket, 83100, Thailand",
    "percentage_discount": 57.0,
    "min_duration": 5,
    "max_duration": 21,
    "price": 379.0,
    "value": 880.0
  }
]