[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HuidIAC",
    "hero_image": "https://images.luxuryescapes.com/y3g7aux24ev5y5sxecuc",
    "image_two": "https://images.luxuryescapes.com/bmrqenrit9lv221k53k",
    "image_three": "https://images.luxuryescapes.com/pguum5jnuigw6y4btph",
    "vendor_name": "Uga Ulagalla",
    "title": "Private Pool Villas in the Heart of Sri Lanka's Cultural Triangle with Daily Breakfast & Nightly Cocktails",
    "description": "Surrender yourself to the epitome of Sri Lankan hospitality and traditional elegance at this five-star all-villa sanctuary, nestled within a 58-acre estate, dotted with lush paddy fields and lily ponds, in the heart of the cultural triangle. Once the ancestral abode of local Anuradhapura nobility, this resort cradles a 150-year-old mansion and boasts 25 expansive private pool villas, offering absolute seclusion and tranquillity in the lap of nature.\n\nCherish the beauty of your surroundings and explore the quaint hamlet of Thirrapane with authentic experiences such as village cycle tours, tuk-tuk tours, horseback riding, archery, or even kayaking in the local lake. Feast on delectable Sri Lankan delicacies at the Liyawela restaurant or indulge in a unique dining experience at Kamatha, sampling the local cuisine in the middle of a rice paddy field, or enjoy rejuvenating treatments at Uga Spa.\n\nTake advantage of the resort's serene location in the ancient Buddhist city of Anuradhapura and explore nearby UNESCO World Heritage sites, like the ancient rock fortress of Sigiriya and the Dambulla Caves, and elevate your Sri Lankan adventure.",
    "offer_country_name": "Sri Lanka",
    "offer_country_code_alpha_2": "LK",
    "offer_geo_area_level_1": "North Central Province",
    "offer_geo_area_level_2": "Anuradhapura",
    "location_heading": "Thirippane",
    "location_subheading": "Sri Lanka",
    "location_description": "Uga Ulagalla",
    "offer_address": "Ulagalla Road, Thirippane, Anuradhapura 50072, Sri Lanka",
    "percentage_discount": 39.0,
    "min_duration": 3,
    "max_duration": 13,
    "price": 929.0,
    "value": 1531.0
  }
]