[
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Lsv2AAC",
    "hero_image": "https://images.luxuryescapes.com/8ya7xzzou45pr2wgd1io9",
    "image_two": "https://images.luxuryescapes.com/297oo2lmxm6hesis4yb",
    "image_three": "https://images.luxuryescapes.com/eyau1ue2vnbrdfg6jkxi",
    "vendor_name": "Ski In Ski Out Chalet",
    "title": "Five-Star Chalet Escape at Australia's Premier Ski Resort",
    "description": "Enjoy an Australian alpine escape among snow-covered Thredbo village with a AAA five-star rated stay in a fully equipped Ski In Ski Out Chalet. Whether you’re an accomplished snowsports athlete or it’s your first time on skis, Ski In Ski Out Chalets in New South Wales offer full boutique luxury so you can relax after a big day on the slopes. \n\nPerfect for families or groups, two-bedroom packages are valid for four, while three-bedroom packages are valid for six, and include a breakfast hamper and a bottle of Mumm Champagne on arrival.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Thredbo",
    "location_heading": "Thredbo",
    "location_subheading": "New South Wales",
    "location_description": "Ski In Ski Out Chalets",
    "offer_address": "24/9 Crackenback Dr, Thredbo NSW 2625",
    "percentage_discount": 43.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 789.0,
    "value": 1375.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006z5s6AAA",
    "hero_image": "https://images.luxuryescapes.com/8wqd0c15s4itdhyx7x1d",
    "image_two": "https://images.luxuryescapes.com/u2zb7kqcjev22bu9z3d9",
    "image_three": "https://images.luxuryescapes.com/aqsyxgtg1910r7mu2w3p",
    "vendor_name": "Thredbo Alpine Hotel",
    "title": "Thredbo Alpine Summer Escape with Daily Breakfast & Welcome Cocktail",
    "description": "Breathe fresh mountain air and explore Australia’s premier alpine destination with a summer stay at the historic Thredbo Alpine Hotel. Ideally placed in the heart of Thredbo Village, just metres from the base of Kosciuszko Express Scenic Chairlift, this long-established property will give you access to a world of adventures in nature. From mountain biking to hiking, fly fishing to playing golf at Australia’s highest golf course, the opportunities are endless.\n\nThredbo might be known as Australia’s premier ski resort, but in summer this magical alpine village transforms into the ultimate adventure destination. This is the mountain-biking and hiking mecca of Australia, where you’ll find some of the country's most scenic trails, longest gravity-biking trails and fly-fishing spots. Pack your sense of adventure and your hiking boots and set off to explore. Thredbo offers more than 20 different hikes for all levels and more than 34 kilometres of mountain bike trails. Not a fan of hiking? Play a round of golf, try your luck at fly fishing or play tennis... whatever you're looking for, you're set to find it in this idyllic alpine destination.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Thredbo",
    "location_heading": "Thredbo",
    "location_subheading": "New South Wales",
    "location_description": "Thredbo Alpine Hotel",
    "offer_address": "8 Friday Dr, Thredbo NSW 2625",
    "percentage_discount": 31.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 232.0,
    "value": 335.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003HdgvAAC",
    "hero_image": "https://images.luxuryescapes.com/4cl9f19ee6mo0cccz7w",
    "image_two": "https://images.luxuryescapes.com/141ee5utzjvc8fmdrld5",
    "image_three": "https://images.luxuryescapes.com/7oynw2uvpua4i3tcnrf5",
    "vendor_name": "Thredbo Alpine Hotel",
    "title": "Thredbo Alpine Summer Escape with Daily Breakfast & Welcome Cocktail",
    "description": "Breathe fresh mountain air and explore Australia’s premier alpine destination with a summer stay at the historic Thredbo Alpine Hotel. Ideally placed in the heart of Thredbo village, just metres from the base of the Kosciuszko Express Scenic Chairlift, this long-established property - ranked in the top 3 hotels in Thredbo on Tripadvisor - will give you access to a world of adventures in nature. From mountain biking to hiking, fly fishing to playing golf at Australia’s highest golf course, the opportunities are endless here.\n\nYour alpine retreat includes daily breakfast, a welcome cocktail on arrival, and a A$25 dining credit to spend at selected Thredbo village restaurants.\n\n**Ride & Dine Upgrade:** Get a breathtaking new perspective on your alpine escape with a chair lift pass for the Kosciuszko Express Scenic Chairlift and a one-course lunch with soft drinks or coffee at Australia’s highest restaurant, Eagles Nest - standing proud at over 1,937 metres above sea level.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Thredbo",
    "location_heading": "Thredbo",
    "location_subheading": "New South Wales",
    "location_description": "Thredbo Alpine Hotel",
    "offer_address": "8 Friday Dr, Thredbo NSW 2625",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 7,
    "price": 219.0,
    "value": 409.0
  }
]