[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Ed1Y1AAJ",
    "hero_image": "https://images.luxuryescapes.com/xn0xwdr4n4qafao1udhj",
    "image_two": "https://images.luxuryescapes.com/4bompk9a2mquozvvcwlp",
    "image_three": "https://images.luxuryescapes.com/sus82kptehf09sp8s76l",
    "vendor_name": "The Sands Torquay",
    "title": "Great Ocean Road Coastal Resort with Daily Breakfast, Welcome Cocktail & 18-Hole Championship Course",
    "description": "Wind your way along the coast of Victoria to The Sands Torquay, elegantly perched on the northern headland of Torquay - the official starting point of the Great Ocean Road. Spend your days exploring one of Australia's most famed stretches of coastline, home to the internationally renowned Bells Beach and the Australian National Surfing Museum. After busy days, plunge into the expansive 25-metre heated indoor pool or work out in the state-of-the-art fitness zone. Stretch out with a yoga class, try your hand at a round of tennis or pull up a pew at the 20-metre-long Shirley's bar and savour your favourite drink.\n\nThe Sands Torquay is perched on an 18-hole championship golf course designed by former Australian professional golfer Stuart Appleby. Golfers will be instantly impressed by the immaculately groomed fairway set against a striking coastal backdrop. There's also plenty to keep their travelling companions busy. Walk along the adjacent Whites Beach, take the short drive into Torquay township where you'll find boutiques and gourmet bites or travel a little further afield to the wonders of the Great Ocean Road, including the iconic surfing haven of Bells Beach and the spectacular Twelve Apostles.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Torquay",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "The Sands Torquay",
    "offer_address": "2 Sands Boulevard, Torquay, Victoria 3228, Australia",
    "percentage_discount": 58.0,
    "min_duration": 2,
    "max_duration": 9,
    "price": 243.0,
    "value": 584.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000cIyJUQA0",
    "hero_image": "https://images.luxuryescapes.com/nmxpvdqijx1ixmu1vey5",
    "image_two": "https://images.luxuryescapes.com/xtha9vaia8eqnxdcspyt",
    "image_three": "https://images.luxuryescapes.com/gkj45hqjbvnyswbhlobq",
    "vendor_name": "RACV Torquay Resort",
    "title": "Award-Winning Escape on the Iconic Great Ocean Road with Daily Breakfast & Nightly Drinks",
    "description": "Discover the laid-back vibes, spectacular surf beaches and impressive scenery of Victoria’s iconic Great Ocean Road staying at the award-winning RACV Torquay Resort, ranked in the top 10 luxury hotels in Australia. Unwind in contemporary luxury as you enjoy daily full buffet breakfast, a bottle of sparkling wine on arrival, a nightly house drink per person at Harding’s Lounge, an AU$50 resort credit to spend on food, drinks, spa treatments or golf bookings, complimentary use of the resort’s facilities including pool, gym and tennis court access, complimentary Wi-Fi and parking, and a leisurely late 11am checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Surf Coast Shire",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "RACV Torquay Resort May 2019",
    "offer_address": "1 Great Ocean Rd, Torquay VIC 3228",
    "percentage_discount": 66.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 304.0,
    "value": 900.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lLzUAAU",
    "hero_image": "https://images.luxuryescapes.com/blt54s362g30n3jeg1i",
    "image_two": "https://images.luxuryescapes.com/yz51pqkiqdebkmqtstqe",
    "image_three": "https://images.luxuryescapes.com/n8276jq31o57476ikria",
    "vendor_name": "The Sands Torquay",
    "title": "Grand Reopening: Stylish Great Ocean Road Golf Resort with Daily Breakfast & Welcome Cocktails",
    "description": "Looking for a regional escape with a difference? Wind your way along the coast of Victoria to the newly-reopened The Sands Torquay Resort. Elegantly perched on the northern headland of Torquay - the official starting point of the Great Ocean Road - the resort, which has recently undergone a multimillion-dollar renovation, sits on an 18-hole championship golf course designed by former Australian Open champion Stuart Appleby, creating a striking backdrop from almost everywhere in the hotel.\n\nGolfers will be instantly impressed by the immaculately groomed fairway set against a striking coastal backdrop. For their travelling companions, there's plenty to keep them busy. Plunge into the expansive 25-metre heated indoor pool with floor-to-ceiling windows showcasing fairway views, or work out in the state-of-the-art fitness zone. Stretch out with a yoga class, try your hand at a round of tennis, or pull up a pew at the 20-metre long bar, Shirley's Bar and savour your favourite drink. Walk along the adjacent, Whites Beach, take the short drive into Torquay township, where you'll find boutiques and gourmet bites, or travel a little further afield where you'll find the wonders of the Great Ocean Road, including the iconic surfing haven of Bells Beach and the spectacular Twelve Apostles.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Torquay",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "The Sands Torquay",
    "offer_address": "2 Sands Boulevard, Torquay, Victoria 3228, Australia",
    "percentage_discount": 40.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 409.0,
    "value": 679.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002EdRGAA0",
    "hero_image": "https://images.luxuryescapes.com/5rg8exbr6g3f5bfyjn7d",
    "image_two": "https://images.luxuryescapes.com/rnuskuc8dp4hggv51476",
    "image_three": "https://images.luxuryescapes.com/a200n7r0d87upsu0o0tu",
    "vendor_name": "RACV Torquay Resort",
    "title": "Award-Winning Torquay Retreat with Stunning Great Ocean Road Views",
    "description": "Discover one of Australia’s great architectural masterpieces with a stay at the renowned RACV Torquay Resort, voted one of Australia’s top 10 best luxury hotels and ranked in the top 1% worldwide in Tripadvisor’s 2020 Best of the Best Awards. Tucked away in the seaside town of Torquay, at the beginning of the iconic Great Ocean Road, this designer hotel invites you to discover the region’s exquisite surf, café culture and postcard landmarks while staying in sophisticated comfort overlooking the Bass Strait and the resort's championship 18-hole golf course.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Jan Juc",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "RACV Torquay Resort",
    "offer_address": "1 Great Ocean Road, Torquay, Victoria 3228, Australia",
    "percentage_discount": 55.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 306.0,
    "value": 680.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IdjxzAAB",
    "hero_image": "https://images.luxuryescapes.com/8ic0w6qdowu47a5lhuom",
    "image_two": "https://images.luxuryescapes.com/pdop8rvqs3ip0vnbcz",
    "image_three": "https://images.luxuryescapes.com/f4x8kye3mwhyjfc89xq",
    "vendor_name": "The Sands Torquay",
    "title": "Great Ocean Road Coastal Resort with Daily Breakfast & 18-Hole Championship Course",
    "description": "Wind your way along the coast of Victoria to this coastal haven, elegantly perched on the northern headland of Torquay - the official starting point of the Great Ocean Road. Spend your days exploring one of Australia's most famed stretches of coastline - loved for its family appeal, home to the internationally renowned Bells Beach and the Australian National Surfing Museum. \n\nAfter busy days, plunge into the expansive 25-metre heated indoor pool or work out in the state-of-the-art fitness zone. Stretch out with a yoga class, try your hand at a round of tennis or pull up a pew at the 20-metre-long Shirley's bar and savour your favourite drink.\n\nThe Sands Torquay is perched on an 18-hole championship golf course designed by former Australian professional golfer Stuart Appleby. Golfers will be instantly impressed by the immaculately groomed fairway set against a striking coastal backdrop. \n\nThere's also plenty to keep their travelling companions and little ones busy. Walk along the adjacent Whites Beach, take the short drive into Torquay township where you'll find boutiques and gourmet bites or travel a little further afield to the wonders of the Great Ocean Road, including the iconic surfing haven of Bells Beach and the spectacular Twelve Apostles.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Torquay",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "The Sands Torquay",
    "offer_address": "2 Sands Boulevard, Torquay, Victoria 3228, Australia",
    "percentage_discount": 52.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 249.0,
    "value": 518.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HuruIAC",
    "hero_image": "https://images.luxuryescapes.com/kswlo0pxhm7qiirgnvfc",
    "image_two": "https://images.luxuryescapes.com/rf577y99jvro8xilsip9",
    "image_three": "https://images.luxuryescapes.com/8w3b33267wimiaryi1u",
    "vendor_name": "Wyndham Resort Torquay",
    "title": "Great Ocean Road Torquay Escape Steps from Zeally Bay Beach with Daily Breakfast",
    "description": "This modern and stylish escape directly across from Zeally Bay Beach is an ocean lover's paradise, offering the perfect gateway to the Great Ocean Road.\n\nIt's the ideal location for those looking to experience firsthand what makes Torquay shine - laidback rooms are perfectly suited for travellers of all stripes, and the resort boasts a range of modern facilities, including a heated indoor pool, outdoor spa, tennis court and onsite bar and cafe, making it the perfect place to relax after a day in the bay.\n\nOnly a short walk from the town’s vibrant cafe scene and surf shops, and less than a 15-minute drive from the famous waves of Bells Beach, you'll be hanging five in no time. You're perfectly set to take advantage of everything the Great Ocean Road has to offer - including reef walking, fishing charters, surf classes and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Torquay",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "Wyndham Resort Torquay",
    "offer_address": "100 The Esplanade, Torquay, Victoria 3228, Australia",
    "percentage_discount": 47.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 239.0,
    "value": 455.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HtcyxYAB",
    "hero_image": "https://images.luxuryescapes.com/p7edrm1mmn0tf984v63i",
    "image_two": "https://images.luxuryescapes.com/8i6soqbmv3m478i5f5w",
    "image_three": "https://images.luxuryescapes.com/klzk9v3ged8e6rlxogk",
    "vendor_name": "RACV Torquay Resort",
    "title": "Newly Renovated Surf Coast Escape on Great Ocean Road with Daily Breakfast & Nightly Drinks",
    "description": "From world-class golf to acclaimed fine dining, this newly refurbished coastal resort offers unparalleled experiences just steps from the Great Ocean Road's renowned surf beaches. Awarded the 2025 Tripadvisor Best of the Best title as one of Australia's top luxury hotels, RACV Torquay Resort has everything you could wish for.\n\nStart your holiday strong with a rejuvenating treatment at One Spa, or head to the pool for a few leisurely laps while the little ones enjoy the separate recreation area and wading pool. Perfect your swing at the 18-hole, par-71 golf course or stop by the tennis courts to work up a sweat - there's something for the whole family here.\n\nWhen it's time to indulge, treat your palate at Number One restaurant, unwind in the relaxed ambience of White's Paddock, or soak up the sun and ocean views with a drink in hand at SeaSpray Co. When it's time to discover the region, venture out to explore the Great Ocean Road, Bells Beach and the charming town of Torquay, all just a stone's throw away.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Jan Juc",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "RACV Torquay Resort",
    "offer_address": "1 Great Ocean Road, Torquay, Victoria 3228, Australia",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 329.0,
    "value": 609.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000HTxHSYA1",
    "hero_image": "https://images.luxuryescapes.com/u4lb43p1xr13e6u4xf7p",
    "image_two": "https://images.luxuryescapes.com/zacpntk6bffe1onef8",
    "image_three": "https://images.luxuryescapes.com/8ysv6ifr5d75cog126u",
    "vendor_name": "The Sands Torquay",
    "title": "Great Ocean Road Escape: Torquay Coastal Retreat with Daily Breakfast & Indoor Heated Pool",
    "description": "Wind your way along the coast of Victoria to this seaside haven, elegantly perched on the northern headland of Torquay, the Great Ocean Road's starting point. Spend your days exploring one of Australia's most famed stretches of coastline, home to the iconic surfing haven of Bells Beach and the Australian National Surfing Museum.\n\nAfter busy days, plunge into the expansive 25-metre heated indoor pool or work out in the fully equipped gym. Stretch out with a yoga class, try your hand at a round of tennis or pull up a pew at the 20-metre-long bar at Shirleys at The Sands and savour your favourite drink.\n\nThe Sands Torquay is perched on an 18-hole championship golf course designed by former Australian professional golfer Stuart Appleby. Golfers will be instantly impressed by the immaculately groomed fairway set against a striking coastal backdrop.\n\nThere's also plenty to keep their travelling companions and little ones busy. Walk along the adjacent Whites Beach, take the short drive into Torquay township for boutiques and gourmet bites or travel a little further afield to the wonders of the Great Ocean Road, including Bells Beach and the spectacular Twelve Apostles.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Torquay",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "The Sands Torquay",
    "offer_address": "2 Sands Boulevard, Torquay, Victoria 3228, Australia",
    "percentage_discount": 49.0,
    "min_duration": 2,
    "max_duration": 21,
    "price": 239.0,
    "value": 472.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlH4AAK",
    "hero_image": "https://images.luxuryescapes.com/mcme48to4syqkqaifqw3",
    "image_two": "https://images.luxuryescapes.com/nd9490j1ewecen7ifxp",
    "image_three": "https://images.luxuryescapes.com/8uw2gnhyp8oxslsekcp",
    "vendor_name": "The Sands Torquay",
    "title": "Peppers Ultimate Great Ocean Road Mini-Break",
    "description": "Embrace the laidback vibes and Instagram-worthy scenery of Victoria’s iconic Great Ocean Road staying at Peppers The Sands Resort Torquay. Famed as the official starting point of the Great Ocean Road which will take you to the iconic surfing haven of Bells Beach and past the spectacular sea cliffs of the Twelve Apostles, Otway hinterlands and Queenscliff, this signature Peppers resort is the ultimate mini-break or makes a great short stay as part of a longer trip, with a stunning location close to the beachfront and surrounded by a championship golf course. Soak up the coastal beauty with daily buffet breakfast, one shared pizza for two, a welcome drink per person and a guaranteed 11am late checkout. Plus, exclusive to Luxury Escapes guests, you will recieve 10% off all spa treatments at the nearby Saltair Health Spa in Torquay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Surf Coast Shire",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "Peppers The Sands Resort - Jan 2020",
    "offer_address": "2 Sands Boulevard, Torquay VIC 3228",
    "percentage_discount": 64.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 185.0,
    "value": 513.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008i1xeAAA",
    "hero_image": "https://images.luxuryescapes.com/y2y3sghl4k7czj9cyb5c4",
    "image_two": "https://images.luxuryescapes.com/v2bcxjod62d4sbo2wag",
    "image_three": "https://images.luxuryescapes.com/r58jap9cif4jj8lr9o0q",
    "vendor_name": "Wyndham Resort Torquay",
    "title": "Beachfront Torquay Escape on the Great Ocean Road with Daily Breakfast & Lunch",
    "description": "It’s a surfer’s paradise at Wyndham Resort Torquay, a modern and stylish escape located directly across from Zeally Bay Beach at the gateway to the Great Ocean Road. It's the perfect location for those looking to experience firsthand what makes Torquay shine - laidback rooms are perfectly suited for travellers of all stripes, and the resort boasts a range of modern facilities, including a heated indoor pool, outdoor spa, tennis court and onsite restaurant, making Wyndham Resort Torquay the perfect place to relax after a day in the bay. \n\nOnly a short walk from the town’s vibrant café scene and surf shops and less than a 15-minute drive from the famous waves of Bells Beach, you'll be hanging five in no time, and perfectly set to take advantage of everything the Great Ocean Road has to offer - including reef walking, fishing charters, surf classes and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Torquay",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "Wyndham Resort Torquay",
    "offer_address": "100 The Esplanade, Torquay, Victoria 3228, Australia",
    "percentage_discount": 46.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 237.0,
    "value": 438.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GvKMFAA3",
    "hero_image": "https://images.luxuryescapes.com/v0ylrlmtkmxg0fdcth6w",
    "image_two": "https://images.luxuryescapes.com/9j8xuylk1mf8xvu2oren",
    "image_three": "https://images.luxuryescapes.com/g9i4dbgws87bj77png7",
    "vendor_name": "The Sands Torquay",
    "title": "Great Ocean Road Coastal Resort with 18-Hole Championship Course & Three Onsite Restaurants",
    "description": "Wind your way along the coast of Victoria to this coastal haven, elegantly perched on the northern headland of Torquay - the starting point of the Great Ocean Road. Spend your days exploring one of Australia's most famed stretches of coastline and come back to an expansive 25-metre heated indoor pool for a refreshing swim. Try your hand at a round of tennis or pull up a pew at the 20-metre-long Shirley’s bar and savour your favourite drink. \n\nThe Sands Torquay is perched on an 18-hole championship golf course designed by former Australian professional golfer Stuart Appleby. Take the short drive into Torquay township where you'll find boutiques and gourmet bites or travel a little further afield to the wonders of the Great Ocean Road, including the the spectacular Twelve Apostles.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Torquay",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "The Sands Torquay",
    "offer_address": "2 Sands Boulevard, Torquay, Victoria 3228, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 103.0,
    "value": 103.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Fa4fcYAB",
    "hero_image": "https://images.luxuryescapes.com/em1m0lrulywec4ljc9a",
    "image_two": "https://images.luxuryescapes.com/hrcnwgwyjn0pdb86oh0k",
    "image_three": "https://images.luxuryescapes.com/ui93jw462mxpzio8t9",
    "vendor_name": "Wyndham Resort Torquay",
    "title": "Elegant Great Ocean Road Torquay Escape Steps from Zeally Bay Beach with Indoor Pool & Spa",
    "description": "Experience the sheer coastal bliss of Victoria's picturesque Surf Coast with an escape to this stylish retreat in Torquay, ideally sitting across Zeally Bay Beach. The perfect launchpad for exploring the unrivalled beauty of the Great Ocean Road, this resort offers a blend of modern comfort with classic charms, featuring spacious, well-appointed accommodations to ensure utmost relaxation.\n\nTake a dip in the heated indoor pool, pamper with treatments at the outdoor spa, play tennis or indulge in culinary delights at the onsite bar and cafe. From surf lessons, vibrant dining and farmers markets, to reef walks and fishing charters, you'll be perfectly placed to take advantage of everything the Great Ocean Road has to offer.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Victoria",
    "offer_geo_area_level_2": "Torquay",
    "location_heading": "Torquay",
    "location_subheading": "Victoria",
    "location_description": "Wyndham Resort Torquay",
    "offer_address": "100 The Esplanade, Torquay, Victoria 3228, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 31,
    "price": 117.0,
    "value": 117.0
  }
]