[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IZ6gIAG",
    "hero_image": "https://images.luxuryescapes.com/xguhz3ojgmyqdjz4nwc",
    "image_two": "https://images.luxuryescapes.com/4vt9mqlyj7iud50x4bl",
    "image_three": "https://images.luxuryescapes.com/0c10pntrb603ze3ygz",
    "vendor_name": "Palcall Tsumagoi Resort",
    "title": "Japan Ski-In Ski-Out Alpine Escape with Unlimited Ski Passes & Daily Breakfast",
    "description": "If you've been daydreaming of a ski-in, ski-out alpine stay in Japan, welcome to paradise. Loved by skiers and boarders everywhere, Palcall Tsumagoi Resort is one of the best hotels in the area for both beginners and intermediates, with a huge range of facilities, including a traditional hot spring onsen. \n\nThe resort is located just below the tree line, featuring fantastic beginner-friendly slopes, magic carpets for kids, and intermediate or advanced black diamond runs for the adrenaline junkie. The resort itself is home to a fantastic buffet restaurant, serving local produce and offering both international favourites and Japanese specialities.\n\nAfter fuelling up for the day, hit the slopes, and return to enjoy the healing benefits of a traditional onsen (hot spring). Allow the soothing waters to rejuvenate the mind and body after a day in the outdoors, or keep the excitement bubbling in the activity area, featuring pool tables, table tennis, and a gym.",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Gunma Prefecture",
    "offer_geo_area_level_2": "Tsumagoi",
    "location_heading": "Tsumagoi",
    "location_subheading": "Japan",
    "location_description": "Palcall Tsumagoi Resort",
    "offer_address": "Tsumagoi Villge, Agatsuma, Gunma 377-1611, Japan",
    "percentage_discount": 59.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 599.0,
    "value": 1465.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GrJT7YAN",
    "hero_image": "https://images.luxuryescapes.com/dxvoxlvu2pfq5a6n7tgm",
    "image_two": "https://images.luxuryescapes.com/dkro7ajgfl2yn8h4gp94",
    "image_three": "https://images.luxuryescapes.com/wwy28a4p9ierokobt0sp",
    "vendor_name": "Palcall Tsumagoi Resort",
    "title": "Japan Ski-In Ski-Out Alpine Escape with Unlimited-Use Ski Passes, Daily Breakfast & Onsen Access",
    "description": "If you've been dreaming of a ski-in ski-out alpine stay in Japan, look no further. Only a one-hour bullet train ride from Tokyo to Karuizawa and located just below the tree line, the resort features beginner-friendly slopes, magic carpets for kids and challenging black diamond runs for the adventurous.\n\nEnjoy a meal at the buffet restaurant Tsumagoi Dining with local produce, international favourites and Japanese specialties. After a day on the slopes, relax in the onsen or keep the energy high with pool, table tennis and fitness centre facilities.",
    "offer_country_name": "Japan",
    "offer_country_code_alpha_2": "JP",
    "offer_geo_area_level_1": "Gunma Prefecture",
    "offer_geo_area_level_2": "Tsumagoi",
    "location_heading": "Tsumagoi",
    "location_subheading": "Japan",
    "location_description": "Palcall Tsumagoi Resort",
    "offer_address": "Tsumagoi Villge, Agatsuma, Gunma 377-1611, Japan",
    "percentage_discount": 60.0,
    "min_duration": 5,
    "max_duration": 14,
    "price": 683.0,
    "value": 1709.0
  }
]