[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HiIbIAK",
    "hero_image": "https://images.luxuryescapes.com/59pd7o5z4xzhd57msnb9",
    "image_two": "https://images.luxuryescapes.com/skxspp0d49ib4ge3ul9",
    "image_three": "https://images.luxuryescapes.com/mtowjm2f5jsq80e1wmb9",
    "vendor_name": "Omni Tucson National Resort",
    "title": "Luxurious Tucson Mountain Resort with Two Championship Golf Courses, Six Eateries & Day Spa",
    "description": "Escape to the desert oasis of this glorious resort, a lavish retreat set against the stunning backdrop of the Santa Catalina Mountains. Tee off on one of two championship golf courses and between swings savour delicious meals and refreshing drinks across the resort's six eateries, including Southwestern cuisine at Bob's Steak & Chop House and breezy cocktails at the al fresco Sweetwater Cabana Bar.\n\nRejuvenate with a treatment at the onsite spa, cool off in the sparkling infinity pool or embark on an exciting hike or cycle through the mountains. Explore the vibrant city of Tucson, with its unique blend of Mexican and Native American cultures, or venture further afield to the stunning surrounds of the Saguaro National Park.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Arizona",
    "offer_geo_area_level_2": "Tucson",
    "location_heading": "Tucson",
    "location_subheading": "Arizona",
    "location_description": "Omni Tucson National Resort",
    "offer_address": "2727 West Club Drive, Tucson, Arizona 85742, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 195.0,
    "value": 195.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000007lpaIAAQ",
    "hero_image": "https://images.luxuryescapes.com/jxfnnn6dvl888qe8jpsf",
    "image_two": "https://images.luxuryescapes.com/5lf697wm8q9zoydypj0o",
    "image_three": "https://images.luxuryescapes.com/vpyuzh0nfbl150rtbrbg",
    "vendor_name": "Hacienda Del Sol",
    "title": "Historic Arizona Desert Escape",
    "description": "Get your fix of southwest charms in one of Arizona's most picturesque spots at the Hacienda Del Sol Guest Ranch Resort. This idyllic, 34-acre refuge dates back to 1929 and perfectly combines rustic touches with modern charms and is set in the shadows of the stunning Santa Catalina Mountain Range.\n\nMake the most of your superb location by exploring the nearby Finger Rock Canyon, Arizona-Sonora Desert Museum or Colossal Cave Mountain Park and hitting the shops at La Encantada. Later, recharge within the resort and make use of the luxurious facilities onsite. Indulge at either of the two fine dining restaurants, The Grill and Terraza Garden Patio & Lounge, dive into three sparkling pools, or be treated to a luxurious spa treatment. For an active escape, drop into the 24-hour fitness centre or go horseback riding along the many trails that wrap around the resort.",
    "offer_country_name": "United States",
    "offer_country_code_alpha_2": "US",
    "offer_geo_area_level_1": "Arizona",
    "offer_geo_area_level_2": "Tucson",
    "location_heading": "Tucson",
    "location_subheading": "Arizona",
    "location_description": "Hacienda Del Sol Guest Ranch Resort",
    "offer_address": "5501 N Hacienda Del Sol Rd, Tucson, AZ 85718, United States",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 171.0,
    "value": 171.0
  }
]