[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006Qa8LAAS",
    "hero_image": "https://images.luxuryescapes.com/usl9fycvofhcc3zfl8gzf",
    "image_two": "https://images.luxuryescapes.com/c5ev2u1pbjm4ffviu8ny",
    "image_three": "https://images.luxuryescapes.com/dib5kpyx9o39sii3mo",
    "vendor_name": "The Oyster Box",
    "title": "South Africa Award-Winning Five-Star Beachfront Oasis near Durban",
    "description": "Perfectly poised on the KwaZulu-Natal coastline, just steps from the beautiful Umhlanga beachfront, The Oyster Box is a five-star oasis filled with heartwarming history and unrivalled charm. Set within lush tropical gardens, with staggering views of the shimmering Indian Ocean and Umhlanga's iconic lighthouse, this serene hideaway is conveniently located just a 20-minute drive from Durban’s thriving city centre. This incredible hotel is rated among the top 1% worldwide and the top 25 in Africa on Tripadvisor. \n\nAlongside 86 elegant and individually decorated rooms, suites and villas, The Oyster Box offers an array of exceptional facilities. Epicureans will find joy unearthing the delicious array of culinary adventures, including oysters plucked straight from the ocean, flavoursome curry buffets and elegant high teas. Beyond the wonderful gourmet offerings, guests can spend time at the award-winning spa, plunge into one of two swimming pools, sip on a perfectly stirred cocktail at the rooftop bar, catch a film at the intimate onsite cinema or head straight to the beach thanks to direct access.",
    "offer_country_name": "South Africa",
    "offer_country_code_alpha_2": "ZA",
    "offer_geo_area_level_1": "KwaZulu-Natal",
    "offer_geo_area_level_2": "Umhlanga",
    "location_heading": "Umhlanga",
    "location_subheading": "South Africa",
    "location_description": "The Oyster Box",
    "offer_address": "2 Lighthouse Rd, Umhlanga, 4319, South Africa",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 426.0,
    "value": 426.0
  }
]