[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005IFHUAA4",
    "hero_image": "https://images.luxuryescapes.com/8bvoik412zgi9eqkev",
    "image_two": "https://images.luxuryescapes.com/vnkzhnc2rsgx5w6ja9k",
    "image_three": "https://images.luxuryescapes.com/571ac293bpup7skofqkd",
    "vendor_name": "Nightcap at Ocean Beach Umina",
    "title": "Modern NSW Central Coast Escape with Daily Breakfast & Welcome Drinks",
    "description": "Bringing a wave of energy to the central coast of New South Wales, Nightcap at Ocean Beach Hotel is the seaside escape that you've been looking for. Fresh, funky and splashed with pops of colour, this recently renovated retreat is nestled in the fun-loving hub of Umina. Halfway between Sydney and Newcastle, it's the perfect pitstop for a road trip itinerary or for families and friends seeking a cheeky weekend away from the city.\n\nSpend action-packed or relaxing days exploring nearby attractions including Umina Beach and the Ettalong Markets, then when night falls, head to the hotel's sports bar, bistro or brand-new beer garden for live entertainment and a delicious meal.\n\n**Your handpicked inclusions:**\n\n- Enjoy a daily breakfast box for two including cereal, a muesli bar and fresh juice\n- Celebrate your escape with a welcome beer, wine or soft drink for two\n- Relax with daily parking for one vehicle per stay\n- Stay connected with complimentary high-speed Wi-Fi\n- Treat yourself with 10% dining discount throughout your stay\n\n**Travelling with family?** Choose the Triple Studio Upgrade or Family Studio Upgrade (packages valid for up to two guests and additional guests may stay for a surcharge - see Room Policies for details).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Umina Beach",
    "location_heading": "Umina Beach",
    "location_subheading": "New South Wales",
    "location_description": "Nightcap at Ocean Beach Hotel",
    "offer_address": "259 West St, Umina Beach NSW 2257",
    "percentage_discount": 33.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 140.0,
    "value": 210.0
  }
]