[
  {
    "link": "https://luxuryescapes.com/offer/0062y0000070MNoAAM",
    "hero_image": "https://images.luxuryescapes.com/8fwe76eagtrxlzipy6s",
    "image_two": "https://images.luxuryescapes.com/svz0z0p2y8vmef8dmt5w",
    "image_three": "https://images.luxuryescapes.com/x296ui385tohvfrgr6o",
    "vendor_name": "Tilvery Boutique Accommodation",
    "title": "Brand-New Boutique Cottages near Abel Tasman National Park with Daily Breakfast Hamper",
    "description": "Be one of the first to escape to a brand-new countryside oasis with a blissful stay at Tilvery Boutique Accommodation, a rural retreat nestled between Nelson and the breathtaking Abel Tasman National Park.\n\nOpened in September 2021, this beautiful property features an intimate collection of just five unique cottages sprinkled across 14 acres of rolling green fields with snow-capped mountain vistas. Equipped with all the amenities needed for a home away from home experience, including a gourmet kitchen, spacious lounge and high-speed Wi-Fi, this nature-filled escape places you moments from the region's top attractions.\n\nWhether you fancy vine-hopping, indulging in delicious produce at top restaurants or sampling lip-smacking craft beers at New Zealand's oldest pub, you'll find a tasting trail of local delights on your doorstep. Take a scenic 40-minute drive north to Abel Tasman National Park's stunning scenery and wildlife; sink your toes into crescents of golden sand, stroll through native forest that echoes with birdsong or kayak the coast, keeping your eyes peeled for sunbathing fur seals.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Tasman Region",
    "offer_geo_area_level_2": "Upper Moutere",
    "location_heading": "Upper Moutere",
    "location_subheading": "New Zealand",
    "location_description": "Tilvery Boutique Accommodation",
    "offer_address": "7 Tarrant Road, Upper Moutere 7173, New Zealand",
    "percentage_discount": 26.0,
    "min_duration": 3,
    "max_duration": 7,
    "price": 539.0,
    "value": 725.0
  }
]