[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000Dg6hsAAB",
    "hero_image": "https://images.luxuryescapes.com/uhi8xv8qi9bdwcexlsbq",
    "image_two": "https://images.luxuryescapes.com/idh3v8uo6asdb63icdz",
    "image_three": "https://images.luxuryescapes.com/yk1whoh4zsfr9co3qehf",
    "vendor_name": "Amritara Suryauday Haveli",
    "title": "Heritage Varanasi Mansion Stay on Shivala Ghat with Daily Breakfast, One Dinner & Daily Ganga Aarti Experience",
    "description": "Resting on the famous Shivala Ghats of Varanasi, Amritara Suryauday Haveli is the ultimate choice for all travellers looking for a spiritually uplifting escape. Overlooking the holy Ganga river, Amritara Suryauday Haveli was previously a mansion built by the royal family of Nepal in the 20th century and has now carefully been refurbished into a luxury hotel. Located less than an hour's drive from Varanasi Airport, this heritage property features beautifully designed rooms that reflect the charm of the era gone by plus unmatched views of the Ganga. \n\nCatch an amazing sunrise from the hotel's terrace, head to the restaurant where the hotel's Maharajah (cook) will whip up some lip-smacking delights, take a boat ride to witness the magical 'Ganga Aarti' every evening at Dashashwamedh Ghat or simply lose yourself in the ethereal ambience of Varanasi. Wake to the soothing sounds of temple bells, and stay in close proximity to Varanasi's major attractions including Dashashwamedh Ghat, Assi Ghat, Kashi Viswanath Temple and more.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttar Pradesh",
    "offer_geo_area_level_2": "Varanasi",
    "location_heading": "Varanasi",
    "location_subheading": "India",
    "location_description": "Amritara Suryauday Haveli",
    "offer_address": "Shivala Ghat B - 4/25, Shivala Ghat Road Besides Shiv Mandir Nepali Kothi, Shivala Ghat, Bangali Tola, Varanasi, Uttar Pradesh 221001 Varanasi, India",
    "percentage_discount": 32.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 398.0,
    "value": 585.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QdSeAAK",
    "hero_image": "https://images.luxuryescapes.com/kljpjfsrcrp81i6ofjel",
    "image_two": "https://images.luxuryescapes.com/aenhu0qdvdbfg5sds9ar",
    "image_three": "https://images.luxuryescapes.com/alqf1mhgul76hfyfwkdo",
    "vendor_name": "Tree of Life Varanasi",
    "title": "Luxe Suite Stay in the Heart of Spiritual Varanasi with Decadent Dining",
    "description": "Take a walk on the spiritual side with a stay at Tree of Life Resort & Spa Varanasi, an upscale retreat in the heart of India's holiest city. Immerse yourself in the timeless charm and colourful tapestry of India's spiritual capital, all the while enjoying contemporary accommodation and comforts at this boutique property.\n\nA 13-hour drive from Delhi and only six hours from Lucknow, this suite-only retreat will pamper you after a day spent navigating the sepia-tinted lanes and alleys of Varanasi. Conveniently located close to all the major attractions, including the holy River Ganges, Tree of Life Resort & Spa Varanasi is your gateway to this ethereal city. Careful; you might just stumble upon nirvana during your stay here.\n\n**Your handpicked inclusions:**\n\n- You'll be welcomed with a non-alcoholic drink each on arrival\n- Begin every morning with set-menu breakfast at AnnTripti Restaurant\n- Savour a set-menu dinner, once per stay, at AnnTripti Restaurant\n- Sit down for a high tea experience under the Lichi Vriksh, once per stay\n- Make the most of your stay with a 15% discount on soft drinks and food\n- Discover the local culture with a village tour and visit to a traditional weaver, once per stay\n- Stay connected with complimentary Wi-Fi\n\n**Travelling with family?** One child (six and under) stays free in existing bedding with all package inclusions.\n\n**Longer stay bonus:** Stay 4+ nights and enjoy two set-menu dinners and two high tea experiences per stay.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttar Pradesh",
    "offer_geo_area_level_2": "Varanasi",
    "location_heading": "Varanasi",
    "location_subheading": "India",
    "location_description": "Tree of Life Varanasi",
    "offer_address": "Kazi Serai, Sehmalpur, Uttar Pradesh 221105, India",
    "percentage_discount": 45.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 196.0,
    "value": 357.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000CxKKHAA3",
    "hero_image": "https://images.luxuryescapes.com/12kdxk9m982rm9ga81m",
    "image_two": "https://images.luxuryescapes.com/axyu07mhseble4lx3tf",
    "image_three": "https://images.luxuryescapes.com/jjkt03trtboq345ousr",
    "vendor_name": "Tree of Life Varanasi",
    "title": "Luxe Suite Stay in the Heart of Spiritual Varanasi with Daily Breakfast, High Tea & One Dinner",
    "description": "Explore your spiritual side with a stay at Tree of Life Varanasi, an upscale retreat in the heart of India's holiest city. Immerse yourself in the timeless charm and colourful tapestry of the City of Light, all the while enjoying contemporary accommodation and comforts at this boutique property. A 13-hour drive from Delhi and only six hours from Lucknow, this suite-only retreat will pamper you after a day spent navigating the sepia-tinted lanes and alleys of Varanasi. Conveniently located close to all the major attractions, including the holy River Ganges, Tree of Life Varanasi is your gateway to this ethereal city. Careful, you might just stumble upon nirvana during your stay here.",
    "offer_country_name": "India",
    "offer_country_code_alpha_2": "IN",
    "offer_geo_area_level_1": "Uttar Pradesh",
    "offer_geo_area_level_2": "Varanasi",
    "location_heading": "Varanasi",
    "location_subheading": "India",
    "location_description": "Tree of Life Varanasi",
    "offer_address": "Kazi Serai, Sehmalpur, Uttar Pradesh 221105, India",
    "percentage_discount": 38.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 220.0,
    "value": 357.0
  }
]