[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxkCNQAZ",
    "hero_image": "https://images.luxuryescapes.com/retco4g1mqnqgakj8y48",
    "image_two": "https://images.luxuryescapes.com/sndp8ncylq9pcf2qxnyr",
    "image_three": "https://images.luxuryescapes.com/b3spp0syvxkxb7km3fil",
    "vendor_name": "Ski Armadillo",
    "title": "Ski Chalet Luxury in Verbier, Switzerland",
    "description": "Experience one of the world’s best ski resorts with a luxury chalet stay including a private chef in the winter playground of Verbier, Switzerland. Loved by celebrities and royalty including Prince Harry, Leonardo DiCaprio and the Beckhams, you can experience this high-end skier’s paradise with daily breakfast, gourmet three-course dinners with two paired wines, daily afternoon tea and more included at Ski Armadillo.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Valais",
    "offer_geo_area_level_2": "Bagnes",
    "location_heading": "Verbier",
    "location_subheading": "Switzerland",
    "location_description": "Ski Armadillo",
    "offer_address": "Chemin des Vernes 5, 1936 Bagnes, Switzerland",
    "percentage_discount": 29.0,
    "min_duration": 7,
    "max_duration": 7,
    "price": 4443.0,
    "value": 6241.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003HHDUAA4",
    "hero_image": "https://images.luxuryescapes.com/l87nj9igo91um0cngziy",
    "image_two": "https://images.luxuryescapes.com/oob4w84zfdrf93d2lpkn",
    "image_three": "https://images.luxuryescapes.com/ya2961vndcp48rvvpdve",
    "vendor_name": "Experimental Chalet",
    "title": "Switzerland Ski Retreat in the Heart of Verbier with Alpine Views",
    "description": "Après-ski aficionados and alpine adventurers on the hunt for high-altitude hedonism need look no further than Experimental Chalet, a glamorous take on a traditional ski hotel in the heart of Switzerland’s Verbier. Standing proudly in the middle of the ski town, this 70s-inspired ski retreat is perfectly perched for days on the slopes and evenings on the schnapps. A complimentary hotel shuttle will take you and your gear to the main gondola every morning, but if you fancy stretching your legs, it’s only a 10-minute walk.\n\nThere's no doubting your location when you wake up each morning - every room and suite at Experimental Chalet has breathtaking views of the surrounding ranges, complementing the Fabrizio Casiraghi-designed interiors. After a day on the mountain, make a beeline for the ground-floor spa for a sports massage, facial or session in the hammam, or settle into a moss-green banquette in the restaurant to sample the locally inspired fare of French founder Greg Marchand. Retire to the first-floor bar to sip on curated cocktails by the open fire or take the party downstairs to the legendary Farm Club: skip the queues by using the VIP guests entrance, next to the reception desk.",
    "offer_country_name": "Switzerland",
    "offer_country_code_alpha_2": "CH",
    "offer_geo_area_level_1": "Valais",
    "offer_geo_area_level_2": "Bagnes",
    "location_heading": "Verbier",
    "location_subheading": "Switzerland",
    "location_description": "Experimental Chalet",
    "offer_address": "Route de Verbier Station 55, 1936 Verbier, Switzerland",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 196.0,
    "value": 196.0
  }
]