[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Uwx3AAC",
    "hero_image": "https://images.luxuryescapes.com/uo9xn54xx1827l1ue4",
    "image_two": "https://images.luxuryescapes.com/f88atp65acc6kb2wq5j",
    "image_three": "https://images.luxuryescapes.com/dzefnv66ypf0kjte359n",
    "vendor_name": "Hotel Katla",
    "title": "Secluded Iceland Nature Retreat with Stunning Mountain & Glacier Views",
    "description": "Explore the breathtaking mountains, black-sand beaches and glaciers of Iceland’s southern coast with a stay at Hotel Katla by Keahotels. Situated two-and-a-half hours from Reykjavik, near the quaint town of Vik, this rustic retreat is perfectly placed for exploring Iceland’s spectacular natural landscapes. Visit the black sands of Reynisfjara, before venturing to the iconic Skógafoss waterfall or Jökulsárlón glacier lagoon - all just a short drive away.\n\nIf you’re not sure where to start, Hotel Katla’s staff can help organise adventures amid the surrounding scenery, including horse riding, snowmobiling and guided walks of the majestic Mýrdalsjökull ice cap. After a big day out, return to the hotel to warm up in the geothermal pool and sauna - the staff will even deliver drinks while you soak. Should hunger strike, the rustic restaurant serves local specialties in a buffet format every evening, with warming dishes that will restore your energy after a day spent sightseeing.\n\n**Luxury Escapes inclusions (select packages/nights)**\n\n- Start the day with a delicious **daily buffet breakfast** at the onsite restaurant\n- Don’t feel rushed on your final day with **a late checkout**, subject to availability (for stays of 2+ nights)\n- Enjoy an **upgrade to the next best room category**, subject to availability (excludes Junior Suites; for stays of 4+ nights)\n\n**Suite Upgrade:** Enjoy the space of the modern Junior Suite, complete with views over the surrounding breathtaking landscapes, a large bathroom with walk-in shower, and monochrome detailing.\n\n**Travelling with family?** Upgrade to a Triple Room for three guests.",
    "offer_country_name": "Iceland",
    "offer_country_code_alpha_2": "IS",
    "offer_geo_area_level_1": "Southern Region",
    "offer_geo_area_level_2": "Vik I Myrdal",
    "location_heading": "Vik",
    "location_subheading": "Iceland",
    "location_description": "Hotel Katla by Keahotels",
    "offer_address": "Hofdabrekku, 871 Vík, Iceland",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 30,
    "price": null,
    "value": null
  }
]