[
  {
    "link": "https://luxuryescapes.com/offer/0062y000006QY2xAAG",
    "hero_image": "https://images.luxuryescapes.com/qk4fait32807zbx3v1u",
    "image_two": "https://images.luxuryescapes.com/92cjtpv6ljb7erma7zs",
    "image_three": "https://images.luxuryescapes.com/hrr6q20n1ot1fcperq6f",
    "vendor_name": "Orokawa Bay Retreat",
    "title": "Exclusive Coastal Villa for up to Eight Guests Less than Two Hours from Auckland",
    "description": "Immerse yourself in the tranquillity of your own private villa at Orokawa Bay Retreat, surrounded by native bush with sparkling turquoise bay views. This exclusive-use property has vast indoor and outdoor living spaces, perfect for long, balmy nights wining and dining with friends. There are four spacious bedrooms, each with its own ensuite and a hot tub perfectly perched to take in the incredible ocean and rural vistas.\n\nThe property is located at the most southern end of the Coromandel Peninsula, which consistently rates as having some of the best beaches in the world in the likes of National Geographic and Lonely Planet. Peruse the local seaside market at Waihi Beach, take a drive to discover the naturally heated mineral water at Hot Water Beach where you'll find hot water bubbling through the golden sand, or head inland to Hobbiton Movie Set Tours, as featured in The Lord of the Rings film trilogy.\n\n**Your handpicked inclusions:**\n\n- Two bottles of bubbly and a grazing platter of delicious local produce to share\n- Create your own breakfast with morning provisions supplied for the duration of your stay\n- Relax right up until the last moment with a guaranteed 11am late checkout\n\n**This deal has NO peak surcharges:** Travel any time for the same great price.",
    "offer_country_name": "New Zealand",
    "offer_country_code_alpha_2": "NZ",
    "offer_geo_area_level_1": "Waikato",
    "offer_geo_area_level_2": "Waihi",
    "location_heading": "Waihi",
    "location_subheading": "New Zealand",
    "location_description": "Orokawa Bay Retreat",
    "offer_address": "28 Poets Corner Road, Waihi 3681, New Zealand",
    "percentage_discount": 29.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 1585.0,
    "value": 2245.0
  }
]