[
  {
    "link": "https://luxuryescapes.com/offer/0060I00000damvUQAQ",
    "hero_image": "https://images.luxuryescapes.com/ovakgxjlpn6kq9pfejb",
    "image_two": "https://images.luxuryescapes.com/vdvb3qu4j5eau9u8evw",
    "image_three": "https://images.luxuryescapes.com/hres3ecxeam2t2ytbn1c",
    "vendor_name": "Wavi Island Villas",
    "title": "Private Fijian Island Exclusively for You and up to Five Guests",
    "description": "You no longer need to win the lottery or find fame to escape to your very own private island: at Wavi Island Villas, 27 acres of Fijian island is reserved just for you and up to five of your favourite people. Connected by gated security bridge to Vanua Levu, Fiji’s second-largest island, you will have easy access to restaurants, shops and entertainment while being able to enjoy a slice of paradise that is completely, absolutely yours. Stay in a three-bedroom luxury villa with return airport transfers, daily breakfast provisions, a welcome drink each and bottle of sparkling wine to share, use of fitness centre, two stand-up paddleboards and snorkelling gear. Plus, on-site management and concierge are always around to assist with island excursions, restaurant reservations and more.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Northern Division",
    "offer_geo_area_level_2": "Savusavu",
    "location_heading": "Wavi Island, Vanua Levu",
    "location_subheading": "Fiji",
    "location_description": "Wavi Island Villas - SEP2019",
    "offer_address": "Hibiscus Hwy, Fiji",
    "percentage_discount": 39.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 1646.0,
    "value": 2682.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LnGJAA0",
    "hero_image": "https://images.luxuryescapes.com/mw0vd2qe4t7qt1piby",
    "image_two": "https://images.luxuryescapes.com/5pe5q8i6rg16zk3n76b",
    "image_three": "https://images.luxuryescapes.com/7sdm2f6pipoy15gndc99p",
    "vendor_name": "Wavi Island Villas",
    "title": "Fiji Private Island Villa with Return Transfers for up to Six Guests",
    "description": "You no longer need to win the lottery to escape to your very own private island: at Wavi Island Villa, 27 tropical acres are reserved just for you. Connected by a gated security bridge to Vanua Levu, Fiji’s second-largest island, you will have easy access to restaurants, shops and entertainment while being able to enjoy a slice of paradise that is completely, absolutely and utterly yours.\n\nStay in villa luxury with return airport transfers, daily breakfast provisions, a welcome drink each and bottle of sparkling wine to share on arrival, use of the fitness centre, two stand-up paddleboards and snorkelling gear. Plus, onsite management and concierge are always around to assist with island excursions, restaurant reservations and more.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Northern Division",
    "offer_geo_area_level_2": "Savusavu",
    "location_heading": "Wavi Island, Vanua Levu",
    "location_subheading": "Fiji",
    "location_description": "Wavi Island Villas",
    "offer_address": "Hibiscus Hwy, Fiji",
    "percentage_discount": 58.0,
    "min_duration": 4,
    "max_duration": 6,
    "price": 1199.0,
    "value": 2868.0
  }
]