[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005IBH3AAO",
    "hero_image": "https://images.luxuryescapes.com/mjo4cmagmh81nfc0f5vp",
    "image_two": "https://images.luxuryescapes.com/yp2u705ydn0h7yg3h1r",
    "image_three": "https://images.luxuryescapes.com/wk35iut2gjme8gvh3r4i",
    "vendor_name": "Bushmans Kloof Wilderness Reserve & Wellness Retreat",
    "title": "Five-Star South Africa Wilderness Oasis Three Hours from Cape Town",
    "description": "Uncover layers upon layers of history and culture amid South Africa’s rugged Cederberg mountains with an escape at Bushmans Kloof Wilderness Reserve & Wellness Retreat, just three hours from Cape Town. One of the National Geographic Unique Lodges of the World, and listed in the Tripadvisor Travellers' Choice awards 2021, this five-star haven is set within its own private reserve in the UNESCO World Heritage-listed Cape Floral Region.\n\nImmerse yourself in the soul-stirring scenery on a nature drive with expert rangers in search of the Cape mountain zebra, springbok, and wildebeest, or marvel at the more than 130 ancient rock art sites across the reserve, dating back 10,000 years. Tap into the calming energy of the award-winning spa, or choose from one of the four glimmering pools to plunge into. Take advantage of the exceptional onsite dining options, from high tea and gourmet picnics to a romantic candlelit dinner under the stars, where menus change with the seasons and produce from the onsite gardens plays a leading role in each dish.",
    "offer_country_name": "South Africa",
    "offer_country_code_alpha_2": "ZA",
    "offer_geo_area_level_1": "Western Cape",
    "offer_geo_area_level_2": "Cederberg",
    "location_heading": "Western Cape",
    "location_subheading": "South Africa",
    "location_description": "Bushmans Kloof Wilderness Reserve & Wellness Retreat",
    "offer_address": "R364 Agert Pakhuis Pass, Clanwilliam, 8135, South Africa",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 557.0,
    "value": 557.0
  }
]