[
  {
    "link": "https://luxuryescapes.com/offer/0062y000005Ha90AAC",
    "hero_image": "https://images.luxuryescapes.com/bysie2ez6ppdjbhb3vn",
    "image_two": "https://images.luxuryescapes.com/yzzla2y1wm5s0xh7pjm",
    "image_three": "https://images.luxuryescapes.com/hu3kp5glrg1qqteuu7yf",
    "vendor_name": "The Menjangan Resort, West Bali National Park",
    "title": "Peaceful Nature Retreat on Private Beach in West Bali",
    "description": "Discover a secluded, serene slice of paradise at The Menjangan by LifestyleRetreats in the West Bali National Park, a stunning resort stamped with a Tripadvisor Travellers’ Choice 2021 award. Here, the busy soundtrack of city life is replaced with the sounds of birds twittering, treetops rustling, and the crashing of the ocean.\n\nThe main ethos of this intimate, boutique sanctuary is to reconnect with nature while restoring calm to the mind and body. Spend your days sipping cocktails poolside, indulging in a massage at Mangrove Spa, or lazing on the resort’s private Sentigi Beach. When you’re ready to explore, the unspoiled landscape of West Bali National Park awaits. Uncover the park on horseback, or search for wildlife on foot on a guided trek. Keen birders can head out with a pair of binoculars and a knowledgeable guide to spot some of the 120 species of birds in the park. Make use of the resort’s kayaks and paddle through the mangroves to discover the bay's secret beaches or don snorkels and explore the reef’s coral gardens and marine life.",
    "offer_country_name": "Indonesia",
    "offer_country_code_alpha_2": "ID",
    "offer_geo_area_level_1": "Bali",
    "offer_geo_area_level_2": "Pejarakan",
    "location_heading": "West Bali National Park",
    "location_subheading": "Bali",
    "location_description": "The Menjangan by LifestyleRetreats",
    "offer_address": "Jl. Raya Denpasar - Gilimanuk No.Km. 17, Pejarakan, Gerokgak, Kabupaten Buleleng, Bali 81155, Indonesia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 93.0,
    "value": 93.0
  }
]