[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C4nYJAAZ",
    "hero_image": "https://images.luxuryescapes.com/qlw3m606cm2xyhv98wj",
    "image_two": "https://images.luxuryescapes.com/m2vl6h5o310j2r523v9",
    "image_three": "https://images.luxuryescapes.com/i7jdq8ub9lpn4tt5f3li",
    "vendor_name": "Southern Man",
    "title": "Whitsundays & Great Barrier Reef Private Catamaran Charter for up to 8 Guests",
    "description": "Set sail amid the spectacular beauty of the Whitsundays and Great Barrier Reef onboard the cruising catamaran Southern Man, with Anchor Charters’ bareboat private sailing experience. Exclusively for your group of up to eight, Southern Man boasts four double cabins, each featuring a private ensuite. There’s no dreamier way to explore the Whitsundays' crystal-clear waters - with no set itinerary and 74 extraordinary emerald islands on the horizon, you’re free to snorkel and splash among whales, dolphins, turtles and tropical fish at your own pace.\n\nSail in style - Southern Man comes complete with a Nespresso machine, kitchenette, deckchairs, a stern-mounted BBQ, private dinghy and more. Plus, thanks to an included full maritime briefing, this is an adventure even novices can sail towards. With exclusive Ocean Club access prior to boarding the vessel with use of luxury bathroom and BBQ facilities, you’ll be all set for the escape of a lifetime.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Anchor Charters",
    "offer_address": "Coral Sea Marina, Shingley Drive, Airlie Beach 4802, Queensland Australia",
    "percentage_discount": 42.0,
    "min_duration": 5,
    "max_duration": 12,
    "price": 3779.0,
    "value": 6470.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GxZX2AAN",
    "hero_image": "https://images.luxuryescapes.com/11og9sxw4otz8bs0oasi",
    "image_two": "https://images.luxuryescapes.com/62q6fq9ovp6jl7s3yx96",
    "image_three": "https://images.luxuryescapes.com/xg3c3u8r0ghmh4ohet2i",
    "vendor_name": "Club Wyndham Airlie Beach",
    "title": "Airlie Beach Self-Contained Apartment Paradise near the Whitsundays with Daily Breakfast & Nightly Drinks",
    "description": "Be perfectly positioned at the gateway to the wonders of the Whitsundays and the Great Barrier Reef when you stay at Club Wyndham Airlie Beach, where apartment living and resort paradise meet. Your stylish, self-contained apartment offers both comfort and privacy, while the rest of the resort has everything else you might need for a memorable escape. Head to Tides at Airlie Beach for a culinary venture into modern Australian cuisine infused with Asian influences, along with stunning views of the nearby harbour. Take a dip in the refreshing outdoor swimming pool or lay back on a sunlounger and enjoy a cocktail or two. When you’re ready to work up a sweat, the fitness centre has all the equipment you need to enjoy a good workout.\n\nFor a day in the sun, take a leisurely 20-minute stroll to Boathaven Beach and roll out a towel on the soft, white sand or enjoy a paddle in the crystal-clear waters. Later, head out and explore the best of the Whitsundays, such as the famous Whitehaven Beach, Hamilton Island and Whitsunday Islands National Park. When you’ve had your fill of sun and sand, relax in the comfort of your apartment, taking a nap on the plush bedding or whipping up a home-cooked meal in the fully equipped kitchen.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Club Wyndham Airlie Beach",
    "offer_address": "9A Hermitage Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 46.0,
    "min_duration": 3,
    "max_duration": 14,
    "price": 419.0,
    "value": 769.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EwpCYAAZ",
    "hero_image": "https://images.luxuryescapes.com/4yhenn0vniqspclq0y32",
    "image_two": "https://images.luxuryescapes.com/osnf8ged79ykhe422dhm",
    "image_three": "https://images.luxuryescapes.com/0fa5g5pi9cxavkk8ro9r",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Bestselling Whitsundays Private Sailing Charter for 6 Guests with Early Boarding & Ocean Club Access Plus Upgrades for 8 Guests",
    "description": "Be the captain of your adventure on this incredible voyage through the majestic Whitsundays with a once-in-a-lifetime opportunity to charter a vessel through acclaimed eco-tour agency Portland Roads - Sailing the Whitsundays. It's the ultimate group escape: set sail on the catamaran Due West for up to six guests, or upgrade to Ruby Sunday, Lucy, Portland Roads or Whitsunday Freedom for up to eight. Glide through sapphire waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, stroll barefoot across the warm, white sands of untouched islands and delve into the coral-filled paradise shimmering beneath the Whitsundays' waves: Portland Roads - Sailing the Whitsundays will take you wherever you need to be.\n\nAfter a day spent exploring any of the region's 74 emerald islands, retreat in style to your spacious premium luxury catamaran and savour each magnificent sunset as you sit back and dine by the waterfront in either your outdoor or indoor dining setting. Featuring a full maritime briefing, this six-day, five-night sailing adventure (with one bonus evening moored at the marina) is suitable for all, with no prior experience required. If it's always been your dream to sail through one of the Seven Natural Wonders of the World, now's the perfect chance.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays",
    "offer_address": "Coral Sea Marina - Shingley Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 45.0,
    "min_duration": 6,
    "max_duration": 6,
    "price": 3299.0,
    "value": 6030.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LdnQAAS",
    "hero_image": "https://images.luxuryescapes.com/mcw1onoplonirrnuadx",
    "image_two": "https://images.luxuryescapes.com/0tnlocdbrhi7bfcsnv",
    "image_three": "https://images.luxuryescapes.com/mthidywqhaufwnpudjk",
    "vendor_name": "Freedom Shores",
    "title": "Unique Beachfront Whitsundays Escape with Daily Sunset Cocktails",
    "description": "If you are a lover of all things unique - and nautical - you will absolutely love Freedom Shores Resort, located right by the water on the outskirts of Airlie Beach and boasting spectacular views over the Coral Sea. Go beyond just a maritime picture in the lobby and fully embrace the unique architectural style of this resort, where you can sleep in a replica of a fishing boat with the added luxury of ultra-modern comforts. Your one-of-a-kind escape includes daily continental breakfast, daily sunset drinks - your choice of a hand-crafted cocktail, craft beer or glass of premium wine - a welcome glass of sparkling wine each and one A$50 dining and drinks credit for lunch or dinner at the award-winning onsite Northerlies Beach Bar & Grill.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Freedom Shores - Feb 2020",
    "offer_address": "Lot 103 Pringle Rd, Woodwark QLD 4802",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 359.0,
    "value": 657.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IepcrAAB",
    "hero_image": "https://images.luxuryescapes.com/shxibczv45oe5dwov78r",
    "image_two": "https://images.luxuryescapes.com/a83udavbdjabhps2xpq",
    "image_three": "https://images.luxuryescapes.com/oxy359tg29eaa0n5peeh",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Bestselling Whitsundays Private Sailing Charter for 8 Guests with Early Boarding, Ocean Club Access & A$250 Provisions Credit",
    "description": "Be the captain of your own adventure and voyage through the majestic Whitsundays with a once-in-a-lifetime opportunity to charter a vessel through acclaimed eco-tour agency Portland Roads - Sailing the Whitsundays.\n\nWith a full maritime briefing provided, this six-day, five-night sailing adventure (with one bonus evening moored at the marina) is suitable for all, with no prior experience required. It's the ultimate group escape: set sail with up to eight guests on the catamaran Portland Roads, LAWLESS or Whitsunday Freedom.\n\nGlide through sapphire waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, stroll barefoot across the warm, white sands of untouched islands and delve into the coral-filled paradise shimmering beneath the Whitsundays' waves.\n\nAfter a day spent exploring any of the region's 74 emerald islands, retreat in style to your spacious premium luxury catamaran and savour meals accompanied by magnificent sunsets in either your outdoor or indoor dining setting. If it's always been your dream to sail through one of the Seven Natural Wonders of the World, now's the perfect chance.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays",
    "offer_address": "Coral Sea Marina - Shingley Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 42.0,
    "min_duration": 6,
    "max_duration": 6,
    "price": 3964.0,
    "value": 6832.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002IAwiIAG",
    "hero_image": "https://images.luxuryescapes.com/plszmfte7lbtsm5eg3uq",
    "image_two": "https://images.luxuryescapes.com/yyvbtwhqoow0ibxsu7zo",
    "image_three": "https://images.luxuryescapes.com/otx1fqadvslem43a8y2f",
    "vendor_name": "Mantra Club Croc",
    "title": "Newly Renovated Whitsundays Escape near Airlie Beach with Daily Breakfast, Nightly Drinks & A$25 Daily Dining Credit",
    "description": "Retreat to the balmy tropics of the Whitsundays with a stay at this charming retreat, just a five-minute drive from Airlie Beach. Perfect for peaceful days exploring the area’s best beaches and bays - or days of rest before jetting to the nearby islands of the Whitsundays - Mantra Club Croc Airlie Beach offers one of the region’s finest laidback escapes.\n\nAfter substantial renovations, this coastal escape offers a shimmering lagoon-style pool, lush garden and brand-new amenities. With a daily A$25 dining credit included, lap up the warm weather while dining on locally sourced seafood at the breezy Club Croc Bistro or enjoying ice-cold cocktails by the pool.\n\nExplore the vibrant Airlie Beach Lagoon and the town’s bustling Saturday markets, or head to the nearby marina to set sail to the Great Barrier Reef.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Cannonvale",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Mantra Club Croc Airlie Beach",
    "offer_address": "240 Shute Harbour Road, Cannonvale, Queensland 4802, Australia",
    "percentage_discount": 36.0,
    "min_duration": 3,
    "max_duration": 10,
    "price": 299.0,
    "value": 466.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004zbFlAAI",
    "hero_image": "https://images.luxuryescapes.com/mzaeuo5fp71wd2ou0tj",
    "image_two": "https://images.luxuryescapes.com/3v1l6yef2nzsmyegj81l",
    "image_three": "https://images.luxuryescapes.com/48mlau179cqb8d80r9v",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "It's Back: Whitsundays Private Sailing Charter for up to 8 Guests with Luxury Skippered Upgrades Available",
    "description": "Be the captain of your own adventure on this incredible bareboat voyage through the majestic beauty of the Whitsundays. Back by popular demand, this is a once-in-a-lifetime opportunity to charter your own vessel - or upgrade to holiday like royalty, with a private skipper to guide you onboard the brand-new Whistunday Freedom catamaran.\n\nWith luxury catamarans for up to eight guests available (or six guests on skippered charters), split the cost of this unbelievable experience with family and friends. Glide through crystal-clear waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, stroll barefoot across the velvety white sands of untouched islands and delve into the snorkelers' paradise shimmering beneath the Whitsundays' waves.\n\nFeaturing a full maritime briefing, this six-night sailing adventure is suitable for all, with no prior experience required.\n\n**Your handpicked inclusions:**\n\n- Spend six full days onboard your choice of luxury catamaran\n- Enjoy early boarding at 5pm on the day of arrival with an overnight stay onboard the catamaran in the Coral Sea Marina (six nights onboard total)\n- With your early boarding, enjoy access to Ocean Club, with private ensuites and an outdoor lounge space for marina guests\n- Benefit from a full maritime briefing (4-5 hours) to learn the secrets of navigating the Whitsundays\n\n**Private Skipper Upgrade:** Holiday like the rich and famous with the guidance of an experienced skipper, who will help you unearth the secrets of the Whitsundays. Set sail on the brand-new Whitsunday Freedom, an extraordinary Lagoon 450S sailing catamaran with spacious double cabins, each with private ensuite. A personal skipper, aboard a luxury catamaran for up to six friends, sailing through the natural beauty of the Whitsundays: this is the ultimate sailing escape. **Please note:** The Whitsunday Freedom Skipper Upgrade can accommodate six guests across three cabins, with a fourth cabin reserved for your skipper.\n\n**This deal has NO surcharges:** Sail any time, including school holidays, for the same great price!",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays 2021",
    "offer_address": "Coral Sea Marina - Shingley Drive Airlie Beach Qld 4802",
    "percentage_discount": 47.0,
    "min_duration": 6,
    "max_duration": 6,
    "price": 3809.0,
    "value": 7200.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000FiJtwAAF",
    "hero_image": "https://images.luxuryescapes.com/0jpubvtgma6x1zyr8hi",
    "image_two": "https://images.luxuryescapes.com/20tzii5cq4k77c4wud",
    "image_three": "https://images.luxuryescapes.com/1a2yg4ngwppgcs9lt1b",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Bestselling Whitsundays Private Sailing Charter for 6 Guests with Early Boarding & Ocean Club Access Plus Upgrades for 8 Guests",
    "description": "Be the captain of your own adventure on this incredible voyage through the majestic Whitsundays with a once-in-a-lifetime opportunity to charter a vessel through acclaimed eco-tour agency Portland Roads - Sailing the Whitsundays. It's the ultimate group escape: set sail on the catamaran Due West for up to six guests, or upgrade to Ruby Sunday, Portland Roads, LAWLESS or Whitsunday Freedom for up to eight guests. Glide through sapphire waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, stroll barefoot across the warm, white sands of untouched islands and delve into the coral-filled paradise shimmering beneath the Whitsundays' waves.\n\nAfter a day spent exploring any of the region's 74 emerald islands, retreat in style to your spacious premium luxury catamaran and savour meals accompanied by magnificent sunsets in either your outdoor or indoor dining setting. With a full maritime briefing provided, this six-day, five-night sailing adventure (with one bonus evening moored at the marina) is suitable for all, with no prior experience required. If it's always been your dream to sail through one of the Seven Natural Wonders of the World, now's the perfect chance.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays",
    "offer_address": "Coral Sea Marina - Shingley Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 45.0,
    "min_duration": 6,
    "max_duration": 6,
    "price": 3244.0,
    "value": 5930.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JSENTAA5",
    "hero_image": "https://images.luxuryescapes.com/v1n318a1xu6038thx08m",
    "image_two": "https://images.luxuryescapes.com/xjph84xeggx2mek7tkc",
    "image_three": "https://images.luxuryescapes.com/4clj25aasr1brdn42ea",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Bestselling Whitsundays Private Sailing Charter for 6 Guests with Early Boarding & Ocean Club Access Plus Upgrades for 8 Guests",
    "description": "Be the captain of your own adventure on this incredible voyage through the majestic Whitsundays with a once-in-a-lifetime opportunity to charter a vessel through acclaimed eco-tour agency Portland Roads - Sailing the Whitsundays.\n\nIt's the ultimate group escape: set sail on the catamaran **DUE WEST** for up to six guests, or upgrade to **RUBY SUNDAY**, **LUCY** or **SOUTHERN MAN** for up to eight guests. Glide through sapphire waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, stroll barefoot across the warm, white sands of untouched islands and delve into the coral-filled paradise shimmering beneath the waves.\n\nAfter a day spent exploring any of the region's 74 emerald islands, retreat to the comfort of your private catamaran anchored in a quiet bay, and whip up a storm in the galley sitting back and enjoying magnificent sunsets. With a full maritime briefing provided, this six-day, five-night sailing adventure (with one bonus evening moored at the marina) is suitable for all, with no prior experience required.\n\nIf it's always been your dream to sail through one of the Seven Natural Wonders of the World, now's the perfect chance.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays",
    "offer_address": "Coral Sea Marina - Shingley Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 49.0,
    "min_duration": 6,
    "max_duration": 6,
    "price": 3399.0,
    "value": 6680.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgisVQAQ",
    "hero_image": "https://images.luxuryescapes.com/hpwqyiyxsfqkl1mnit4a",
    "image_two": "https://images.luxuryescapes.com/nundzqvelogyvzm2axgk",
    "image_three": "https://images.luxuryescapes.com/bhjwc30yen424eqoqcv8",
    "vendor_name": "Elysian Retreat",
    "title": "Grand Opening: All-Inclusive Eco-Luxury on an Undisturbed Island",
    "description": "Discover the newest resort in the Whitsundays: an all-inclusive, adults-only retreat nestled amid lush rainforest on a pristine island and completely off the grid. Exuding secluded privacy and catering to a maximum of 20 guests, Elysian retreat is set to deliver one of the most unique and exclusive holiday experiences in Australia. Spend five nights in a striking Oceanfront Villa and indulge with daily breakfast, lunches and nightly three-course dinners paired with New Zealand and Australian wines, a nightly cocktail accompanied by canapes, a 60-minute spa treatment, a complimentary bottle of sparkling wine and unlimited use of all water sports equipment.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Elysian Retreat - 2019",
    "offer_address": "Long Island, Whitsundays, QLD, 4802, Australia",
    "percentage_discount": 35.0,
    "min_duration": 4,
    "max_duration": 9,
    "price": 3072.0,
    "value": 4721.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000csXh0QAE",
    "hero_image": "https://images.luxuryescapes.com/nl7u5fhqs6214tj59l",
    "image_two": "https://images.luxuryescapes.com/3jg8zbbgr65fbymofuh9",
    "image_three": "https://images.luxuryescapes.com/ws089kgcr9tauz5p1tf",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Exclusive Whitsundays Adventure: Private Sailing Experience for Six or Eight People",
    "description": "Split the bill and set sail with ease! Grab your family or friends and set sail on the crystal-clear waters of the dreamy Whitsundays with a range of catamarans accommodating up to six or eight guests in cabins with private ensuites. Visit some of the area’s 74 islands and discover the diverse underwater nirvana, spotting incredible marine and wildlife including whales, turtles, dolphins and an abundance of tropical fish. With a full maritime briefing included, this incredible escape is even suitable for sailing beginners. Enjoy a night of accommodation on board your vessel at the marina before your adventure, with complimentary access to the Ocean Club ensuites and bonus 5pm boarding.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays 2019",
    "offer_address": "Q3, Q4, Q5 & Q6 Coral Sea Marina - Shingley Drive Airlie Beach Qld 4802",
    "percentage_discount": 52.0,
    "min_duration": 6,
    "max_duration": 6,
    "price": 2975.0,
    "value": 6262.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GOg3QAAT",
    "hero_image": "https://images.luxuryescapes.com/yxitflyzrk6g9u0elon1",
    "image_two": "https://images.luxuryescapes.com/yuetywxayge465i06ltr",
    "image_three": "https://images.luxuryescapes.com/rd4oy90gkfx9pzd77p7",
    "vendor_name": "Southern Man",
    "title": "Bestselling Whitsundays & Great Barrier Reef Private Catamaran for 8 Guests with Ocean Club Access",
    "description": "Set sail amid the spectacular beauty of the Whitsundays and Great Barrier Reef onboard the cruising catamaran Southern Man. This Anchor Charters' bareboat private sailing experience is exclusive for your group of up to eight, boasting four double-bed cabins, each with a private ensuite. With no set itinerary and 74 extraordinary emerald islands on the horizon, you’re free to snorkel and splash among whales, dolphins, turtles and tropical fish at your own pace.\n\nSouthern Man is home to a Nespresso machine, kitchenette, deckchairs, stern-mounted BBQ, private dinghy and more. Plus, thanks to an included full maritime briefing, this is an adventure even beginners can embark upon. With exclusive Ocean Club access before boarding the vessel, you’ll be all set for the escape of a lifetime.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Anchor Charters",
    "offer_address": "Coral Sea Marina, Shingley Drive, Airlie Beach 4802, Queensland Australia",
    "percentage_discount": 41.0,
    "min_duration": 5,
    "max_duration": 5,
    "price": 3599.0,
    "value": 6120.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EzQ6vAAF",
    "hero_image": "https://images.luxuryescapes.com/jntyd71k5dxslx00an3d",
    "image_two": "https://images.luxuryescapes.com/x8x8slbmz96wbg1inqaw",
    "image_three": "https://images.luxuryescapes.com/f9uistlq6py3dyb7a0qm",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Brand-New Whitsundays Luxury Private Sailing Charter for up to Eight Guests with Early Boarding & A$500 Provisioning Credit",
    "description": "Be the captain of your own adventure on this incredible voyage through the majestic Whitsundays with this once-in-a-lifetime opportunity to charter the brand-new premium luxury catamaran LAWLESS, journeying with acclaimed eco-tour agency Portland Roads - Sailing the Whitsundays. Boasting four light-filled, elegant double cabins - each with its own private ensuite - this extraordinary experience easily accommodates up to eight guests. Glide through sapphire waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, stroll barefoot across the warm, white sands of untouched islands and delve into the coral-filled paradise shimmering beneath the Whitsundays' waves - LAWLESS will take you wherever you need to be.\n\nAfter a day spent exploring any of the region's 74 emerald islands, retreat in style to your spacious premium luxury catamaran and savour each magnificent sunset as you dine by the waterfront on the vessel's exquisite outside deck. Featuring a full maritime briefing, this six-day, five-night sailing adventure (with one bonus evening moored at the marina) is suitable for all, with no prior experience required - if it's always been your dream to sail through one of the Seven Natural Wonders of the World, now's the perfect chance.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays",
    "offer_address": "Coral Sea Marina - Shingley Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 36.0,
    "min_duration": 6,
    "max_duration": 6,
    "price": 5489.0,
    "value": 8632.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000aiMDPQA2",
    "hero_image": "https://images.luxuryescapes.com/slcugsowmwkfhd1b6wl6",
    "image_two": "https://images.luxuryescapes.com/pnm01whjtigfn1oga8qn",
    "image_three": "https://images.luxuryescapes.com/jcugmupdda9f1n1qcygj",
    "vendor_name": "Daydream Island Resort",
    "title": "Grand Reopening: Iconic Daydream Island is Back",
    "description": "It’s time to celebrate the reopening of an Australian favourite - Daydream Island is back and better than ever! With new dining venues, waterfront suites, an underwater observatory and the iconic Living Reef (offering 200m of coral lagoon), you can once again enjoy this stunning location, overlooking the crystal-clear waters of the Whitsundays. Included in your grand reopening escape is daily buffet breakfast, one poolside lunch, your choice of one à la carte or buffet dinner, a nightly cocktail each at Tonic, the resort’s brand-new specialty gin bar, return airport/port transfers, a Living Reef experience and much more. Travelling as a family? Two children (aged 11 years and under), stay, play and eat for free!",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Daydream Island - 2019",
    "offer_address": "Daydream Island, Whitsundays QLD 4802",
    "percentage_discount": 49.0,
    "min_duration": 5,
    "max_duration": 7,
    "price": 949.0,
    "value": 1844.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000bgLP1QAM",
    "hero_image": "https://images.luxuryescapes.com/awlvvd2haiw7l0tqzrjc",
    "image_two": "https://images.luxuryescapes.com/yegftxgovbewkvvtj1kv",
    "image_three": "https://images.luxuryescapes.com/sz5kvranyccc4h19yi11",
    "vendor_name": "Freedom Shores",
    "title": "Grand Opening: Bespoke Whitsundays Beachfront Escape",
    "description": "If you are a lover of all things unique - and nautical - you will absolutely love this brand-new resort, located right by the water on the outskirts of Airlie Beach and boasting spectacular views over the Coral Sea. Freedom Shores gives you the opportunity to sleep in a replica of a fishing boat, with the added luxury of ultra-modern comforts. Your one-of-a-kind escape includes daily breakfast, a sunset cocktail per person, a welcome glass of sparkling wine, two AU$50 credits to be used for lunch or dinner at the resort and a leisurely late 12pm checkout.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Freedom Shores 2019",
    "offer_address": "Lot 103 Pringle Rd, Woodwark QLD 4802",
    "percentage_discount": 44.0,
    "min_duration": 3,
    "max_duration": 5,
    "price": 375.0,
    "value": 669.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000003Gs6pAAC",
    "hero_image": "https://images.luxuryescapes.com/xp86nezrxrn04sqx5i4",
    "image_two": "https://images.luxuryescapes.com/5tuj8ytnxlolyd4wc6c9",
    "image_three": "https://images.luxuryescapes.com/3ezsonouprdujt1rxef",
    "vendor_name": "Palm Bay Resort",
    "title": "Whitsundays Private Villa Escape with Whitehaven Beach Tour & Return Transfers",
    "description": "A new type of self-catering villa relaxation unfolds at this remote island resort. Tucked into a quiet bay on Long Island in the glistening Whitsunday archipelago, Palm Bay Resort offers unparalleled seclusion with a mere 25 Bali-inspired villas, bures, suites and bungalows overlooking the crystal-clear Coral Sea.\n\nExperience a unique, boutique stay where you can enjoy barefoot luxury in this secluded cove. Bring your own provisions to create a romantic banquet in the self-catered gourmet kitchen or treat yourself at the onsite restaurant - the choice is yours.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsundays",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Palm Bay Resort",
    "offer_address": "Long Island, Whitsundays, Queensland 4741, Australia",
    "percentage_discount": 38.0,
    "min_duration": 4,
    "max_duration": 8,
    "price": 719.0,
    "value": 1153.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UxISCQA3",
    "hero_image": "https://images.luxuryescapes.com/sju7szmmp6rpaivyltnn",
    "image_two": "https://images.luxuryescapes.com/juz1cgeped7s5rmiwsdo",
    "image_three": "https://images.luxuryescapes.com/qdysythvzzjesghsktjk",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Private Sailing Adventure in the Whitsundays",
    "description": "Immerse yourself in the breathtaking natural beauty of the Whitsundays in Queensland, sailing the aquamarine waters on your very own privately chartered catamaran. Grab your friends and family for the adventure of a lifetime as you explore some of the region’s 74 islands. Dive and swim in pristine, clear waters, snorkel the spectacular Great Barrier Reef and spot incredible marine and wildlife including whales, turtles, dolphins, tropical fish and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays - 2018",
    "offer_address": "M& N Arms - Abell Point Marina, Shingley Dr, Airlie Beach QLD 4802",
    "percentage_discount": 50.0,
    "min_duration": 4,
    "max_duration": 5,
    "price": 2600.0,
    "value": 5201.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004VjnlAAC",
    "hero_image": "https://images.luxuryescapes.com/tlfb1z9szbwq80dzwcte",
    "image_two": "https://images.luxuryescapes.com/chfd7j1m90pgracg3e",
    "image_three": "https://images.luxuryescapes.com/k2krs1sviuzascd48yd",
    "vendor_name": "Southern Man",
    "title": "Whitsundays Bareboat Private Catamaran Charter for up to 8 Guests",
    "description": "Island-hopping through the Whitsundays' 74 emerald jewels on a private catamaran was once a pastime reserved for the jet-set elite... now you too can experience the ultimate in sailing luxury with a six-night voyage onboard a classic Lagoon 410 catamaran for up to eight guests. Escape the everyday and be the captain of your very own bareboat adventure - lay back, relax and take in the uninterrupted beauty of this UNESCO World Heritage-listed oasis at your own pace.\n\nWith this enticing package, you’re not restricted by any itinerary - in fact, exploration is encouraged. Plunge into the heart of the breathtaking Whitsundays as you snorkel through the crystal-clear waters of the Great Barrier Reef, marvel at the kaleidoscopic world below the waves and discover the footprint-free sands of untouched islands.\n\nFeaturing a private dinghy and a full maritime briefing, with the option to hire a skilled personal Sail Guide for a surcharge (see Fine Print for details), this once-in-a-lifetime bareboat experience is suitable for all, with no prior experience required.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Anchor Charters",
    "offer_address": "Coral Sea Marina, Shingley Drive, Airlie Beach 4802, Queensland Australia",
    "percentage_discount": 47.0,
    "min_duration": 6,
    "max_duration": 12,
    "price": 3471.0,
    "value": 6603.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008J9MSAA0",
    "hero_image": "https://images.luxuryescapes.com/1h3hd3y724wfjgfbon",
    "image_two": "https://images.luxuryescapes.com/dr0m2q7qi68bsgfmiao",
    "image_three": "https://images.luxuryescapes.com/9pgqbtqr6hhwi4s652x8",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Bestselling Whitsundays Private Sailing Charter for up to Six Guests with Early Boarding & Ocean Club Access",
    "description": "Be the captain of your own adventure on this incredible voyage through the majestic Whitsundays with this once-in-a-lifetime opportunity to charter your own vessel with Portland Roads - Sailing the Whitsundays. Split the cost of this unbelievable experience with family and friends: set sail on the catamaran Due West for up to six guests, or upgrade to a catamaran for up to eight. Glide through crystal-clear waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, stroll barefoot across the velvety white sands of untouched islands and delve into the snorkelers' paradise shimmering beneath the Whitsundays' waves.\n\nAfter a day spent exploring any of the region's 74 emerald islands, retreat in style to your spacious catamaran. Featuring a full maritime briefing, this six-night sailing adventure is suitable for all, with no prior experience required. If it's always been your dream to sail through one of the Seven Natural Wonders of the World, now's the perfect chance.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays",
    "offer_address": "Coral Sea Marina - Shingley Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 45.0,
    "min_duration": 5,
    "max_duration": 6,
    "price": 3464.0,
    "value": 6332.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000Eg4VPYAZ",
    "hero_image": "https://images.luxuryescapes.com/8rcl0mz6fwb438lr9ii",
    "image_two": "https://images.luxuryescapes.com/mias2t1coxqok5lmtou1i",
    "image_three": "https://images.luxuryescapes.com/96dxpyj6umnijc0vqv1",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Bestselling Whitsundays Private Sailing Charter for 6 Guests with Early Boarding & Ocean Club Access Plus Upgrades for 8 Guests",
    "description": "Be the captain of your own adventure on this incredible voyage through the majestic Whitsundays with a once-in-a-lifetime opportunity to charter a vessel through acclaimed eco-tour agency Portland Roads - Sailing the Whitsundays.\n\nIt's the ultimate group escape: set sail on the catamaran **DUE WEST** for up to six guests, or upgrade for up to eight guests. Glide through sapphire waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, stroll barefoot across the warm, white sands of untouched islands and delve into the coral-filled paradise shimmering beneath the waves.\n\nAfter a day spent exploring any of the region's 74 emerald islands, retreat to the comfort of your private catamaran anchored in a quiet bay, and whip up a storm in the galley sitting back and enjoying magnificent sunsets. With a full maritime briefing provided, this six-day, five-night sailing adventure (with one bonus evening moored at the marina) is suitable for all, with no prior experience required.\n\nIf it's always been your dream to sail through one of the Seven Natural Wonders of the World, now's the perfect chance.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays",
    "offer_address": "Coral Sea Marina - Shingley Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 50.0,
    "min_duration": 6,
    "max_duration": 6,
    "price": 3189.0,
    "value": 6372.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004U66EAAS",
    "hero_image": "https://images.luxuryescapes.com/79p39gdz26e0cw4yph5",
    "image_two": "https://images.luxuryescapes.com/fm1dtd5u21exnzjwin",
    "image_three": "https://images.luxuryescapes.com/jge9nyk4gltn73vug0q",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Whitsundays Private Sailing Charter for up to 8 Guests with Luxury Skippered Upgrade Available",
    "description": "Be the captain of your own adventure on this incredible bareboat voyage through the Whitsundays. This is a once-in-a-lifetime opportunity to charter your own vessel - or upgrade to holiday like royalty with a private skipper, who will guide you through the majestic beauty of this destination onboard the brand-new Whistunday Freedom catamaran.\n\nWith luxury catamarans for up to eight guests available, split the cost of this unbelievable experience with family and friends. Glide through crystal-clear waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, stroll barefoot across the velvety white sands of untouched islands and delve into the snorkelers' paradise shimmering beneath the Whitsundays' waves.\n\nFeaturing a full maritime briefing, this six-night sailing adventure is suitable for all, with no prior experience required.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays 2021",
    "offer_address": "Coral Sea Marina - Shingley Drive Airlie Beach Qld 4802",
    "percentage_discount": 50.0,
    "min_duration": 6,
    "max_duration": 6,
    "price": 3229.0,
    "value": 6490.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002LlpLAAS",
    "hero_image": "https://images.luxuryescapes.com/6sj2fw5rtmif3299kqqn",
    "image_two": "https://images.luxuryescapes.com/vx663378f9cuy1xqe25",
    "image_three": "https://images.luxuryescapes.com/9dt5g6o2o83x1hcv0yz",
    "vendor_name": "Queen Marie",
    "title": "Luxury Whitsundays Private Powered Catamaran Charter for up to 8 Guests",
    "description": "Make your dream of island-hopping through the crystal-clear waters of Australia's majestic Whitsundays a reality with a once-in-a-lifetime experience onboard Queen Marie, a luxury powered catamaran. Escape on a unique voyage for up to eight guests and explore the Whitsundays' 74 magnificent islands.\n\nWith its luxury finishes and generous space, Queen Marie offers an enjoyable cruising experience for all. Whatever your level of boating experience, you will be fully prepared to be the skipper of your own Whitsundays adventure. On the first day of your charter, take advantage of early 5pm boarding to relax and acquaint yourself with the vessel, before spending the first night onboard at the Coral Sea Marina (five nights total).\n\n**Perfect for groups**: A private charter for up to eight people.\n\n**This deal has no surcharges**: Set sail when it suits you, for the same incredible price.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Queen Marie Whitsundays",
    "offer_address": "Shingley Dr, Cannonvale QLD 4802",
    "percentage_discount": 47.0,
    "min_duration": 5,
    "max_duration": 5,
    "price": 3299.0,
    "value": 6174.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000UutgcQAB",
    "hero_image": "https://images.luxuryescapes.com/chry6a1qfu1qi5hrvcrk",
    "image_two": "https://images.luxuryescapes.com/yzwwurq5gajfdyiqh3sf",
    "image_three": "https://images.luxuryescapes.com/nu9wnf5akh5xhklcd2pr",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Private Sailing Adventure in the Spectacular Whitsundays",
    "description": "Soak up the breathtaking natural beauty of the Whitsundays in Queensland, sailing the aquamarine waters on your very own privately chartered catamaran. Grab your friends and family for the adventure of a lifetime as you explore some of the region’s 74 islands. Dive and swim in pristine, clear waters, snorkel the spectacular Great Barrier Reef and spot incredible marine and wildlife including whales, turtles, dolphins, tropical fish and more.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays - 2018",
    "offer_address": "M& N Arms - Abell Point Marina, Shingley Dr, Airlie Beach QLD 4802",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 5,
    "price": 3020.0,
    "value": 6042.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0060I00000WK6G3QAL",
    "hero_image": "https://images.luxuryescapes.com/rgomj7xqubgqnfmovjf4",
    "image_two": "https://images.luxuryescapes.com/nwdmi5umhhnl2mt3mqrq",
    "image_three": "https://images.luxuryescapes.com/whsct6wq8fxtlbnchyq6",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Private Sailing Adventure in the Spectacular Whitsundays",
    "description": "Embark on the adventure of a lifetime, sailing the azure waters of Queensland’s Whitsundays on your very own privately chartered catamaran. Without the restrictions of an itinerary, you’ll be free to explore this beautiful region at your leisure: visit some of the area’s 74 islands, go snorkeling, and spot incredible marine and wildlife including whales, turtles, dolphins, tropical fish and more. Suitable even for sailing novices thanks to an included full maritime briefing, there is nothing stopping you from grabbing your family and friends and setting sail for this incredible escape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays - 2018",
    "offer_address": "M& N Arms - Abell Point Marina, Shingley Dr, Airlie Beach QLD 4802",
    "percentage_discount": 50.0,
    "min_duration": 5,
    "max_duration": 5,
    "price": 3070.0,
    "value": 6141.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DQNByAAP",
    "hero_image": "https://images.luxuryescapes.com/q3ei3r6ntenj7a18mytq",
    "image_two": "https://images.luxuryescapes.com/l8nemovtwfv3kmbnxl8f",
    "image_three": "https://images.luxuryescapes.com/pdx1qhb65g5mwb37zu9m7",
    "vendor_name": "Daydream Island Resort",
    "title": "Iconic Daydream Island in the Heart of the Whitsundays & Great Barrier Reef with Room Upgrade, A$100 Credit & Daily Breakfast",
    "description": "Experience the magic of the Whitsundays with a stay at the impressive Daydream Island Resort - an iconic family-friendly escape at the gateway to the UNESCO World Heritage-listed Great Barrier Reef. Just five kilometres off the coast of the mainland and surrounded by lush rainforest with a fringe of cool coastline, this resort is only accessible by boat or helicopter. With three restaurants, a revitalised pool area and a manmade free-form coral lagoon wrapping 200m around the central building, this is one of the best ways to enjoy this stunning part of Queensland, the Great Barrier Reef and surrounding islands.\n\nA stay on Daydream Island truly feels like an escape from the world, surrounded by one of the seven wonders of the world. From snorkelling to scuba diving and glass bottom boats, there are many ways to enjoy this natural beauty, teeming with colourful marine life. As one of 74 islands in the Whitsundays, Daydream is also the perfect launchpad for a boating adventure on these crystal-clear waters. Sunbathe on the impossibly white sands of Whitehaven Beach, hike through dense rainforest and take in this breathtaking area of unspoiled beauty.\n\nExpert Tip: While Daydream Island is a tropical paradise and one of the most popular family destinations in Australians, please note it isn’t a ‘luxury resort’.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsundays",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Daydream Island Resort",
    "offer_address": "Daydream Island Whitsundays QLD 4802 Australia",
    "percentage_discount": 45.0,
    "min_duration": 4,
    "max_duration": 21,
    "price": 639.0,
    "value": 1171.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002Ljw9AAC",
    "hero_image": "https://images.luxuryescapes.com/xfr5sjpfn6v90bc8vyg8",
    "image_two": "https://images.luxuryescapes.com/eqbeplx6eoa39jkcjn5k",
    "image_three": "https://images.luxuryescapes.com/injvrev4nknihxu2hcia",
    "vendor_name": "Portland Roads Sailing The Whitsundays",
    "title": "Luxurious Whitsundays Private Catamaran Charter for up to 8 Guests",
    "description": "Imagine gliding through crystal-clear waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, strolling barefoot across velvety white sands of untouched, uninhabited islands and delving into the snorkellers' paradise shimmering beneath the Whitsundays' waves. An unmatched playground for boaters and divers, this incredible voyage through the Whitsundays offers a once-in-a-lifetime opportunity to charter your own vessel, with luxury catamarans for up to eight people available.\n\nFeaturing a full maritime briefing, this five-night voyage is suitable for all, with no prior experience required. With bonus early boarding included in this package, enjoy a night onboard the vessel in the beautiful Coral Sea Marina on the first day of your charter (six nights total), with complimentary access to the Ocean Club.\n\n**Perfect for groups**: charters for up to eight people available.\n\n**No blackout dates apply** for this offer - meaning you can set sail when it suits you for the same incredible price.\n\n⏱**Buy now, book later:** Secure this deal now and choose your travel dates when you're ready (see Fine Print for details).",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Portland Roads - Sailing the Whitsundays 2021",
    "offer_address": "Coral Sea Marina - Shingley Drive Airlie Beach Qld 4802",
    "percentage_discount": 52.0,
    "min_duration": 6,
    "max_duration": 6,
    "price": 2987.0,
    "value": 6256.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000IcBSOAA3",
    "hero_image": "https://images.luxuryescapes.com/s5xig78v6r6u4pp2zzh",
    "image_two": "https://images.luxuryescapes.com/n0li6o9uxr5xdwmbpg",
    "image_three": "https://images.luxuryescapes.com/qh2v2hqw2izsytn3h7b",
    "vendor_name": "SeaDream",
    "title": "Private Whitsundays Luxury Charter Sailing for 10 Guests with Early Boarding + Guided Upgrades Available",
    "description": "Heed the call of the dreamy Whitsundays' treasure trove of over 74 emerald islands and crystal blue waters on a private catamaran charter journey for up to 10 guests. Glide through sapphire waters in the heart of the UNESCO World Heritage-listed Great Barrier Reef, stroll barefoot across the warm, white sands of untouched islands and delve into the coral-filled paradise shimmering beneath the Whitsundays' waves. Explore in style on board your spacious premium luxury catamaran and savour meals accompanied by magnificent sunsets in either your indoor dining setting or out in the open air.\n\nWith a full maritime briefing provided, this six-day, five-night sailing adventure (with one bonus evening moored at the marina) is suitable for all, with no prior experience required. If it's always been your dream to sail through one of the Seven Natural Wonders of the World, now is the perfect chance. This luxurious Leopard 50 catamaran is the perfect vessel to charter for your next getaway. With plenty of room and comfort, you will feel right at home as you sail away on your holiday!",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Airlie Beach",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "SeaDream Luxury Charters",
    "offer_address": "Port of Airlie, Shop 7/33 Port Drive, Airlie Beach, Queensland 4802, Australia",
    "percentage_discount": 52.0,
    "min_duration": 6,
    "max_duration": 10,
    "price": 5099.0,
    "value": 10728.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000DN5kFAAT",
    "hero_image": "https://images.luxuryescapes.com/qlg99at4oghqdpiprfo",
    "image_two": "https://images.luxuryescapes.com/66r5vx6d3nx8dgicyi",
    "image_three": "https://images.luxuryescapes.com/5lki2ks79nucg1opjidq",
    "vendor_name": "Palm Bay Resort",
    "title": "Whitsundays Adults-Only Beachfront Private Bure Escape with Daily Breakfast, Nightly Drinks & A$50 Dining Credit",
    "description": "Tucked into a quiet bay on Long Island in the glistening Whitsunday archipelago is the adults-only Palm Bay Resort, offering unparalleled seclusion with Bali-inspired treetop suites, and beachfront bures and bungalows overlooking the crystal-clear Coral Sea. Experience a unique, boutique stay where you can enjoy barefoot luxury in this secluded cove. Hungry? Treat yourself to a meal at Curlews Restaurant, serving the freshest seafood and flavours of the sub-tropical region.\n\nTake to the seas for days of adventure with complimentary use of the resort snorkelling equipment and kayaking gear - the ideal way to explore this hidden gem and discover the perfect secret beach to lounge by. Nestled enticingly on the edge of the Great Barrier Reef, this resort is your key to uncovering the beauty of Tropical North Queensland.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsundays",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Palm Bay Resort",
    "offer_address": "Long Island, Whitsundays, Queensland 4741, Australia",
    "percentage_discount": 45.0,
    "min_duration": 3,
    "max_duration": 12,
    "price": 495.0,
    "value": 903.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z5qYAAQ",
    "hero_image": "https://images.luxuryescapes.com/3szstnubgpwlenyo56f",
    "image_two": "https://images.luxuryescapes.com/xwocytkju2la58v1l5zc",
    "image_three": "https://images.luxuryescapes.com/qx4k7m92vkphkxxagc2i",
    "vendor_name": "Daydream Island Resort",
    "title": "Sun-Kissed Escape in the Dreamy Whitsundays",
    "description": "Experience the magic of the Whitsundays with a stay at the impressive Daydream Island Resort - an iconic resort recently reopened unveiling a chic multimillion-dollar makeover. With three brand-new restaurants, a revitalised pool area, a stunning location lending itself to blissful days in the sunshine and a manmade free-form coral lagoon wrapping 200m around the central building and holding over 1.5 million litres of water, this is one of the best ways to enjoy this stunning part of Queensland, the Great Barrier Reef and surrounding islands. \n\n**Exclusive Extras:**\n\n- Daily breakfast\n- 25% discount on dining and drinks at the resort’s restaurants and bars\n- A guaranteed upgrade to the next available room category",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsunday Regional",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Daydream Island - 2019",
    "offer_address": "Daydream Island, Whitsundays QLD 4802",
    "percentage_discount": null,
    "min_duration": null,
    "max_duration": null,
    "price": null,
    "value": null
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000004UZxgAAG",
    "hero_image": "https://images.luxuryescapes.com/8fwx9z7ufu0flr14ysug",
    "image_two": "https://images.luxuryescapes.com/56qgq11wqgbmuxu4gb",
    "image_three": "https://images.luxuryescapes.com/g445fycyhvxogjfcjy19",
    "vendor_name": "Daydream Island Resort",
    "title": "Iconic Daydream Island Great Barrier Reef Escape in the Heart of the Whitsundays",
    "description": "Experience the magic of the Whitsundays with a stay at Daydream Island Resort, your gateway to the UNESCO World Heritage-listed Great Barrier Reef. Surrounded by stunning sapphire waters and boasting three restaurants, an idyllic pool area, and a manmade 200-metre coral lagoon, this family-friendly resort is the ideal launchpad for island adventures. Cross the Great Barrier Reef off your bucket list, island-hop through the archipelago, or simply sit back and enjoy your environment.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "Queensland",
    "offer_geo_area_level_2": "Whitsundays",
    "location_heading": "Whitsundays",
    "location_subheading": "Queensland",
    "location_description": "Daydream Island Resort",
    "offer_address": "Daydream Island, Great Barrier Reef, Whitsundays, Queensland 4802, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 151.0,
    "value": 151.0
  }
]