[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbKXzAAN",
    "hero_image": "https://images.luxuryescapes.com/2zdfv6omm6cn0a7k27wu",
    "image_two": "https://images.luxuryescapes.com/6s22m97dzkv65vzhdeld",
    "image_three": "https://images.luxuryescapes.com/jx0t5131387tsq16mntp",
    "vendor_name": "Glenayr Farm",
    "title": "Off-Grid Mudgee Glamping Retreat with Wine-Tasting Experience",
    "description": "Unplug, unwind and reset in the beautiful New South Wales countryside when you stay at Glenayr Farm, a boutique retreat in the Mudgee wine region. Boasting just four glamping tents and two luxury villas, this unforgettable escape promises seclusion and privacy in abundance - wake up to extraordinary sunrises, savour breathtaking views of the wildlife-filled surrounding hinterland and sleep soundly under a canopy of stars. Spend your days exploring Mudgee, dotted with a number of wineries and sophisticated restaurants, or simply unwind amid the farm's serene landscapes.\n\nConnect with the quiet against a picturesque backdrop with complete peace of mind knowing your truly off-grid stay is leaving the most minimal mark on the environment. For a day of indulgence, you'll be treated to a private wine tasting at Burnbrae Wines, enjoying some of the finest local fare as you discover a new favourite drop.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Windeyer",
    "location_heading": "Windeyer",
    "location_subheading": "New South Wales",
    "location_description": "Glenayr Farm",
    "offer_address": "1257 Windeyer Road, Windeyer, New South Wales 2850, Australia",
    "percentage_discount": 30.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 230.0,
    "value": 330.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000DcIvhYAF",
    "hero_image": "https://images.luxuryescapes.com/z64m795p6bmu1ck7wcv",
    "image_two": "https://images.luxuryescapes.com/9h6yhravcf9b8jnpsf6",
    "image_three": "https://images.luxuryescapes.com/c0ym47n9lp4rx23z3mam",
    "vendor_name": "Glenayr Farm",
    "title": "Off-Grid Farm Glamping or Villas near Mudgee with Wine-Tasting Experience",
    "description": "Unplug and unwind in the beautiful New South Wales countryside with a stay at this boutique farm retreat in the Mudgee wine region. Recognised with multiple accolades and included in Tripadvisor Travellers’ Choice awards for three consecutive years, this unforgettable escape promises privacy in abundance and the chance to experience nature in absolute comfort from one of four glamping tents and two lavish villas.\n\nConnect with the quiet against a picturesque backdrop with peace of mind knowing your truly off-grid stay leaves the most minimal mark on the environment. For a day of indulgence, you’ll be treated to a wine tasting at Burnbrae Wines, enjoying some of the finest local fare as you discover a new favourite drop.\n\nWake up to extraordinary sunrises, savour breathtaking views of the wildlife-filled surrounding hinterland and sleep soundly under a canopy of stars. Take a day trip to explore Mudgee, dotted with wineries and sophisticated restaurants, or simply unwind amid the farm’s serene landscapes.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Windeyer",
    "location_heading": "Windeyer",
    "location_subheading": "New South Wales",
    "location_description": "Glenayr Farm",
    "offer_address": "1257 Windeyer Road, Windeyer, New South Wales 2850, Australia",
    "percentage_discount": 50.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 239.0,
    "value": 482.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000GuzMMAAZ",
    "hero_image": "https://images.luxuryescapes.com/qonhr49w1qzwvz5lext",
    "image_two": "https://images.luxuryescapes.com/or7lfbbmeivurakh5me",
    "image_three": "https://images.luxuryescapes.com/g6yhke2ak8cvuifres69",
    "vendor_name": "Glenayr Farm",
    "title": "Off-Grid Mudgee Wine Country Retreat with Glamping Tents & Villas",
    "description": "Unplug, unwind and reset in the beautiful New South Wales countryside when you stay at Glenayr Farm, a boutique retreat in the Mudgee wine region. This unforgettable escape promises seclusion and privacy in abundance - wake up to extraordinary sunrises, savour breathtaking views of the wildlife-filled surrounding hinterland and sleep soundly under a canopy of stars. Spend your days exploring Mudgee, dotted with a number of wineries and sophisticated restaurants.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Windeyer",
    "location_heading": "Windeyer",
    "location_subheading": "New South Wales",
    "location_description": "Glenayr Farm",
    "offer_address": "1257 Windeyer Road, Windeyer, New South Wales 2850, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 228.0,
    "value": 228.0
  }
]