[
  {
    "link": "https://luxuryescapes.com/offer/0062y00000C5QQ1AAN",
    "hero_image": "https://images.luxuryescapes.com/86vk1hzznmshg512dbl",
    "image_two": "https://images.luxuryescapes.com/pbxwlywazqf82xhee5ed",
    "image_three": "https://images.luxuryescapes.com/0d9ohih5sgsmdobdvlqe",
    "vendor_name": "Paperbark Camp",
    "title": "Laidback Jervis Bay Safari-Inspired Retreat with Daily Breakfast, Dinner & Cocktails",
    "description": "Retreat to the stunning Shoalhaven region south of Sydney and enjoy a serene stay at Paperbark Camp - an eco-friendly oasis perched along Currambene Creek that celebrates sustainability without sacrificing comfort. This unique camping experience, found just a 2.5-hour drive from Sydney CBD, is ideally located for leaving the hustle and bustle behind you as you reconnect with nature.\n\nSet near the pristine clear waters and white sand beaches of Jervis Bay, this boutique accommodation invites you to roam through nature on bush walks, kayak up the creek, swim, snorkel, surf or simply lounge with one eye open for wandering kangaroos. Among the 13 safari-style canvas tents framed by eucalyptus trees, you can laze the day away with a massage on your private deck before tucking into mouthwatering fare at the treetop The Gunyah restaurant.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Woollamia",
    "location_heading": "Woollamia",
    "location_subheading": "New South Wales",
    "location_description": "Paperbark Camp",
    "offer_address": "571 Woollamia Road, Woollamia, New South Wales 2540, Australia",
    "percentage_discount": 27.0,
    "min_duration": 2,
    "max_duration": 5,
    "price": 818.0,
    "value": 1118.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000JMW6OAAX",
    "hero_image": "https://images.luxuryescapes.com/i554bwl8aviqbivn2zko",
    "image_two": "https://images.luxuryescapes.com/r7m4gpi7dfvloobzihs",
    "image_three": "https://images.luxuryescapes.com/bjr1heeiabbonfpsfapx",
    "vendor_name": "Paperbark Camp",
    "title": "Safari-Inspired Jervis Bay Bush Glamping with Daily Breakfast & Nightly Dinner",
    "description": "Retreat to the stunning Shoalhaven region in New South Wales' South Coast on a serene glamping escape at this eco-friendly oasis in the beautiful surrounds of Jervis Bay. This unique glamping experience manages to make you feel lost amongst nature while only a 2.5-hour drive from Sydney. Inspired by the proprietors' romance with sundowner camps in Africa, each of Paperbark's 13 safari-style tents celebrates sustainability without sacrificing comfort. Fight wintry mornings with a warm tea using the hot water flask delivered to your doorstep, spend afternoons relaxing in the open-air bath and evenings cosying up in your heated tent.\n\nCelebrating 25 years in the pristine bushland, Australia's first glamping retreat invites you to enjoy life's pleasures while connecting with the natural environment around you. Surrounded by national parks, there's ample opportunity to roam through nature on bush walks, kayak up the creek, swim, snorkel, surf or simply lounge with eyes out for wandering kangaroos and wildlife. Feel like some pampering instead? Let reception book you a massage on your private deck and be lulled by the natural soundscape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Woollamia",
    "location_heading": "Woollamia",
    "location_subheading": "New South Wales",
    "location_description": "Paperbark Camp",
    "offer_address": "571 Woollamia Road, Woollamia, New South Wales 2540, Australia",
    "percentage_discount": 54.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 479.0,
    "value": 1047.0
  },
  {
    "link": "https://luxuryescapes.com/offer/006RF00000GHNILYA5",
    "hero_image": "https://images.luxuryescapes.com/bxcitu3tl4t3l9ej20dq",
    "image_two": "https://images.luxuryescapes.com/azestp4xh73qqcbt8ey",
    "image_three": "https://images.luxuryescapes.com/u7a47soj4ji5h11wezb",
    "vendor_name": "Paperbark Camp",
    "title": "Extended by Popular Demand: Safari-Inspired Jervis Bay Bush Glamping with Daily Breakfast",
    "description": "Retreat to the stunning Shoalhaven region in New South Wales' South Coast on a serene glamping escape at this eco-friendly oasis in the beautiful surrounds of Jervis Bay. This unique glamping experience manages to make you feel lost amongst nature while only a 2.5-hour drive from Sydney. Australia's first glamping retreat invites you to enjoy life's pleasures while connecting with the natural environment around you.\n\nInspired by the proprietors' romance with sundowner camps in Africa, each of Paperbark's 13 safari-style tents celebrates sustainability without sacrificing comfort. Fight wintry mornings with a warm tea using the hot water flask delivered to your doorstep, spend afternoons relaxing in the open-air bath and evenings cosying up in your heated tent.\n\nSurrounded by national parks, there's ample opportunity to roam through nature on bush walks, kayak up the creek, swim, snorkel, surf or simply lounge with eyes out for wandering kangaroos and wildlife. Feel like some pampering instead? Let reception book you a massage on your private deck and be lulled by the natural soundscape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Woollamia",
    "location_heading": "Woollamia",
    "location_subheading": "New South Wales",
    "location_description": "Paperbark Camp",
    "offer_address": "571 Woollamia Road, Woollamia, New South Wales 2540, Australia",
    "percentage_discount": 62.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 319.0,
    "value": 835.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y00000EbwtxAAB",
    "hero_image": "https://images.luxuryescapes.com/ra9f29bsdknmitja3d6b",
    "image_two": "https://images.luxuryescapes.com/kiqptks3ne7946aajwrb",
    "image_three": "https://images.luxuryescapes.com/3s5hjt4ceaham15mp66h",
    "vendor_name": "Paperbark Camp",
    "title": "Safari-Inspired Jervis Bay Bush Glamping with Daily Breakfast, Dinner & Wine Pairing",
    "description": "Retreat to the stunning Shoalhaven region in New South Wales' South Coast on a serene escape to Paperbark Camp - an eco-friendly oasis in the beautiful surrounds of Jervis Bay. This unique camping experience manages to make you feel lost amongst nature while only a 2.5-hour drive from Sydney. Inspired by the proprietors' romance with sundowner camps in Africa, each of Paperbark's 13 safari-style tents celebrates sustainability without sacrificing comfort - try cosying up on your private wrap-around balcony with a good book in hand or lie back in a steaming, open-air bath with views of the pristine bushland.\n\nPaperbark Camp is only a short drive or bike ride from the clear waters and white-sand beaches of the bay. Set among three national parks, this boutique accommodation invites you to roam through nature on bush walks, kayak up the creek, swim, snorkel, surf or simply lounge with eyes out for wandering kangaroos and wildlife. The bay's nearby holiday towns offer plenty of choice when it comes to drinks and dining, but you can't go wrong with a picnic by the creek or meals available morning to night at onsite restaurant, The Gunyah. Feel like some pampering instead? Let reception book you a massage on your private deck and be lulled by the natural soundscape.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Woollamia",
    "location_heading": "Woollamia",
    "location_subheading": "New South Wales",
    "location_description": "Paperbark Camp",
    "offer_address": "571 Woollamia Road, Woollamia, New South Wales 2540, Australia",
    "percentage_discount": 51.0,
    "min_duration": 2,
    "max_duration": 3,
    "price": 530.0,
    "value": 1077.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009DUyAAAW",
    "hero_image": "https://images.luxuryescapes.com/2k6lgrk0d8xd7hctondd",
    "image_two": "https://images.luxuryescapes.com/d79z39er9tyrqzmy57f",
    "image_three": "https://images.luxuryescapes.com/3ua4itsqxozo9vbu39wi",
    "vendor_name": "Bay and Bush Cottages",
    "title": "Boutique NSW South Coast Bushland Cottage with Breakfast Hamper & Welcome Wine",
    "description": "Discover the turquoise waters and abundant wildlife of New South Wales' South Coast with a bright and airy stay at Bay and Bush Cottages. Sheltered by precious Australian gum trees, these self-contained cottages offer a charming combination of country and coastal living. Spend your days soaking in the sunshine at the picturesque Hyams Beach, or snuggle up on the sofa with a book and glass of wine in hand as you gaze out into the endless native bushland that surrounds you.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Woollamia",
    "location_heading": "Woollamia",
    "location_subheading": "New South Wales",
    "location_description": "Bay and Bush Cottages",
    "offer_address": "21 Pritchard Ave, Woollamia NSW 2540",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 14,
    "price": 367.0,
    "value": 367.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000009E52KAAS",
    "hero_image": "https://images.luxuryescapes.com/7s459264nyww770x5cap",
    "image_two": "https://images.luxuryescapes.com/7kvp94apsau09bndkza",
    "image_three": "https://images.luxuryescapes.com/u412h74j2wueveq6449",
    "vendor_name": "Paperbark Camp",
    "title": "Stunning Jervis Bay Safari-Inspired Retreat just 2.5 Hours from Sydney",
    "description": "Retreat to the stunning Shoalhaven region south of Sydney and enjoy a serene stay at Paperbark Camp, an eco-friendly oasis perched along Currambene Creek that celebrates sustainability without sacrificing comfort. Retreat to this tranquil spot boasting just 13 safari-style canvas tents framed by eucalyptus trees then savour mouthwatering bush tucker at the treetop The Gunyah restaurant, enjoy a massage or laze the day as you explore Jervis Bay.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Woollamia",
    "location_heading": "Woollamia",
    "location_subheading": "New South Wales",
    "location_description": "Paperbark Camp",
    "offer_address": "571 Woollamia Road, Woollamia, New South Wales 2540, Australia",
    "percentage_discount": 0.0,
    "min_duration": 1,
    "max_duration": 30,
    "price": 410.0,
    "value": 410.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000008gbthAAA",
    "hero_image": "https://images.luxuryescapes.com/10o0e3755fw7e3p29bm",
    "image_two": "https://images.luxuryescapes.com/fj5ydo52ivdqtcqhvn3tc",
    "image_three": "https://images.luxuryescapes.com/9shg54jplsee8suh8gt",
    "vendor_name": "Bay and Bush Cottages",
    "title": "Boutique Cottage Escape Hidden Amid NSW Native Bushland",
    "description": "Discover the turquoise waters and abundant wildlife of the New South Wales coast with a luxurious stay at the romantic Bay and Bush Cottages. Situated under the iconic Australian gum trees, these self-contained cottages offer a charming combination of country and coastal living. Spend your days soaking in the sunshine at the picturesque Hyams Beach, or snuggle up on the sofa with a book and glass of wine in hand as you gaze out into the endless native bushland that surrounds you.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "New South Wales",
    "offer_geo_area_level_2": "Woollamia",
    "location_heading": "Woollamia",
    "location_subheading": "New South Wales",
    "location_description": "Bay and Bush Cottages",
    "offer_address": "21 Pritchard Ave, Woollamia NSW 2540",
    "percentage_discount": 0.0,
    "min_duration": 2,
    "max_duration": 30,
    "price": 524.0,
    "value": 524.0
  }
]