[
  {
    "link": "https://luxuryescapes.com/offer/006Ii000002HsbBIAS",
    "hero_image": "https://images.luxuryescapes.com/rkq9ry4ca50i0eb97mh",
    "image_two": "https://images.luxuryescapes.com/cixt38kowdkf4otsx84",
    "image_three": "https://images.luxuryescapes.com/5dodkodfv9hibcjzono",
    "vendor_name": "Navutu Stars Resort",
    "title": "Fiji Romantic Island Paradise with All-Inclusive Dining, Daily Drink & Sunset Cruise",
    "description": "Disconnect and find your slice of tropical paradise in a blissfully secluded bure at this beachfront gem, nestled within the idyllic Yasawa Islands. This serene haven, located just off the northern coast of popular Viti Levu, boasts palm-fringed shores, lush plantations and azure waters teeming with tropical fish.\n\nA beachfront paradise nestled on white-sand shores, this eco-friendly boutique resort is a wonderfully secluded oasis with just 10 spacious villa-style bures. Spread over three beaches and surrounded by lush gardens dotted with fragrant frangipani and palm trees, this is the ideal destination for a romantic escape from reality.\n\nA host of complimentary resort activities - including Fijian plantation walks, sunrise yoga, kayaking and snorkelling - allow you to experience this incredible destination to the fullest, while the onsite restaurant and spa ensure total relaxation.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Yageta Island",
    "location_heading": "Yasawa Islands",
    "location_subheading": "Fiji",
    "location_description": "Navutu Stars Resort",
    "offer_address": "Yasawa Archipielago, Yaqeta Island, Matayalevu, Fiji",
    "percentage_discount": 38.0,
    "min_duration": 5,
    "max_duration": 12,
    "price": 1849.0,
    "value": 2971.0
  },
  {
    "link": "https://luxuryescapes.com/offer/0062y000002z40rAAA",
    "hero_image": "https://images.luxuryescapes.com/ad5r1yf0vhr9hhz5j6ze",
    "image_two": "https://images.luxuryescapes.com/bixpkyzxxhefuywesdag",
    "image_three": "https://images.luxuryescapes.com/9rl8oj5pfcuafo68mxum",
    "vendor_name": "Navutu Stars Resort",
    "title": "Fiji Beachfront Paradise with Daily Breakfast, Nightly Three-Course Dinner & Nightly Cocktails",
    "description": "You are invited to find your slice of tropical paradise staying in one of the blissfully secluded bures at Navutu Stars Resort in the idyllic Yasawa Islands - Fiji’s sunniest and driest islands, nestled just off the northern coast of popular Viti Levu. Blessed with palm tree-speckled coast, tropical plantations and azure waters brimming with tropical fish, the island of Yaqeta is what dreams are made of.\n\nA beachfront paradise nestled on white-sand shores, this eco-friendly boutique resort is a wonderfully secluded oasis with just 10 spacious villa-style bures. Spread over three beaches and surrounded by lush gardens dotted with fragrant frangipani and swaying palm trees, this is the ideal destination for a romantic escape from reality. A host of complimentary resort activities including Fijian plantation walks, sunrise yoga, kayaking and more allow you to experience this incredible destination to the fullest, while the onsite restaurant and spa ensure total relaxation.",
    "offer_country_name": "Fiji",
    "offer_country_code_alpha_2": "FJ",
    "offer_geo_area_level_1": "Western Division",
    "offer_geo_area_level_2": "Yageta Island",
    "location_heading": "Yasawa Islands",
    "location_subheading": "Fiji",
    "location_description": "Navutu Stars Resort",
    "offer_address": "Yasawa Archipielago, Yaqeta Island, Matayalevu, Fiji",
    "percentage_discount": 53.0,
    "min_duration": 5,
    "max_duration": 9,
    "price": 1099.0,
    "value": 2339.0
  }
]