[
  {
    "link": "https://luxuryescapes.com/offer/0062y000007ofrJAAQ",
    "hero_image": "https://images.luxuryescapes.com/uk1v7jvcnfx7yfajkp8p",
    "image_two": "https://images.luxuryescapes.com/53jzhpx8ed9bfyip02lf",
    "image_three": "https://images.luxuryescapes.com/sy8fvvwv5odrh0azqlh8",
    "vendor_name": "Riverview House B&B",
    "title": "South Australia Private Murray River Escape for up to Eight Guests with Daily Breakfast",
    "description": "Connect with nature and discover friendly country towns, superb landscapes and regional produce with a tranquil stay and hosted B&B experience at Riverview House Younghusband, with space for up to eight guests. This light-filled property is perfectly located in the small township of Younghusband, between Mannum and Bowhill, and is yours to enjoy with the company of your two onsite hosts - with four bedrooms, a spacious lounge area and an expansive furnished deck with views over the mighty Murray River. Listen for the sounds of nature, find your inner zen with a spa treatment at the private onsite treatment room, watch out for kangaroos bouncing along the water's edge, or keep a pair of binoculars handy to admire the many different birds that thrive in the area.\n\nDiscover everything the region has to offer as you wind your way past historic pubs and hotels, paddle along the river in a kayak, stop by the Hermann Gass Bird Sanctuary, don your hiking boots to discover the Mannum Waterfalls or take the scenic route to Caudo Vineyard to pick up a bottle or two of local wine. For extra local tips, your onsite hosts will be available and more than happy to share tips for their favourite spots.",
    "offer_country_name": "Australia",
    "offer_country_code_alpha_2": "AU",
    "offer_geo_area_level_1": "South Australia",
    "offer_geo_area_level_2": "Younghusband",
    "location_heading": "Younghusband on the Murray River",
    "location_subheading": "South Australia",
    "location_description": "Riverview House Younghusband",
    "offer_address": "12 Geehi Pl, Younghusband SA 5238 AUS",
    "percentage_discount": 34.0,
    "min_duration": 2,
    "max_duration": 6,
    "price": 818.0,
    "value": 1235.0
  }
]