[
  {
    "link": "https://luxuryescapes.com/offer/0062y000004Uoi9AAC",
    "hero_image": "https://images.luxuryescapes.com/1tk95qupee3zu7kfhd",
    "image_two": "https://images.luxuryescapes.com/a2g2y0mexhr3pp48brdg",
    "image_three": "https://images.luxuryescapes.com/1n6ps04gvini26vo11ne",
    "vendor_name": "D-Resort Sibenik",
    "title": "Top-Rated Sea-View Croatia Escape with Spa Credit & Daily Breakfast",
    "description": "The unforgettable Adriatic awaits with a breathtaking stay at Croatia’s D-Resort Šibenik, set next to the city's spectacular yacht marina. Surrounded by the sea on three sides, the grandeur of this property has earned it a place in the prestigious Small Luxury Hotels of the World collection and a Tripadvisor Travellers' Choice 2020 award. Designed by famed architect Nikola Bašić, known for Zadar's 'Sea Organ’ installation, this unique hotel gives the feeling of being aboard a large, modern ship, with all rooms enjoying sweeping views across the azure waters of the medieval port. The resort’s contemporary design respectfully blends the striking, light-filled concrete interior with dramatic exterior curves that reflect the glamorous marina setting below, adding excitement to the landscape of this historic spot.\n\nŠibenik is a city on the Adriatic coast of Croatia and a quieter alternative to popular tourist hotspots such as Dubrovnik and Split. It's renowned for its spectacular history, including the UNESCO World Heritage-listed Catherdal of St. James, adorned with 74 striking depictions of local luminaries. The city museum delves deeper into the area's history and is a must for visitors to Šibenik. With a collection of spacious rooms, villas and suites, luxurious facilities - including an outdoor infinity pool, restaurant and four bars, kids’ club and luxury wellness and spa area - this spectacular resort is a secret you'll want to keep to yourself.\n\n**Luxury Escapes inclusions**\n\n- **Complimentary upgrade** to the next available room type (subject to availability)\n- Start each day with **daily breakfast** at Art Restaurant & Bar\n- Toast your stay with a glass of **sparkling wine on arrival**\n- Rejuvenate your body with **EUR50 spa credit** per room\n- Start relaxing sooner rather than later with **12pm early check-in**\n- Sleep in a little longer with **3pm late checkout**",
    "offer_country_name": "Croatia",
    "offer_country_code_alpha_2": "HR",
    "offer_geo_area_level_1": "Sibenik-Knin",
    "offer_geo_area_level_2": "Sibenik",
    "location_heading": "Šibenik",
    "location_subheading": "Croatia",
    "location_description": "D-Resort Šibenik",
    "offer_address": "Obala Jerka Šižgorića 1, 22000, Šibenik, Croatia",
    "percentage_discount": null,
    "min_duration": 1,
    "max_duration": 22,
    "price": null,
    "value": null
  }
]