{
  "city": "New York",
  "country": "United States",
  "country_code": "US",
  "hero_title": "Hotel a New York",
  "description": "Scopri i migliori hotel a New York, United States. Trova offerte esclusive e alloggi di lusso.",
  "hero_image": "https://images.luxuryescapes.com/w4edhixezmhoajq1jpru",
  "hotels": [
    {
      "vendor_name": "voco Times Square South",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Tranquil New York City Stay in Times Square with Onsite Greenhouse, Library & Restaurant",
      "description": "Take a bite of the Big Apple with a stay in one of the city's most iconic areas at voco Times Square South New York, an IHG Hotel. Discover the allure of Manhattan by exploring the endless city streets lined with designer stores, Michelin-starred restaurants, and the Broadway Theatre district. Located on the southern side of Times Square, everything is easily within walking distance or a quick subway ride. Enjoy classic American-style dining at The Finches Den, featuring a chic patio area.",
      "location_subheading": "United States",
      "price": 181,
      "original_price": 181,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GxYXMAA3",
      "hero_image": "https://images.luxuryescapes.com/w4edhixezmhoajq1jpru",
      "image_two": "https://images.luxuryescapes.com/or6ijul9xgcd2hqp32r6",
      "image_three": "https://images.luxuryescapes.com/a003yntwoasm16dxi1f6",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "voco The Frankin Hotel New York",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "New York City Upper East Side 19th Century Brownstone Retreat Minutes from Central Park",
      "description": "Experience the timeless allure of New York City at voco The Franklin New York, an IHG Hotel, a beautifully restored 1800s brownstone nestled in the tranquil Upper East Side. Just steps from the verdant expanse of Central Park and the prestigious 5th Avenue, this charming retreat is your gateway to Manhattan's iconic landmarks. Spend your days exploring iconic landmarks, from the Empire State Building to Times Square, before returning to the hotel to revel in its historic charm and modern glamour.",
      "location_subheading": "United States",
      "price": 219,
      "original_price": 219,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt7uAAB",
      "hero_image": "https://images.luxuryescapes.com/gpmn2mdk1h6m79xs2u8",
      "image_two": "https://images.luxuryescapes.com/5r6boj4xfof0wcrl19md",
      "image_three": "https://images.luxuryescapes.com/1u2mqqtb8kgl529ee4js",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Intercontinental Hotel New York Times Square",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Tranquil Midtown Manhattan Stay near Times Square with Onsite Cocktail Bar",
      "description": "Experience the pulsating heart of the Big Apple with a stay at the InterContinental New York Times Square, an IHG Hotel. Located in the city's Midtown theatre district, this hotel places you at the epicentre of world-class Broadway shows, gourmet dining and high-end shopping. Savour gastronomic delights and craft cocktails at Stinger Cocktail Bar and Kitchen, or venture out to explore the city's iconic landmarks, including Central Park and the Empire State Building just moments away.",
      "location_subheading": "United States",
      "price": 251,
      "original_price": 251,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt7RAAR",
      "hero_image": "https://images.luxuryescapes.com/nnez7sts069f60lzzx4",
      "image_two": "https://images.luxuryescapes.com/896ko5mdhp9uz4smelo9",
      "image_three": "https://images.luxuryescapes.com/qwvo1ij2mm2jdk1svxy8",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Knickerbocker New York",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Five-Star New York Sophistication Overlooking Times Square",
      "description": "Timeless sophistication and style meet with the boundless energy of Times Square at The Knickerbocker - a five-star Manhattan treasure that places you just moments from Broadway and Bryant Park, Radio City Music Hall, the Rockefeller Center and more. Originally constructed in 1906, this landmark building has played host to legendary figures over the years - including The Great Gatsby author F. Scott Fitzgerald, who met his wife Zelda at the hotel. Each of the 330 guestrooms hidden behind the hotel’s grand 16-story beaux arts-style façade exudes a quiet calm. There are bespoke furnishings, richly textured fabrics, oak wood finishes, plush bedding, state-of-the-art technologies and Diptyque bath amenities to create a tranquil haven away from the high-octane energy of bustling New York below. Expect impeccable service, a rooftop bar with panoramic city views, a 24-hour fitness centre with a dedicated yoga and pilates zone, and unforgettable culinary experiences, including Charlie Palmer at The Knick",
      "location_subheading": "United States",
      "price": 213,
      "original_price": 213,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000005IwjAAAS",
      "hero_image": "https://images.luxuryescapes.com/18zoth3l97m2dj4na3b",
      "image_two": "https://images.luxuryescapes.com/xknhc9kk58ntv0u3i6j",
      "image_three": "https://images.luxuryescapes.com/n1vta7j6jiaa8z7ya65k",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:40:00"
    },
    {
      "vendor_name": "Intercontinental Barclay",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Historic Midtown Manhattan Glamour near Park Avenue with 1920s-Style Bar & Restaurant",
      "description": "Where modern luxury and old world glamour converge, experience the beauty of the Big Apple with a stay at the prestigious InterContinental New York Barclay, an IHG Hotel. Located in the beating heart of Midtown Manhattan, this historic hotel, originally opened in 1926, is just steps from Park Avenue, Times Square, Central Park and the luxury boutiques of Fifth Avenue. Between city adventures, retreat to the 1920-style Parlour for a classic cocktail, or to dine on delectable cuisine.",
      "location_subheading": "United States",
      "price": 267,
      "original_price": 267,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt7TAAR",
      "hero_image": "https://images.luxuryescapes.com/9r0rtgxu1cunz927qea",
      "image_two": "https://images.luxuryescapes.com/j2cmiyvqr8l96fxki7ec",
      "image_three": "https://images.luxuryescapes.com/82lof6f6cvlqfyozmrd",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indigo NYC Financial District",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Chic NYC Escape in Iconic Financial District with Pub-Style Restaurant",
      "description": "Embrace the excitement of New York's buzzing financial hub with a stay at Hotel Indigo NYC Financial District, an IHG Hotel. This chic retreat places you within a short stroll of Wall Street, vibrant neighbourhoods like Tribeca and Lower Manhattan, and just a ferry ride from the Statue of Liberty. When you're not out sipping cosmopolitans and sampling local delicacies, enjoy delicious New York-style pub food at the hotel's American restaurant, Half Moon.",
      "location_subheading": "United States",
      "price": 110,
      "original_price": 110,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GxZkBAAV",
      "hero_image": "https://images.luxuryescapes.com/38s42u8i9kbgtfww6q6d",
      "image_two": "https://images.luxuryescapes.com/3gab3tctaajbp4e0mvs",
      "image_three": "https://images.luxuryescapes.com/zujhlhwjsdqafqjmbj",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Staypineapple, An Artful Hotel, New York",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Boutique New York Luxury in the Heart of Midtown Manhattan",
      "description": "Discover the bright lights, bustling avenues and famed streets of New York City from the heart of Midtown Manhattan at Staypineapple, an Artful Hotel. This art-inspired abode is located moments from iconic landmarks including Central Park, the Empire State Building and Times Square. In a city that’s brimming with cafés, bars that spill out onto the streets, hidden speakeasies, under-the-radar art galleries and vibrant marketplaces at any given time of year, the sights of New York are near never-ending. Hop on one of Staypineapple's complimentary beach cruisers and explore on two wheels, or take a three-minute stroll to the subway and travel through New York like a local. Fall in love with the hotel's unique approach to art and design, from the beautifully abstract pieces and tiling to Staypineapple’s signature yellow pineapple that adorns the rooms and lobby. Offering an effortless combination of Midtown Manhattan sophistication, gracious service, a spectacular location and pet-friendly accommodation, Staypineapple, an Artful Hotel ensures an effortless New York experience.",
      "location_subheading": "United States",
      "price": 145,
      "original_price": 145,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000005IlGHAA0",
      "hero_image": "https://images.luxuryescapes.com/97o521vz6o2ivrgk2fg",
      "image_two": "https://images.luxuryescapes.com/u7cdosrwph33f7jmpptt",
      "image_three": "https://images.luxuryescapes.com/uibtuqt9b86gf7s4i2",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "NoMo Soho Hotel New York",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "New York SoHo-Inspired Sophistication Steps from Canal Street with High-End Restaurant & Garden Terrace",
      "description": "At the intersection between stunning heritage architecture and cutting-edge trends, this vibrant SoHo stay perfectly encapsultes the energy of New York. Centrally positioned in this thriving neighbourhood renowned for its fashionable boutiques, art galleries, and trendy eateries, enjoy cocktails in the Rose Garden or seasonal New American fare at Nomo Kitchen between pavement adventures. Start each day with an energising coffee and light bite at the Cafe before heading out for the day, taking a leisurely stroll to nearby Chinatown for authentic dim sum or Little Italy for a taste of the Mediterranean. Just a short drive away, explore some of the city's most iconic sites.",
      "location_subheading": "United States",
      "price": 241,
      "original_price": 241,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002Hc7kIAC",
      "hero_image": "https://images.luxuryescapes.com/1bkpgbc1b3tf8ktufjsb",
      "image_two": "https://images.luxuryescapes.com/orhduc53v8p09wdpz0r",
      "image_three": "https://images.luxuryescapes.com/yl93y2krzbtuwymyc19j",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Lexington Hotel, Autograph Collection",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Jazz Age-Inspired Midtown Manhattan Escape near Grand Central Station & the Rockefeller Center",
      "description": "Experience the grandeur of New York City with a glamorous stay at The Lexington Hotel, Autograph Collection. Perfectly positioned just a two-minute stroll from the iconic Grand Central Station, this hotel serves as an ideal launchpad to explore the Big Apple's endless attractions. From Rockefeller Center and the dazzling lights of Times Square to the world-class shopping on Fifth Avenue, and the culinary delights of nearby bistros and gourmet restaurants, the city's best is at your doorstep.",
      "location_subheading": "United States",
      "price": 506,
      "original_price": 506,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GPsnYAAT",
      "hero_image": "https://images.luxuryescapes.com/felhq1uwoks0zv5wbb0b",
      "image_two": "https://images.luxuryescapes.com/418zgmtpwmxr9dwfu2do",
      "image_three": "https://images.luxuryescapes.com/u7dz73bllcfe4fyydig",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Plaza New York",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "World-Class New York Heritage Stay Overlooking Central Park with Two Onsite Restaurants",
      "description": "Synonymous with timeless elegance and award-winning luxury, this lavish hotel is one of the most prestigious in the world. For more than a century, this world-class retreat has defined style with its grand marble lobby, iced crystal chandeliers and gleaming gilded accents. Dining here is a royal affair, with the palatial Palm Court serving afternoon tea and delicate bites, while the refined Champagne Bar beckons guests to come and sample the world's finest wines, champagne and caviar. Enjoy a rejeventing treatment at the Gerlain Spa or visit one of the many opulent stores that call this hotel home.",
      "location_subheading": "United States",
      "price": 875,
      "original_price": 875,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GRcOBYA1",
      "hero_image": "https://images.luxuryescapes.com/skl7qlth6cvqaikbag6h",
      "image_two": "https://images.luxuryescapes.com/dm1vi85pqpwahnmoaw19",
      "image_three": "https://images.luxuryescapes.com/084weo8grw2hfjm7wcp",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Walker Hotel Tribeca",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Trendy New York City Stay in Heart of Manhattan's Tribeca",
      "description": "Experience the pulsating energy of New York City with a stay at Walker Hotel Tribeca, a former ribbon factory given a new lease on life as a luxury hotel. An eclectic mix of restaurants and bars look after your drinking and dining needs at every time of day - satisfy your palate at Mediterreanean restaurant, Mostrador; sip cocktails at The Flower Shop Rooftop, listen to live music at Saint Tuesday, or jump-start your morning with a coffee at Blue Bottle. Situated within walking distance of Little Italy, Chinatown and SoHo, you'll be living like a local in no time.",
      "location_subheading": "United States",
      "price": 149,
      "original_price": 149,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003qGLtAAM",
      "hero_image": "https://images.luxuryescapes.com/r3yjxa2w4pztn61eofhu",
      "image_two": "https://images.luxuryescapes.com/bhfixdldk5i2ou0hztxo",
      "image_three": "https://images.luxuryescapes.com/pu36ttccucyb9ba4x21n",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indigo Lower East Side New York",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Urban-Chic New York Stay in Lower East Side with Rooftop Pool & Bar",
      "description": "Experience the vibrant energy of the Big Apple with a stay at Hotel Indigo Lower East Side, New York, an IHG Hotel. Perfectly positioned in the city's most artistic district, this luxe, urban-chic retreat is your gateway to the galleries, boutiques and eateries of the Lower East Side. Venture out to explore the nearby Tenement Museum or bustling Essex Market or take in the city skyline from the hotel's rooftop bar Mr. Purple. Later, sip cocktails while listening to a live DJ at The Club.",
      "location_subheading": "United States",
      "price": 176,
      "original_price": 176,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GxZiUAAV",
      "hero_image": "https://images.luxuryescapes.com/rl69a6wujqirm17wph9",
      "image_two": "https://images.luxuryescapes.com/v1zc38for6tummo4r5gf",
      "image_three": "https://images.luxuryescapes.com/0qomfyg35uako4048j18",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-03-31 12:59:00"
    },
    {
      "vendor_name": "The Dominick New York City",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Ultra-Chic Five-Star New York City Escape with Manhattan Views, Rooftop Terrace & Michelin-Starred Restaurant",
      "description": "Experience the height of luxury in the heart of SoHo at The Dominick Hotel, a designer New York City escape offering unrivalled views of the Manhattan skyline. Discover the city's vibrant art scene, chic boutiques and world-class dining, found within a 26-block radius. After a day of exploration, retreat to the Michelin-starred Vestry for a culinary journey, or unwind with a cocktail at Mezzanine. Forget you’re in the centre of it all with an indulgent treatment at Sisley Spa NYC, or watch the world go by from sky high at Terrace on 7.",
      "location_subheading": "United States",
      "price": 480,
      "original_price": 480,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DJ2fvAAD",
      "hero_image": "https://images.luxuryescapes.com/5dntimuwjfmykyjeowd",
      "image_two": "https://images.luxuryescapes.com/x66dh11kwi8jykcdyuho",
      "image_three": "https://images.luxuryescapes.com/v4clvucww36ixh82t0k3",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 00:59:00"
    },
    {
      "vendor_name": "Pendry Manhattan West",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Five-Star West Manhattan Stay with Five Onsite Restaurants & Bars",
      "description": "Indulge in Manhattan’s glittering elegance with a sophisticated stay at the Pendry Manhattan West. Settle into sumptuous velvet-lined booths at Zou Zou's, bask in the intimate grandeur of Bar Pendry, or take in the glamour of three other elevated bars and eateries. Let breathtaking views of the West Side skyline beckon you to explore the city's iconic landmarks, such as Times Square and the Empire State Building, just minutes away.",
      "location_subheading": "United States",
      "price": 660,
      "original_price": 660,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000EcvLfAAJ",
      "hero_image": "https://images.luxuryescapes.com/qvb66obpiqfwmocz0si5",
      "image_two": "https://images.luxuryescapes.com/91bpa0o5xa9i01bth3e",
      "image_three": "https://images.luxuryescapes.com/xyd6dpcvvyln3w2vrid",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Hy36 Midtown Manhattan",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Modern Midtown Manhattan Escape near Madison Square Garden & Empire State Building",
      "description": "Experience the vibrancy of New York City with a stay at Crowne Plaza HY36 Midtown Manhattan, an IHG Hotel. This contemporary haven is ideally positioned in close proximity to Madison Square Garden, and other iconic landmarks such as the Empire State Building, Times Square and Broadway's dazzling theatres. After a day of exploring, indulge in a scrumptious burger at the onsite Burgerology Midtown.",
      "location_subheading": "United States",
      "price": 229,
      "original_price": 229,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GxYXEAA3",
      "hero_image": "https://images.luxuryescapes.com/hlgilwaaqgmjiif5ii8o",
      "image_two": "https://images.luxuryescapes.com/3d5qd4j8nk89m75bqa14",
      "image_three": "https://images.luxuryescapes.com/14wbzo6grrbnsvkdetv",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Collective Governors Island",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Tranquil Governors Island Glamping Retreat with Sunset Terrace with Statue of Liberty Views",
      "description": "Indulge in a luxurious urban retreat at the Collective Governors Island boasting unspoiled New York City skyline and harbour views. A short ferry ride from the concrete jungle, immerse yourself in a tranquil glamping experience as you unwind in the sustainably designed accommodations. Slow down with morning yoga, explore with bike rides, indulge in farm-to-table delights or head to the terrace to toast to the sunset with cocktails and iconic Statue of Liberty views, for an unforgettable escape.",
      "location_subheading": "United States",
      "price": 282,
      "original_price": 282,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GfSEQAA3",
      "hero_image": "https://images.luxuryescapes.com/xr3x94wv5iu4pdzvyn8o",
      "image_two": "https://images.luxuryescapes.com/pkzp4rawlkppvg0v4oho",
      "image_three": "https://images.luxuryescapes.com/detwe3dr7cxldnt81pkw",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "5th and 55th Residence Club at St Regis",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Five-Star Manhattan Residence in Iconic St. Regis Hotel with Butler Service",
      "description": "Discover the heights of luxury in one of New York’s most legendary locations with an exclusive stay at 5th & 55th Residence Club, positioned within beloved heritage icon The St. Regis New York. Just moments away from Central Park, each residence blends Manhattan’s unique magic with peerless sophistication, backed by round-the-clock butler service and impeccable facilities. After days spent exploring the city that never sleeps, enjoy elevated American meals beneath the frescoed ceilings and sparkling chandeliers of Astor Court, or head to the renowned King Cole Bar - birthplace of the Bloody Mary - for signature sips while marveling at its renowned Maxfield Parrish mural.",
      "location_subheading": "United States",
      "price": 1018,
      "original_price": 1018,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000ECh2wAAD",
      "hero_image": "https://images.luxuryescapes.com/4elm1zhlrmb0e26g6vw5",
      "image_two": "https://images.luxuryescapes.com/9moqo6496koh6f4n03i",
      "image_three": "https://images.luxuryescapes.com/jx07zk081acy17a6x1h",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Kimpton Eventi",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Sparkling Central New York Stay on Sixth Avenue with Three Restaurants, Stylish Rooftop & Gym",
      "description": "Take a bite of the Big Apple with a luxurious stay at Kimpton Hotel Eventi, an IHG Hote. Beyond the uber-comfortable suites and convenient Chelsea location, the stylish hotel is also home to a wide variety of dining venues, from the Italian-inspired L’Amico to cocktail bar, The Vine. Explore the city that never sleeps with ease by taking advantage of the hotel’s complimentary push bikes or relax while taking in sparkling city views on the breezy rooftop.",
      "location_subheading": "United States",
      "price": 239,
      "original_price": 239,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000EcjXXAAZ",
      "hero_image": "https://images.luxuryescapes.com/x0y6nyy99xv57d1gen16",
      "image_two": "https://images.luxuryescapes.com/3oomnviqzcm7t6xa8y0e",
      "image_three": "https://images.luxuryescapes.com/3z6auijo39h9kzuhg39",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Walker Hotel Greenwich Village",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Timeless Art Deco Charm in Greenwich Village with High-End Dining",
      "description": "Journey to New York City's bohemian heart with a stay at Walker Hotel Greenwich Village. This Art Deco gem in the heart of historic Greenwich Village retains its heritage charm and is just a stone's throw from Washington Square Park. Savour the flavours of the city at the hotel's Society Cafe, a market-to-table eatery sourcing ingredients from the nearby Union Square Greenmarket, or venture out to explore the vibrant jazz and arts scene of this culturally rich neighbourhood.",
      "location_subheading": "United States",
      "price": 263,
      "original_price": 263,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003qCqoAAE",
      "hero_image": "https://images.luxuryescapes.com/b3u3zmgn2rv00lyxspk9",
      "image_two": "https://images.luxuryescapes.com/5jolh6rk7b76o9dubkfo",
      "image_three": "https://images.luxuryescapes.com/0nnpbueq42ovbs48qctnn",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mandarin Oriental New York",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Sky-High New York City Five-Star Stay on the Edge of Central Park",
      "description": "Stay in the greenest corner of New York City's urban jungle at the Mandarin Oriental, New York, a five-star haven on the fringes of Central Park. Perched above Manhattan on floors 35-54, this centrally located hotel wows with spectacular views of the skyline, Hudson River or Central Park, no matter which room is yours to call home. Only steps from the Big Apple's most iconic attractions, including Broadway, Times Square and Fifth Avenue, this hotel also delivers boutique shopping and high-end restaurants to your doorstep. During your stay, stop for sophisticated cocktails and breathtaking Manhattan views at the sky-high MO Lounge, before retreating to the spa for a dip in the 75-foot lap pool, a relaxing treatment or a session in the amethyst crystal steam room.",
      "location_subheading": "United States",
      "price": 877,
      "original_price": 877,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000BdkT8AAJ",
      "hero_image": "https://images.luxuryescapes.com/pcdlcids7ghcv4onfmap",
      "image_two": "https://images.luxuryescapes.com/tgvfkhenlqfn6ute03",
      "image_three": "https://images.luxuryescapes.com/s8hxy1ldjqaqbyba6no",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "New York Hilton Midtown",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Stylish Manhattan Hilton Escape Opposite Museum of Modern Art with Onsite Bar, Restaurant & Lounge",
      "description": "The creative pulse of Manhattan awaits with a stay at this perfectly positioned Hilton haven bordering New York City's theatre district. Steps from the Museum of Modern Art, this stylish city stay is a short walk from the city's most exciting attractions from Central Park, Times Square and the glittering shops of Fifth Avenue. After a day of exploring, retreat to the sophisticated Bridges Bar for a classic Manhattan cocktail, or refuel with American-style dishes at Herb N' Kitchen.",
      "location_subheading": "United States",
      "price": 608,
      "original_price": 608,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JMfKWAA1",
      "hero_image": "https://images.luxuryescapes.com/8cwi862rba3fcr99syt",
      "image_two": "https://images.luxuryescapes.com/2hsucwywvoffjoetbhm",
      "image_three": "https://images.luxuryescapes.com/s1a25k8f05nagbyogqz",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-05-18 13:59:00"
    },
    {
      "vendor_name": "Shelburne NYC",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Stylish New York City Break in Midtown Manhattan",
      "description": "Stay on the east side of Manhattan's Midtown district, where sophistication meets contemporary style, at The Shelburne Sonesta New York. A New York City sanctuary, the very best of the Big Apple is on your doorstep - spend days shopping on Fifth Avenue, dining at Michelin-starred restaurants, or exploring the art galleries of Chelsea. After days of exploring, retreat to your hotel and make use of the state-of-the-art fitness centre before relaxing in your spacious guest room or apartment.",
      "location_subheading": "United States",
      "price": 140,
      "original_price": 140,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000ExupTAAR",
      "hero_image": "https://images.luxuryescapes.com/7dtmou5me4qno9l1zlf",
      "image_two": "https://images.luxuryescapes.com/8rpmtr00y6ej5moh0vs",
      "image_three": "https://images.luxuryescapes.com/qom2qyecm9km574rrhul",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Gansevoort Meatpacking",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "New York City Meatpacking District Escape with Rooftop Pool & Bar",
      "description": "Located in NYC’s culture-rich Meatpacking District, the iconic Gansevoort Meatpacking NYC embodies the neighborhood’s industrial history and buzzing energy. With the completion of a top-to-bottom renovation, the hotel boasts brand-new rooms, multi-bedroom suites, and an exclusive Poliform Penthouse duplex. The newly-transformed rooftop bar and restaurant serve up cocktails and light bites alongside breathtaking Manhattan skyline panoramas, guaranteeing an unforgettable culinary adventure. Dine at the ground-floor Omakase sushi restaurant, Saishin, and feast on innovative Japanese cuisine during your stay. Later, ascend to the rooftop, where the year-round heated swimming pool and terrace is the perfect spot to take a dip while admiring the cityscape. Sweat it out at the state-of-the-art fitness centre, where you'll find a MIRROR workout companion, boxing equipment and Peloton bikes. The fresh produce and local art at the famous Chelsea Market are just a three-minute walk from the hotel, as are the glorious views from The High Line, where you can experience art, design and nature in one breathtaking location. You're never too far from your next great bite or tipple, with more restaurants and bars than you can count within walking distance from the hotel.",
      "location_subheading": "United States",
      "price": 390,
      "original_price": 390,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000006CaI7AAK",
      "hero_image": "https://images.luxuryescapes.com/47ka6ggi98wx0fjlsnrm",
      "image_two": "https://images.luxuryescapes.com/sdchw4wz6bjad4mhuncke",
      "image_three": "https://images.luxuryescapes.com/djgh5jsh4hxd661rapid",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 01:50:00"
    },
    {
      "vendor_name": "Omni Berkshire Place",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Classic Midtown Manhattan Luxury Near Fifth Avenue with Onsite Bar Overlooking 52nd Street",
      "description": "Embrace New York elegance with a luxurious stay at one of the city's landmark hotels steeped in a century of history. The hotel's enviable location places you steps away from the renowned Fifth Avenue shopping district, the dazzling lights of Broadway, and the verdant tranquillity of Central Park. Delight in a fresh breakfast at Berk's Bar, and return after days spent exploring the iconic concrete jungle for a drink in the bar's plush interiors.",
      "location_subheading": "United States",
      "price": 249,
      "original_price": 249,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JRhmPAAT",
      "hero_image": "https://images.luxuryescapes.com/22rxh5oc59ea23zdyyi",
      "image_two": "https://images.luxuryescapes.com/48qtuk2nvjipu5oglcoh",
      "image_three": "https://images.luxuryescapes.com/idn1jh57z4v5brkqns",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indigo NYC Downtown Wall Street",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Sophisticated New York City Wall Street Stay with Rooftop Bar & Upscale Bistro",
      "description": "Tucked between skyscrapers in the bustling Financial District, find Hotel Indigo NYC Downtown - Wall Street, an IHG Hotel. Located next to the square where the New York Stock Exchange was founded and just minutes from The Battery and the Brooklyn Bridge, find yourself perfectly placed to experience all the thrills of Lower Manhattan. After strolling the banks of the East River, return for a cocktail at Highwater Rooftop Bar and grab a bite to eat Buttonwood Cafe.",
      "location_subheading": "United States",
      "price": 158,
      "original_price": 158,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GxZjcAAF",
      "hero_image": "https://images.luxuryescapes.com/24euojnwsqnotqcb7ta",
      "image_two": "https://images.luxuryescapes.com/7sskwg3o29ci707twv55",
      "image_three": "https://images.luxuryescapes.com/wtezmqh97tkisbz6a2ua",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Boro Hotel New York",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Contemporary New York Escape with Spectacular Manhattan Views",
      "description": "Wake up to sweeping views over New York's iconic skyline with a stay at the ultra-modern Boro Hotel New York, set in the heart of trendy Long Island City, in the lively borough of Queens. Live like a local in one of NYC’s most diverse boroughs, teeming with incredible bars and restaurants, at this industrial-chic hotel. Explore the bustling streets of the city that never sleeps, then retreat to your urban oasis, complete with a striking rooftop bar offering negronis on tap and seasonal cocktails. A city that’s brimming with cafés, bars that spill out onto the streets, hidden speakeasies, under-the-radar art galleries, and vibrant marketplaces at any given time of the year, the sights of New York City are near never-ending - and you will be perfectly located to make the most of them all. Surrounded by trendy bars and restaurants, and just a short metro ride from New York’s top attractions - world-famous Manhattan is just a 20-minute cab ride away, or a quick 15-minute subway ride (two stops) - Boro Hotel New York is a minimalist retreat offering a collection of beautifully styled rooms with high ceilings, hardwood floors and huge floor-to-ceiling windows with incredible views over the city’s skyline. When you’re not exploring the buzzing dining scene of the Big Apple, the hotel’s restaurant, Beebe's, will satisfy your hunger with authentic NYC pies, pasta and pizza, all accompanied by local beers and handcrafted cocktails.",
      "location_subheading": "United States",
      "price": 125,
      "original_price": 125,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003GLMgAAO",
      "hero_image": "https://images.luxuryescapes.com/ujh6ydkhaeyo0oskb0er",
      "image_two": "https://images.luxuryescapes.com/1xzhwyjqs56h7lc5rd3",
      "image_three": "https://images.luxuryescapes.com/2pq11fknlga7rgk0qpw7",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Hard Rock Hotel New York",
      "offer_country_name": "United States",
      "location_heading": "New York",
      "title": "Brand-New Hard Rock New York City Stay near Times Square with Rooftop Bar",
      "description": "Rock out at the brand-new Hard Rock Hotel New York, the hottest new property to take the spotlight in Midtown Manhattan. Sandwiched between the Theatre District and Radio City Music Hall, this vibrant hotel places you within close proximity of some of the world's hottest theatre performances, local live music gigs and iconic city sights. In true Hard Rock style, the hotel is a treasure trove of rare music memorabilia and original artwork that pays homage to New York City's underground music industry. Listen to incredible beats while drinking in cocktails and incredible views of Times Square at RT60 Rooftop Bar and Lounge, opt for upscale dining at NYY Steak, or savour farm-fresh seasonal cuisine in a music-inspired setting at Sessions. Other incredible facilities include Body Rock® fitness, two entertainment venues and an onsite Rock Shop® boutique.",
      "location_subheading": "United States",
      "price": 236,
      "original_price": 236,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000008mXEbAAM",
      "hero_image": "https://images.luxuryescapes.com/tkzi6yqrmb1in9wwauu8",
      "image_two": "https://images.luxuryescapes.com/uai8umakse961mvose",
      "image_three": "https://images.luxuryescapes.com/9rflghorydkxx5u8llgs",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hotel a New York - Stati Uniti Hotels & Travel Guide 2024",
    "description": "Trova i migliori hotel a New York, United States con offerte esclusive. Prenota la tua fuga perfetta con fino al 60% di sconto.",
    "keywords": [
      "new york hotels",
      "new york travel",
      "united states hotels"
    ],
    "canonical": "https://mondoexplora.com/it/destination/new-york",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/new-york",
      "es": "https://mondoexplora.com/es/destination/new-york",
      "fr": "https://mondoexplora.com/fr/destination/new-york",
      "it": "https://mondoexplora.com/it/destination/new-york"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 27,
    "average_price": 344,
    "average_discount": 0
  }
}