{
  "city": "Perth",
  "country": "Australia",
  "country_code": "AU",
  "hero_title": "Hotel a Perth",
  "description": "Scopri i migliori hotel a Perth, Australia. Trova offerte esclusive e alloggi di lusso.",
  "hero_image": "https://images.luxuryescapes.com/ryxttlwbbb1alvggised",
  "hotels": [
    {
      "vendor_name": "Vibe Hotel Subiaco Perth",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Cool Subiaco Vibe Escape near Perth CBD with Rooftop Pool",
      "description": "In the leafy streets of Subiaco, you’ll find the perfect launchpad to one of Perth’s coolest neighbourhoods: Vibe Hotel Subiaco Perth. This sleek hotel is the perfect blend of contemporary design, Australian hospitality and holiday convenience, all just a five-minute drive from the CBD. If you’re in search of mouthwatering fare, the rooftop Storehouse Subiaco has you covered, while St Marks Road Co. offers tasty eats on the ground floor. Subiaco is blessed with a plethora of parks, with nearby Kings Park the ideal setting for morning strolls or summer-night outdoor cinema, and Lake Monger Reserve just a five-minute drive away. In between adventures, plunge into the rooftop pool and float away with panoramic city views.",
      "location_subheading": "Australia",
      "price": 139,
      "original_price": 139,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DMP3AAO",
      "hero_image": "https://images.luxuryescapes.com/ryxttlwbbb1alvggised",
      "image_two": "https://images.luxuryescapes.com/l56eorb36k1nhkjhuxvp",
      "image_three": "https://images.luxuryescapes.com/nhy09dq8ha15ier8qbea",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Wonil Hotel Perth - Handwritten Collection",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Sophisticated Boutique West Perth Stay Overlooking the Swan River with Sleek Onsite Restaurant",
      "description": "Resting on the picturesque banks of Perth's Swan River, this Handwritten Collection escape promises sophisticated seclusion away from the urban cityscape. Wonil Hotel Perth - named after the Noongar word for the medicinal trees that line the area - invites you to get lost in relaxed, riverside living. When hunger calls, sit down to exquisite local produce and homegrown wines at West Kitchen & Bar. Experience the best of Crawley on your doorstep with fig trees leading to Kings Park and the Botanic Garden, or enjoy romantic shoreline strolls to the Blue Boat House - one of the best spots to watch the iconic Perth sunset. Fill your sun-kissed days with cosy cafes, upscale eateries and entertainment at UWA, or travel a mere 10 minutes to reach the lively Elizabeth Quay and CBD.",
      "location_subheading": "Australia",
      "price": 130,
      "original_price": 130,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JRerrAAD",
      "hero_image": "https://images.luxuryescapes.com/hywv5fwocehluhs1sksk",
      "image_two": "https://images.luxuryescapes.com/lru008ypczhp6hcz2opc",
      "image_three": "https://images.luxuryescapes.com/4kjra6i62eskk5c8mw7",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Adina Apartment Hotel Perth - Barrack Plaza",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Stylish Perth CBD Adina Stay with Outdoor Pool",
      "description": "If you're planning an escape to Western Australia’s sunny capital, there’s no better place to stay than Adina Apartment Hotel Perth Barrack Plaza, an impressive urban oasis superbly located in the heart of the CBD. Here, classic yet contemporary features are sure to impress, with each studio or apartment boasting its own fully equipped kitchen and laundry facilities, along with an onsite gym, outdoor swimming pool and sauna. Make the most of every moment and venture to the world-class restaurants found within Elizabeth Quay and Yagan Square, make your way through the Art Gallery of WA or the Perth Institute of Contemporary Arts (PICA), admire the white sandy stretches of Cottesloe Beach, or hop over to Rottnest Island less than an hour’s ferry-ride away.",
      "location_subheading": "Australia",
      "price": 120,
      "original_price": 120,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DMOVAA4",
      "hero_image": "https://images.luxuryescapes.com/tt2969zr9j89dwmcj1j",
      "image_two": "https://images.luxuryescapes.com/h4pwzwg2d4uxn9b65ts",
      "image_three": "https://images.luxuryescapes.com/lo81zvu6vd6bj8jmschk",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Perth Murray Street",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Contemporary Perth Stay with Outdoor Heated Pool, Onsite Dining & Award-Winning Spa",
      "description": "Explore Western Australia's vibrant capital with a stay at this Novotel beauty with all modern-day comforts and luxuries at your beck and call. Positioned in the city's bustling centre, this hotel puts you in proximity to the beautiful Swan River and the lush Kings Park. Retreat to your stylish room, equipped with modern amenities, before taking a refreshing dip in the heated pool. Whet your appetite for culinary delights at the onsite Miss Mi Perth restaurant, serving a smorgasbord of delectable dishes. The award-winning Keishi Spa will transform you into a stress-free being with rejuvenating massages, while the well-equipped fitness center, complemented by the relaxing steam room and sauna, will elevate your overall wellness experience. Beyond the hotel, explore the city's rich cultural scene, with art galleries, museums and theatres within easy reach. Shop, eat and be merry as you soak in the vibe of Perth.",
      "location_subheading": "Australia",
      "price": 111,
      "original_price": 111,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2ygIAC",
      "hero_image": "https://images.luxuryescapes.com/rno1efemk4jejraviqr",
      "image_two": "https://images.luxuryescapes.com/n5a429bzbg2f0sj43y3",
      "image_three": "https://images.luxuryescapes.com/l9m8oyj4fsuqkfk3k12v",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Perth Langley",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Stylish Perth CBD Retreat near Langley Park with Onsite Restaurant & Wine Bar",
      "description": "Escape to Western Australia's sun-soaked capital at this riverside hotel only moments from the verdant Langley Park. Enjoy Perth's offerings from the comfort of a stylish room or suite. Savour Irish fare and the lively atmosphere at Fenians Irish Pub, indulge in a casual drink or meal at Sen5es Restaurant or explore Perth's dynamic restaurants, bars and cafes. With such a central location, exploring every nook and cranny of the cosmopolitan city is easier than ever - embark on an expedition through Perth's CBD, take a soothing stroll through Langley Park or uncover Perth's arts and culture scene in renowned museums and galleries or in quaint laneways hunting for contemporary urban street art.",
      "location_subheading": "Australia",
      "price": 100,
      "original_price": 100,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002Ilw2IAC",
      "hero_image": "https://images.luxuryescapes.com/dwvj878476et337hdl8d",
      "image_two": "https://images.luxuryescapes.com/0t1x1e66ri4dyjchp6v",
      "image_three": "https://images.luxuryescapes.com/srdaaquwwuuaitj1826n",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Holiday Inn Perth",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Perth Modern Escape in the Heart of the CBD with In-House Dining",
      "description": "Relish an exciting central vantage point from the Holiday Inn Perth City Centre, an IHG Hotel, situated right in the heart of Perth’s CBD. Explore enticing restaurants, beautiful boutiques and buzzing nightlife right on your doorstep, or stay close and treat yourself to relaxed dining at the industrial-chic Ivy & Jack Restaurant. Head down to Elizabeth Quay and enjoy a day by the Swan River, or take in a show at His Majesty's Theatre.",
      "location_subheading": "Australia",
      "price": 110,
      "original_price": 110,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DflWcAAJ",
      "hero_image": "https://images.luxuryescapes.com/qbn2g5zeac3se70c5vn",
      "image_two": "https://images.luxuryescapes.com/2mg85n73l89ia9tou9x6",
      "image_three": "https://images.luxuryescapes.com/s9vbzh1wm8nbwvxkmfaq",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Art Series - The Adnate",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Vibrant Art-Forward Escape in the Heart of Perth CBD with Outdoor Pool & Music-Inspired Restaurant",
      "description": "Captivating art, contemporary comfort and cosmopolitan culture combine at this boutique stay in the heart of Perth. A homage to the monumental work of street artist Matt Adnate, The Adnate - Art Series has become a landmark of multiculturalism, with an expansive collection of Adnate's work scattered throughout every room. Beyond the colourful masterpieces that make this hotel a one-of-a-kind destination, the chic BAHA Poolside Bar & Kitchen offers a laidback onsite dining option with a year-round summer feel, where you can sip on cocktails curated by expert mixologists or lounge by the outdoor pool.",
      "location_subheading": "Australia",
      "price": 116,
      "original_price": 116,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JRestAAD",
      "hero_image": "https://images.luxuryescapes.com/c2nzbeoyxafrh51slsyn",
      "image_two": "https://images.luxuryescapes.com/4v5l2c0a5f712rybb2es",
      "image_three": "https://images.luxuryescapes.com/ltxskrso5p4zk9jp3a3ew",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Perth on Hay",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Mercure Escape in Perth CBD near Swan River with Onsite Restaurant",
      "description": "Explore Western Australia's charming capital with a stay at this perfectly positioned hotel, right in the heart of Perth's vibrant CBD. The hotel is a stone's throw from the lush greenery of Queens Gardens and the shimmering Swan River. If you're not resting in your well-appointed room, head to the onsite Hop & Huddle restaurant for some tasty flavours and refreshing drinks. Exploring the city couldn't get easier with the city loop bus right at the hotel's doorstep. For culture enthusiasts, the Art Gallery of Western Australia is just a leisurely stroll away. Among other attractions nearby to your residence are Perth Mint, Kings Park, buzzing shopping precincts and snazzy rooftop bars. Stay in or go out - the choice is yours at this convenient abode in Perth.",
      "location_subheading": "Australia",
      "price": 102,
      "original_price": 102,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2yeIAC",
      "hero_image": "https://images.luxuryescapes.com/fez7sm1exa2u5a5mzlo",
      "image_two": "https://images.luxuryescapes.com/yk7gsvqq2n6jnsec3ol",
      "image_three": "https://images.luxuryescapes.com/j0w8k30f9qd0wcn1qee",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "InterContinental Perth City Centre",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Five-Star Perth CBD Escape on King Street",
      "description": "Escape to a world of opulence in the heart of the CBD with a stay at the Intercontinental Perth City Centre, an IHG Hotel. Set among King Street’s historic architecture, retail boutiques and elegant eateries, this urban hideaway has everything you need to uncover Perth’s very best. Dine on grilled bites scorched to perfection at Ascua Spanish Grill, treat yourself to authentic tapas at Heno & Rey or wander the hotel’s breathtaking lobby, showcasing over 300 pieces of traditional and modern art.",
      "location_subheading": "Australia",
      "price": 135,
      "original_price": 135,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt5oAAB",
      "hero_image": "https://images.luxuryescapes.com/emoo6x0y9fj21now47oo",
      "image_two": "https://images.luxuryescapes.com/6puhd2i5j5vox3br2pvqo",
      "image_three": "https://images.luxuryescapes.com/fk3oqw25qh60tl239rb",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "QT Perth",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Designer QT Perth Escape with Ultra-Cool Rooftop Bar",
      "description": "Industrial luxe awaits at QT Perth, a stylish boutique oasis with a turbo-charged personality just moments from the Elizabeth Quay precinct. Experience true sophistication and indulgence staying at this designer haven, ranked within the top 10% of properties on Tripadvisor. After a day of sightseeing, return to the hotel’s ultra-cool Rooftop at QT bar and watch the sun go down, or grab a bite at the acclaimed Santini Grill. Then, spend a revitalising night in your luxe abode with its edgy, industrial style, a black marble ensuite bathroom and signature QT Dream Bed, where you can enjoy glittering city views. Everything is on your doorstep from this prime CBD location. Step out to explore the array of attractions on your doorstep, from a shopping spree at the fabulous Murray Street Mall to a romantic walk along the stunning Swan River.",
      "location_subheading": "Australia",
      "price": 156,
      "original_price": 156,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004v1SsAAI",
      "hero_image": "https://images.luxuryescapes.com/a4rnsl624lhg3pjtmrdv",
      "image_two": "https://images.luxuryescapes.com/mcxlrvcemi689mzk9wpr",
      "image_three": "https://images.luxuryescapes.com/a24714sqa5ifymd46avi",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Oaks Perth Hotel",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Contemporary Central Perth Studios Near Kings Park & Botanic Gardens",
      "description": "Immerse yourself in the heart of Western Australia's capital at the Oaks Perth Hotel, a family-friendly haven boasting a coveted location in the city's CBD. This comfortable retreat is your gateway to Perth's iconic attractions, from the lush Kings Park and Botanic Garden to the historic Fremantle Markets. End your day in the cosy embrace of your suite, refuel at the onsite restaurant and grab a nighttime tipple at the bar.",
      "location_subheading": "Australia",
      "price": 111,
      "original_price": 111,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000FnEWKAA3",
      "hero_image": "https://images.luxuryescapes.com/g3vwmg9jrdnfo7cguj",
      "image_two": "https://images.luxuryescapes.com/xuqi2bancvpssiev8faj",
      "image_three": "https://images.luxuryescapes.com/4s4wu4074tj8k7v194s",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Holiday Inn West Perth",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Charming Perth City Break with Heritage-Listed Onsite Restaurant",
      "description": "Bask in effortless Australian charm with a stay at Holiday Inn West Perth, an IHG Hotel. Spend the day perusing nearby Subiaco for Australian wines, browse through Hay Street's many boutiques, take a trip through Kings Park and Botanic Gardens, and create lifelong memories watching the sun set over the Swan River. When hunger strikes, dine on wholesome and hearty cuisine at Julio’s Italian Restaurant, housed in a carefully restored heritage building.",
      "location_subheading": "Australia",
      "price": 98,
      "original_price": 98,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DH7OeAAL",
      "hero_image": "https://images.luxuryescapes.com/fds6tw6az4wtvd2zobg8",
      "image_two": "https://images.luxuryescapes.com/41r1dxcoa95t1dlb1er",
      "image_three": "https://images.luxuryescapes.com/b92d66gpja8dhraeut",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Rydges Perth Kings Square",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Perth CBD Hideaway Minutes from Perth Arena",
      "description": "A stylish urban hideaway in the heart of the CBD, Rydges Perth Kings Square offers the cosmopolitan city at your fingertips. Only minutes from Perth Arena and the central business district of Perth, the pulse of Perth's nightlife and culture is within easy reach. Prowl the city streets for bargains or indulge in boutique shopping. Discover hidden laneways, bars and dining districts for mouthwatering meals or ice-cool cocktails before retreating to the serene surroundings of your guest room for a restful slumber.",
      "location_subheading": "Australia",
      "price": 103,
      "original_price": 103,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009FXjhAAG",
      "hero_image": "https://images.luxuryescapes.com/mfsqon5x2aecuq8hnsll",
      "image_two": "https://images.luxuryescapes.com/gxnbjrk6wotov0pw9n2",
      "image_three": "https://images.luxuryescapes.com/xidae7kbedx3hw1j2g7",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Perth",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Perth CBD Escape with Open-Air Infinity Pool & Swan River Views",
      "description": "In a leafy pocket of eastern Perth, cradled by the Swan River and Langley Park, you'll find Crowne Plaza Perth, located within easy reach of Elizabeth Quay and Optus Stadium. Before heading out to explore Perth, stop in at Gusti Restaurant & Bar for a tantalising alfresco dinner accompanied by a glass of Swan Valley wine. Complimentary bicycle hire is available from the hotel: grab your wheels and cycle alongside the Swan River before discovering the city's hidden treasures.",
      "location_subheading": "Australia",
      "price": 102,
      "original_price": 102,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt5fAAB",
      "hero_image": "https://images.luxuryescapes.com/n7o4igadg2so53valygx",
      "image_two": "https://images.luxuryescapes.com/psljfpo6cesyon1ac4ys",
      "image_three": "https://images.luxuryescapes.com/b9l1vaqxfibgn3uglze",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "COMO The Treasury",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Perth Luxury Five-Star City Escape with Wellness Spa and Fine Dining",
      "description": "Within a 19th-century heritage building, old-world grandeur and modern cosmopolitan living blend in perfect harmony at the luxury five-star COMO The Treasury in Perth. Gastronomic greatness is yours to experience at the Wildflower restaurant, a star of Perth's fine dining scene. Indulge in treatments to invigorate your mind and body at Shambhala Urban Escape, take time to appreciate stunning skylines from your designer room or suite, or organise a tailored experience with the concierge and experience the diverse beauty of Western Australia.",
      "location_subheading": "Australia",
      "price": 429,
      "original_price": 429,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CNx8WAAT",
      "hero_image": "https://images.luxuryescapes.com/e2ci0wr0j6gfrpslzq4k",
      "image_two": "https://images.luxuryescapes.com/8grpc4euf43vkr1ftue",
      "image_three": "https://images.luxuryescapes.com/96nb6ecngcm8rzmezclc",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 01:59:00"
    },
    {
      "vendor_name": "Mercure Perth",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Stylish Perth Escape near Swan River with Onsite Bar, Restaurant & Rooftop Pool",
      "description": "Indulge in stunning views of Perth and the Swan River when you stay at this chic hotel with well-appointed rooms, a rooftop pool, a snazzy bar and more on offer. Gifted with an ideal location, this contemporary retreat is just a short stroll from the picturesque Swan River and the city's premier shopping district. The onsite Cucina on Hay will take you on an Italian, piazza-style journey, while Beccaria Restaurant opens for breakfast only - the perfect spot for classic plates and barista-made coffee. When not exploring the city's bustling streets, take a leisurely walk to the nearby Elizabeth Quay or Kings Park for stunning city views.",
      "location_subheading": "Australia",
      "price": 98,
      "original_price": 98,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2y2IAC",
      "hero_image": "https://images.luxuryescapes.com/4e5qlpgn5956d31g4tn8",
      "image_two": "https://images.luxuryescapes.com/m14ipnfiwh5t3wh3h3v6",
      "image_three": "https://images.luxuryescapes.com/zzxbl7pxtjr17iy91kjq",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Adina Apartment Hotel Perth",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Perth Adina Self-Contained Studio Escape with Heated Pool",
      "description": "Experience Perth’s dazzling wealth of golden beaches, world-class restaurants, vibrant arts scene and sensational wine regions from the ultimate central base with a stay at Adina Apartment Hotel Perth. This modern haven offers stylish apartment-style accommodation with a kitchenette, and is perfectly positioned overlooking the Swan River and Perth Convention and Exhibition Centre. Be sure to make use of the onsite parking, heated outdoor pool and jacuzzi, sleek gym and onsite Metro Bar & Bistro where fresh, locally sourced ingredients are a staple of the extensive menu, along with a spectacular wine list to match.",
      "location_subheading": "Australia",
      "price": 117,
      "original_price": 117,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000007ogtOAAQ",
      "hero_image": "https://images.luxuryescapes.com/lx0kop4ioo2y351tm2fi",
      "image_two": "https://images.luxuryescapes.com/8is22z7bpbpeq0in6j8m",
      "image_three": "https://images.luxuryescapes.com/8tmbiiimkk8dqk0l5s9",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Alex, Perth",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Stylish Stay in the Heart of Perth CBD",
      "description": "Enjoy the stylish comfort of the boutique Alex Hotel Perth, located on the doorstep of the city’s buzzing Cultural Centre arts precinct. Arguably the most ideally placed boutique hotel in Western Australia's capital, you'll be mere steps from the edgy bars and countless fusion eateries of James and William Streets - the perfect base to gain a real taste for this vibrant community. Thoughtfully crafted rooms place comfort and style at the forefront, offering a quiet sanctuary after time exploring the colourful streets of Perth’s CBD. Contemporary shared spaces encourage guests to venture out from cosy rooms to relax and connect, and a sunny roof terrace offers a sweet urban escape. Borrow a complimentary retro bicycle to roam the CBD, before rewarding yourself with a tipple and European-inspired meal at the hotel’s Shadow Wine Bar.",
      "location_subheading": "Australia",
      "price": 120,
      "original_price": 120,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004VnHbAAK",
      "hero_image": "https://images.luxuryescapes.com/lk27ezr69y9l2kjib53",
      "image_two": "https://images.luxuryescapes.com/cch6ewo0ec0ejz1od4t",
      "image_three": "https://images.luxuryescapes.com/zc3g4bbhtfzj4z90cvo",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pan Pacific Perth",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Five-Star Pan Pacific Perth Escape Overlooking the Swan River",
      "description": "Discover the endless sunny skies, pristine beaches, and buzzing city streets of the Western Australian capital at Pan Pacific Perth, a five-star oasis offering unparalleled facilities and service. Its Adelaide Terrace address, just moments from the Swan River and Langley Park, encourages effortless exploration. Retire to your urban sanctuary to splash in the glimmering outdoor pool, and when hunger strikes, be sure to head to one of the six onsite eateries for sumptuous seasonal fare.",
      "location_subheading": "Australia",
      "price": 184,
      "original_price": 184,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CvkzaAAB",
      "hero_image": "https://images.luxuryescapes.com/gf3fxk8l25w2iurnot7t",
      "image_two": "https://images.luxuryescapes.com/jv4zdln1f7xxqpxt5jpl",
      "image_three": "https://images.luxuryescapes.com/4zfp91xk8586b8ygwgrs",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Nautica Residences Hillarys",
      "offer_country_name": "Australia",
      "location_heading": "Perth",
      "title": "Family-Friendly Waterfront Apartments near Perth Aquarium & Rottnest Island Ferry Terminal",
      "description": "Escape to the waterfront at Nautica Residences Hillarys, a family-friendly Perth stay overlooking the serene Hillarys boat harbour. Revel in an ultra-convenient location, where boutique shopping, pristine beaches, the gateway to Rottnest Island via the ferry, and a vibrant dining precinct are all just a leisurely stroll away. Or, relish homemade dinners, poolside lounging, and ample space for family fun in your home-away-from-home apartment.",
      "location_subheading": "Australia",
      "price": 314,
      "original_price": 314,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cw2yKAAR",
      "hero_image": "https://images.luxuryescapes.com/1yak76m3sf0ab4epcrws",
      "image_two": "https://images.luxuryescapes.com/1unr1rqhaw1vzaww6z",
      "image_three": "https://images.luxuryescapes.com/hv9i45uo2qb9yy5kopwh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hotel a Perth - Australia Hotels & Travel Guide 2024",
    "description": "Trova i migliori hotel a Perth, Australia con offerte esclusive. Prenota la tua fuga perfetta con fino al 60% di sconto.",
    "keywords": [
      "perth hotels",
      "perth travel",
      "australia hotels"
    ],
    "canonical": "https://mondoexplora.com/it/destination/perth",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/perth",
      "es": "https://mondoexplora.com/es/destination/perth",
      "fr": "https://mondoexplora.com/fr/destination/perth",
      "it": "https://mondoexplora.com/it/destination/perth"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 20,
    "average_price": 145,
    "average_discount": 0
  }
}