{
  "city": "Canberra",
  "country": "Australia",
  "country_code": "AU",
  "hero_title": "Hôtels à Canberra",
  "description": "Découvrez les meilleurs hôtels à Canberra, Australia. Trouvez des offres exclusives et des hébergements de luxe.",
  "hero_image": "https://images.luxuryescapes.com/gr3wudfdcszz5knz9g6p",
  "hotels": [
    {
      "vendor_name": "Mercure Canberra",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Heritage-Listed Canberra City Escape Steps from City Centre with Daily Breakfast",
      "description": "Soak up Canberra’s impressive cultural experiences, top-notch restaurants and burgeoning art scene with a central city stay at this welcoming heritage-listed hotel. Originally opened in 1927 and listed on the Register of the National Estate, the Mercure Canberra is part of the capital's rich history. Use this conveniently located abode as your home base while exploring treasures like the Australian War Memorial or Old Parliament House. Boasting outstanding service, superb old-world charm and a welcoming atmosphere, guests of this iconic Canberra institution are guaranteed a relaxing retreat.",
      "location_subheading": "Australia",
      "price": 159,
      "original_price": 300,
      "discount_percentage": 47,
      "link": "https://luxuryescapes.com/offer/006RF00000IUEfuYAH",
      "hero_image": "https://images.luxuryescapes.com/gr3wudfdcszz5knz9g6p",
      "image_two": "https://images.luxuryescapes.com/yx6fqh1vrgmuhe41khlci",
      "image_three": "https://images.luxuryescapes.com/bk90zfvabi0h5cqhqm5m",
      "deal_tier": "Lifestyle Brands on Luxury Escapes",
      "min_duration": 2,
      "end_date_utc": "2025-08-04 13:59:00"
    },
    {
      "vendor_name": "Peppers Gallery Hotel Canberra",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Elegant Central Canberra Escape with Daily Breakfast, Nightly Cocktails & Dining Credit",
      "description": "Tucked away among the NewActon precinct's stylish bars, glam restaurants and quirky entertainment venues, Canberra’s hidden gem sets the standard for pure comfort. The hotel's unique 'gallery' theme ensures a one-of-a-kind stay, with a sculpture garden that spills into the foyer and art installations that turn corridors into creative spaces. Take in the full Canberra experience with tailored culinary moments and immersive cultural experiences on your doorstep, with your hotel located near Lake Burley Griffin and within walking distance of Parliament House. Indulge in a bespoke gourmet experience at the hotel's renowned Canberra institution, the acclaimed Italian trattoria, Bicicletta.",
      "location_subheading": "Australia",
      "price": 209,
      "original_price": 348,
      "discount_percentage": 40,
      "link": "https://luxuryescapes.com/offer/006RF00000GVwCzYAL",
      "hero_image": "https://images.luxuryescapes.com/hplxgtttio74of72kisj",
      "image_two": "https://images.luxuryescapes.com/silcaqquo9ar9919zxgn",
      "image_three": "https://images.luxuryescapes.com/hg8gjnykfe1480iig2w5p",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 2,
      "end_date_utc": "2025-07-31 13:59:00"
    },
    {
      "vendor_name": "Ovolo Nishi",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Top-Rated Canberra Ovolo Designer Break in the Heart of the NewActon Precinct",
      "description": "Immerse yourself in urban luxury with a boutique stay at the most stylish designer hotel in Canberra, the top-rated Ovolo Nishi. Enjoy dining at the award-winning onsite Monster Kitchen and Bar, take the hotel's complimentary bicycles for a spin to discover the surrounding delights of Australia's capital, including Parliament House, and help yourself to the complimentary lolly bar in the lobby. Plus, this uber-cool, eclectic hotel puts you within a stone's throw of Canberra's hottest spots and icons.",
      "location_subheading": "Australia",
      "price": 89,
      "original_price": 89,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000008hHO6AAM",
      "hero_image": "https://images.luxuryescapes.com/w1o5oa98n7e0uoa4jr9s",
      "image_two": "https://images.luxuryescapes.com/durkr4qb2oe26z5h5bqs",
      "image_three": "https://images.luxuryescapes.com/n3emxwuaaw4l13lan0g2",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Canberra",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Stylish Central Canberra Stay with Indoor Pool",
      "description": "Engage with Australia's intimate and cultured capital city with a central stay, located just steps from the iconic Australian War Memorial and the National Gallery of Australia. Find yourself within walking distance of Canberra's vibrant dining scene, boutique shopping and picturesque Lake Burley Griffin. After a day of exploring, retreat to the hotel's indoor heated pool or jacuzzi, unwind at the onsite fitness centre or savour a meal at the First Edition Restaurant & Bar, where you can indulge in locally sourced dishes and a selection of drinks.",
      "location_subheading": "Australia",
      "price": 89,
      "original_price": 89,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvcIAC",
      "hero_image": "https://images.luxuryescapes.com/wuaburjxfyei3e1do0h",
      "image_two": "https://images.luxuryescapes.com/l4wi8hbn4oxwffdshg4",
      "image_three": "https://images.luxuryescapes.com/5qzelestkkmbn37c5wq",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Canberra",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Heritage-Listed Central Canberra Escape with Two Onsite Restaurants",
      "description": "Soak up Canberra’s impressive cultural experiences, top-notch restaurants and burgeoning art scene with a central city stay at this welcoming, heritage-listed hotel, located on the eastern edge of stylish Braddon. Originally opened in 1927 and listed on the Register of the National Estate, the Mercure Canberra is part of the capital's rich history. From your conveniently located abode, mere moments from the CBD and vibrant New Acton precinct, it's easy to explore treasures like the National Gallery of Australia, the War Memorial or Old Parliament House.",
      "location_subheading": "Australia",
      "price": 74,
      "original_price": 74,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2ydIAC",
      "hero_image": "https://images.luxuryescapes.com/qz307fue8nuomy8358hi",
      "image_two": "https://images.luxuryescapes.com/68ya8q3rk4dwq6ru8r",
      "image_three": "https://images.luxuryescapes.com/w37ug7evbfw7ukrlq7pw",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mantra on Northbourne",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Stylish Canberra Escape Moments from the CBD with Indoor Pool & Onsite Restaurant",
      "description": "Find yourself mere moments from the vibrant Canberra CBD with a stay at this sleek abode, perfectly positioned in the heart of the city. The modern hotel boasts lavish rooms as well as self-contained apartments tailored to your comforts and is within easy access of cultural landmarks, including Parliament House, the Australian War Memorial and the National Gallery of Australia. Swim laps in the indoor heated pool, relax in the sauna and tuck into sumptuous food at the Stock Bar & Kitchen. If you wish to explore, take a short stroll to reach Braddon district, renowned for its artisan coffee shops and innovative modern Australian eateries.",
      "location_subheading": "Australia",
      "price": 66,
      "original_price": 66,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JRetXAAT",
      "hero_image": "https://images.luxuryescapes.com/b8one1kyxoema2ekpr2l",
      "image_two": "https://images.luxuryescapes.com/p5on8yiml2310hzue3dr",
      "image_three": "https://images.luxuryescapes.com/s0twtwx1pdps0zgv167c",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Vibe Hotel Canberra",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Sleek Canberra Airport Stay Just 10 Minutes from City Centre",
      "description": "It doesn't get more convenient than a stay at Vibe Hotel Canberra, just 350 metres from the airport and a swift 10-minute drive to the CBD. When you're not checking out what this vibrant city has to offer - including the National Gallery of Australia, the Australian War Memorial and the Old Parliament House - enjoy moments of downtime at your hotel. Order a cocktail or craft beer at Helix Bar & Dining, a fun bistro where you can catch live music as well as a delicious lunch and dinner menu.",
      "location_subheading": "Australia",
      "price": 117,
      "original_price": 117,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DMdoAAG",
      "hero_image": "https://images.luxuryescapes.com/ek5rm6lm2r6sfcu12o4e",
      "image_two": "https://images.luxuryescapes.com/jtd912rs8sadx9msv6b",
      "image_three": "https://images.luxuryescapes.com/tzua7n70jk1f2enn3yl",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "A by Adina, Canberra",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Canberra CBD Modern Apartment-Style Stay near Trendy Bars & Eateries",
      "description": "Immerse yourself in the wonder of Australia’s capital with a glamorous stay at A by Adina Canberra in the heart of the city. Designed by award-winning architects Bates Smart, the beautiful sculptural exterior impresses while the warm, plush interiors are ideal for relaxation after days exploring the ACT’s many museums, parks and cultural sites. Keep up your fitness regime in the hotel’s gym, or treat yourself to a series of delectable dishes and cocktails at one of the esteemed venues next door.",
      "location_subheading": "Australia",
      "price": 139,
      "original_price": 139,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000EbPZbAAN",
      "hero_image": "https://images.luxuryescapes.com/zphlmslzxmiy552m09",
      "image_two": "https://images.luxuryescapes.com/73fzutbzsalzdbr47sl8",
      "image_three": "https://images.luxuryescapes.com/enoqgu5lqeimlsg82397",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Canberra",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Tranquil Canberra Escape in Heart of CBD Close to Wine Region",
      "description": "Take in the best of Australia’s tranquil capital with a stay at the contemporary Crowne Plaza Canberra, an IHG Hotel. Perfect for business travellers or a romantic city escape, the hotel creates a welcoming atmosphere with an ideal CBD location close to the museums and galleries, the bustling shopping district and an array of vibrant restaurants and bars. Take a relaxing short drive through Canberra’s iconic wine region and explore charming towns like Bungendore, Gundaroo and Murrumbateman, along with stunning local vineyards and sophisticated cellar doors. After a long day of discovery, grab a decadent dinner at the hotel’s Redsalt Restaurant, serving up modern Australian fare, before relaxing with an evening cocktail in hand.",
      "location_subheading": "Australia",
      "price": 88,
      "original_price": 88,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt5XAAR",
      "hero_image": "https://images.luxuryescapes.com/muy4jzuiqc2y6xxwq3mn",
      "image_two": "https://images.luxuryescapes.com/btm0euryqewbccjn0kco",
      "image_three": "https://images.luxuryescapes.com/7w8crxk95u5m2byf75rb",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Abode Belconnen",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Relaxing Canberra Apartment Stay",
      "description": "Treat yourself to a relaxing city stay at Abode Belconnen, a boutique retreat bordering the beautiful Lake Ginninderra in Canberra's north-west. Located in the picturesque suburb of Belconnen, only 20 minutes from the Australia Capital Territory's iconic attractions, this stylish apartment hotel is the perfect launchpad for exploring the very best of Canberra - including the National Gallery of Australia and Parliament House - and relaxing after adventure-filled days. Great for long or short stays, each stylishly appointed studio or apartment features a kitchenette, laundry facilities and TV with STAYCAST streaming. For wholesome food, you needn't go far, with Westfield Belconnen less than a 15-minute walk away, and the sophisticated No.10 Restaurant + Bar and the convenient Abode Pantry - stocked with healthy frozen meals and drinks - onsite. Plus, there's a foyer lined with retro-inspired bikes - perfect for an afternoon cycling around the Lake Ginninderra circuit.",
      "location_subheading": "Australia",
      "price": 86,
      "original_price": 86,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004T9EHAA0",
      "hero_image": "https://images.luxuryescapes.com/nbgh266m6ao5htdeam3",
      "image_two": "https://images.luxuryescapes.com/3cqcnuc9gv4u14ixdgj",
      "image_three": "https://images.luxuryescapes.com/fakdr5saotx4o7ggj76",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Sebel Canberra Campbell",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Contemporary Canberra Stay near CBD & Australian War Memorial",
      "description": "Surrounded by lush parklands in Canberra's popular Campbell district, this contemporary hotel is perfectly positioned with easy access to Canberra's vibrant city centre, renowned museums and the tranquil shores of Lake Burley Griffin. Start your day at one of the city's best cafes before exploring highlights like the National Museum of Australia, the National Gallery of Australia and Old Parliament House. Walk the Lake Burley Griffin circuit to get there and take in iconic views of ANZAC Parade, leading to the War Memorial.",
      "location_subheading": "Australia",
      "price": 97,
      "original_price": 97,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOvBYAV",
      "hero_image": "https://images.luxuryescapes.com/cy4gq87n97ztfhzux9r",
      "image_two": "https://images.luxuryescapes.com/tdkdgxa9lhnnrx8j5kzl",
      "image_three": "https://images.luxuryescapes.com/75shhf99ojual4q7k3a",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Abode Narrabundah",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Stylish Apartment Stay in Canberra's Inner-South with Welcome Wine",
      "description": "Whisk yourself away on a stylish city stay at Abode Narrabundah - a boutique gem crowning the tranquil gardens of Canberra's inner-south - only 15 minutes from the Australian Capital Territory's iconic attractions. Located in the leafy green suburb of Narrabundah, this boutique apartment-style hotel is the perfect launchpad for exploring the very best of Canberra - including the National Gallery of Australia and Parliament House - while offering a tranquil space to retreat to after adventure-filled days. Great for long or short stays, each stylishly appointed studio features a kitchenette and TV with STAYCAST streaming. There's also the convenient Abode Pantry onsite, stocked with healthy frozen meals, drinks and more. Exploring Canberra and its surrounds is easy thanks to complimentary private parking - or why not swap to two wheels and take an Abode bike into the city, only a 20-minute ride away? If you'd prefer to stay local, Abode Narrabundah is positioned on the perimeter of Capital Public Golf Course and close to Canberra’s inner-south dining and shopping hotspots.",
      "location_subheading": "Australia",
      "price": 88,
      "original_price": 88,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004T9CGAA0",
      "hero_image": "https://images.luxuryescapes.com/gmifyq81gejzj00duf6q",
      "image_two": "https://images.luxuryescapes.com/aio72lcovojyqwqmlnkn",
      "image_three": "https://images.luxuryescapes.com/4jsdlr2oikkfvcchk8k",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Abode Kingston",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Boutique Canberra Stay near Kingston Foreshore & Capital Hill",
      "description": "Cast your vote for a sophisticated stay on the edge of Canberra’s political stage, near eclectic cinemas, iconic monuments and the city’s vibrant dining scene, at the timelessly elegant Abode Kingston. Stamped with a Tripadvisor Travellers' Choice 2020 badge, this modern boutique hotel’s star feature is its location in one of the city’s most desirable postcodes, Kingston - a short bike ride from Capital Hill, less than a 15-minute walk from the reinvigorated Kingston Foreshore, and enviably close to the area’s café culture hub, Parliament House and the National Gallery. So much more than your ordinary Canberra accommodation, this hotel fuses stylish décor with moody ambience and designer-cool rooms and studios. There's the convenient Abode Pantry, stocked with healthy frozen meals, drinks, midnight snacks and more onsite, and a hotel foyer lined with retro-inspired bikes along one wall. Feel like a Kingston local as you delve into this political playground of foodie delights, arts, culture and history, before returning to your ultimate city abode. **Luxury Escapes inclusions (select nights)** - A **welcome bottle of wine** to toast to your sophisticated Kingston escape - **Daily in-room bottled water** for the morning after a night on the town - **Guaranteed 11am checkout** to make the most of your stay - Stay connected with **complimentary Wi-Fi** throughout - **Two-hour bike hire** per person, per stay, to help you explore the city (for stays of 2+ nights) - **A$15 food and drink credit** per package, per stay to use at the onsite Abode Pantry (for stays of 2+ nights) - An **additional A$5 (A$20 total) food and drink credit** per package, per stay (for stays of 3+ nights) - An **additional A$5 (A$25 total) food and drink credit** per package, per stay (for stays of 4+ nights) - An **additional A$5 (A$30 total) food and drink credit** per package, per stay (for stays of 5+ nights) **Need more space?** Upgrade to the Executive Studio, offering a sofa bed for one extra guest (charges apply).",
      "location_subheading": "Australia",
      "price": 92,
      "original_price": 92,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004T99vAAC",
      "hero_image": "https://images.luxuryescapes.com/mqttkh555j5n8ct7vvaj",
      "image_two": "https://images.luxuryescapes.com/qz8osiyveqhehjuhb8on",
      "image_three": "https://images.luxuryescapes.com/raewo5mpwcfyheozlmf",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Jamala Wildlife Lodge",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Canberra Wildlife Lodge Stay with Rooms & Suites Overlooking National Zoo Animal Enclosures",
      "description": "Creature comfort takes on a new meaning with a stay alongside some of the world's most majestic animals at this five-star retreat, hidden within Canberra's National Zoo & Aquarium. Go where the wild things are and stay in safari-style accommodation, offering views over the enclosures or pristine nature. Animal welfare is one of the top priorities and animals have the option to be near the room or far away and out of sight, with the funds raised supporting the zoo's breeding programs.",
      "location_subheading": "Australia",
      "price": 925,
      "original_price": 925,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000G5GLOAA3",
      "hero_image": "https://images.luxuryescapes.com/taxba8lufwqmmtnyva4e",
      "image_two": "https://images.luxuryescapes.com/rtbondsghnrioxk94r9q",
      "image_three": "https://images.luxuryescapes.com/k3p3pqlk5s67gvbwazx",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Kurrajong Canberra",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Elegant Canberra Heritage Hotel near Old Parliament House",
      "description": "First opened in 1926, Hotel Kurrajong Canberra effortlessly combines classic elegance and modern style. Featuring glamorous Art Deco décor, smooth jazz music and nostalgic ambient lighting, the hotel is the perfect place to relax and unwind as you explore Australia’s capital. Take a short 10-minute stroll to the iconic Old Parliament House, mint your own souvenir coin at the Royal Australian Mint or explore the vibrant CBD a ten-minute drive away. Head back for a decadent dinner of steaks, seafood, chicken and more at Chifley’s Bar & Grill - named after the 16th Prime Minister of Australia, Ben Chifley - or try the signature cocktail, an ode to the hotel’s rich history.",
      "location_subheading": "Australia",
      "price": 111,
      "original_price": 111,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000007ohjnAAA",
      "hero_image": "https://images.luxuryescapes.com/1oy3m34a7oyq99xvkxd",
      "image_two": "https://images.luxuryescapes.com/mfgg91arox1wrcuplg",
      "image_three": "https://images.luxuryescapes.com/pbyqjv5n6lsl4e3cjbhr",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Rydges Canberra",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Centrally Located Rydges Canberra Stay near Parliament House",
      "description": "Escape to the nation’s capital with a stylish stay at the Rydges Canberra - a charming retreat ideally located in the Parliamentary Triangle of Canberra. Sneak away for a relaxing escape in a burgeoning destination packed with upscale eateries, microbreweries, indulgent wine and cocktail bars and award-winning coffee roasters, then tap into the history of the country, with top attractions including Parliament House, the National Gallery of Australia and the National Portrait Gallery all within close reach. When you return after a day of exploring, relax at The George Bar with a signature cocktail or let yourself be taken on a culinary journey at The George Grill.",
      "location_subheading": "Australia",
      "price": 84,
      "original_price": 84,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004v0sVAAQ",
      "hero_image": "https://images.luxuryescapes.com/56q3ask3asfmbx23bp8v",
      "image_two": "https://images.luxuryescapes.com/bd0sa3118uv7wr2kd6dlv",
      "image_three": "https://images.luxuryescapes.com/pijfx3osmbyfxlam2tm",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Canberra Belconnen",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Relaxing Canberra Mercure Escape Near Lake Ginninderra",
      "description": "Immerse yourself in Australia's intimate and cultured capital city with a stylish lakeside stay at a beautifully appointed property near Lake Ginninderra. Make use of the hotel's fitness centre or savour a meal at Selection Bistro, located in the adjoining Canberra Labor Club. Venture out to discover the city's iconic landmarks, including the Australian War Memorial and the National Gallery, or indulge in retail therapy at world-class shopping centres. For nature enthusiasts, scenic national parks beckon, while sports aficionados will appreciate proximity to major stadiums.",
      "location_subheading": "Australia",
      "price": 75,
      "original_price": 75,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2yrIAC",
      "hero_image": "https://images.luxuryescapes.com/im46o5y62pjot3g8etu",
      "image_two": "https://images.luxuryescapes.com/7q43gn78jj9p3n6qz5",
      "image_three": "https://images.luxuryescapes.com/wli35fwwifj3961rp3fm",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "QT Canberra",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Stylish Canberra QT Escape in the Heart of NewActon",
      "description": "Where cultural cool meets national politics, discover your ultimate base for exploring Australia’s capital city at QT Canberra. Cast your vote for a luxurious stay close to Molonglo River and experience an escape that places you within walking distance of stylish bars, restaurants, art galleries and Parliament House. After days spent exploring, retreat to your stylish abode in the heart of NewActon and feast on innovative Italian delights at Capitol Bar & Grill, a must for dining during your stay.",
      "location_subheading": "Australia",
      "price": 94,
      "original_price": 94,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004v1XxAAI",
      "hero_image": "https://images.luxuryescapes.com/7de1dxvg29uhsb3n22h",
      "image_two": "https://images.luxuryescapes.com/f33dphlw8mpt1kaoext",
      "image_three": "https://images.luxuryescapes.com/w7xxu3rrkqrr25xdiolm",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Nishi Apartments by Ovolo",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Ultra-Modern Canberra Apartments by Ovolo in Creative NewActon Precinct",
      "description": "Experience a stay to remember in Canberra’s Nishi Apartments Eco-Living by Ovolo, housed in the art-inspired boutique hotel, Ovolo Nishi. This contemporary escape invites you to dive into the rich culture and vibrant food scene of the new capital of cool in one of Canberra’s most inspiring precincts: NewActon. Cycle to nearby sights (subject to availability) including the Australian War Memorial and Parliament House, and enjoy access to the vegetarian Monster Kitchen and Bar just downstairs.",
      "location_subheading": "Australia",
      "price": 85,
      "original_price": 85,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009CAYZAA4",
      "hero_image": "https://images.luxuryescapes.com/vf0h3nlinliqpl8niodn",
      "image_two": "https://images.luxuryescapes.com/yrab747s4obrca8vup5",
      "image_three": "https://images.luxuryescapes.com/1zp7yd9zcjyb177xxoavh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Adina Serviced Apartments Canberra Dickson",
      "offer_country_name": "Australia",
      "location_heading": "Canberra",
      "title": "Stylish Canberra City Break in Leafy Dickson",
      "description": "Make yourself at home at the Adina Serviced Apartments Canberra Dickson, a stylish property located in verdant Dickson, just a few minutes from the city centre. Canberra’s premier retail and dining precincts are just a short amble away, with an abundance of cafés, bars and restaurants. If you're ready for some sightseeing, Parliament House, Lake Burley Griffin, the National Gallery of Australia, Mount Ainslie Lookout, the Australian War Memorial and the National Library are all nearby.",
      "location_subheading": "Australia",
      "price": 100,
      "original_price": 100,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000007ohi1AAA",
      "hero_image": "https://images.luxuryescapes.com/uu6uxgtlqpf8yqfvsn",
      "image_two": "https://images.luxuryescapes.com/7ws31p10aw3b94ugb1ol",
      "image_three": "https://images.luxuryescapes.com/2qh7cjtru0x8dtby66d",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hôtels à Canberra - Australie Hotels & Travel Guide 2024",
    "description": "Trouvez les meilleurs hôtels à Canberra, Australia avec des offres exclusives. Réservez votre escapade parfaite avec jusqu'à 60% de réduction.",
    "keywords": [
      "canberra hotels",
      "canberra travel",
      "australia hotels"
    ],
    "canonical": "https://mondoexplora.com/fr/destination/canberra",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/canberra",
      "es": "https://mondoexplora.com/es/destination/canberra",
      "fr": "https://mondoexplora.com/fr/destination/canberra",
      "it": "https://mondoexplora.com/it/destination/canberra"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 20,
    "average_price": 143,
    "average_discount": 4
  }
}