{
  "city": "Kuala Lumpur",
  "country": "Malaysia",
  "country_code": "MY",
  "hero_title": "Hôtels à Kuala Lumpur",
  "description": "Découvrez les meilleurs hôtels à Kuala Lumpur, Malaysia. Trouvez des offres exclusives et des hébergements de luxe.",
  "hero_image": "https://images.luxuryescapes.com/nykh20nd9758ipezxwn9",
  "hotels": [
    {
      "vendor_name": "Sofitel Kuala Lumpur Damansara Hotel",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Five-Star Sofitel Kuala Lumpur Glamour with Spa & Five Restaurants & Bars",
      "description": "From the iconic heights of the PETRONAS Twin Towers to the historic temples and vibrant markets of the past, immerse yourself in the sights of Malaysia’s dynamic capital from this elegant retreat. Located in one of Kuala Lumpur’s most upscale neighbourhoods, Damansara Heights - voted one of the coolest neighbourhoods in the world by Lonely Planet - you’ll be perfectly positioned to explore the city. After a day of exploration, retreat to your luxurious sanctuary, complete with a stunning swimming pool, offering an urban oasis amidst the glittering towers of Damansara. Unwind at the Sofitel SPA, or enjoy exquisite dining at five different restaurants, before sipping on a nightcap at Le Bar Cocktail & Stories.",
      "location_subheading": "Malaysia",
      "price": 102,
      "original_price": 102,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GWaAPYA1",
      "hero_image": "https://images.luxuryescapes.com/nykh20nd9758ipezxwn9",
      "image_two": "https://images.luxuryescapes.com/pd6t3o0589ist7miiju8",
      "image_three": "https://images.luxuryescapes.com/8m8gik5fawn0titr56h",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Kuala Lumpur City Centre",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Ultra-Modern Kuala Lumpur Stay with Rooftop Pool & Restaurant",
      "description": "Dive into the heart of Malaysia's capital at the ultra-modern Crowne Plaza Kuala Lumpur City Centre. This contemporary haven is ideally situated for exploring the city's rich cultural tapestry, with the iconic Petronas Twin Towers and bustling Jalan Alor food street just a stone's throw away. Savour a symphony of flavours at the hotel's signature restaurant, or unwind in the rooftop pool. As night falls, retreat to your sumptuous suite, where floor-to-ceiling windows reveal breathtaking city views.",
      "location_subheading": "Malaysia",
      "price": 116,
      "original_price": 116,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GOQmoAAH",
      "hero_image": "https://images.luxuryescapes.com/0c2aajq2xe2rrzdw0to",
      "image_two": "https://images.luxuryescapes.com/imoe3sa6k40gu0jegno",
      "image_three": "https://images.luxuryescapes.com/wi6qc4td5xy7m6sfm6qm",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Chow Kit",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Boutique Kuala Lumpur Sanctuary in City's Golden Triangle",
      "description": "Luxury is redefined with a stay at The Chow Kit, a boutique escape sitting in the heart of Kuala Lumpur. Perched in an emerging neighbourhood once known for its gambling dens, this modern marvel is ideally located to experience the best of the city, with mouthwatering street food, bustling markets and artisan boutiques on your doorstep. The onsite restaurant and bar celebrates the multiculturalism of Malaysia, with recipes passed down from generations.",
      "location_subheading": "Malaysia",
      "price": 62,
      "original_price": 62,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DN5cQAAT",
      "hero_image": "https://images.luxuryescapes.com/m5gnm4440mi3nmt0vfj",
      "image_two": "https://images.luxuryescapes.com/2rbwiyjqv1h0w67xocf",
      "image_three": "https://images.luxuryescapes.com/oln8oe2vif60kkz2964q",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Alila Bangsar, Kuala Lumpur",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Kuala Lumpur Urban Retreat in the Heart of Bangsar with Sky-High Pool",
      "description": "Experience the vibrancy of Kuala Lumpur from a tranquil urban sanctuary, perched high above the city's bustling streets. This high-end hotel is ideally located in the cosmopolitan district of Bangsar, just a stone's throw from the city's best shopping, dining and nightlife. Savour the city's culinary delights at the nearby Jalan Alor Food Street, or explore the cultural richness of the Brickfields, known as Kuala Lumpur's Little India. Back at the hotel take a dip in the sky-high pool and enjoy a drink at the stylish bar, or retreat to your spacious, elegantly designed room for a restful night's sleep.",
      "location_subheading": "Malaysia",
      "price": 69,
      "original_price": 69,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000HicEaYAJ",
      "hero_image": "https://images.luxuryescapes.com/fik1padox32ma9vkvbm",
      "image_two": "https://images.luxuryescapes.com/eyzpqudussmhijys5ko",
      "image_three": "https://images.luxuryescapes.com/bbva3iuszfb539eqhqom",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mandarin Oriental Kuala Lumpur",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Sophisticated Kuala Lumpur Escape with Five-Star Day Spa",
      "description": "Experience an idyllic inner-city escape located close to Kuala Lumpur’s most inspiring attractions. Offering dramatic views from its position between Petronas Twin Towers and Kuala Lumpur City Centre (KLCC) Park, take time to enjoy access to the hotel’s high-end facilities, including a five-star day spa and seven top-tier dining venues. Unwind at the infinity pool overlooking the KLCC park, or relax in the shade of a poolside cabana.",
      "location_subheading": "Malaysia",
      "price": 155,
      "original_price": 155,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000BdkUaAAJ",
      "hero_image": "https://images.luxuryescapes.com/xna4cx5x2bf9bzskhc",
      "image_two": "https://images.luxuryescapes.com/yaac6trruk0k51ryln2",
      "image_three": "https://images.luxuryescapes.com/bi4iottr5p9ef56kxz1i",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indigo Kuala Lumpur on the Park, an IHG Hotel",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Chic Kuala Lumpur Escape with Views of the World’s Second Tallest Building",
      "description": "Hotel Indigo Kuala Lumpur on the Park, an IHG Hotel, has largely been designed to mirror the chic, contemporary culture of the bustling Bukit Nanas vicinity, where a myriad of thrilling local adventures await. Feast your eyes over Merdeka 118, the world's second tallest building, and the Kuala Lumper Tower from this centrally located haven. Elegantly prepared rooms welcome you with warmth alongside an idyllic pool and a late-night fitness centre.",
      "location_subheading": "Malaysia",
      "price": 97,
      "original_price": 97,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000FMDRsAAP",
      "hero_image": "https://images.luxuryescapes.com/cy7xot2f0eiep11j8asn",
      "image_two": "https://images.luxuryescapes.com/4he83ar6f6gveqnc70ww",
      "image_three": "https://images.luxuryescapes.com/jl7ngi6dzk8l3f22xzbmh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Shangri-La Hotel Kuala Lumpur",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Five-Star Shangri-La Indulgence in the Heart of Kuala Lumpur",
      "description": "Wake up in Malaysia's vibrant capital city in signature luxury at the five-star Shangri-La Kuala Lumpur. Perfectly located in the heart of the action, it's all too easy to get up and embark on daily explorations, or simply spend a day resting among the fabulous facilities of this hotel. Relax by the outdoor swimming pool on a lounger, or spend a day at The Spa and treat yourself to a massage, reflexology treatment or a soothing facial. There's an abundance of tailored family activities on offer to keep the whole clan entertained, from family yoga to arts and crafts. When it's time to grab a bite, there are eight excellent restaurants and bars onsite to choose from, including international buffets, Cantonese fine dining and a Manhattan-style steakhouse.",
      "location_subheading": "Malaysia",
      "price": 95,
      "original_price": 95,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000006zXGPAA2",
      "hero_image": "https://images.luxuryescapes.com/cm92a5rlvqojng74c3",
      "image_two": "https://images.luxuryescapes.com/a0axncyy1iluh1ng7ng",
      "image_three": "https://images.luxuryescapes.com/jobdw283f7kri2gb256jo",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "EQ Kuala Lumpur",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Top-Rated Kuala Lumpur Luxe City Escape with City Views & Sky-High Infinity Pool",
      "description": "Featuring glamourous bars and restaurants, a 25-metre infinity pool and a long list of state-of-the-art facilities, it's easy to see why this luxurious retreat is heralded as Malaysia's top city hotel. Surrounded by the lofty heights of the glittering Petronas Towers, historic temples, the KL Tower and high-end stores, you can soak up the sights of Malaysia's dynamic capital in absolute opulence. At EQ Kuala Lumpur, every detail is meticulously crafted so you can enjoy the finer things in life. Experience five-star Malaysian hospitality accompanied by ultra-modern design, the city's best sustainability, an award-winning spa, gourmet dining and an impressive collection of fine artworks. Flying high above the city skyline within the Golden Triangle - Kuala Lumpur’s main shopping and nightlife district - this 52-storey building boasts sweeping views from every angle. Open the hotel’s doors and embrace the vibrant KL - explore the Batu Caves, take a breath at the nearby forest reserve and feel the electric atmosphere of the thriving nightlife.",
      "location_subheading": "Malaysia",
      "price": 183,
      "original_price": 183,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000007nStEAAU",
      "hero_image": "https://images.luxuryescapes.com/7ibfr9f0h8gei4b46nt",
      "image_two": "https://images.luxuryescapes.com/2rn7v0fllyjdzhhyn5c5k",
      "image_three": "https://images.luxuryescapes.com/hs071muh0np21v3y3g9q",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Kuala Lumpur Trion",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Cosmopolitan Kuala Lumpur Escape 5-Minutes from CBD with City Views & Onsite Dining",
      "description": "Dive right into the dynamic energy of Malaysia's capital city from this elegant retreat. Ideally located in the bustling district of Trion, the property provides easy access to a plethora of vibrant eateries, boutiques and cultural landmarks. Perched on levels 38 and above, its meticulously designed rooms and suites provide sweeping vistas of the city's skyline. Explore the nearby Petronas Twin Towers, savour local delicacies at Jalan Alor Food Street, or delve into history at the National Museum. Just a short drive from the city centre and major attractions, the hotel ensures convenience for both leisure and business travellers.",
      "location_subheading": "Malaysia",
      "price": 46,
      "original_price": 46,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP3TYAV",
      "hero_image": "https://images.luxuryescapes.com/5vheikle0bs2khock7ul",
      "image_two": "https://images.luxuryescapes.com/wzhepdw3tqgad7vr1dgn",
      "image_three": "https://images.luxuryescapes.com/zcdpm8eswsq8ri0zry4",
      "deal_tier": "",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Kuala Lumpur City Centre Hotel & Residences",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Kuala Lumpur Sky-High Sophistication with Day Spa, Terrace Pool & Two Restaurants",
      "description": "Situated near the Pavilion Kuala Lumpur shopping mall - and just a five-minute drive from the Golden Triangle, the city’s premier shopping, entertainment and business district - you'll have the privilege of choice in this central hotel, with all of Kuala Lumpur’s charm just a stone's throw away. Embrace sky-high living as you sip cocktails next to the terrace pool, dig into handmade dim sum at Red Chinese Cuisine or tuck into delicious tapas at Blu Bar & Cigars.",
      "location_subheading": "Malaysia",
      "price": 94,
      "original_price": 94,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2xiIAC",
      "hero_image": "https://images.luxuryescapes.com/5mjkwm0etvhpj8angiq",
      "image_two": "https://images.luxuryescapes.com/sveaxh0vfewcgqztwvnc",
      "image_three": "https://images.luxuryescapes.com/zbfqeqyb591yi461cei",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Selangor Selayang",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Modern Retreat near Kuala Lumpur with Rooftop Pool & Onsite Dining",
      "description": "Immerse yourself in the cultural richness of Malaysia with a stay at this contemporary retreat in the heart of Selayang, just a short drive from Kuala Lumpur city centre. Boasting a rooftop infinity pool with 180-degree city views, a well-equipped gym and an Asian buffet restaurant, everything you need is within reach. Just a short distance from the Batu Caves, one of Malaysia's most popular Hindu shrines, this hotel is the ideal base for cultural exploration. For a taste of local cuisine, venture to the nearby Selayang Wet Market, where a myriad of food stalls serve up authentic Malaysian dishes.",
      "location_subheading": "Malaysia",
      "price": 39,
      "original_price": 39,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP3QYAV",
      "hero_image": "https://images.luxuryescapes.com/emzg2vtx8ljlrw33uvh8",
      "image_two": "https://images.luxuryescapes.com/5kzdh1vuyij6y8rkz6k",
      "image_three": "https://images.luxuryescapes.com/dew4wwf9aoer0ly4z89",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Kuala Lumpur Shaw Parade",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Modern Kuala Lumpur Stay near Petronas Twin Towers with Rooftop Pool with Bar",
      "description": "Positioned on the fringe of Kuala Lumpur’s lively Bukit Bintang shopping district, this city oasis is at the centre of the action. Embrace sky-high living and sip on cocktails by the rooftop pool, grab an elegant cocktail at the Lobby Lounge, or savour global flavours at the Chorak Restaurant. When you're ready to explore, you can enjoy all of just a stone's throw away. Bursting at the seams with unbelievable shopping, popular hawker stalls and architectural wonders like the world-famous Petronas Towers, this hotel is the perfect gateway to enjoy all of Kuala Lumpur’s charm. When it comes to retail haunts, the hotel is located steps from the Berjaya Times Square and the high-end Pavilion Kuala Lumpur.",
      "location_subheading": "Malaysia",
      "price": 52,
      "original_price": 52,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP3PYAV",
      "hero_image": "https://images.luxuryescapes.com/bjfdz0xatqrg1aalxp2q",
      "image_two": "https://images.luxuryescapes.com/9j3a2athikzwvnyookj",
      "image_three": "https://images.luxuryescapes.com/fpcdoa9qbfue6bqhu3ci",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Traders Hotel Kuala Lumpur",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Kuala Lumpur Urban Oasis near Petronas Twin Towers with Rooftop Pool & SkyBar",
      "description": "For soaring city views, Traders Hotel Kuala Lumpur by Shangri-La serves up incredible urban panoramas alongside a convenient central location, friendly service and fabulous facilities. Stay right in the heart of the city's main commercial district, close to the Petronas Twin Towers, KLCC Park and Bukit Bintang shopping precinct. For moments of stillness, ascend to the rooftop spa for relaxing treatments, a steam bath or a sauna session. For a tipple or two with incredible Twin Tower views, the SkyBar’s sultry lounge is the perfect spot for a glamorous evening. When hunger strikes, head to Gobo Upstairs Lounge & Grill for succulent steaks grilled to perfection, or Gobo Chit Chat for mouthwatering international fare. Plus, the rooftop swimming pool surrounded by sun-soaked loungers and sky-high health club with state-of-the-art equipment ensure you can stay active during your stay.",
      "location_subheading": "Malaysia",
      "price": 92,
      "original_price": 92,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000006zXGkAAM",
      "hero_image": "https://images.luxuryescapes.com/qz8ow4v6zhfaep6upw6t",
      "image_two": "https://images.luxuryescapes.com/lgp6pxiz3h9fjcfahgv8",
      "image_three": "https://images.luxuryescapes.com/xqpq2tha98g2ht1pkaon",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Pavilion Hotel by Banyan Tree, Kuala Lumpur",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Five-Star Kuala Lumpur Luxury in the Heart of the City with Rooftop Infinity Pool",
      "description": "In the heart of Malaysia's capital city, you'll find the five-star Pavilion Hotel Kuala Lumpur Managed by Banyan Tree, a glitzy hotel in the centre of bustling Bukit Bintang. There's plenty to keep you busy during your stay: opt for a spot of retail therapy at the onsite Banyan Tree Retail Shop, take a dip in the rooftop infinity pool (an incredible 18 floors above ground level), and leave the little ones to have fun at Rangers Club while you enjoy a tipple at the bar. When hunger strikes, there are four exceptional eateries available to treat your tastebuds. The hotel is located in the middle of Kuala Lumpur's buzzing business and entertainment district, which means the best attractions, restaurants and shops are at your fingertips. Kuala Lumpur's landmark Petronas Twin Towers are just around the corner, Jalan Alor's vibrant market stalls, coffee shops and restaurants are within a 10-minute walk, and the Pavilion Mall is just an elevator ride away.",
      "location_subheading": "Malaysia",
      "price": 121,
      "original_price": 121,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004UOGUAA4",
      "hero_image": "https://images.luxuryescapes.com/q9onughnx5ydw6smauee",
      "image_two": "https://images.luxuryescapes.com/aa5xgamzd93fuz559sa",
      "image_three": "https://images.luxuryescapes.com/7wyeuor63l2but5wz4qe",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "PARKROYAL Collection Kuala Lumpur",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Five-Star Kuala Lumpur Luxury with Poolside Al Fresco Restaurant & Bar",
      "description": "Kuala Lumpur is a whirlwind of activity, home to soaring skyscrapers, street-food stalls, spiraling minarets and banyan trees - see it all when you stay at PARKROYAL COLLECTION Kuala Lumpur. During your stay, dine at the three exceptional onsite restaurants: sink your teeth into Mediterranean and Asian fusion fare at the al fresco Skye Chill, dine amid Thyme's seven open kitchens, and sip tropical cocktails in the low-lit and sultry The Botanist Lounge & Bar.",
      "location_subheading": "Malaysia",
      "price": 119,
      "original_price": 119,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CvkzFAAR",
      "hero_image": "https://images.luxuryescapes.com/n522ijh6va7g2oxd3dc5",
      "image_two": "https://images.luxuryescapes.com/1yevvfcrhi97er7gw1q",
      "image_three": "https://images.luxuryescapes.com/vbp7yhz04dkn207teewj",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Intercontinental Kuala Lumpur",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Five-Star Kuala Lumpur InterContinental Luxury Moments from the Petronas Towers",
      "description": "The splendor of the five-star InterContinental Kuala Lumpur is undeniable: a huge lobby sparkles with a statement art fixture, an expansive swimming pool is a cooling respite from the day's heat and the city's best sites are all within close proximity. During a stay, indulge in award-winning dining at Tatsu Japanese Cuisine and Tao Chinese Cuisine, or unwind with a cocktail or tapas at the Serena Brasserie and OneSixFive Lounge.",
      "location_subheading": "Malaysia",
      "price": 105,
      "original_price": 105,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt6jAAB",
      "hero_image": "https://images.luxuryescapes.com/hp71j3mghfyf0wzwtfj",
      "image_two": "https://images.luxuryescapes.com/f2ly583125maqakaii6e",
      "image_three": "https://images.luxuryescapes.com/ulfktc3kwd7p207of6ts",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Sunway Resort Hotel & Spa",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Five-Star Kuala Lumpur Sunway City Escape with Theme Park & Gordon Ramsay Restaurant",
      "description": "Seamlessly integrated with the Sunway City theme park, the opulent Sunway Resort Hotel offers guests the convenience of exploring elegant shopping and thrilling rides just moments away. Indulge with a myriad of dining options available across seven distinct precincts, while the hotel's spectacular rooms, suites, and villas promise to create cherished memories for the entire family.",
      "location_subheading": "Malaysia",
      "price": 251,
      "original_price": 251,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DNV4vAAH",
      "hero_image": "https://images.luxuryescapes.com/c8bkwlm4kdgwvacphjhl",
      "image_two": "https://images.luxuryescapes.com/6fea8opshjvtvws0hy",
      "image_three": "https://images.luxuryescapes.com/leflyv15n479e8j1euw",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Kuala Lumpur City Centre Hotel",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Modern Kuala Lumpur Novotel Stay near Petronas Twin Towers with Outdoor Pool",
      "description": "Experience the vibrant energy of Malaysia's capital city with a stylish stay in the heart of Kuala Lumpur's Golden Triangle. Conveniently positioned for easy access to the bustling Petaling Street Market and the architectural marvel of the Petronas Twin Towers, this modern hotel keeps you close to the city's endless action. Indulge in a range of local and international flavours at the onsite Food Exchange restaurant, or grab a refreshing drink at Gourmet Bar. Cool off in the glittering outdoor pool or take a short stroll to the vibrant Bukit Bintang district, renowned for its shopping, dining and nightlife.",
      "location_subheading": "Malaysia",
      "price": 66,
      "original_price": 66,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnP3NYAV",
      "hero_image": "https://images.luxuryescapes.com/msuvaqfuriugy4j8nq3",
      "image_two": "https://images.luxuryescapes.com/qz0ubc118o14ob6jmvrt9",
      "image_three": "https://images.luxuryescapes.com/tnlpyp1jnk6owud7zzk",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pan Pacific Serviced Suites Kuala Lumpur",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Kuala Lumpur Luxury Suites with Award-Winning Day Spa & Rooftop Pool",
      "description": "Experience the buzz of Malaysia's capital city when you stay in the heart of the Golden Triangle at Pan Pacific Serviced Suites Kuala Lumpur, a five-star, all-suite, apartment-style escape. Spend balmy days swimming in the rooftop swimming pool on level 24 of the hotel, or opt to kick back on the sunloungers for a mid-afternoon nap. For extra indulgence, book a treatment at the award-winning St. Gregory Spa and revel in high-end pampering from a luxurious spa menu.",
      "location_subheading": "Malaysia",
      "price": 152,
      "original_price": 152,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cw2SOAAZ",
      "hero_image": "https://images.luxuryescapes.com/s00ws4m2tkyr7k1fu3ti",
      "image_two": "https://images.luxuryescapes.com/x1odix0ijnl08d3b87a",
      "image_three": "https://images.luxuryescapes.com/yy2gibx8aq413ai5q0z9",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Banyan Tree Kuala Lumpur",
      "offer_country_name": "Malaysia",
      "location_heading": "Kuala Lumpur",
      "title": "Sky-High Five-Star Kuala Lumpur Oasis in the Heart of the Golden Triangle",
      "description": "Experience Malaysia's vibrant capital from the five-star Banyan Tree Kuala Lumpur, a luxurious sky-high oasis in the heart of the city's Golden Triangle. Enjoy sweeping views across Kuala Lumpur's gleaming cityscape, treat yourself to spiritual renewal at the relaxing wellness spa or dine in the sky across a collection of world-class restaurants. Pamper your palate at the Gatsby-esque Horizon Grill, immerse yourself in decadence with an afternoon tea at Altitude or sip and sway to the sounds of the resident DJ at the highest rooftop bar in the city. You'll be perfectly positioned to explore the very best of Kuala Lumpur, with its historic landmarks, scenic parks and bustling nightspots. Why not begin with a shopping spree at the illustrious Pavillion KL, located just a five-minute stroll away?",
      "location_subheading": "Malaysia",
      "price": 236,
      "original_price": 236,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004UOFvAAO",
      "hero_image": "https://images.luxuryescapes.com/8iqwe3xexvxgcouhw4j",
      "image_two": "https://images.luxuryescapes.com/jh61qjn73wzux0fnu96o",
      "image_three": "https://images.luxuryescapes.com/w3srefsxiqp7jsh0rt1o",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hôtels à Kuala Lumpur - Malaysia Hotels & Travel Guide 2024",
    "description": "Trouvez les meilleurs hôtels à Kuala Lumpur, Malaysia avec des offres exclusives. Réservez votre escapade parfaite avec jusqu'à 60% de réduction.",
    "keywords": [
      "kuala lumpur hotels",
      "kuala lumpur travel",
      "malaysia hotels"
    ],
    "canonical": "https://mondoexplora.com/fr/destination/kuala-lumpur",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/kuala-lumpur",
      "es": "https://mondoexplora.com/es/destination/kuala-lumpur",
      "fr": "https://mondoexplora.com/fr/destination/kuala-lumpur",
      "it": "https://mondoexplora.com/it/destination/kuala-lumpur"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 20,
    "average_price": 113,
    "average_discount": 0
  }
}