{
  "city": "Melbourne",
  "country": "Australia",
  "country_code": "AU",
  "hero_title": "Hôtels à Melbourne",
  "description": "Découvrez les meilleurs hôtels à Melbourne, Australia. Trouvez des offres exclusives et des hébergements de luxe.",
  "hero_image": "https://images.luxuryescapes.com/8yzmy550nq8i7th0irv",
  "hotels": [
    {
      "vendor_name": "Pullman Melbourne City Centre",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Five-Star Melbourne CBD Glamour with Rooftop Bar, Daily Breakfast, Nightly Drinks & Parking",
      "description": "Embrace five-star sophistication in the heart of Melbourne at this premium Little Bourke Street hotel. Perfectly positioned off one of the city's main thoroughfares, this luxury haven beckons you through a hidden laneway entrance into an urban retreat away from the hustle and bustle of the CBD. Treat yourself to breakfast and great coffee at Eva's Restaurant & Bar, or head to Blossom Rooftop Bar - Melbourne's highest outdoor rooftop bar - for laid-back cocktails and dazzling views of Melbourne's skyline. The hotel offers a first-class experience with state-of-the-art amenities and outstanding service, and when you're ready to explore, Melbourne’s laneways, cafes and elegant bars await. Landmarks such as Federation Square, Parliament House and the National Gallery of Victoria are all an easy stroll - or tram ride - away. Venture further to Victoria's best-loved places, including the mighty Dandenong Ranges, Yarra Valley wine region and windswept beauty of the Great Ocean Road.",
      "location_subheading": "Australia",
      "price": 269,
      "original_price": 549,
      "discount_percentage": 51,
      "link": "https://luxuryescapes.com/offer/006RF00000DX1VkYAL",
      "hero_image": "https://images.luxuryescapes.com/8yzmy550nq8i7th0irv",
      "image_two": "https://images.luxuryescapes.com/pezj348yfm8i8710nyj",
      "image_three": "https://images.luxuryescapes.com/1y8hjn24vlhbboymw7wto",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 2,
      "end_date_utc": "2025-07-30 13:59:00"
    },
    {
      "vendor_name": "Peppers Docklands",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Modern Melbourne Docklands Escape near Marvel Stadium with Daily Breakfast & Nightly Drinks",
      "description": "Modern luxury meets unbeatable convenience at this stylish urban retreat, ideally located on the concourse of Marvel Stadium and just minutes from Melbourne’s CBD. With complimentary trams right outside and bike hire stations nearby, exploring the Docklands waterfront and the city's top attractions couldn’t be easier. When it’s time to dine, MOMAMI delivers everything from indulgent buffet breakfasts to refined Asian-inspired cuisine, paired with a vibrant bar perfect for evening drinks. For a touch of relaxation, head to the neighbouring rooftop pool and take a dip in the heated waters or unwind on the terrace and soak up skyline views. After a day of shopping at The District Docklands, dining along NewQuay or catching a game at Marvel Stadium, retreat to your plush sanctuary. With Peppers’ signature luxury and family-friendly rooms, this is your sophisticated home-away-from-home, offering an escape from the CBD bustle.",
      "location_subheading": "Australia",
      "price": 229,
      "original_price": 520,
      "discount_percentage": 56,
      "link": "https://luxuryescapes.com/offer/006RF00000IkweYYAR",
      "hero_image": "https://images.luxuryescapes.com/umflfqtselka0jarjejg",
      "image_two": "https://images.luxuryescapes.com/ukug2qdkz1hpktingwwa",
      "image_three": "https://images.luxuryescapes.com/0d0a48ih5ikg5hdlotvd",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 2,
      "end_date_utc": "2025-08-04 13:59:00"
    },
    {
      "vendor_name": "Next Hotel Melbourne, Curio Collection by Hilton",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Award-Winning Melbourne Manhattan-Inspired CBD Stay with Daily A$75 Dining Credit",
      "description": "Step into a world of bespoke sophistication at this cosmopolitan sanctuary that crowns Melbourne's glamorous 80 Collins retail and dining precinct. Consistently ranked as one of the best stays in the city, this haven in the sky redefines the hotel experience. This landmark precinct in the CBD's prestigious 'Paris End' claims prime real estate among renowned retailers, high-end boutiques, first-class eateries and industry influencers. Throughout the space, you can find thought-provoking pieces by internationally acclaimed Melbourne artists and boutique elements from its heritage past. The heart and soul of this hotel can be found in its super-sleek dining venues: La Madonna Restaurant & Bar, where the menu perfectly encapsulates the very best of local produce through provocative dishes, and The Barrel Room, where guests can enjoy house-distilled, barrel-aged spirits. With daily A$75 dining and drinks credit to use at La Madonna Restaurant & Bar, your stay here promises pure indulgence.",
      "location_subheading": "Australia",
      "price": 279,
      "original_price": 507,
      "discount_percentage": 45,
      "link": "https://luxuryescapes.com/offer/006RF00000JOonBYAT",
      "hero_image": "https://images.luxuryescapes.com/fdbfp3le50a0ppg6sbt",
      "image_two": "https://images.luxuryescapes.com/px9kyse6c88706vf9a6s",
      "image_three": "https://images.luxuryescapes.com/6pzee3ql8zhz1677mpd",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 2,
      "end_date_utc": "2025-08-05 13:59:00"
    },
    {
      "vendor_name": "Intercontinental Melbourne The Rialto",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Heritage Glamour in Rialto Precinct with Daily Breakfast & Club Lounge Upgrades Available",
      "description": "Stay in heritage luxury at this five-star Melbourne icon, located inside the Rialto precinct where the 1890s neo-Gothic façade, glass-topped atrium and ornate windows will transport you to the refined elegance of yesteryear. InterContinental Melbourne The Rialto is a masterclass in heritage distinction and five-star sophistication; from the bluestone laneways beneath your feet to the soaring glass atrium above, this historic landmark blends the city’s gold rush grandeur with the refined comforts of modern-day indulgence. Beyond the lobby, the best of Melbourne awaits. Perfectly positioned on prestigious Collins Street, the hotel places you at the heart of the city’s most stylish thoroughfare. Hop aboard the City Circle tram and pass landmarks like Parliament House and Federation Square, or wander down to graffiti-covered Hosier Lane for a hit of street art and expertly brewed coffee. When it’s time to unwind, make your way to Bluestone Lounge Bar for a signature cocktail beneath the soaring atrium. Dine in style at Alluvial, where European-inspired dishes are served in elegant surrounds, or pull up a chair at Ronnie’s for rustic Italian fare and a curated wine list. For an elevated stay, upgrade to enjoy access to the Club InterContinental Lounge, where daily refreshments, evening drinks and canapes with skyline views await. Wellness is taken seriously here, with a tranquil escape waiting at Botanica Wellness Spa. Soothe tired muscles in the rooftop jacuzzi or sauna, swim a few laps in the enclosed pool, or simply retreat to your luxuriously appointed room.",
      "location_subheading": "Australia",
      "price": 339,
      "original_price": 1059,
      "discount_percentage": 68,
      "link": "https://luxuryescapes.com/offer/006RF00000JBq0MYAT",
      "hero_image": "https://images.luxuryescapes.com/le9iv3rww8hmqplhho3iw",
      "image_two": "https://images.luxuryescapes.com/t9hw11epu7ytvz252t7w",
      "image_three": "https://images.luxuryescapes.com/kclp261goji6y52j2uue",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 2,
      "end_date_utc": "2025-07-29 13:59:00"
    },
    {
      "vendor_name": "Adina Apartment Hotel Melbourne, Pentridge",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Heritage Escape Located in Former Her Majesty's Prison Pentridge",
      "description": "Set within the blue stone walls of the former Her Majesty's Prison Pentridge, Adina Apartment Hotel Penridge is rife with history, heritage and undeniable style. This historic site boasts modern facilities including a restaurant and bar (opening in May 2023), while the hotel's façade still reflects the grandeur of its former life. Located just eight kilometres from Melbourne CBD, the city's eclectic mix of restaurants, bars, galleries and attractions are all a short drive away.",
      "location_subheading": "Australia",
      "price": 113,
      "original_price": 113,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000BeL9ZAAV",
      "hero_image": "https://images.luxuryescapes.com/pis17ji07i4v852awc4",
      "image_two": "https://images.luxuryescapes.com/yhcwzh3xz88he992hrsd",
      "image_three": "https://images.luxuryescapes.com/r2r9xc9vzdex9idrwh6o",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Melbourne Southwharf",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Stylish Novotel Melbourne Escape near South Wharf DFO & Convention Centre with Onsite Restaurants",
      "description": "With the serene Yarra River on one side and South Wharf's iconic DFO and Melbourne Convention Centre on the other, Novotel Melbourne South Wharf promises a location like no other. Immerse yourself in the colourful canvas of Southbank from this sophisticated hotel which puts premium shopping on your doorstep, with Melbourne's famed outlets, boutiques and malls just metres away. Enjoy access to exceptional facilities including a contemporary lounge and spacious light-filled rooms with views across Port Philip Bay or the captivating city skyline. Round out your days at Mr Carpano Dining + Bar or Allora cafe for a well-deserved drink or delicious bite to eat.",
      "location_subheading": "Australia",
      "price": 99,
      "original_price": 99,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2z0IAC",
      "hero_image": "https://images.luxuryescapes.com/a02dw1h2zr952b45k8ti",
      "image_two": "https://images.luxuryescapes.com/1ugdhngughbxfhe5szjg",
      "image_three": "https://images.luxuryescapes.com/5a33jje4z9p906tayhes",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Ovolo Laneways Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Top-Rated Ovolo Laneways Melbourne Escape",
      "description": "Immerse yourself in Melbourne’s creative culture during an escape at the top-rated Ovolo Laneways - a designer wonderland inspired by the hidden laneways and street art of the CBD's iconic canvas. Nestled amid popular brunch spots, stylish bars, live music venues, theatres and fashionable boutiques, this eclectic hotel puts you within walking distance of the area’s hottest spots. Even attractions outside the city centre are easy to reach, with easy access to Melbourne's extensive network of trams and trains.",
      "location_subheading": "Australia",
      "price": 132,
      "original_price": 132,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000008gkITAAY",
      "hero_image": "https://images.luxuryescapes.com/pmzlfctv3tgyybb39cb",
      "image_two": "https://images.luxuryescapes.com/4qj2omhgtbih5gs19yl",
      "image_three": "https://images.luxuryescapes.com/dtai8lt9ca7p7s2ri5za",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Chadstone Melbourne MGallery by Sofitel",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Five-Star Melbourne Glamour Above Chadstone Shopping Centre with Day Spa",
      "description": "Setting a new benchmark in luxury, this designer retreat promises to deliver you into glamour with a stay in Australia's Fashion Capital. Inspired by the creative journey of fashion, Hotel Chadstone Melbourne - MGallery Collection offers a voyage of seamless discoveries, exceptional service and stunning views of the Melbourne skyline, Port Phillip Bay and the Dandenong Ranges. Invigorate your mind and body at the multi-purpose fitness centre or the indoor curved rooftop pool. Indulge in soothing treatments at Holism Retreat Melbourne Day Spa and savour culinary delights at Pastore restaurant, before sipping cool cocktails at Altus Rooftop & Bar.",
      "location_subheading": "Australia",
      "price": 140,
      "original_price": 140,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GURJJYA5",
      "hero_image": "https://images.luxuryescapes.com/toz03pzg4h92zlwcy6w",
      "image_two": "https://images.luxuryescapes.com/svlru5rakqyrs8oxgt5h",
      "image_three": "https://images.luxuryescapes.com/0nxwgpws7qkggp0h4g9n",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Radisson on Flagstaff Gardens",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Award-Winning Melbourne Radisson Stay Overlooking Flagstaff Gardens",
      "description": "If you’re looking for a sophisticated city stay in the heart of Melbourne, the award-winning Radisson on Flagstaff Gardens Melbourne is the answer. Located on the doorstep of the city's oldest market, the iconic Queen Victoria Market, and immediately opposite the leafy Flagstaff Gardens, this sleek hotel sits in the Free Tram Zone, within walking distance of Flagstaff station. Consistently ranked a Tripadvisor Travellers' Choice hotel winner, the hotel offers world-renowned Radisson service and allows you to discover Melbourne’s world-class shopping, coffee and gastronomy with ease. Facilities include onsite restaurant and bar HQ’s on William, offering expertly prepared dishes from a seasonally rotating menu. Unwind with breathtaking views of the Melbourne skyline at the rooftop fitness centre, or ask the friendly 24-hour concierge for insider tips to help you make the most of your Melbourne experience. **Luxury Escapes inclusions (select nights):** - Your package includes a **complimentary room upgrade** - Relax right up until the last moment thanks to guaranteed **1pm late checkout** - **One child (10 and under) stays free** in existing bedding (accommodation only) **Deluxe Upgrade**: Upgrade and stay in a Deluxe Park View Room, a refurbished room on the upper floors with stunning views of Flagstaff Gardens.",
      "location_subheading": "Australia",
      "price": 75,
      "original_price": 75,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000005IgIlAAK",
      "hero_image": "https://images.luxuryescapes.com/k8ryomxborh92m5fswmk",
      "image_two": "https://images.luxuryescapes.com/s96oivmndm5ppv1hftaj",
      "image_three": "https://images.luxuryescapes.com/c3x4bcmj4r63tccyeoel",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Rydges Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Newly Refurbished Melbourne CBD Stay with Rooftop Pool, Bar & Restaurant",
      "description": "Unlock the beauty of the city with a relaxing stay at the recently transformed Rydges Melbourne. Emerging from the CBD’s concrete jungle in the heart of Melbourne’s theatre district, this sparkling space boasts uber-modern facilities, impeccable service and access to the city’s most famous tourist and local spots. Admire the city’s shimmering skyline with a curated cocktail in hand or from the comfort of the open-air rooftop pool. When you’re not eating dumplings in Chinatown or catching an AFL match at the MCG, treat yourself to a delicious meal in-house at the newly refurbished signature restaurant.",
      "location_subheading": "Australia",
      "price": 112,
      "original_price": 112,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cvl0IAAR",
      "hero_image": "https://images.luxuryescapes.com/sjw76njjd79ok45xbcn",
      "image_two": "https://images.luxuryescapes.com/quo2nktykdaxh9y2r4dl",
      "image_three": "https://images.luxuryescapes.com/1hahtvlexqxhobyefelp",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "HYDE MELBOURNE PLACE",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Elegant Melbourne CBD Opulence with Two Restaurants & Sophisticated Cocktail Bar",
      "description": "In the heart of Melbourne’s buzzing CBD, enjoy a luxury boutique stay at this bold designer retreat, where bohemian charm meets urban sophistication. Set amid the iconic East End Theatre District, you're perfectly placed to explore the city's cultural pulse. Historic laneways and fashion-forward boutiques are all at your doorstep. Begin your day with skyline views and Mediterranean-inspired bites at the rooftop restaurant, Mid Air, while coastal Spanish flavours beckon from Marmelo. After exploring the city’s vibrant arts, culture and dining scene, return to your hotel's eclectic cocktail bar and late-night supper club, Mr Mills, for some well-crafted drinks and top-class DJ sets.",
      "location_subheading": "Australia",
      "price": 151,
      "original_price": 151,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000IyLNNYA3",
      "hero_image": "https://images.luxuryescapes.com/a4paz586ztwct3oj3d",
      "image_two": "https://images.luxuryescapes.com/0vbquud675lb7oz5vqzt",
      "image_three": "https://images.luxuryescapes.com/jknpdud3029pgck3rr8p4",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Oaks Melbourne on William Suites",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne CBD Stylish Self-Contained Studio Escape",
      "description": "Oaks Melbourne on William Suites boasts a range of fully-furnished studios and apartments with a prime location in the CBD: brushing shoulders with Flagstaff Station and Flagstaff Gardens. Grab a morning cup of coffee at the hotel’s onsite café before exploring the iconic Queen Victoria Market just a five-minute walk away. Explore the intricacies of the historic State Library Victoria before indulging in a dose of retail therapy at the nearby Melbourne Central and Emporium Melbourne shopping centres. You’ll be spoilt for choice for shopping opportunities, entertainment venues or world-class dining options staying at these sophisticated studios and apartments, each offering handy kitchen facilities so you dine in or out as you please.",
      "location_subheading": "Australia",
      "price": 94,
      "original_price": 94,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BU25AAG",
      "hero_image": "https://images.luxuryescapes.com/7bgp0i72tpvo52rflr9",
      "image_two": "https://images.luxuryescapes.com/3o4oq2ncbl04cz5zp3ea",
      "image_three": "https://images.luxuryescapes.com/2vo8r5xhxnmfw88j4cul",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mantra Melbourne Melton",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Modern Melbourne Escape within Melton Entertainment Park with Onsite Sports Bar",
      "description": "There are stays that just seem to tick all the boxes, and this modern escape on Melbourne's outskirts does just that. Try an Old Fashioned at the onsite Scotch Notch Cafe, savour generous Australian grill pub meals at thriving Popular Alm Bistro or wine and dine in at the Gammalite Sports Bar. Hop from one entertaining watering hole to another in slow succession (each is to be thoroughly enjoyed) and barely spare what lies beyond the Melton Entertainment Park's racing tracks a thought. Though, if you're tempted, the Woodgrove Shopping Centre is nearby and Melbourne's CBD is a 40-minute drive.",
      "location_subheading": "Australia",
      "price": 82,
      "original_price": 82,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000CnOvCYAV",
      "hero_image": "https://images.luxuryescapes.com/s16eujn0qqeldollbk8m",
      "image_two": "https://images.luxuryescapes.com/ztk9sks5t8mnp15565b",
      "image_three": "https://images.luxuryescapes.com/6jc9mgcnxe6z40f4y6b",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pan Pacific Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Five-Star Melbourne Riverside Luxury with Unbeatable CBD Location",
      "description": "Retreat to a haven of tranquillity boasting panoramic vistas of the Yarra River, Port Phillip Bay, and city skyline at Pan Pacific Melbourne, a stylish oasis adorned in designer artwork. Inside you'll find a 24-hour gym, a contemporary restaurant serving dishes highlighting Australia's fresh local produce, and a dedicated concierge team on hand to help you discover the best of Melbourne. During your stay, discover the city's hidden laneways and rooftop bars from this privileged location.",
      "location_subheading": "Australia",
      "price": 150,
      "original_price": 150,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cvl1LAAR",
      "hero_image": "https://images.luxuryescapes.com/vn5q81mwvqqtsb87vngm",
      "image_two": "https://images.luxuryescapes.com/eonw0rfkjzs18dkqsc",
      "image_three": "https://images.luxuryescapes.com/4cbu0cfyf0uam7cxppe",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "PARKROYAL Monash",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Sophisticated Melbourne Escape near Chadstone Shopping Centre & Monash University",
      "description": "For a relaxing eastern Melbourne escape, indulge in a stay at PARKROYAL Monash Melbourne, a stone's throw from city highlights such as Chadstone Shopping Centre, Monash University and Sandown Racecourse. Shop until you drop at Melbourne's fashion capital, immerse yourself in the education and research hub at the university or enjoy a race day before returning to the peace and quiet of the stylish hotel. Wind down with a drink and nibbles at the hotel's wine bar - Enoteca Bar & Lounge - or opt for a dip in the outdoor heated swimming pool.",
      "location_subheading": "Australia",
      "price": 107,
      "original_price": 107,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Cvl4tAAB",
      "hero_image": "https://images.luxuryescapes.com/n9m3tik70pdubqij4vau",
      "image_two": "https://images.luxuryescapes.com/9o7qbvs13op0f41zxco2",
      "image_three": "https://images.luxuryescapes.com/k8lonee3froivfel8pr",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Vibe Hotel Melbourne Docklands",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "New Melbourne Hotel in the Heart of Docklands with Rooftop Pool",
      "description": "Take in Melbourne's vibrant energy with an elegant waterfront escape in the city's bustling Docklands district. This newly acquired modern hotel is ideally positioned within the city's shopping, dining and entertainment hub on the banks of the Yarra River. When you're not exploring the area, savour farm-to-table cuisine at Storehouse Docklands, or lounge by the hotel's rooftop pool overlooking the city.",
      "location_subheading": "Australia",
      "price": 98,
      "original_price": 98,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000IbnhQAAR",
      "hero_image": "https://images.luxuryescapes.com/p1ei840uuqalcwnoa3pc",
      "image_two": "https://images.luxuryescapes.com/3dup2somiro7yz34vi1t",
      "image_three": "https://images.luxuryescapes.com/yyo79i7v3s96r75a4l7",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Adina Apartment Hotel Melbourne Southbank",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Southbank Apartment Break with Indoor Pool",
      "description": "Find yourself in the heart of the city buzz with a stay at Adina Apartments Hotel Melbourne Southbank. There's no better location - Southbank’s dazzling collection of high-end restaurants and bars are an easy walk, and you’re never too far from Melbourne's signature perfectly-brewed coffee. The National Gallery of Victoria and the Arts Centre Melbourne are a stone’s throw away, and when you need a moment to recharge, simply return to the hotel and dive into the indoor heated pool.",
      "location_subheading": "Australia",
      "price": 100,
      "original_price": 100,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DMf6AAG",
      "hero_image": "https://images.luxuryescapes.com/4a2gp1dzn9sl52bj9bm",
      "image_two": "https://images.luxuryescapes.com/rv5lrn60fmpi8r1gc3w",
      "image_three": "https://images.luxuryescapes.com/9lguzk1suw7lulm28f",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Lancemore Crossley St.",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Boutique Lancemore Melbourne Laneway Luxury near Theatre District",
      "description": "Embrace Melburnian culture with a luxurious laneway stay at the new Lancemore Crossley St. - a cutting-edge, designer retreat located in the city's prestigious Paris end, only moments from Chinatown and the iconic Theatre District. Effortlessly capturing Melbourne's juxtaposing grit and glamour through its stylish design and upscale amenities, Lancemore Crossley St. offers a quintessential experience for those seeking a bucket-list ticking stay in Victoria's vibrant capital. Head to the hotel's Manhattan-style Rooftop Terrace for skyline vistas and pre-theatre cocktails, before stepping out onto the surrounding streets to discover hole-in-the-wall cafés, high-end boutiques, and an endless network of top-notch restaurants. From gourmet capital to sporting hub, Lancemore Crossley St. is the perfect launchpad for cashing in on Melbourne's calendar of events, with the MCG, Rod Laver Arena and Her Majesty's Theatre all within easy reach.",
      "location_subheading": "Australia",
      "price": 106,
      "original_price": 106,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000005IgDvAAK",
      "hero_image": "https://images.luxuryescapes.com/zv6ywsc3m1lg4kd0dcl",
      "image_two": "https://images.luxuryescapes.com/cjz5bbonlrza8motv7n",
      "image_three": "https://images.luxuryescapes.com/bfr940ejjqyrqpssksyp",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Rendezvous Hotel Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Heritage Escape in the Heart of Melbourne with Onsite Restaurant & Bar",
      "description": "Follow in the footsteps of international celebrities and dignitaries with a stay at Rendezvous Hotel Melbourne, a heritage-listed property renowned for its original Victorian décor and yesteryear charm. Delight in a bustling hotel restaurant and bar, where you can dine on mouthwatering dishes or indulge in a high tea from Thursday to Sunday (additional charges apply). Sitting on Flinders Street in Melbourne’s CBD, this grand hotel couldn’t be closer to the action - just across the road from Flinders Street Railway Station and surrounded by some of the city’s best-known bars and restaurants.",
      "location_subheading": "Australia",
      "price": 99,
      "original_price": 99,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DMQGAA4",
      "hero_image": "https://images.luxuryescapes.com/i4q87thawxpqm6pn54m",
      "image_two": "https://images.luxuryescapes.com/xjwyvro43r5ccgh4s7t",
      "image_three": "https://images.luxuryescapes.com/4n05jagcjcoachzko93s",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Melbourne Albert Park",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Pullman Luxury in the Heart of Albert Park with Indoor Pool & Lakeview Restaurant",
      "description": "If you’re looking for a five-star yet tranquil Melbourne city stay, look no further than this modern sanctuary. Perfectly poised on the famed Albert Park Lake, and within walking distance of picturesque Fawkner Park, this stylish hotel sits moments from the buzz of the CBD, St Kilda's iconic beaches and the bars and boutiques of South Yarra’s eclectic Chapel Street. Part of the acclaimed Pullman Hotels and Resorts brand, Pullman Melbourne Albert Park offers guests a first-class experience through its state-of-the-art amenities and outstanding service. Treat yourself to a global dining affair at Windows Restaurant or opt for something more relaxed with a drink at Mortimer's.",
      "location_subheading": "Australia",
      "price": 94,
      "original_price": 94,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvyIAC",
      "hero_image": "https://images.luxuryescapes.com/efo0tv49gmrwrdidnb8",
      "image_two": "https://images.luxuryescapes.com/z1wcqyiub9m55cxhgehb",
      "image_three": "https://images.luxuryescapes.com/bq9cejaz6jhm29c3w8r",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Vibe Hotel Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Central Vibe Melbourne Riverside Escape with Heated Indoor Pool",
      "description": "Absorb the urban essence of cosmopolitan Melbourne - Australia's bustling cultural capital - with a stylish stay at Vibe Hotel Melbourne in the heart of the CBD. Rising from its heritage base and boasting a prime position on the corner of Queen Street and Flinders Street, this urban retreat is at the epicentre of all things Melbourne, from world-class galleries to rooftop bars, upscale boutiques and major sporting venues. The hotel has a luxurious heated indoor swimming pool, fitness centre and sleek eatery-hangout St Marks Road Co., while each contemporary room features floor-to-ceiling windows framing stunning cityscapes. Within a 15-minute stroll, you will be sipping drinks on Southbank, checking out the fascinating Immigration Museum, dining at the renowned Chin Chin or grabbing pastries and coffee at Lune Croissanterie.",
      "location_subheading": "Australia",
      "price": 100,
      "original_price": 100,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DMPrAAO",
      "hero_image": "https://images.luxuryescapes.com/od7fspctad2y1edjvrqn",
      "image_two": "https://images.luxuryescapes.com/3qthzopsxudx1wdfu1su",
      "image_three": "https://images.luxuryescapes.com/jhjn39f54c8qi25sqr2g",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Prince Hotel",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Art Deco Beachside Escape",
      "description": "Experience Melbourne’s vibrant beachside neighbourhood, St Kilda, from the iconic Prince Hotel. Occupying a large and beautifully maintained Art Deco building right on Acland Street, The Prince Hotel takes you to the heart of this bayside suburb, minutes from the shores of St Kilda Beach and a short stroll from the restaurants, pubs and bars that dot the esplanade. An icon of St Kilda, the hotel is home to a plethora of dining venues and a rooftop beer garden, where you can admire spectacular sunsets over Port Phillip Bay. With the history of St Kilda steeped throughout, indulge in a world of minimalist luxury, modern design, custom furniture and unique sculptures crafted by local artists.",
      "location_subheading": "Australia",
      "price": 103,
      "original_price": 103,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003IAlwAAG",
      "hero_image": "https://images.luxuryescapes.com/85bdi7ewoiy0jzvtr24",
      "image_two": "https://images.luxuryescapes.com/bqlgjopkanqnzm841cd4",
      "image_three": "https://images.luxuryescapes.com/5epf2mggi8ee3ys8mr4",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Savoy Hotel on Little Collins Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Timeless Art Deco Savoy Stay in the Heart of Melbourne",
      "description": "Find out why Melbourne is heralded as one of the world's most livable cities with a heritage stay at The Savoy Hotel on Little Collins - a timeless gem located on one of the city's most iconic streets. Inside, you will find a grand yet welcoming lobby, a cocktail bar and lounge on the ground floor, plus the serene V Hotel Spa and gym to cater to all of your wellness needs. Stamped with a Tripadvisor Travellers' Choice 2022 award, this quintessentially Melbourne retreat makes for the perfect hideaway as you soak up the vibrant city streets of Victoria's capital.",
      "location_subheading": "Australia",
      "price": 111,
      "original_price": 111,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DM8rAAG",
      "hero_image": "https://images.luxuryescapes.com/1sb8tawbq1kpic4bve4y3",
      "image_two": "https://images.luxuryescapes.com/dfzvyqnu272lvn4iiqr",
      "image_three": "https://images.luxuryescapes.com/hx6p4q7drvs1cj1p2a9r",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mantra Southbank, Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Vibrant Melbourne Southbank Self-Contained Apartment Escape with Indoor Heated Pool, Spa & Onsite Restaurant",
      "description": "Experience Melbourne's vibrant arts scene from this stylish hotel, perfectly positioned in Southbank's cultural heart. Just a short stroll from the renowned National Gallery of Victoria and the Arts Centre Melbourne, this hotel is your gateway to the city's best. After a day of exploring, return to the comfort of your spacious self-contained apartment or enjoy a leisurely swim in the indoor heated pool. Savour local flavours at the Mezzi Bar and Kitchen restaurant, or explore the city's famed culinary scene, with Southbank's renowned eateries just moments away. For a touch of green, the verdant Royal Botanic Gardens are a leisurely walk away, offering a tranquil retreat.",
      "location_subheading": "Australia",
      "price": 100,
      "original_price": 100,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JResZAAT",
      "hero_image": "https://images.luxuryescapes.com/wxlm9y77xr1t92iaztpj",
      "image_two": "https://images.luxuryescapes.com/2immto88jsruca49cae",
      "image_three": "https://images.luxuryescapes.com/hgl3gcmqn6tssp7v875",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Sofitel Melbourne on Collins",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Bestselling French-Inspired Sofitel Melbourne Luxury with Sky-High Restaurant",
      "description": "Experience the epitome of sophistication with a stay at this five-star city retreat, nestled in the Paris end of Melbourne's CBD. Towering over the city's premier shopping district, Sofitel Melbourne on Collins offers unrivalled access to high-end boutiques, world-class theatres and gourmet dining options. After a day of exploring, retreat to your plush room boasting panoramic views of the city skyline, or savour a cocktail at the chic Atrium Bar on 35. Venture beyond the hotel to discover Melbourne's vibrant arts scene, with the National Gallery of Victoria and Arts Centre Melbourne just a short stroll away. For food lovers, a visit to the nearby Queen Victoria Market is a must, where you can sample the city's finest fresh produce and artisanal treats. Fitness enthusiasts can maintain their routine at the hotel's state-of-the-art gym, or take a leisurely jog along the picturesque Yarra River.",
      "location_subheading": "Australia",
      "price": 186,
      "original_price": 186,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000GRFxsYAH",
      "hero_image": "https://images.luxuryescapes.com/r3wehyvbynfg0hait78c",
      "image_two": "https://images.luxuryescapes.com/pujopolyej8b6laxjdb",
      "image_three": "https://images.luxuryescapes.com/n9qncwzn9sgirpym0hqa",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Melbourne Airport",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Elegant Melbourne Airport Hotel with Three Dining Venues, Spa & Pool",
      "description": "Perfectly positioned for a smooth layover, this hotel is just a stone's throw from Melbourne Airport and a short drive from the vibrant city centre. Savour contemporary Australian cuisine at the stylish Amber State Taphouse and Kitchen, tuck into Italian cuisine at Boccata Restaurant or sample famous Melbourne coffee at Small Holdings cafe. Keep active in the well-equipped fitness centre, swim laps of the pool or explore the nearby attractions, including the historic Queen Victoria Market and the lush Royal Botanic Gardens.",
      "location_subheading": "Australia",
      "price": 100,
      "original_price": 100,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2z1IAC",
      "hero_image": "https://images.luxuryescapes.com/1baddry1lk53sqzc8n6k",
      "image_two": "https://images.luxuryescapes.com/0xkt8knlbgta0ode7vyp",
      "image_three": "https://images.luxuryescapes.com/61p6mytj1nepk8x5wu7e",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Quincy Hotel Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Boutique Melbourne Laneway Luxury with Rooftop Swimming Pool",
      "description": "Towering 29 stories above the bustling heart of Flinders Lane is Quincy Melbourne, a luxuriously fun abode that brings the zing of Southeast Asia to Melbourne. Excellent facilities include an onsite cafe, SingSong, Salted Egg - the hotel's exceptional signature restaurant - and a rooftop pool, where you can kick back while taking in views across Melbourne's skyline.",
      "location_subheading": "Australia",
      "price": 104,
      "original_price": 104,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000007ocdpAAA",
      "hero_image": "https://images.luxuryescapes.com/rntl45arp9cumtarp6b8",
      "image_two": "https://images.luxuryescapes.com/zl7mlrtku5qvpu4cqkp",
      "image_three": "https://images.luxuryescapes.com/qy3w9v5uvmvf9bjo09l",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Oaks Melbourne on Lonsdale Suites",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Self-Contained Central Melbourne Escape with Spectacular City Views",
      "description": "Feel like a true urbanite with a stay at the city-central Oaks Melbourne on Lonsdale Suites, located in the heart of Melbourne's vibrant theatre district. This stylish retreat offers a gateway to the city's most iconic attractions, from the bustling Queen Victoria Market to the inspiring National Gallery of Victoria. Savour the culinary delights of Chinatown, just a stone's throw away, or indulge in retail therapy at Bourke Street Mall. Return to your suite to unwind and soak in panoramic city views.",
      "location_subheading": "Australia",
      "price": 116,
      "original_price": 116,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GOQQ4AAP",
      "hero_image": "https://images.luxuryescapes.com/ekneid6o3wjxci7gzxzl",
      "image_two": "https://images.luxuryescapes.com/0fis8dklchfvrayrmcpo",
      "image_three": "https://images.luxuryescapes.com/41dn2uv8zvxn1c5s1meh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2025-08-27 06:59:00"
    },
    {
      "vendor_name": "Pullman Melbourne on The Park",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Leafy Melbourne City Stay Near Fitzroy Gardens with Fine-Dining Restaurant",
      "description": "Escape to a world of lattes, laneways and leafy gardens with a stay at this hotel perfectly positioned between the historic Fitzroy Gardens, MCG and Rod Laver Arena. Following a stunning multi-million-dollar renovation, the luxe rooms and suites feature window chaise lounges accentuating showstopping skyline views. Savour every bite at The Cliveden Bar & Dining, an upscale eatery celebrating Victorian produce, native Australian ingredients and European flair, and explore the city’s many mysteries, marvels and macchiatos, just a stone’s throw from countless world-class restaurants, rooftop bars and electrifying nightlife.",
      "location_subheading": "Australia",
      "price": 128,
      "original_price": 128,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvjIAC",
      "hero_image": "https://images.luxuryescapes.com/2nscmr1h4e1rc8j12a1",
      "image_two": "https://images.luxuryescapes.com/2uxwfy3i1n42zmb7sh7",
      "image_three": "https://images.luxuryescapes.com/bxbahab3wv8k4n6g13es",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Melbourne Central",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Novotel Escape in the Heart of Melbourne with Panoramic City Views",
      "description": "Cobblestone laneways, hidden coffee shops and some of Australia’s finest dining: this stylish high-rise hotel is the perfect introduction to Melbourne’s extraordinary spirit, with Hardware Lane just metres away and vibrant Bourke Street within easy reach. Part of the esteemed Novotel brand, the hotel offers supreme comfort and elegant, minimalist design. After exploring Melbourne's top attractions, return to exceptional facilities, including a fully equipped fitness centre, impressive event spaces and contemporary Italian cuisine at the onsite Pretty Boy Bar & Restaurant.",
      "location_subheading": "Australia",
      "price": 103,
      "original_price": 103,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002Ilw9IAC",
      "hero_image": "https://images.luxuryescapes.com/kx5ug8dgdfl9ue45nbrq",
      "image_two": "https://images.luxuryescapes.com/ma1thkl7mmi7g5i8u9g",
      "image_three": "https://images.luxuryescapes.com/acyqh5uo9r9al153fxqx",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Oaks Melbourne Southbank Suites",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Self-Contained Melbourne Apartments with Private Balconies & City Views",
      "description": "Be in the heart of the action at Oaks Melbourne Southbank Suites. This chic retreat is a stone's throw from the Yarra River, the National Gallery of Victoria and the Crown Casino, making it the perfect base for your city exploration. Indulge in Melbourne's renowned food scene with a plethora of award-winning restaurants and trendy cafes nearby. After a day of city adventures, you'll find everything you need in your self-contained apartment, complemented by stunning city views from your private balcony.",
      "location_subheading": "Australia",
      "price": 94,
      "original_price": 94,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GMI8kAAH",
      "hero_image": "https://images.luxuryescapes.com/2qfwwtv9bkov5ipgu9",
      "image_two": "https://images.luxuryescapes.com/vhtkgskfatnstmx0ey",
      "image_three": "https://images.luxuryescapes.com/hgh9ch7vt6zltdsquvhb",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Mövenpick Hotel Melbourne On Spencer",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Mövenpick City Break in the Heart of Melbourne with Outdoor Heated Pool",
      "description": "Discover the soul of the Swiss Alps in the tram-filled heart of Australia’s cultural capital with a chic Melbourne stay. Perfectly positioned an easy stroll away from Marvel Stadium, Southern Cross Station and the Airport SkyBus Terminal - there’s no better base to discover Melbourne’s sweet spots. After days spent seeking the city’s perfect lattes and laneways, return to moments spent by the hotel’s spectacular outdoor heated pool, savour Mövenpick’s iconic Chocolate Hour or admire the hotel’s striking collection of local photography.",
      "location_subheading": "Australia",
      "price": 103,
      "original_price": 103,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvbIAC",
      "hero_image": "https://images.luxuryescapes.com/u377r2zuoo5ob462wdd",
      "image_two": "https://images.luxuryescapes.com/1r0sham7avrjrpjdj4dc",
      "image_three": "https://images.luxuryescapes.com/3udb34dsotyg0x7gdxm",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "QT Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Five-Star QT Melbourne Escape in the Heart of the CBD",
      "description": "One mention of the five-star QT Melbourne evokes world-class hospitality, eclectic décor, and the famous rooftop bar with an unparalleled view, all in the heart of the bustling CBD. Soak in industrial chic in this luxurious hotel, before venturing out to explore historic laneways and vibrant Chinatown. Iconic Melbourne destinations are on your doorstep, along with an array of world-class restaurants and lively bars. If you’re not sure where to go, opulent French-inspired dining is on offer at onsite Pascale Bar & Grill, handcrafted cocktails await at Bar 133 and hidden Hot Sauce Laneway ups the cool factor.",
      "location_subheading": "Australia",
      "price": 160,
      "original_price": 160,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004v0nQAAQ",
      "hero_image": "https://images.luxuryescapes.com/o9px5gpv1xpg5fts5y7",
      "image_two": "https://images.luxuryescapes.com/zjeqwg93pg5t01l4cted",
      "image_three": "https://images.luxuryescapes.com/gis1ob5ykw9rkwj1qp1h",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Holiday Inn Express Melbourne Little Collins",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Vibrant Sky-High Stay in Iconic Melbourne Laneway",
      "description": "Melbourne’s best-kept secrets are tucked away in its art-spritzed laneways - be a part of the story at Holiday Inn Express Melbourne Little Collins, an IHG hotel. Unmissable destinations are at every turn with the MCG, National Gallery of Victoria, and SEALIFE Melbourne just a quick tram ride away. Feel like a true urbanite and skip across to the Paris end of Little Collins for some designer retail therapy, or disappear into a hole-in-the-wall cafe for a delightfully Melbourne brew.",
      "location_subheading": "Australia",
      "price": 98,
      "original_price": 98,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DH7CqAAL",
      "hero_image": "https://images.luxuryescapes.com/kc41m05g4id342npbkwl",
      "image_two": "https://images.luxuryescapes.com/066nbc60lbvi8yo1kckb",
      "image_three": "https://images.luxuryescapes.com/k1wywxbjvbkemfebhssd",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Adina Apartment Hotel Melbourne on Flinders",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne CBD Apartment Stay near Federation Square",
      "description": "Stay in the beating heart of Melbourne CBD at Adina Apartment Hotel Melbourne on Flinders, located just a hop, skip and jump from Federation Square and Flinders Street train station. The crowning glory of this property is its incredible location. The vibrant bustle of the CBD is right on your doorstep: an abundance of cocktail bars, restaurants, and cafés are all just a short walk away. When you're not sampling the world-class food and culture of the city, the studios and apartments offer a tranquil haven away from the buzz of the city, complete with full kitchens and laundry facilities.",
      "location_subheading": "Australia",
      "price": 115,
      "original_price": 115,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DM9UAAW",
      "hero_image": "https://images.luxuryescapes.com/rsb6gk47boxq99zaekev",
      "image_two": "https://images.luxuryescapes.com/4n4sslcyqax5ap0bblo",
      "image_three": "https://images.luxuryescapes.com/nguok7q5r61ylme729n",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Oaks Melbourne on Collins Suites",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Self-Contained Apartment Luxury in the Heart of the CBD",
      "description": "Stay among the bustling streets of Melbourne's CBD at the sleek and sophisticated Oaks Melbourne on Collins Suites, ideally located on popular Collins Street close to the city's efficient trams and trains. Right outside your door, you'll find a plethora of incredible dining and shopping opportunities, including the lively Bourke Street Mall just a 10-minute walk away. Between moments exploring the famous landmarks and destinations in the CBD, return to your hotel and make use of the convenient facilities, including a steamy sauna and well-equipped fitness centre.",
      "location_subheading": "Australia",
      "price": 83,
      "original_price": 83,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BU1WAAW",
      "hero_image": "https://images.luxuryescapes.com/71vvn817lfkcznxqi1h",
      "image_two": "https://images.luxuryescapes.com/956x5yi0ric9lstwhb3",
      "image_three": "https://images.luxuryescapes.com/hp496ede7tmlbemps39xj",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Adina Apartment Hotel Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Stylish Fully Furnished Melbourne CBD Apartments near Bourke Street Mall",
      "description": "Surrounded by the hustle and bustle of the invigorating CBD, the sophisticated Adina Apartment Hotel Melbourne is the ideal base from which to explore Melbourne to your heart’s content. With eclectic fully furnished apartments offering spectacular city views, the hotel creates a home-away-from-home to come back to after a long day of shopping, theatre or wining and dining. Just steps from your apartment, there’s an endless variety of gourmet dining options and award-winning bars to sample, not to mention Melbourne's world-famous coffee culture. Destinations such as the Shrine of Remembrance and the National Gallery of Victoria are only a short distance away - as is anything you could desire in this vibrant city, thanks to the hotel’s central location.",
      "location_subheading": "Australia",
      "price": 110,
      "original_price": 110,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009DM8qAAG",
      "hero_image": "https://images.luxuryescapes.com/dpkfunte11jazg8whie",
      "image_two": "https://images.luxuryescapes.com/2oe7v28wkf2m21a6krtc",
      "image_three": "https://images.luxuryescapes.com/hemeg12sgaif7pcprznh",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mantra on Little Bourke",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Contemporary Melbourne CBD Apartments near MCG & Bourke Street Mall",
      "description": "Step into the vibrant heart of Melbourne's bustling CBD with a stay at these contemporary and stylish apartments, set in the legal precinct of Little Bourke Street. With self-contained studios and apartments, all with top-notch amenities, you'll have everything you need for a stress-free urban adventure. Take advantage of the location and explore the vibrant Queen Victoria Market and the stunning Royal Botanic Gardens, or for sporting fans, the Melbourne Cricket Ground and the Etihad Stadium are both a short 10-minute drive away. When hunger strikes, tuck into comfort food and sip on a refreshing drink at the hotel's ALIBI Urban Gastropub and later, work up a sweat at the fully equipped gym. For a spot of retail therapy, don't forget to visit the nearby Bourke Street Mall and splurge away.",
      "location_subheading": "Australia",
      "price": 100,
      "original_price": 100,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JRes5AAD",
      "hero_image": "https://images.luxuryescapes.com/znfpkfiz745si736zw6",
      "image_two": "https://images.luxuryescapes.com/8cexr04hip34ib3m12p",
      "image_three": "https://images.luxuryescapes.com/bhh9u9bpek7vnygvjgd",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Hotel Windsor",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Iconic Five-Star Heritage-Listed Melbourne Stay",
      "description": "Follow in the footsteps of international celebrities and dignitaries in the hallowed halls of Melbourne’s grandest hotel: The Hotel Windsor. With previous guests ranging from English and Hollywood royalty to former Australian prime ministers, this five-star, heritage-listed property is world-renowned for its original Victoriana décor and as the home of Australia’s longest continual afternoon tea service. Sitting at the top of Spring Street, in Melbourne’s CBD, this grand hotel couldn’t be closer to the action - it’s opposite Parliament House and surrounded by some of the city’s best-known bars and restaurants. A short wander north gets you to the happening neighbourhoods of Fitzroy and Collingwood, while the Melbourne Cricket Ground (MCG), locals’ preferred place of worship, is just a 15-minute walk away. Built in 1883, The Hotel Windsor retains its heritage charm but, thanks to a few updates, includes all the modern amenities of a five-star hotel. Luxurious rooms and suites feature marble bathrooms and generous furnishings that encourage total relaxation. Dining onsite is decadent, with afternoon tea offered in the classic dining room, and lunch and dinner inspired by classic English pub fare served in the cosy Cricketers Bar. The hotel also offers access to coveted dining destinations - modern Southeast Asian restaurant SUNDA and contemporary Australian fine dining restaurant ARU are both within the hotel's hospitality group and just a short walk away. Speak with the front desk to book your table.",
      "location_subheading": "Australia",
      "price": 114,
      "original_price": 114,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000003z6PTAAY",
      "hero_image": "https://images.luxuryescapes.com/t5jswmk5vld7z2fg2pvm",
      "image_two": "https://images.luxuryescapes.com/3r3lxsr4mjsgajm3s4gt",
      "image_three": "https://images.luxuryescapes.com/26omiul5x9ekxqlse54",
      "deal_tier": "Luxury Escapes - Tier 1",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "The Como Melbourne MGallery by Sofitel",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Iconic Melbourne South Yarra Luxury on Chapel Street with Heated Rooftop Pool",
      "description": "Situated in the stylish and upscale suburb of South Yarra, The Como Melbourne is an iconic, contemporary five-star hotel and celebrity favourite. Start your day with a dip in the temperature-controlled glistening rooftop pool and savour breakfast at the onsite Brasserie restaurant, before heading out to explore Chapel Street's trendy boutiques. Gourmands can enjoy the Prahran Market for artisanal goods, renowned eateries for fine dining and eclectic bars for a nightcap - all at The Como Melbourne's doorstep. The CBD's vibrant arts and sporting scene is just a short train ride away.",
      "location_subheading": "Australia",
      "price": 134,
      "original_price": 134,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvsIAC",
      "hero_image": "https://images.luxuryescapes.com/59x2lpwb4lsi5xy698om",
      "image_two": "https://images.luxuryescapes.com/rc2uemjr2e2nemo9wl6",
      "image_three": "https://images.luxuryescapes.com/yelpeaeyls3l9wcdjmxm",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Oakwood Premier Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Sophisticated Sky-High Melbourne Apartment-Style Escape with Onsite Restaurant",
      "description": "Experience a world of cosmopolitan charm and luxury in the heart of Melbourne's vibrant CBD. Oakwood Premier Melbourne is a stone's throw from the city's premier shopping district, home to high-end fashion boutiques and the historic Queen Victoria Market. Indulge in the city's thriving food scene with a visit to Hardware Lane, renowned for its al fresco dining and live jazz music. After a day of exploration, retreat to the hotel's sky-high pool for a refreshing dip or enjoy a leisurely stroll along the nearby Yarra River.",
      "location_subheading": "Australia",
      "price": 106,
      "original_price": 106,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006RF00000DkOPeYAN",
      "hero_image": "https://images.luxuryescapes.com/l3snkarh7sdja9fvpuzm",
      "image_two": "https://images.luxuryescapes.com/y3a1k4963ylywsczll",
      "image_three": "https://images.luxuryescapes.com/vtk6t39v45ybyttfqnlp",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-06-30 13:59:00"
    },
    {
      "vendor_name": "Ovolo South Yarra",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Retro-Cool Melbourne Designer Ovolo Escape with Speakeasy Bar",
      "description": "Embrace the extraordinary with an escape to Ovolo South Yarra, where raw rockstar energy meets designer sophistication in the beating heart of cosmopolitan Melbourne. Located near the corner of Toorak Road and Chapel Street, this super-cool, inner-city retreat has it all - tuck into delicious vegan and vegetarian fare at Lona Misa, sate your thirst at hidden speakeasy Backroom or step out of the hotels doors and find yourself among the city's dazzling spread of bars, restaurants and clubs.",
      "location_subheading": "Australia",
      "price": 119,
      "original_price": 119,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000008gkToAAI",
      "hero_image": "https://images.luxuryescapes.com/g1u8owbc4fpw3r6mtoy",
      "image_two": "https://images.luxuryescapes.com/ld5oy60ije0j0wfj9oea",
      "image_three": "https://images.luxuryescapes.com/z2ekbxjkkxf0j57y3hvo",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "AVANI Melbourne Central Residences",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Sky-High Self-Contained Suite Escape in the Heart of the CBD",
      "description": "Embrace the beauty and charm of Melbourne with an ultra-modern suite escape at the sky-high AVANI Melbourne Central Residences. Perfectly located in the heart of the CBD, this stylish hotel brings the best of Melbourne to your feet. Discover the city by day, and retreat to a stylish suite - each with convenient kitchen facilities - perched high above the city lights at night. Offering beautifully furnished suites and luxe facilities including an onsite gym, an indoor pool and an outdoor spa bath, this cutting-edge hotel has everything you need for a luxe city escape.",
      "location_subheading": "Australia",
      "price": 117,
      "original_price": 117,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BU5iAAG",
      "hero_image": "https://images.luxuryescapes.com/wbr0ya68sjrw95lfjv",
      "image_two": "https://images.luxuryescapes.com/cap5nqmjmo2y5u0syiaq",
      "image_three": "https://images.luxuryescapes.com/1uo233w0vtoyniherl",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Intercontinental Melbourne The Rialto",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Heritage Glamour with Rooftop Swimming Pool & Jacuzzi",
      "description": "Stay in heritage luxury at InterContinental Melbourne The Rialto, an IHG Hotel, located inside the Rialto precinct where the 1890s neo-Gothic façade, glass-topped atrium and ornate windows will transport you to the refined elegance of yesteryear Melbourne. Discover a charming escape with state-of-the-art facilities: swim in the enclosed rooftop pool, enjoy a soak and steam in the rooftop jacuzzi and sauna, or dine at the two onsite restaurants, Ronnie's and the Alluvial Restaurant & Bluestone Bar.",
      "location_subheading": "Australia",
      "price": 154,
      "original_price": 154,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Bdt5nAAB",
      "hero_image": "https://images.luxuryescapes.com/xbm724ajb8ennhpcxnbi",
      "image_two": "https://images.luxuryescapes.com/g8n5virs3fsun0fucorb",
      "image_three": "https://images.luxuryescapes.com/j0d17ft19ac7qhynx296",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Zagame's House",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Luxe Top-Rated Melbourne Boutique Break in the Heart of Little Italy",
      "description": "Hit the trifecta of iconic Melbourne experiences with a stay at Zagame’s House, an ultra-chic, super-boutique hotel in the heart of Little Italy. Sitting proudly on Lygon Street, this design-led den deals out coffee, wine and graffiti in spades, celebrating the best of the city within its art-decked halls. Surrounded by the cafés, restaurants and bars that put Melbourne’s name on the gourmet map, and just a short walk to the CBD, it’s perfectly positioned for days and nights of exploring, eating and entertaining. High-tech rooms and suites are plumped with everything you need for a city escape, with MUK hairdryers and straighteners, a sensor-laden minibar, cocktail kit and, if needed, treats for your canine companion (dogs permitted with prior approval). Start the morning at streetside 1851 Coffee + Kitchen - perch on a stool overlooking Lygon Street as you try Melbourne's unique 'magic' coffee and devour a bowl of breakfast ramen before taking to the streets. A luxe 24-hour gym means you can fit in a workout whenever, but after pounding the pavement, a glass of wine and tapas at Lord Lygon Wine Shop might be the recovery you need.",
      "location_subheading": "Australia",
      "price": 165,
      "original_price": 165,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004h1JlAAI",
      "hero_image": "https://images.luxuryescapes.com/r3k9cpyucbtgyaiai4h6",
      "image_two": "https://images.luxuryescapes.com/hyl7y74orcdmpzmgzaqh",
      "image_three": "https://images.luxuryescapes.com/itszhx5erjwlyd7juui7",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mantra on Russell",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Trendy Central Melbourne Escape with Indoor Heated Pool, Onsite Restaurant & Bar",
      "description": "Experience the vibrancy of Melbourne from the comfort of this perfectly positioned hotel in the heart of the city's bustling theatre district and Chinatown. This stylish hotel offers easy access to the city's renowned laneways, filled with street art, cosy cafes and trendy boutiques. Savour contemporary Australian cuisine at the onsite Home Kitchen & Bar, enjoy a leisurely swim in the heated indoor pool or unwind in the bubbling spa under a stunning glass ceiling. With the iconic Queen Victoria Market and the National Gallery of Victoria within easy reach, this hotel is the perfect base for your Melbourne adventure.",
      "location_subheading": "Australia",
      "price": 126,
      "original_price": 126,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JResLAAT",
      "hero_image": "https://images.luxuryescapes.com/u7f02ro0r17e1hx61he",
      "image_two": "https://images.luxuryescapes.com/zyrprgz520mvusjcqt",
      "image_three": "https://images.luxuryescapes.com/6b0qtv60mxrfezzzyem9",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Hotel Indigo Melbourne on Flinders, an IHG Hotel",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Sophisticated Melbourne City Escape w. Onsite Spanish Restaurant",
      "description": "Stay in the beating heart of Melbourne’s Flinders Lane, savouring the variety of foodie flavours wafting down the renowned street, shopping the quirky boutiques, and immersing yourself in the creative flare with a stay at Hotel Indigo Melbourne on Flinders, an IHG Hotel. Modern sophistication awaits with rooms overlooking the city streets, and the elegant Beso Bar & Restaurant serving a flavoursome buffet breakfast, before transforming into a Spanish-inspired tapas, wine and cocktail bar.",
      "location_subheading": "Australia",
      "price": 92,
      "original_price": 92,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000G1LSVAA3",
      "hero_image": "https://images.luxuryescapes.com/gqbty2gwknn3z1h37krk",
      "image_two": "https://images.luxuryescapes.com/wz3zalfq0kfnrrfmq3ii",
      "image_three": "https://images.luxuryescapes.com/1r979814cuh6n2ama8vq",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Welcome Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Contemporary Mercure Melbourne CBD Escape with Onsite Dining",
      "description": "Tucked between iconic Bourke Street - home to the eponymous mall - and immediately next door to Emporium, Mercure Welcome Melbourne's location on Little Bourke is second to none. Savour a Melbourne-strength coffee at Soul Cafe before a day of exploration, then return to relax in your contemporary room. Moments from Melbourne's free tram network and Melbourne Central's collection of shops and restaurants, this contemporary hotel boasts easy access to Chinatown, Queen Victoria Market, Degraves Street, Southbank - offering next-level dining along the Yarra River - and local cultural attractions such as the historic Shrine of Remembrance.",
      "location_subheading": "Australia",
      "price": 64,
      "original_price": 64,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2yqIAC",
      "hero_image": "https://images.luxuryescapes.com/8zht6zc52csu90oishl4",
      "image_two": "https://images.luxuryescapes.com/a0niltw6x99xebqqdxq",
      "image_three": "https://images.luxuryescapes.com/g6dzv45y585lo70hgs6",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The StandardX, Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Modern Melbourne Escape in Fitzroy with Fine Dining Restaurant & Rooftop Bar",
      "description": "Set in the heart of Melbourne's most eclectic neighbourhood, experience a boutique stay at Fitzroy's trendiest luxury hotel just steps from stylish cafes, hidden galleries and vintage stores. Settle in for a delightful Thai-inspired meal at BANG - a delectable dining destination with a seasonally driven menu and a focus on the vibrant street food experience. Ascend to the top floor to toast to your stay at the rooftop terrace bar - offering panoramic views of the city skyline and only accessible to guests of the hotel. When it's time to explore, Melbourne's inner north's shopping and dining hubs are walkable, while the city centre boasting Flinder's Street Dining, the theatre district and the National Gallery of Victoria is a short tram ride away.",
      "location_subheading": "Australia",
      "price": 131,
      "original_price": 131,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000GvHeCAAV",
      "hero_image": "https://images.luxuryescapes.com/5g8jhvxp2p19ev98v8di",
      "image_two": "https://images.luxuryescapes.com/gpnuls0z42w128x5jk8u",
      "image_three": "https://images.luxuryescapes.com/4uhmocdojfwqn4qqnwho",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Stamford Plaza Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Stylish Stay in the Heart of Melbourne with Onsite Cocktail Bar & Indoor Pool",
      "description": "Stay in the stylish 'Paris End' of one of Melbourne's famous laneways at this CBD escape, placing you within perfect reach of the city's best attractions. Drink and dine at Harry's Restaurant onsite, serving a tantalising menu of contemporary Australian cuisine and cocktails. Fitness enthusiasts will love the modern onsite gym, while the hotel's heated indoor pool is perfect to soothe sore muscles after a day of urban exploration. Enjoying a prime location on the Parisian-style Little Collins Street, the hotel is the ideal retreat for those looking to discover Melbourne.",
      "location_subheading": "Australia",
      "price": 93,
      "original_price": 93,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000Gul3YAAR",
      "hero_image": "https://images.luxuryescapes.com/8vh9s4d6mrwj5xuyuzb7",
      "image_two": "https://images.luxuryescapes.com/00x4is4u7ij2svbp8tc6",
      "image_three": "https://images.luxuryescapes.com/gd3nixqotb1dproc0f7i",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Crowne Plaza Melbourne, an IHG Hotel",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Central Melbourne Yarra River Escape with Rooftop Swimming Pool",
      "description": "Stay in Melbourne's CBD on the banks of the Yarra River at the Crowne Plaza Melbourne, an IHG Hotel serving up unmatched panoramas across the river and cityscape. Melbourne is a foodies' haven, and the hotel's three onsite restaurants are guaranteed to satisfy your cravings: start or finish the day at Yugo for buffet breakfasts or an exceptional dinner experience, sip a renowned Melbourne coffee at Pow Wow and order your favourite cocktail at Dive Bar. When you're ready to explore, you'll find yourself within easy reach of fashionable South Yarra and suave Southbank, and with the temptations of the South Wharf shopping outlet on your doorstep. Between adventures, enjoy leisure time at the brand-new fitness centre or at the rooftop swimming pool.",
      "location_subheading": "Australia",
      "price": 112,
      "original_price": 112,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BVTMAA4",
      "hero_image": "https://images.luxuryescapes.com/wng5tq7k1nkzds8pf3z9",
      "image_two": "https://images.luxuryescapes.com/3gtart2jnhwdrxrb0nj",
      "image_three": "https://images.luxuryescapes.com/04ew6ira3lgr0qqmwdh9",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "voco Melbourne Central",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Laneway Luxury with Rooftop Swimming Pool",
      "description": "Stay in the beating urban heart of Melbourne's buzzing CBD at voco Melbourne Central, an IHG Hotel, a stylish and ultra-modern hideaway. Between explorations, recharge your batteries with a dip in the rooftop swimming pool, sip a sophisticated cocktail while admiring the glittering cityscape from a great height, or feast on a succulent steak at Blacksmith Bar & Grill. When you're ready to venture beyond your hotel, Queen Victoria Market and Chinatown are just a nine-minute stroll away.",
      "location_subheading": "Australia",
      "price": 123,
      "original_price": 123,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000CP3v4AAD",
      "hero_image": "https://images.luxuryescapes.com/jevqf0hxkfiw7dzp58jv",
      "image_two": "https://images.luxuryescapes.com/rckplh46slpzmkm53nn7",
      "image_three": "https://images.luxuryescapes.com/kee0ef5rba22sh23jqj8",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Novotel Melbourne on Collins",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Novotel Escape in the Heart of Melbourne’s Fashion District with Onsite Restaurant & Bar",
      "description": "Between the prestigious thoroughfare of Bourke Street Mall and Collins Street’s sophisticated retail precinct, the well-appointed Novotel Melbourne on Collins offers the perfect place to discover the city's iconic laneways and lattes. Located directly above the upscale boutiques of St Collins Lane, you'll be perfectly placed for a romantic escape or a decadent staycation. Refuel at the Lane Restaurant before exploring Melbourne's many hidden gems.",
      "location_subheading": "Australia",
      "price": 119,
      "original_price": 119,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000IbsHhAAJ",
      "hero_image": "https://images.luxuryescapes.com/634vtuvjxekiaa3ot6sj",
      "image_two": "https://images.luxuryescapes.com/57x40ew36w2ogy8fz9q",
      "image_three": "https://images.luxuryescapes.com/msvnjeggyn2dnj57dzo",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Quay West Suites Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Riverside Five-Star Apartment-Style Stay with Mineral Pool & Onsite Restaurant",
      "description": "Perfectly positioned in the lively Southbank precinct, Quay West Suites Melbourne is a sophisticated 5-star hotel, ideal for overnight and long-term stays alike. Indulge with a cocktail on the alfresco terrace of the Jarrah Bar or tuck into a tasty treat as you admire the stunning CBD skyline. Then, take some time to relax with a dip in the moody magnesium mineral pool or sweat it out in the steam room and onsite fitness centre. Quay West Suites Melbourne is your gateway to a luxurious Melbourne lifestyle sitting upon the banks of the Yarra River. Find yourself on the doorstep of trendy shops, restaurants, and bars of the scenic promenade and only a short stroll away from the city’s iconic attractions - the National Gallery of Victoria, Federation Square, Rod Laver Arena and MCG.",
      "location_subheading": "Australia",
      "price": 165,
      "original_price": 165,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvpIAC",
      "hero_image": "https://images.luxuryescapes.com/8zwcqmruy9ddbpckish",
      "image_two": "https://images.luxuryescapes.com/x78ris6txflkdna04m",
      "image_three": "https://images.luxuryescapes.com/2vw6oljly4vyr0kb59s",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Dorsett Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne CBD Escape with Wellness Centre, Indoor Pool & Onsite Bar",
      "description": "Experience one of Melbourne's most sought-after addresses at this upscale hotel on Little Lonsdale Street. Take advantage of its enviable location, just a tram ride away from the world-famous dining of Flinders Lane, bustling al fresco eateries of Hardware Lane, vibrant salesmanship of the Queen Victoria Market and the retail mecca of Bourke Street Mall. After a day spent exploring the city, relax with an evening drink at the hotel’s opulent Jin Bar, named after the Mandarin word for gold. When total relaxation is in order, ascend to the hotel’s dedicated wellness spaces including an indoor heated pool, jacuzzi, sauna and steam room.",
      "location_subheading": "Australia",
      "price": 100,
      "original_price": 100,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000IbqW0AAJ",
      "hero_image": "https://images.luxuryescapes.com/znn4ygucrrta9subv2di",
      "image_two": "https://images.luxuryescapes.com/k2f7awbpkl5pbio7y6e",
      "image_three": "https://images.luxuryescapes.com/wsaf0emqogfbsr12k7zn",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "The Langham Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Five-Star Langham Melbourne Luxury on the Banks of the Yarra River",
      "description": "Experience the epitome of Melbourne sophistication with a stay at The Langham, Melbourne, a five-star retreat on the banks of the iconic Yarra River. This luxurious hotel is just a stone's throw from the city's vibrant Southbank precinct, home to world-class dining, upscale boutiques and the renowned National Gallery of Victoria. Indulge at the hotel's exquisite Chuan Spa, savour innovative cuisine at Melba Restaurant or simply unwind in your elegantly appointed room.",
      "location_subheading": "Australia",
      "price": 143,
      "original_price": 143,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000BfvmXAAR",
      "hero_image": "https://images.luxuryescapes.com/dbk6eat55kt64nlfbn",
      "image_two": "https://images.luxuryescapes.com/b4dczavliq64gocjl15i",
      "image_three": "https://images.luxuryescapes.com/0l770tqocov6keohbkb5",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Holiday Inn Express Melbourne Southbank",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Southbank Escape in Melbourne's Arts Hub",
      "description": "Lose yourself in fascinating museums, upscale restaurants and riverside bars when you stay at Holiday Inn Express Melbourne Southbank, an IHG Hotel. Located in the arts hub of Melbourne, you'll find the National Gallery of Victoria, Arts Centre Melbourne and the Australian Centre for Contemporary Art right outside your hotel's doors. Before heading out to explore, grab a bite to eat in the Great Room dining area, or work up a sweat in the fitness centre.",
      "location_subheading": "Australia",
      "price": 77,
      "original_price": 77,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000DH73FAAT",
      "hero_image": "https://images.luxuryescapes.com/sstb65qk7lurvdppimsn",
      "image_two": "https://images.luxuryescapes.com/b1joewya8ggg8ny8oh",
      "image_three": "https://images.luxuryescapes.com/nvf4htvg5qmia0eslbk",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Shadow Play by Peppers",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Peppers Apartments in the Heart of Southbank with Wine Bar & Rooftop Heated Pool",
      "description": "Experience the essence of Melbourne at this inner-city haven, where lattes, laneways and the city's signature trams set the scene. More than just a hotel, this inner-city abode is the perfect base to explore romantic rooftop bars, art-splashed laneways and upscale boutiques. Return to light-filled, self-contained apartments - each featuring fully equipped kitchens, spacious living areas, laundries and spectacular views - and sample Victorian-focused wines, hand-selected by world-renowned sommeliers, at Edwin Wine Bar and Cellar before plunging into the glittering rooftop heated pool.",
      "location_subheading": "Australia",
      "price": 115,
      "original_price": 115,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JRes0AAD",
      "hero_image": "https://images.luxuryescapes.com/2pm43mz9fwg9aq6pldc",
      "image_two": "https://images.luxuryescapes.com/pnpk1zlx9ilq382n9gq",
      "image_three": "https://images.luxuryescapes.com/28fm5krbws52vprzx8bp",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Oaks Melbourne on Market Hotel",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Stylish Oaks Apartment Escape near Marvel Stadium",
      "description": "Fans of Melbourne's nightlife and passionate sports culture will delight in a stay at Oaks Melbourne on Market Hotel, located mere moments from Marvel Stadium and the sports precinct of Melbourne. Whether you want to catch a local AFL game, cricket match or live music performance, a stay here is perfectly positioned, with the CBD's best restaurants and bars in the immediate vicinity. The hotel's convenient facilities are dedicated to its guests' comfort, including the delicious Oak & Vine restaurant, an indoor swimming pool, steamy sauna and well-equipped fitness centre.",
      "location_subheading": "Australia",
      "price": 89,
      "original_price": 89,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BU1lAAG",
      "hero_image": "https://images.luxuryescapes.com/02olvlzpmfjgh4ah4pv",
      "image_two": "https://images.luxuryescapes.com/haksv2626v58c7prr2q",
      "image_three": "https://images.luxuryescapes.com/3uefdgnqi8v7xvuuw8h8",
      "deal_tier": "Luxury Escapes - Tier 2",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Avani Melbourne Box Hill Residences",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Melbourne Contemporary Box Hill Suites with Rooftop Infinity Pool",
      "description": "Enjoy an urban escape in the up-and-coming suburb of Box Hill at Avani Melbourne Box Hill Residences. You'll be within easy walking distance to Box Hill Central shopping and dining precinct, but should you fancy going further afield, Mount Dandenong and local wineries are less than an hour's drive. Perfectly tailored for the modern traveller, these spacious and stylish suites, alongside an expansive rooftop complete with heated infinity pool and spa, ensure a relaxing stay.",
      "location_subheading": "Australia",
      "price": 111,
      "original_price": 111,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000009BU6CAAW",
      "hero_image": "https://images.luxuryescapes.com/nqggax6jf508gq3csw2j",
      "image_two": "https://images.luxuryescapes.com/isc6q99ksvttbp0690wp",
      "image_three": "https://images.luxuryescapes.com/zznbz9dh0gi1h51wkev9",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Mercure Melbourne Albert Park",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Contemporary Melbourne Retreat Overlooking Albert Park with Indoor Pool & Sauna",
      "description": "Explore Australia's cultural capital from this tranquil haven, overlooking the picturesque Albert Park Lake and F1 Australian Grand Prix track. Enjoy the best of both worlds from your serene spot, with a base that allows for easy access to the city while providing an nightly escape where you can truly unwind. Whether you plan relax in cocoon comfortable bedding or energise your day at the fully-equipped fitness centre, every detail at Mercure Melbourne Albert Park crafted to enhance your stay. Wander towards the high streets of Prahran and Windsor to discover curated cafes and buzzy restaurants, or hop on a short tram to either the city or St Kilda to see, hear or do something new.",
      "location_subheading": "Australia",
      "price": 75,
      "original_price": 75,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002J2yaIAC",
      "hero_image": "https://images.luxuryescapes.com/l1v80ubclazho736rnj",
      "image_two": "https://images.luxuryescapes.com/zubbo92gbdqmt4t41ys",
      "image_three": "https://images.luxuryescapes.com/c3ecgxdicg3ooykc9f4ks",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Citadines on Bourke Melbourne",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Contemporary Apartment Stay in the Heart of Melbourne",
      "description": "Embrace apartment-style living in one of the world’s most livable cities with a stay at Citadines on Bourke Melbourne. Perfectly positioned in the middle of the city’s vibrant CBD, this stylish apart-hotel is seconds from world-class dining, drinking and shopping experiences, but maintains peacefulness and privacy. The Melbourne Cricket Ground and Melbourne Park, home to the Australian Open, are within a half-hour wander, while a nearby tram stop makes exploring the suburbs of St Kilda, Carlton and Fitzroy stress-free. Situated in the heart of the theatre district, Citadines on Bourke Melbourne is within walking distance of the fine-dining establishments of Spring Street, Collins Street and Flinders Lane. Each apartment combines the convenience of home with the luxuries of a hotel, offering fully equipped kitchenettes, large living spaces and striking views over the city’s skyline. Work up a sweat in the extensive gym before taking to the streets to explore everything Melbourne has to offer. Return to relax in the indoor pool or sauna, or soak up the sun’s rays on the deck, before returning to the city once more to sample its outstanding dining scene.",
      "location_subheading": "Australia",
      "price": 112,
      "original_price": 112,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y000004hNP7AAM",
      "hero_image": "https://images.luxuryescapes.com/73q55juclhjuoz6xwxg5",
      "image_two": "https://images.luxuryescapes.com/vlvy3jyh36f9ennhnfy",
      "image_three": "https://images.luxuryescapes.com/or7no4psejzsru3oy3ar",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2026-12-31 12:59:00"
    },
    {
      "vendor_name": "Peppers Docklands",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Contemporary Melbourne Docklands Escape with Rooftop Pool",
      "description": "Take in Melbourne's vibrant energy with a stylish Peppers escape in the heart of the Docklands entertainment and shopping precinct. With Marvel Stadium on your doorstep and The District Docklands a short walk away, this urban sanctuary invites you to spend your days exploring the city streets, shimmering harbourfront or sampling Melbourne's renowned cuisine. In between exploring Australia's culture capital and its surrounds, indulge in a blend of signature Peppers luxury, upscale sophistication and inner-city living. Enjoy a delicious meal at Momami Restaurant and Bar, or swim a few laps in the heated pool.",
      "location_subheading": "Australia",
      "price": 5610,
      "original_price": 5610,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/0062y00000JResAAAT",
      "hero_image": "https://images.luxuryescapes.com/fgwj5u9zjlxj20xfdfe",
      "image_two": "https://images.luxuryescapes.com/ayqqwk5sy63tschhor5s",
      "image_three": "https://images.luxuryescapes.com/g0cdukzey79s5wk3p6r",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    },
    {
      "vendor_name": "Pullman Melbourne City Centre",
      "offer_country_name": "Australia",
      "location_heading": "Melbourne",
      "title": "Central Melbourne Stay with City's Highest Rooftop Bar",
      "description": "Located just off Little Bourke Street in the city's renowned retail district, this five-star hotel is perfectly placed to explore Melbourne. Access this urban retreat through a hidden laneway and indulge at Eva’s Restaurant & Bar or enjoy cocktails with panoramic skyline views at Blossom Rooftop Bar, Melbourne’s highest rooftop bar. Explore nearby landmarks like the State Library of Victoria, Federation Square and the National Gallery of Victoria, or venture further to the Dandenong Ranges and the Yarra Valley.",
      "location_subheading": "Australia",
      "price": 117,
      "original_price": 117,
      "discount_percentage": 0,
      "link": "https://luxuryescapes.com/offer/006Ii000002IlvhIAC",
      "hero_image": "https://images.luxuryescapes.com/fxnvaunbwnmopwd23ckb",
      "image_two": "https://images.luxuryescapes.com/qzhjli2k3akbxhdzmyt",
      "image_three": "https://images.luxuryescapes.com/98u0v8ww05yo00b4ok5j",
      "deal_tier": "Luxury Escapes - Tier 3",
      "min_duration": 1,
      "end_date_utc": "2050-12-31 12:59:00"
    }
  ],
  "seo": {
    "title": "Hôtels à Melbourne - Australie Hotels & Travel Guide 2024",
    "description": "Trouvez les meilleurs hôtels à Melbourne, Australia avec des offres exclusives. Réservez votre escapade parfaite avec jusqu'à 60% de réduction.",
    "keywords": [
      "melbourne hotels",
      "melbourne travel",
      "australia hotels"
    ],
    "canonical": "https://mondoexplora.com/fr/destination/melbourne",
    "hreflang": {
      "en": "https://mondoexplora.com/en/destination/melbourne",
      "es": "https://mondoexplora.com/es/destination/melbourne",
      "fr": "https://mondoexplora.com/fr/destination/melbourne",
      "it": "https://mondoexplora.com/it/destination/melbourne"
    }
  },
  "meta": {
    "last_updated": "2025-07-27",
    "hotel_count": 64,
    "average_price": 209,
    "average_discount": 3
  }
}